{
  "places_with_reviews": [
    {
      "name": "Kalarivathukkal Bhagavathi Temple",
      "rating": 4.7,
      "address": "Valapattanam Post, W9F3+R5W, Valapattanam, Kannur, Kerala 670010, India",
      "reviews": [
        {
          "text": "The staff was friendly and attentive, and the room was comfortable with great views. The food at the restaurant was delicious, and the overall atmosphere was welcoming. I highly recommend this hotel for anyone visiting Munnar!”",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Near the Highway between Valapattanam and Puthiyatheru.\nIt is an ancient Hindu temple in Kannur, Kerala, dedicated to Bhagavati. The historical charm, with the Naga thara and the serene old pond, created a unique and spiritually enriching atmosphere. The intricate architecture and cultural significance make it a must-visit destination for those seeking a glimpse into the region's rich heritage.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Here Bhagawati god Badrakali is main god which is worshiped. We all consider this temple powerful with attributes of Bhagawati.  You can offer here prayers and in Prasadam meat is served here too.\nYou can also offer prayers and get & tie Black strings in your Hand.\nIt's located in 20 minutes drive from main Kannur city center.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The famous bagavathi shetram in malabar, the last theyyam is conducted here at every year, after the festival the whole ulasavm are finishes at malabar, the biggest thirumudi is here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Entering the temple , I was immediately struck by the vibrant colors and intricate carvings that adorned its walls. The scent of sandalwood incense lingered in the air, mingling with the sounds of soft chants and the ringing of bells. ✨",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Pallikunnu Mookambika Temple",
      "rating": 4.7,
      "address": "Devi Rd, Pallikkunnu, Kannur, Kerala 670004, India",
      "reviews": [
        {
          "text": "1500 years old temple.\nIt is known as the second Saraswathi temple after kollur temple. It is believed that parasuram built this temple. Every day 8:00 am to 9:30 am, vidyarambha  can be offered.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Calm and serene. Plenty of parking space.\nPlease consider adding information about the history and architecture of the temple in English and Hindi as well.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is one of the oldest temples in Kerala and is a great place to take your kids and family. It is a very good place to find your spiritual self. It has ample space for parking 🅿️ your vehicles 🚗🚘🚐🚙🏎️🛵🏍️🚲, but the area is not covered and your vehicles will be out in the rain ☔🌧️🌨️🌧️🌦️🌩️ and sun 🌞☀️😎. It is visible from inside your car and is on the side of the road with two approach roads. Currently, the entrance is NOT accessibility ♿ enabled.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visited the temple in connection with the ezhuthiniruthu of my granddaughter today. Vijaya dhasami is celebrating and thousands of people are visiting the temple. The function was carried out in a befitting manner and thousands of kids started their vidhyarambham from this temple on this auspicious day. Get a good dharsan of ma Mookambika and thank God for getting a chance to visit the temple on a very special day.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful temple and very peaceful place .There is  2 ponds.very neat and maintained well",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kaattile Palli Darga(Moonnu Pettumma Makham)",
      "rating": 4.6,
      "address": "W8QX+2F8, Pappinisseri, Kerala 670561, India",
      "reviews": [
        {
          "text": "This is a popular Muslim Shrine (Maqam) in Kannur Dt., where people visit regardless of their religion or caste. During the 7 days of Nercha (festival), the public can witness large crowds of devotees heading to the shrine to offer prayers and things. Makeshift shops which sell foods, drinks, toys, clay pots, agriculture equipment etc.. are a very popular attraction during the Nercha.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its a popular Muslim dargah in kannur. The masjid maqam welcomes every religion with open arms",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good traditional mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its a place where all are welcome . Usually the festival longs for 7 days . Irrespective of religion all go for worship though it is a mosque . Actually this place is the grave of an umma(mother) and her three children",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great Dargha Shareef with interesting history,  many females come to ziyarat here.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Chirakkal Chamundi Kottam",
      "rating": 4.6,
      "address": "W964+95Q, Chirakkal, Kerala 670011, India",
      "reviews": [
        {
          "text": "It is an ancient temple in kannur which was not so famous, but recently a grand festival called \"Perumkaliyattam\" was conducted after 45 years, so now everyone knows this place very well. The temple is situated near the chirakkal chira. The nearest known place is chirakkal Rajas higher secondary school, which is 1 km away from this temple. Usually, a perumkaliyattam is held every 12 years. But, since it needs copious amounts of organisational skill and resources, the festival is not held regularly. And after 45 years it has been done. A grand Annadhanm was also given every day on ulsavam days. Lakhs of people came here to watch the grand spectacle of the series of theyyams in action. So that there was a huge rush and everyone couldn't watch the theyyam performance smoothly. Here Theyyams performed nonstop like one by one without long waiting. More than 35 theyyam was performed here likely Thee chamundi, Yakshi theyyam, Gulikan, Karinkuttichathan, Uchita bhagavathi, Vairajathan, Ghantakarnan and Vayanattu kulavan are some of them. Apart from the continuous flow of theyyams, some other cultural programmes were also conducted. Not only from kannur but also from various parts of India people came and captured the programmes. Actually from the parking point we have to walk almost 1km to reach the temple, no private vehicles are allowed after this point.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Blessed to be here for the Perungaliyattam, 2023, happening here after a period of 45 years.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Grand festival after 45 years, devotees thronging in large numbers.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Divine. One of the best Theyyam festival happened here in April beginning after almost 40years",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Crowded like anything. Hard to find a spot to get a good view.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Vengilate Sree Muthappan Madappura",
      "rating": 4.5,
      "address": "X82Q+C7M, Payangadi-Valapattanam Rd, Pappinisseri, Kerala 670561, India",
      "reviews": [
        {
          "text": "Amazing temple. Paid parking is available. Lot of hotel and boarding options near the temple. Kantara-like holy dance is impressive",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Parassinikadavu Sri Muthappan Temple is a famous pilgrim site, located on the bank of the Valapattanam River, near Thalipparambu People from different districts and different places visit this pilgrimage every day",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The temple is located near the river and is a very peaceful place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Most visited temple, they provide tea and meals as good.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Pls dont follow. This is not the correct location",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "MEENKUNNU BEACH",
      "rating": 4.5,
      "address": "W869+RR8, Azhikode South, Kerala 670009, India",
      "reviews": [
        {
          "text": "Venturing to Meenkunnu Beach at the crack of dawn was pure magic! From the cliff's edge, we watched the sky transform into a canvas of vibrant orange hues, casting a spell of awe over us. Making our way down to the shore, the sight of our car parked up on the cliff added a quirky touch to the scene. With the soothing sound of waves in the background, we felt like we had the whole beach to ourselves.\n\nIt was a morning filled with joy and serenity, a memory we'll cherish forever ✨",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Meenkunnu Beach, nestled along the Malabar Coast in Kerala, is a captivating stretch of golden sands and azure waters. The pristine shoreline and the gentle waves make it an idyllic escape for those seeking tranquility. The beach offers a serene ambiance, perfect for leisurely strolls and relaxation.\n\nThe coconut groves lining the coast add a tropical charm, providing shade and a picturesque backdrop. Meenkunnu Beach is relatively unspoiled, making it an ideal destination for those who appreciate natural beauty. The locals’ warm hospitality and the vibrant fishing community nearby contribute to the authentic coastal experience.\n\nVisitors can witness stunning sunsets that paint the sky in hues of orange and pink, creating a magical atmosphere. The beach isn’t overly crowded, allowing for a peaceful connection with nature. However, amenities like beachside shacks offer delicious local seafood, enhancing the overall experience.\n\nIn summary, Meenkunnu Beach stands out as a hidden gem on Kerala’s coastline, offering a serene retreat with its untouched beauty, friendly atmosphere, and breathtaking sunsets.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Such a beautiful place, if you go during sunset time you will get an amazing experience from here",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "We had a Good time at Meenkunnu Beach, we went around 7 in the evening, there was almost no person on the bench, it was extremely thrilling and the walkable places were haunting",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Meenkunnu cliff beach is very awesome for shootings and watching sunset or to have a good time with your loved ones. Also there is a view point from the top there you can see the sea from top which as stunning 🤩",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Meenkunnu Cliff",
      "rating": 4.5,
      "address": "W849+3HG, Azhikode South, Kerala 670009, India",
      "reviews": [
        {
          "text": "Must visit the spot.\nPeaceful and calm and quiet place. Just enjoy the beauty.\nYou should visit in the evening.\nNo food outlets nearby.\nRoads are not good.\nYou should consider your safety.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great spot to relax and enjoy the peacefulness. Also the sunset view from here is amazing",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Awesome view of the sea. Beautiful coastal view from the cliff. But way to reach here is narrow; only two wheelers and autorickshaws can get here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to visit early morning or late evening.\nVery peaceful and calming atmosphere here .\nCan sit for a long time and connect  well",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Fantastic place to have a clam and peaceful experience. After going to the beach, we came to know the way to go to this cliff which was very easy and the point, we loved it!",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kadalayi Sri Krishna Temple, Chirakkal",
      "rating": 4.6,
      "address": "W965+8R5, Chirakkal, Puthiyatheru, Kerala 670011, India",
      "reviews": [
        {
          "text": "Very good temple and divine place to offer and see god . a must place to visit if at kannur",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is one of the oldest temples in Kerala. The temple area is large and grand with paintings and murals. The temple has ample space for parking 🅿️ your vehicles 🚙🚘🚲🚗🚐, but it is not covered and your vehicles will be out in the rain ☔🌧️⛈️🌨️🌧️🌦️🌬️ and sun ☀️🌞😎🌟. Currently, the entrance is NOT wheelchair ♿ accessible right now. There are toilets 🚺🚹, but these are not well maintained. It is good place to go with your family and friends.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "OMG......HARE KRISHNA HARE KRISHNA....Divine place.....one of my favourite 😍 temple.....must visit for blessings.....Godbless 🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was a great experience. The temple is so clean and well maintained.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place....\nLoad Krishna Temple...\nGents must wear 'Mundu\" and must remove shirt to enter inside the temple. no special dress for ladies.(saree will be the best dress)",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Chal Beach Park",
      "rating": 4.3,
      "address": "W8F7+G52, Azhikode, Kerala 670009, India",
      "reviews": [
        {
          "text": "One of the most underrated driving beach ( public cannot enter with vehicals ) we can enioy this beach by riding cycles or walking or running. The beach is around 3km and perfect for sunrise and sunset. At end of the beach (the right most end) we can see starting point of valapatanm river. Very nice beach ,must visit beach in kannur",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the best beaches in Kannur. A nice palce to spend an evening with family. Not much crowded and reachable easily frm kannur. A small park also there for kids.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice beach to hangout with friends family and alone. Neat and clean beach give you a fresh mind and can spend a lot of time by just roaming around. There is a small park with limited rides for kids. Have a parking lot and small snacks shope near the beach. Mostly the beach is not crowded when compare with other beaches in kannur. We had a good time over .On coming dec 20 to jan 1st there is a beach carnival . It will be a nice experience too for the visitors",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beach side cafe for naturally enjoy your food & drink",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We had been here after 7pm, so could not explore much. Not many shops were available that day to eat and drink as well, the park closes at 8pm.\n\nNot much to share at this point of time.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Azhikode Chal Beach",
      "rating": 4.3,
      "address": "W8F6+8XQ, Azhikode, Kerala 670009, India",
      "reviews": [
        {
          "text": "This is a very good beach, no too much rush, clean and calm, there is a public toilet and there was a lifeguard also, parking is paid only, it is 20rupees.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the best beach in Kannur",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a blessing to find beaches that are less crowded. Like we feel calm. There's a park also nearby which has been closed since corona times. But they were building something out of used beer bottles. Overall, a good beach.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very calm place to visit.\nExpect little rush during sundays.\nPark for children with average rides.\nBeach is in devolping stage",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Superb beach, but crowded but really good with great parking facilities.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}