{
  "places_with_reviews": [
    {
      "name": "Bhawarnath Temple",
      "rating": 4.5,
      "address": "35Q9+MF2, Sikandarpur Rd, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "go with devotion, u will find peace of mind.\n\nvisit after 8 pm, participate in prabhu shringar done almost everyday, stay there for atleast an hour,\nu will feel relaxed, free from dilemma and the spiritual energy will.help u a lot in your life problems.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the Famous temple/ place in azamgarh.\nNice place to spend time, surrounded by Greeneries.\n\nHave a parking facility available as well.\n\nGood for marriage and other small programs.\n\nYes! It's very rush at festival times.\nThey have rooms available as well if you are planning for some marriage or for marriage dates.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a very old and famous Shiva temple of Azamgarh district. The nearby intersection is named after Baba Bhawan Nath as Bhawan Nath Square. Buses for Gorakhpur and Ayodhya are available from here. There are many fruit and vegetable shops nearby during Shivratri. There is a lot of crowd, the roads are diverted. हर हर महादेव🔱",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple inside is very good the outer area specifically the parking and the near shops make its very dirty",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the main Bhagwan Shiva temple in azamgarh, it is suitated outskirts of main city. Other god and goddess idols are also there and a Tulsi plant. It has lot of space with two gates entrance/exit. In this temple one can pray and other part of temple small marriage functions and Jagrata can be done. During festive season many small shops are there and it is very crowdy outside also",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Bhawarnath Chauraha",
      "rating": 4.3,
      "address": "35Q9+QF4, Bhawarnath, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "Overall Great Experience ❣️ especially when uh visit in the month of sawan❣️ as a devotee of bholenath, the peace I found there is unbelievable. Bhawarnath temple Is such great place to opt positive energy. I got only positive vibes there. At last Har Mahadev 🙏🙏",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a mere crossroad nothing else. It's not a tourist place at all. Yes the Bhawarnath Temple is there. That's a good place with amazing vibe.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You can get buses or taxis for commuting to Lucknow, Balia and some other places too from Bhawarnath Chauraha. There are a few shops for quick snacks and tea. Royal Enfield showroom is located at this place. It is near the Purvanchal Expressway.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A peaceful and historic temple of Lord Shiva. People from far places come to pray and worship. Very neat and clean ambiance.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I went there to board bus from Azamgarh to Delhi. It took around 15 minutes from bus stand to reach there using E-rikshaw",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Junaidganj Chauraha",
      "rating": 4,
      "address": "35WQ+W7J, Junaid ganj Chauraha, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "The chouraha needs to be well managed no waterfalls only dust and muds all over",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very saint place: Good location: From here you can get ride to Azampur, Bilariaganj.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Chowk for way to Lucknow,gorakhpur,bilariyaganj,Azamgrah city.\nThere are also available convenience for travel .",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very Nice Product",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Big campus soo beautiful",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Maa Poorvi Temple Azamgarh",
      "rating": 4.2,
      "address": "near 6Lane, Aho Patti, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "Much more crowds Every sunday and Tuesday in fair",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's very  holy place for hindus,situated at azamgarh(u.p.).children's mundan sanskar and newly wed couple's sanskar by pandit.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is my village\nJay ma purvi",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A holy and peaceful place. And there is a small fair where many devotee came and enjoy..",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is very good place for worship",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bhagat Singh Chauraha",
      "rating": 4.1,
      "address": "Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "This very good and friendly area 🙂☺️.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "If UC gjfhh ah c 4th c to o 32gb to TN v GM Hf 4th v Jim k hmm Yb GM UK I TV ur DJ 3gb Yb I'm Yb 4th h88 TBD f56 TV t DJ 7 did UC-x Yb UK DC UC DJ mix the SMH thx fb 7 DVD Yb fb Vu SC y rmx fb I TV-TTYL ih8 4th DC UC fb h7 yum Yb GB I GB I TV TBH yum 8 in UN DC y fb I DVD t6 TV fb u TN dg 7 tub 32gb 7 32gb 8 TV TBH fu6 fb u TN thumb FC FC'u 32gb I'll u GM GB I DVD g hmm I'm Yb thx TBH TN 32gb u GM o 32gb 4th 32gb uh",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "At this chauraha ATM is available 24*7",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This place is very nice Bhagat Singh Chauraha I like very because when I walkya then I am feeling natural is the freedom fighter of India so I am respecting and I salute Bhagat Singh and I am recommended to people please like it and follow me and share this article\nA huge contribution of Bhagat Singh in the independence of the country!\nThank you reader\n👍👍🤝🤝🇮🇳🇮🇳🙏🙏",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice work",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Pahlwan Ki Murti",
      "rating": 4.1,
      "address": "25X9+94P, near, Pahlawan Chowk, Harbanshpur, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "Pehalwan Tiraha in Azamgarh is a bustling intersection that encapsulates the vibrant essence of the city. This dynamic crossroads serves as a pivotal hub, connecting various neighborhoods and embodying the spirited rhythm of Azamgarh's daily life. The name \"Pehalwan Tiraha\" itself carries a touch of local flavor, evoking a sense of strength and resilience.\n\nThe energetic atmosphere at Pehalwan Tiraha is infectious, with a diverse array of shops, eateries, and market stalls lining the streets. From traditional local delicacies to modern conveniences, the area caters to a wide range of tastes and preferences, creating a melting pot of cultural experiences. The sights and sounds of daily life, coupled with the friendly interactions among locals, provide a genuine glimpse into the heart of Azamgarh.\n\nNavigating through Pehalwan Tiraha reveals a tapestry of daily activities, where vendors display their wares and shoppers engage in lively bargaining. The intersection is not just a geographical point; it is a communal space where the pulse of Azamgarh is palpable.\n\nWhile Pehalwan Tiraha may not boast grand architectural wonders, its significance lies in its role as a dynamic crossroads that mirrors the spirit and resilience of Azamgarh's residents. It is a place where tradition and modernity converge, making it a noteworthy and integral part of the city's cultural fabric.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The best guitar class for the cheapest money",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best place atmosphere is better than other place",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Sweet Village takhur  akash singh",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Everything is very good",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Azamgarh Fort",
      "rating": 4.1,
      "address": "Lakdi Ki Taal, Badarka, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "It's ruined place of Mosque, shrine and Tomb of Azam Shan and their relatives and some locals which is now been demolished by locals time to time. I don't know why ASI didn't get attention anyway. The history of Azamgarh is very interesting. Here are a lot of ancient structures spread over the city.\nThe district is named after its headquarters town, Azamgarh, which was founded in 1665 by Azam, son of Vikramajit. Vikramajit a descendant of Gautam Rajputs of Mehnagar in pargana Nizamabad, like some of his predecessors, had embraced the faith of Islam. He had a Muhammadan wife who bore him two sons Azam and Azmat. While Azam gave his name to the town of Azamgarh, and the fort, Azmat constructed the fort and settled the bazar of Azmatgarh in pargana Sagri",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Again a misleading story, it’s not a forte, it’s part of Karbala maidan with graves, it’s in much bad condition. As local around it not taking care of it.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This Is Not Fort . Don't Visit There , If you're thinking this is fort .",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good work",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Ancient and better engineering of that time",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "جامع مسجد اعظم گڑھ۔ Jama Masjid Azamgarh.",
      "rating": 4.2,
      "address": "35CM+282, Takia, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "India's greatest mosque, historical icon,u can also pray namaz here",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Alhamdulillah very good mosque..\nAll facilities available here.\nAir conditioning hall is also available.\nWashroom\nLatrin.\nSehan.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is a very big mosque as you know u want that the first floors railing should be talled  enough so that the children can not go there. It is a great to pray.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very great and old mosques in azamgarh",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Masha Allah. Situated in main market. Juma salat time is 01:00 pm. Jama masjid has a very great space, great open area and airy environment. It has entrance and exit  from two sides of the road. \"Azamgarh ki Shan\". Alway love to offer namaz in the masjid....",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "ٹیدھیا مسجد Tedhiya Masjid",
      "rating": 4.2,
      "address": "1st floor, Tedhiya Masjid, 182, Pandit Dindayal Upadhyaya Marg, near Kuraishiya School, Mukeriganj, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "It's a small but famous mosque situated at the corner of the street of Bazbahadur Mohalla and way to Gulami ka pura.\n\nAt a time a total of around 150/- people can pray here in the groud and first floor, here you can perform salah of 5 times and June as well.\n\nIt's easy to reach via Kote mohalla and Harra ki chingi from opposite direction.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very Famous beautiful mosque as the name of area is upon its name. Very calm and beautiful place.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Its a madarsa good education given to students.\nGood peaceful place. 🤗 👍 👌",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Small local mosque in locality especially famous for its name..it is land mark for many things",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Small but famous Islamic prayer spot in Azamgarh",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "ऋषि चंद्रमा मुनि मन्‍दीर",
      "rating": 4.5,
      "address": "34RX+MG8, Mujaffarpur, Azamgarh, Uttar Pradesh 276001, India",
      "reviews": [
        {
          "text": "Very peaceful. But people must stop throwing trash in the water.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "We all should know about our history. Being Hindu is a blessing and we should learn more and more about our roots.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place for religion worship and pujas …nature place …best for photo shoot too",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good & pleasant atmosphere\nNice place for picnic",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice place for pooja and other rituals ceremony. Very very calm atmosphere and surroundings",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}