{
  "places_with_reviews": [
    {
      "name": "Badami Cave Temples",
      "rating": 4.6,
      "address": "Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Absolutely stunning piece of architecture and a testimony to the sheer talent and wisdom of the Chalukyan architects and sculptors. The walls depict a story from a mythology or a scene from a daily life in 8th century. An absolutely must see.\nThere are a lot of monkeys in the vicinity, do not carry food items with you.\nWe went there on a weekday in the midst of a heatwave, so there was almost no queue for tickets.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its one of the UNESCOheritage site, its well maintained. Enough parking places available. Its recommended to visit during winter, as during summer the temperature may shoot high. Their are 4 caves caved out of the red stones, looks beautiful. A must visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Fascinating dive into the history of Dravidian architecture and beginning of cave temples in southern India.\nThe carvings on the caves are breathtaking and very ornate.\nOnly 4 caves are open to public and can be covered in 30 mins or so.\nPlease wear walking shoes as they're are steps to be climbed and best time to visit is between 9-11am when the sun is shinning on the caves.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit spot at Badami. Place is well maintained. The view of Badami town from the top is beautiful. To reach here you can either take an auto from the bus stand area or walk. Washroom facilities & parking space available.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place, the carvings are fascinating and very ornate. There are four caves and you can cover them in 1-2 hours. There is Bhootnath Temple, Agastya Lake, archeological museum and few more ancient temples nearby in walking distance which you can explore after the caves. I'd recommend to visit only on weekdays if you really want to explore the place.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Banashankari Temple ಬನಶಂಕರಿ ದೇವಸ್ಥಾನ",
      "rating": 4.6,
      "address": "VPQ3+4QF, Banashankari, Badami, Cholachagudda, Karnataka 587201, India",
      "reviews": [
        {
          "text": "The temple will open at 6 am ,  and devotees can take part in Abhishek by purchasing tickets which is available near temple premises. but without devotees can visit from 7 am . You can offer different types of Pooja .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mother Goddess Banashankari temple is a pilgrimage center for Hindus. It is situated at Cholachagudda near Badami of Bagalkot district in the state of Karnataka in India. The deity is commonly known as Banashankari or Vanashankari as. She is so named because the temple is in the midst of Tilakaaranya forest. The other widespread name of the deity is Shakambhari (ಶಖಮಬ್ರಿoroeor/ಶಾಕಂಬರಿ). She is an incarnation of the goddess Parvati who is the consort of Lord Shiva as well as His half body (Ardangi). Large number of devotees of Karnataka, Maharashtra and other places do visit this shrine frequently as the deity is believed to be very powerful goddess who grants the boons as prayed for by Her devotees. It is going on so for centuries.\nThe Kalyani Chalukya kings worshipped goddess Banashankari as their family deity and they constructed the temple during the 7th century. In the 18th century the existing structure was built by Maratha rulers. As in any other place the annual festivities do take place in this temple also by way of Jathra Mahotsava in the months of January or February. There will be cultural programmes, boat festival and Rathayatra in which the uthsavamurthy of the deity will be taken in procession on the ratha (chariot) and paraded around the city.\nBana is vana means forest; Shankari means the consort of Lord Shankara or Shiva that is Parvathi. Thus this temple is popularly called Vanashankari as it is in the center of Tilakaaranya forest. Yet another familiar name of this goddess is Shakambari means “Goddess of vegetable \". It is a combination of two Sanskrit words ‘Shaka’ and ‘Ambari’ meaning thereby the vegetables or vegetarian food and Ambari means \"one who wears or put up with vegetables\".\nThe natives have been using several other names in the slangish way such as Balavva, Banadavva, Sunkavva, Shiravanthi, Chowdamma, Vanadurge and so on. The goddess Banashankari was the Kuladevi (royal family deity) of the Chalukya rulers. At present some of the Deshastha Brahmins and Devangas (weaver community persons) have been worshipping Her with great reverence as their Kuladevatha.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Banashankari shakti peetamThe Banashankari temple located to the south of Badami and the Badami town itself are enclosed between two gorges. The valley formed by the two gorges has steep sandstone ridges.\n\nThe temple is located at cholagudda about 5 km (3.1 mi) from Badami on the road to Gadag. Badami Railway Station, served by the South Western Railways, is the nearest railhead. Badami is well connected by a good network of roads to all parts of Karnataka and is 495 km (307.6 mi) from Bangalore  and 125 km (77.7 mi) from Hubli, which is the nearest airport. In the fair all type of ornaments, jewelry, wall doors, clothes and bangles, and sweets are available. It is a fair of 12 days.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Old buildings are very few and new buildings are built. Nice campus. Not a must visit but can visit if you have some extra free time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Badami Banashankari temple, located in Badami, Karnataka, is a revered Hindu temple dedicated to Goddess Banashankari. It is known for its historical significance and stunning Chalukyan architecture.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Shakambhari Shakti Peetham, Shree Kshetra Banashankari, Cholachagudda, Badami",
      "rating": 4.7,
      "address": "SH 57, Banashankari, Cholachagudda, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Temple surrounding need some development and clean, blessed 🙏, temple beside there is yatri nivas which costs 200rs so that you can get freshup from badami railway station you will get share auto which costs 20rs per person",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Shree Shakambhari Shakti Peetham is a divine sanctuary radiating spiritual energy. The serene ambiance and sacred vibrations make it an ideal place for introspection and prayer. The temple's architecture is awe-inspiring, reflecting cultural richness. Devotees experience a profound connection with the divine during rituals and ceremonies. The priests are knowledgeable, enhancing the spiritual journey. The surrounding gardens provide a peaceful retreat for contemplation. Overall, a spiritually uplifting haven where one can seek solace and connect with higher realms. A must-visit for those on a spiritual quest.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sree Banashankari Temple is located near Badami in Bagalkot district of Karnataka. It is a Beautiful temple and we had our Darshan of Shree Banashankari Devi during the month long temple festival in Feb 2024.\n\nIt is very ancient temple (7th Century AD temple, built by Chalukya kingdom). The large temple tank is dry now and the surroundings are not so clean now.  The upkeeping and maintenance of the temple is not up to the standard.\n\nHope the Hindu organization will take up the challenge to clean-up the surroundings and redevelop the area in consultation with the local authorities.\n\nBut seeing the idol in the Sanctum Sanctorium is mesmerising and will give you an electrifying positice energy.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Blessed.\nUsually busy during festival days. Specially from mid jan till feb mid.\nIf you need to get any specials poojas done, one must get the tickets booked prior, in person.\nWould recommend to visit during less busy days to get the darshana.\nIf you are travelling from long, badami is the best place to stay, however, the temple premises also have the facilities. Just check the website / call temple to confirm before visiting. Cheers",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the famous and beautiful temple of Banashankari Devi\nNice spiritual atmosphere around",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sri Bhootanaatha Gudi",
      "rating": 4.7,
      "address": "WMCQ+837, Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Situated on the banks of Agastya lake. The temples are almost ruined but has beautiful carvings. Calm serene place to just sit peacefully and watch sun setting down.\nI would highly suggest to sit and enjoy the beauty where the sun will go off for the day with the birds chirping in the background.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Located approximately 2km from badami town, we can reach this place by a walk or private transportation or auto.\nAnd also can explore the badami fort.\nOn the weekend it will be crowded, the best time is during the sunset time. There is no entry ticket to this place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "a beautiful monuments present in the banks of the river August Lake\n\nThe water here is very very clear and the winds come really Kool waves\n\nYou can come here with friends family love once near and dear ones\n\nthe temple premises is really beautiful.\n\nyou will spend a lovely time clicking pictures and sitting near the lake.\n\nonly thing is to be aware of the monkees because sometimes they snatch away goods and food from people..\n\nJust be alert that's it.\n\ndo visit this premises\nI am sure you will have fun and love time.\n\nDo press like button to my review\n\nUrmi.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice and maintained ancient temple place to visit this.\nYou can park your own car at the ticket counter then walk till here else, it is good to have autorickshaw to visit nearby places at ₹300.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful temple located near the Agastya Thirtha lake. To reach here we can walk along the steps built around Agastya lake. The view of the temple with the lake at one side and the mountains at other is astonishing.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Banashankari Devi Temple, Badami",
      "rating": 4.7,
      "address": "VPP3+VR2, Banashankari, Cholachagudda, Karnataka 587201, India",
      "reviews": [
        {
          "text": "It is a good hundi temple and a tourist place between those places and rocks\nThe special darshan is very less price and it allows us to see the god from 2 inch\nFood in temple is free and it is also very delicious",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very devotional place and serene from naturistic views",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Banashankari Amma temple, is located at Cholachagudd near Badami in Bagalkot district Karnataka\nThe temple is popularly called Shakambhari ಶಾಕoಭರಿ Or Banashankari Vanashankari' since it is located in the Tilakaaranya forest.\nThe temple attracts devotees from Karnataka as well as the neighbouring state of Maharashtra. The original temple was built by the 7th century Badami Chalukya kings, who worshipped goddess Banashankari as their tutelary deity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The goddess appeared through the fire of the Yagna (fire-sacrifice) in the form of the goddess Shakambari. She then killed the demon after a fierce encounter and restored peace in the region. Banashankari is considered as the incarnation of goddess Parvati, who is the consort of god Shiva.\n\nAt a distance of 5 Kms from Badami, Banashankari Temple is located at Cholachagudda. Dedicated to Banashankari Devi, an incarnation of Goddess Parvati, it's one of the famous temples in the district.\n\nDress Code : Modest clothing with arms and legs covered. Sheer clothing is prohibited as well.\n\nThe Abhisheka is held from 6:30 AM to 8:30 AM, everyday. The Banashankari Temple... timings for Monday, Wednesday, Thursday and Sunday is from 6:00 AM to 1:00 PM and 4:30 PM to 8:00 PM. The Badami Banashankari Temple pooja timings for Tuesday are from 6:00 AM to 1:00 PM and 3:00 PM to 9:00 PM.\n\nThe Banashankari Amma Temple was originally built by the Chalukyas during the 7th century. The Goddess Banashankari was their family deity. According to an inscription, this image of the Banashankari Amma was installed by Jagadekamalla I in 630 AD. This temple was later renovated by the Marathas in the 18th century.\n\nStay Healthy...Stay Blessed ❤️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great visit....Surrounding area is not cleaned...Cleanliness lacking in peripherals...photography inside temple is prohibited",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Archaeological Museum Badami",
      "rating": 4.3,
      "address": "WMCM+HX6, Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "there is a museum which is located near the Agastya lake..\n\nA real beautiful ancient very old collection of the monuments is present inside the museum.\n\nan archaeological beauty is all there what it meant to be.\n\naap logon king lion\nand elephant\ngoddess of fertility\n\nthese are main highlights of the inside present of the museum.\n\nbecause of the rarest things present inside the museum it is really a worth while important to visit this museum.\n\nhowever inside the museum you cannot take any photos\n\nthis is the reason I could not share any picture of the inside to you.\n\nbut for your idea I am putting outside gate and entry pictures here.\n\nplease do like press to this review\n\nurmi..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The entry fee is 5₹ per person. When we wanted to pay through QR scan, the ticket counter guy said you will have to add adhar number , pan number etc while paying. So we gave cash and he didnt give the ticket. Said ticket machine has some issue and even inside they asked for ticket and we said they didn’t give any but paid. Then a guy came and asked not to ask for tickets anymore. They are all involved in making money !!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Visit during a weekday, there was no big crowd or group. I was mesmerized by the view when I was climbing the stairs, for reference you can check the images that i attached. I enjoyed visiting this place so much, if your taking big car then there is a problem of road which you can travel there.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Archeological museum Badami.. nice place to know the history....\n\nThere is a short TREK to badami fort from here.. easy trek even for elderly people.\n\nSearch for archeological museum in Google maps. From there only this short wonderful TREK begins.\n\nNever miss such a wonderful place. Attaching photos also..\n\nRestroom available\nMore 🐒🐒🐒 monkeys.\nDon't carry any food item.\nKeep water bottle inside closed bag.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Museum is maintained by ASI and the entry fee here is 5₹. There are some collectibles on display here whiich we’re found around the area near the caves.\n\nTheir are many temples around Badami which are more or less in ruined shape. Lots of figures seen at the museum are from those temples which were destroyed over time.\n\nGood details have been put up there if you want to understand a little more about Badami and it’s caves and temples.\n\nRight from here you can also hike up to the northern side of the Badami fort. There is no entrance fee for that.\n\nA visit here would be good. Would take around 30 min to cover it. Their is a small parking lot in case you are taking your own vehicle.\n\nYou can also hire an auto to reach here.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shivana Gudi Badami",
      "rating": 4.6,
      "address": "WMCM+WJM, Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "It is located within the premises of Badami fort. The trek starts alongside the archaeological museum. After crossing the first gate the path advances through the huge boulders. Path is very scenic. Crossing the second gate left side leads to lower Shivalaya. It's a  comparatively small temple ruins and no idol inside the temple. View from here is excellent. Early morning is quite and peaceful.\n\nA must visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lower Shiva temple, best point to have great view of Agastya lake and Badami caves. The hike to this place inside the Badami fort take you inside the 5th century world. Try not to visited during summer or during noon. Early morning visit to the fort and places around are recommended as it will be less crowded.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Built in early decades of 600 CE , this awesome temple is one of the oldest surviving structural stone temples of South India .Great piece of archetecture situated on the badami cave temple complex. It's in the top of the northern hill and have to Trek from the museum or from back side.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Built in early decades of 600 CE , this awesome temple is one of the oldest surviving structural stone temples of South India . It is situated in the highest summit of the Northern Hill of Badami . Access is through the Fort gate , via steps that lead through stunningly beautiful vistas . It is an exhilerating trek of 30 to 40 minutes ( one way) but will worth the effort . Both the temple and the view of the countryside all around are memorable .\nThe sanctum of the temple is now empty . The outer walls are ornamented with narrative panels illustrating events from Ramayana and Krishna Leela . Inspite of being  weather  worn ,the friezes are exquisite .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It’s a short trek here to upper Shivalaya temple and on the way you find lower Shivalaya shrine. Amazing sight and city view from the top. Also, the trek begins right next to Archeological Museum which is convenient. Definitely a must visit place. And beware of monkeys and langurs. Also, security is added up to ensure destruction of monuments could be avoided.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Rock-cut caves Badami",
      "rating": 4.7,
      "address": "Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Superb place to visit along with aihole and pataddakal. Single rock cut caves are ancient marvel. And also see ASI museum, bhootnath temple complex and Badami fort. Keep water with you and be sure don’t pay any camera fee as it’s for personal use and no need to pay camera fee as per guide line at ticket window but have a photo of that guideline to show to security.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit place if you are keen to explore the history of Hindu civilisation. How rich and advance our culture was .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The most beautiful cave temple out of all 4. Largest too! Beware of monkeys. One tried to steal my bag while I was wearing it and sitting on a bench. Tried to scare me when I found out it pulling my bag and jumped front. Guard came to the rescue!!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the third temple which is inline along a set of four cave temples carved a rock mountain in an elevation. Impressive and gigantic. You can’t imagine how hard it would be to come up such carvings in a rock and the result looking absolutely stunning and astonishing. I would like to be transported to the times these cave temples were being carved. Such a wonderful place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Deep in the rocky mountains of Bagalkot district in northern Karnataka, lies an architectural wonder. The tiny town of Badami in Bagalkot district is home to the rock-cut Badami Caves, a complex of Hindu and Jain cave temples. The cave temples in Badami are remnants of the Chalukya dynasty.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sidila Padi",
      "rating": 4.6,
      "address": "WPV2+FG8, Badami Rural, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Sidila padi is an Excellent prehistoric place to visit.But need a company of people to visit this place as it is not crowded area,no any other facilities like water.we can get water from near by fields its better to carry food and water with you.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Place is sweltering 3 km walk from park on the outskirts of Badami. There is nothing much left from prehistoric painting. All that you will see from 20th century spoilers.\nWalking trail is pretty easy and well paved.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the best experience to have when you are in Badami... You need to trek for approximately 3.2 Km on hills to reach this naturally built cave which has cave paintings of dating back to Pre Historic Period also it has 2 Inscriptions which may of from Chalukyan Era and if you go behind the cave there is a valley where you can find some Peacocks...\nIt's a must go for everyone once",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Super ignored, naturally formed stone formation which has drawings of ancient human race. It is believed that the holes on its roof are caused due to the thunder as the name goes. Its sad that the place is not recognised and guarded.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "You could touch the shelter walls & make your imagination travel to the prehistoric times when the stone age men lived here. The rock paintings are difficult to identify but an amazing place to remind you of the rock shelters inhabited by the early men.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sri Shakambari Shakthi peetam,Badami",
      "rating": 4.5,
      "address": "WM9G+FC4, Badami, Karnataka 587201, India",
      "reviews": [
        {
          "text": "Very nice temple ample parking rooms available",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}