{
  "places_with_reviews": [
    {
      "name": "Navanagar",
      "rating": 4.3,
      "address": "5M39+RX5, Sector 36, Nava Nagar, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "Quality services has been provided 😀",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Big bus stand but hotel is not good at all",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice n broad roads👌maintained good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very much fun",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Heaven in our District.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Museum and Cultural Hall",
      "rating": 4.3,
      "address": "5M77+23J, near radhakrishna temple, Sector 18, Nava Nagar, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "The museum contains information about Anthropological aspects  related to different festivals of north and south Karnataka, live stiles of rural societies, cattle raring and different occupations along with human size live modals. other than that the museum also holds picture expeditions about dams all around Karnataka, historical artifacts, coin and stamp collection and stone sculptures of pre historic times. Fun and learning place for School trips.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One best place for visit our family.. So beautiful of village nature and old stones and statues and old coins all available for sawing",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The museum is located in Navanagara close to DC office and City Municipal Council. The entry fee is ₹10 which is really reasonable. The place could be well maintained. The artifacts and sculptures are worth a watch. The lifestyle and history of the city of BAGALKOTE is brought up well by the sculptures. If you are around the city and want to spend some quality time pls do visit the Museum. Parking wise there is good parking space for both 2 and 4 wheelers. Auto also is available from and to Bus Stop which is near by around 1-1.5km",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice village life and traditional experience for upcoming generation\nTicket fee 5rs, 10rs\nTime 11-06",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome place, great way to showcase Uttara Karnataka culture\n\nNice to see the evolution of old to new Bagalkot\n\nShowcasing how a typical village life and various means of making a living is highlight",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Yamanurappa Temple",
      "rating": 4.2,
      "address": "5M97+RRQ, Vidayagiri, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "Holy place and best place for tour with family.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Hindu best temple best river for #bhima river",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very famous temple of shree yamanurappa",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice temple Hanuman",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The place of pray to God....",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Gaddanakeri tanda",
      "rating": 4.5,
      "address": "4JXP+2C8, Gaddanakeri L T, Nava Nagar, Durganagar, Karnataka 587103, India",
      "reviews": [
        {
          "text": "Gaddanakeri tanda  is all decked up again as the festival celebrations are about to begin. I have always felt that I should pen down my experience with Durga Puja year after year, which is not only about a mere festival but much more about what I feel about it .\n\nAnd this time, that is 2023 when Durga Puja has been enlisted in the  list of intangible cultural heritage . I still feel that even if the celebrations are in full swing mostly in our hearts and minds but the spirit to churn out happiness will never die in the hearts of Bagalkot whatsoever may come, because it is indeed about CELEBRATING life in those 6 days",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The epitome of Banjara culture in India. This place organises one of the richest festival .i.e, Teej, and Durga Jatra, both celebrated once in a three year. On these occasions people from many states gather and cheers the moment.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Went to take durga ma darshan 🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Wonderful village",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Village of the Banjara Cultural",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "ಮುಚಖಂಡಿ ವೀರಭದ್ರೇಶ್ವರ ದೇವಸ್ಥಾನ",
      "rating": 4.6,
      "address": "4MW8+33F, Rajiv Gandhi Colony, Muchakhandi, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "It's around 6km from bagalkot city. Nice temple with a way to dam . Well-maintained and temple premises was clean. There is a car parking space available.  There will be fair every year . One can have good time here and have a walk over bridge and there is ample space to sit and relax or to have food if you have brought it from home. Weddings, munjivi , jawala and many other functions happen here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Blesses",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good place to visit.i loved it.n my favourite god veerabhadreshvara🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the great places to see around bagalkot. But not known much to outsiders.\n\nThis place is full of devotion, adventure, sports and outing.\n\nIt has a tank/lake built by British in 1882.\nIt irrigates hundreds of acres of land.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beloved More powerful God it is been many years that  people worship here from different parts of Karnataka people visit here it feels very joyful visiting here and most loved by Bagalkot people and it is also located in Bagalkot, Muchakhandi , and surrounded with good atmosphere and this place is joy for the most of the people Karnataka people .",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Balaji Mandir Bagalkot",
      "rating": 4.7,
      "address": "5MC6+C65 BVVS Engineering circle, Vidayagiri, Bagalkote, Karnataka 587102, India",
      "reviews": [
        {
          "text": "Great experience. Can sit for long time, peaceful",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "\"Stepping into the serene realm of the Shri Balaji Temple was an awe-inspiring experience that left an indelible mark on my spiritual journey. The temple's majestic architecture and intricate craftsmanship instantly captivated my senses, setting the stage for a deeply profound visit.\n\nUpon entering, the palpable sense of divinity and tranquility washed over me, creating an ambiance perfect for introspection and devotion. The beautifully adorned sanctum housing the deity radiated an aura of peace and reverence.\n\nWhat truly set this temple apart was the seamless blend of spirituality and community. The devoted priests' heartfelt rituals and the melodious hymns heightened the spiritual atmosphere. The temple's inclusive nature welcomed visitors from all walks of life, fostering a sense of unity and harmony among devotees.\n\nThe well-maintained premises and the impeccable cleanliness further enhanced the overall experience, reflecting the dedication of the temple management and staff.\n\nAdditionally, the temple's engagement in charitable activities and community initiatives was commendable, showcasing a commitment to both spiritual upliftment and social welfare.\n\nIn conclusion, the Shri Balaji Temple is a sanctuary of spirituality, offering not just a visit but an immersive journey into devotion, culture, and unity. A visit here promises not just a connection with the divine but also a sense of belonging to a larger, harmonious community.\"",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Spiritual place.\nWe get good control over ourselves.\nSacred place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice cool and calm temple to visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Holy place to have peace of mind.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sai Baba Temple",
      "rating": 4.7,
      "address": "5MF6+RJ8 Sai Baba Mandir, Vijay Nagar, Vidayagiri, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "OmSaiRam🕉🔱🌷💐♾️🌏💫❤️🧿\nAnanta koti brahmanda nayaka rajadiraja yogi raja parabrahma shree sacchidanandha sadhguru sainath Maharaj ki jai🙏\n♥︎Divinity at it's Peak♥︎\n♠︎Peaceful Temple♠︎\n♣︎Surrounded by open area, trees & sai trust office♣︎\n★Best Spacious Temple in the town★\n☆Prasadam distribution will be there on Every Thursday evening☆\n★Open garden is good★\n☆Water facility is good☆\n★Maintenence is good★",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "If you go on Thursday it will be crowded and you will get Prasad as well",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Such a beautiful place, visit daily.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful, good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Guddapur Danamma, Edeyur Siddalingeshwar, Shirdi Sai Baba can be seen in one place Good atmosphere",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sanchi stupa",
      "rating": 4.8,
      "address": "DC office campus, near Navanagar Bus Stand, A P M C Yard, Bagalkote, Karnataka 587103, India",
      "reviews": []
    },
    {
      "name": "Shri Satyabodharayar Math",
      "rating": 4.4,
      "address": "5M93+P3Q, Bypass Rd, Sector 63A, Nava Nagar, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "Main Uttaradhi mutt in Bagalkot. Good and calm environment. Also has a large functional hall and a clean neat dinning hall.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Divine place.\nBut Washrooms and dining halls are pathetic.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very Good place for all sorts of functions",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice and tidy first floor hall... Renovated recently... Dining hall is ok ok types... Good enough for a function of 300 or 450 if floating population",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice kalyana Mantap. Clean.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Sri Jagadguru Siddarameswara Mahasamsthana Bhovi GURUPEETHA ಶ್ರೀ ಜಗದ್ಗುರು ಸಿದ್ಧರಾಮೇಶ್ವರ ಮಹಾಸಂಸ್ಥಾನ ಭೋವಿ ಗುರುಪೀಠ",
      "rating": 4.8,
      "address": "5MC2+3MX, Sector 1, Nava Nagar, Bagalkote, Karnataka 587103, India",
      "reviews": [
        {
          "text": "BMW NEW CAR",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great treatment",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "👌💞",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Melodious moments of beautiful memories of my lifetime",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "Naveen Kumar Lakshmi Sagar Chitradurga",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    }
  ]
}