{
  "places_with_reviews": [
    {
      "name": "Bageswar dham ravi",
      "rating": 4.4,
      "address": "RQR9+4QV, Bageshwar, Bari Khalsa, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "Bageshwar is a district headquarter and is a busy town of Kumanyn area and famous for the Bagnath temple. This old temple is located at joining of two rivers Gomati & Sarya. The approach road to temple passes through narrow roads with local shops in both sides. It is a very busy town with busy traffic and vehicles are not allowed to park near the temple. As this main temple is located at heart of the city and at confluence of two rivers, you need to walk through the lanes to reach this temple. Devotees take bath and then go for Darshan of Lord Shiva known as Bageshwar here. This small but ancient temple has many surrounding temples at the river bank. You can park your vehicle away from the market and walk over the hanging bridge over river and reach the temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "All people are lying. I recite Hanuman chalisa everyday. Two timei recite 108 round. I went bageswar.. 21 parikrama completed. Then stay in que 3 hrs. When reach infront of Hanumanji bloody sevadar catch my neck and push me I fell down. I told them why are you doing like this. I don't sat d more than a second. I told yh m I will never come again bageswar.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "They provide good service....Staff behaviour is very good and their staff are very helpful😊",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This restorent is ousom and surprise\nAll disk are very tety",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "After watched bageswasr balaji YouTube channel i m shocked, this is a miracle.I  just say  jay shree ram",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bagnath Temple, Bageshwar",
      "rating": 4.7,
      "address": "RQPC+RG2, SH 37, Bageshwar, Bari Khalsa, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "It's a must Visit place to visit, if you are travelling to Uttrakhand.\n\nBagnath Temple (Kumaoni: बागनाथ थान) is an ancient shrine dedicated to Shiva, situated in the Bageshwar city at the confluence of Sarayu and Gomati rivers.Bagnath Temple is festooned with bells of all sizes and features impressive carvings.It is the most famous Temple in Bageshwar District. It is flooded with devotees on the occasion of Shivratri.The city of Bageshwar gets its name from this Temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Bagnath Temple in Bageshwar, dedicated to Lord Shiva, stands at the confluence of Sarayu and Gomati rivers. Adorned with bells and intricate carvings, it's the oldest and most renowned temple in the district. Built in 1450 by Chand ruler Laxmi Chand, its statues date from the 7th to 16th century. Devotees throng on Mondays and Shivratri. The city of Bageshwar is named after it. The ancient temple, with a beautiful Shivling, offers a divine and peaceful experience by the Gomati River. A must-visit, it's a preserved site of national importance. 🕉️✨",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Pls note, this is the location of the entry road of Bagnath temple. Main temple location is 'Bageshwar juna panchdashnami akhara' . Road is narrow, there is a small temple market also.\nBeautiful, small ,stone temple near saryu river.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the famous religious places in Kumaun region of Uttarakhand. There is sangam of Sarayu Ganga and Ram Ganga at Bageshwar. It is ancient historical place. River Water is very clean and one can some quality time at this place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Bagnath temple is situated on the banks of confluence of Saryu and Gomti river.\n\nThe temple is a spiritual place of utmost peace.... The darshan at the shiv temple were very contenting\n... The surrounding area of the temple is maintained very nicely by the authorities.\n\nThe banks of Saryu River  is a nice place to visit after the temple darshan.  This place is picturesque.\n\nThere is also a  paid parking just before the temple",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Bageshwar Mahadev Mandir",
      "rating": 4.6,
      "address": "RQPC+RXQ Shri Bageshwar mahadev mandir, Bageshwar, Bari Khalsa, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "Very peaceful place. Relieves your\nStress. Lord Hanumana known as Bageshwar Balaji is always present when you need him. Bageshwar Santa's baba\nIs too kind.\nMerit arji lag jayega tab Aunga Darshan",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I want to meet him n want to come to temple but when bhageshwar Balaji will call me",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best dham",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jai Sita Ram\nyou are true Son of\nSanatan Dharam",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hanuman Mandir",
      "rating": 4.4,
      "address": "Saryu Bridge, Bilona-SP Office Road, RQHC+FC8, Bageshwar, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "As it situated at the bank of saryu river its holy place...saryu is the holy river of kumaon region also known as ganga of kumaun division.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice view near Saryu river",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Amazing natural beauty and nice temple also",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small but peaceful temple on the banks of the river Sharayu",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Chandika Mandir Bageshwar",
      "rating": 4.7,
      "address": "RQQG+2FG, Bageshwar, Namtichetabagar, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "Lovely place to view Bageshwar city in one glance. Peaceful and greenry area",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The view from this temple is breathtaking. You can see an aerial view of the whole Bageshwar town from here. Colourful temple structure. You may pay a visit along with Bagnath Temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit place in bageshwar....situated at top,offers beautiful view of bageshwar city..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful holy place of Bageshwar town. This place is very  peaceful with surrounded maa chandika Devi temple, bhairav nath temple, santoshi maa temple and many more temples ...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A blissful place atop the hill in Bageshwar. Spectacular views of the valley. On a clear day you can even see the Himalayas. A truly peaceful temple of Chandika Maa.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sun Temple, Bageshwar",
      "rating": 4.5,
      "address": "RQVG+XXR, Almora-Bageshwar-Munsyari Rd, Bageshwar, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "Beautiful place for visiting the surrounding is awesome\nStones mandir are old enough to see their beauty\n\nKatarmalla, a Katyuri king constructed this temple, which has 44 smaller temples around the main deity of Surya, which called as Burhadita or Vraddhaditya.\nKatarmal Sun Temple is considered as the second most important sun temple in India after Konark Sun Temple (Orissa)",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hamare sanskriti hamare virasat. Every one must visit the place to see the great architecture and to get the real peace of mind. Very beautiful surroundings. May God Shiva full fill all our wishes.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This Sun Temple is situated on the road of Kathayatbada of Kapkot Bageshwar Road\n\nSurajkund is also located near this where the sacred thread ceremony takes place.\n\nEvery one must visit the place to see the great architecture and to get the real peace of mind. Very beautiful surroundings.\n\nJai Surya Dev 🌞 ❣️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Situated in Almora district, this is one of the best tourist attractions in the area. You can find dilapidated murals and structures that are build thousands of years ago but still are one of the best technologically.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is an incredibly landmark that is a must see if you're in the area.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Nileshwar Mahadev Temple",
      "rating": 4.8,
      "address": "RQQC+V65, byepass road, Bageshwar, Bari Khalsa, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "A very oldest temple is lord's shiva nileshwar mahadev..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The Nileshwar Mahadev Temple in Bageshwar, top  of a hill, offers a captivating spiritual experience. With its panoramic views of mountains, city of Bageshwar, and the serene Saryu River, the temple becomes a divine abode.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A very oldest temple is lords shiva nileshwar mahadev.. ... Meet god Shiva here . ... The Neeleshwar Temple is dedicated to Lord Shiva.There is a very nice view of Bageshwar from the temple.  Just below it is the temple of Bagnath ji.  And in front of it is the temple of Maa Chandika in the second mountain.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "nileshwar temple is situated in one  of the  highest point among three highest point in bageshwar , where different temples are situated . from nileshwar you can view out the glimpse of the entire bageshwar city . there are two routes to climb up the hill one the stair way another from the byepass route but it is the long route .so usually people climb up the stairs .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This temple of Bholenath situated in Nileshwar hill, from where the entire Bageshwar is seen, there is a blissful atmosphere in the temple premises...🌸❤️\n\n#jai_bholenath 🔱",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "वेणी माधव मंदिर बागेश्वर",
      "rating": 3.8,
      "address": "RQPF+M9H, Vikas Bhawan Rd, Namtichetabagar, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "I Am Bihari Lal Yadav 💗 for new post office",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Jitu bhai chat and sweet Catherine service",
          "languageCode": "en-US",
          "rating": 3.8
        },
        {
          "text": "Jai ho",
          "languageCode": "en-US",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Sai Mandir Bageshwar",
      "rating": 4.3,
      "address": "Near Bridge on Sarayu, Almora-Bageshwar Rd, Village - Tyunara, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "It is a small Shiv Mandir right on the banks of the Sarayu River in Bageshwar district, Bilona village next to the newly constructed Bridge on under construction bye pass road. It has a comparatively big Granite Shiv Ling. One can enjoy the refreshing site of Crystal clear blue water of Sarayu on the steps of the temple.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kukuda Mai Temple (कुकुडा माई)",
      "rating": 4.7,
      "address": "VQ96+4FC, Karas, Uttarakhand 263642, India",
      "reviews": [
        {
          "text": "On Bageshwar-Garuda road\n8KM from Bageshwar, Right turn towards temple road and head more 10 KM. One hour road travel then 4-5KM walking distance.\nRoad is not good, don't go on rainy day 🌧️.\nBeautiful views in between. Himalayan darshan, cheed jungle.\nTemple situated in secluded place. You can stay there for night. Keep khichdi items, fruits, water and cook yourself.\nWater problem may be there.\n\nTake darshan of Kukuda Mai and take her blessings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "If you love to see Himalayan ranges this is a must go, you can see the small towns from a Bird's eye view,very close to the city you can visit anytime except maybe monsoon , winter is the time I would recommend you to visit especially for clear himalayan views due to heavy snow on peaks as well as high visibility",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nantin Maharaj spent time here and established the first temple of Kukuda Mai. The top can be reached in half an hour from Bageshwar side (temple road cuts few kms before the city). The climb uphill is fairly easy. The jungle area is largely pine. You can see Kapkot on one side and Garud on the other.\n\nBeautiful Himalaya view on a clear day, but pine trees obstruct the full view of the Himalayan Range.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kukada Mai temple is a great place to visit for the devotees in respect to the religious view as well as natural beauty.It is situated at the top of a hill just above the Bageshwar city of Uttarakhand.Mata in this temple, resides in the form of Kukada(कुकङा)(मुर्गी)or Hen.\n\nThe temple is located at the top of a hill completely sorrounded by dense and thick forest.Live view of forest animals like deers and even leopards is the common sight seeing for the baba ji's residing in the temple.It is a serene and beautiful places filled withthe blessings of Mata Kukada Mai ji and nature.\n\nThe two rivers flowing in the Bageshwar city can be viewed from the temple premises.The river seen on the left hand side of the temple is known to be Gomti river and river on the right hand side is known to be Saryu river.Both of these rivers confluence in Bageshwar.\n\nBageshwar is also a traditional town with religious Bagnath temple situated within it.It is also known as a major pilgrimage spot or Teerth(तीर्थ) in the hindu mythology.It is among  one of the sacred temples of lord Shiva.Bageshwar is also famous for its traditional route for trekking into Pindari Glacier,a world renowned destunation for trekking.The way into deeper Kumaon namely Pithoragrh ,Munsyari , Dharchula also passes through this town.\n\nThe temple of Kukada Mai was established by Param Pujya Shri 1008 Naantin Maharaj ji,who used to meditate in the deep dense and thick forest near the temple.Maharaj ji was a great saint who had detailed and deep knowledge of ayurveda by the God's grace. He used to treat uncurable diseases by his power of ayurveda and blessings of god.The Kali Maai temple situated in the steep slope just below the Kukada Maai temple was also a place of meditation of Param Pujya Shri 1008 Nanttin Maharaj ji.Maharaj ji attained samadhi in late 1970s but is present in the heart of his followers and is visible to the people within their heart and brain who remembers him with great love and devotion.\n\nParam Pujya Shri Shankar Maharaj ji ,the disciple of Shri Nantin Maharaj now holds the responsibility of the works done by Shri Nantin Maharaj ji.Shankar Maharaj ji also have a deep and detailed knowledge of ayurveda by the grace of god and Maharaj ji. A Lot of patients who have left the hope of being cured off of their diseases are treated by maharaj ji with his immense power and knowledge.\n\nThe temple of Kukada Maai is well equipped with all the facilities for living days long ranging from rooms to the cooking of food.The food cooked in the temple is very simple as per guided by Shri Nantin Maharaj ji who especially used to focus on diet for the disease curing. There is a small stream nearly 1.5 k.m below the temple between forest and hills which is used to carry drinking water for the temple.\n\nThe Kukada Maai temple is a paradise for the people who wants to meditate in a place far from the unwanted disturbance of cities with natural air without any pollution.There are two routes to reach Kukada Maai temple.One is from the Bageshwar which is completely a trek route in the steep slopes of hills about 3 k.m and other is from Garur(गरूङ). The route of Garur is partially motorable and then a trek of 3k.m but without steep slopes.\n\nJai Mata Di\n\nJai Maa Kukada Maai\n\nJai Param Pujya Shree 1008 Nantin Maharaj ji",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place in Bageshwar",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}