{
  "places_with_reviews": [
    {
      "name": "Ezhamkulam Devi Temple",
      "rating": 4.7,
      "address": "5Q2C+XC5, Ezhamkulam, Kerala 691554, India",
      "reviews": [
        {
          "text": "Nice temple.. nice atmosphere... Very neat and clean premises... I think it's because the temple is not under Devaswam board, so things are going very strict and devotee friendly. It's famous for thookkam. Huge trees in front of the temple are very attractive and it's very appreciative. Thanks go to the management team... space for parking, special auditorium for functions like marriage and all. 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a beautiful and divine temple\nI haven't actually visited there. But took some snaps from outside",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Ezhamkulam Devi Temple is dedicated to Shakti and is located in Ezhamkulam, Adoor, Kerala, India. Ezhamkulam is a village in Pathanamthitta district in Kerala. The temple is famous for Garudan Thookkam and Kettukazhcha which take place as a part of the annual Kumbha Bharani festival. The scenic beauty, the bliss of solitude and mental peace imparted by this place will ever be in the mind of a devotee who had at least been once to this place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is one of the most famous Temple in ezhamkulam the temple has lots of positive energy. the temple is has very pleasant environment during evening. The surrounding is very silent and it is the best place to release stress.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place but no car parking area",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Trichennamangalam Mahadevar Temple",
      "rating": 4.7,
      "address": "Trichendamangalam Temple Lane Adoor, 4PW6+73H, Taluk, Peringanad, Kerala 691551, India",
      "reviews": [
        {
          "text": "One of the oldest and famous Lord Shiva temple in peringanad near adoor...and the most attraction is kettukazhcha in 10 days festival during the month of February or March every year...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great Ambience and peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Robust and sophisticated lab equipment that prepares technical students for industry challenges.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A Lovely Atmosphere At The Temple.The Gopuram On The Front Of The Temple Is Really Passionating The Various Religious Beliefs Of The Temple.In Front Of The Temple There Is A Huge Parking Area.The Top Layer Of The Temple Is Roofed With Copper Pieces.It Really Looks Stunning.The Temple And It's Atmosphere Gives As A Pleasant Feel .......",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the famous Shiva temples in Pathanamthitta.Peaceful atmosphere.its positive vibe really refreshes the mind.evening time arati gives a really different vibe.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "St. Thomas Orthodox Cathedral, Kannamkode-Adoor. (കണ്ണംകോട് പള്ളി)",
      "rating": 4.5,
      "address": "Adoor - Kaipattoor Rd, Kannamkode, Adoor, Kerala 691523, India",
      "reviews": [
        {
          "text": "This is one of the ancient church in Adoor town. The church is believed to have been founded in 15th century. The cathedral is the resting in place of the revered Philipose Ramban who translated The Holy Bible for the first time to the vernacular language Malayalam. The translation was based on the Syriac version of the Bible.\nThe church is easily accessible from the town. There is a parish hall near to the church.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the greatest Malankara Orthodox churches in Adoor. Philiphose ramban, who translates the Bible into malayalam language, lies in this church. It is a pilgrimage center located in Adoor.  She has a good parking area and a very old average level auditorium.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Located in Adoor Central,near to the adoor valiyathodu.The church belongs to the Malankara Orthodix  Syrian church under 'Adoor-Kadampanad' diocese. Kannamcode Cathedral is situated in Adoor, a town in Pathanamthitta district of the Indian state of Kerala.\n\nA peaceful pilgrim centre for worship. Dining,and parking area is small .\n\nAccess\n\nYou can easily access through public transportation.The ksrtc and private bus stand is situated near to the church.In my opinion,it is better to get down from bus  in near to  Ghandi park adoor ,then you can easily access the church within five minutes",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "St. Thomas Orthodox Cathedral in Kannamkode-Adoor is a truly divine place for prayer. The cathedral's tranquil surroundings and magnificent architecture create an atmosphere of deep spirituality. The warm and welcoming community here adds to the experience, making it an ideal place for worship and reflection. Highly recommend this beautiful cathedral for anyone seeking a place of serenity and prayer.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Holiness filled, ample parking space and good visibility for travellers.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Chennampalli Sree Dharmasastha Temple",
      "rating": 4.5,
      "address": "5P67+7WJ, Kayamkulam - Pathanapuram Rd, Peringanad, Kerala 691523, India",
      "reviews": [
        {
          "text": "Temple which has soothing effect on ones mind. The temple ambience itself calms our mind. It is near the road so wheelchair accessible entrance is present.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the oldest Dharmasastha temple in Adoor.  This place of worship is located adjacent to Kayamkulam Punalur road and attracts lots of devotees.  Calm atmosphere, kept  neat and clean.  Respected by the local population regardless their religion.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Parking is limited ( 2-3 cars). The banyan tree there infront of the temple will give you a warm welcome and the bells resonate  with some positive vibes during pooja time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ayyappa swamy temple near chennampalli junction (KP Road) Along with Lord Ayyappa, Goddess Sreebhadra and goddess Annapoorneswari has equal importance here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Kayamkulam Punaloor road side. South side of the road.  Temple is Near to chennampallil bus stop 100 meter away from Adoor High school junction.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Manakkala (മണക്കാല) Junction",
      "rating": 4.1,
      "address": "4PMC+M22, Adoor - Kollam Rd, Manakala, Kerala 691551, India",
      "reviews": [
        {
          "text": "Well maintained and somewhat clean area with main Banking and Financial Services Provider available at the same place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good place.  Will get all day to day  items in the circle",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very good place with maximum facilities available",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place..\nCollege, school, Technical school, Bank, Market,gym",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Pattikadub, it's in NH road but no development, but nyc place",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Vellakulangara Junction",
      "rating": 4.2,
      "address": "Adoor Mannady Road Vellakulangara, 4PMH+W3C, Junction, Adoor, Kerala 691551, India",
      "reviews": [
        {
          "text": "Fast developing and beautiful place.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place to live",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The town needs to be developed a bit more",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nature love",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "St. Mary's Orthodox Church | Holy Martha Mariyam Pilgrim Centre - Karuvatta, Adoor",
      "rating": 4.4,
      "address": "St. Mary's Orthodox Church Karuvatta, Adoor, Kerala 691523, India",
      "reviews": [
        {
          "text": "Very good church with good ambience.But have only a little space to accommodate the believers.It has an auditorium too",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good church with  good ambiance and good spiritual experiences. It is one of the Marian pilgrimage centers located in Adoor. But it has limited space to afford believers and an auditorium with the capacity to afford less audience.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful orthodox church with nice ambience...\nNoted lot of people from different religions come to pray.\nWell maintained & clean and tidy place of worship.\nIt has an auditorium too...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The church is in the name of St.Mary..Its a divine place and Christians and other religious people visit this church as they believe that their wishes will be fullfilled by praying to mother Mary with full determination and they feel a peaceful atmosphere here........Its truly a divine place with a peaceful environment",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very good church with a good view.  Noted lot of people from different religions comes to pray.  Well maintained, clean and tidy place of worship.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Sree Parthasarathy Temple",
      "rating": 4.7,
      "address": "5P4J+5J2, SH 1, Parass La, Adoor, Kerala 691523, India",
      "reviews": [
        {
          "text": "It is one of the most visited places in Pathanamthitta district. Adoor Gaja Mela is the most important 10-day festival in the temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Parthasarathy Temple is very beautiful temple during the festival here with large elephants and great festivities that occur. On any other day it is a very humble temple with small surroundings and very peaceful environment.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We can get a peace of mind while visiting Sree Parthasarathy In adoor, pathanamthitta district in Kerala..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Adoor Gajamela, is part of the ten-day annual celebration held at the Parthasarathy Temple in Adoor. The highlight of the festival is the elephant pageant. Hundreds of people throng the temple premises to witness this spectacle where around nine bedecked tuskers are paraded. The Temple is dedicated to Lord Krishna, who is also known as Parthasarathy - the charioteer of Parthan, another name for Arjuna. Arjuna is one of the five Pandava princes in the Indian epic Mahabharata.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful temple 🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Vadakkadathukavu Devi Temple",
      "rating": 4.6,
      "address": "Puthoor Iverkala Road Opp. Government Vocational Higher Secondary School Adoor, 4PMQ+R4X, Vadakkadathukavu, Kerala 691551, India",
      "reviews": [
        {
          "text": "Temple.\nI don't want to incur the wrath of the gods by saying anything negative, so that's all I'm going to say 🙏.\n\nThe temple is on the roadside btw, so easily accessible.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Our Dharmasastha temple which I visited for the first time after 15 long years",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Well maintained\neasy accessible with travelling facility\nlocated near adoor police KAP3 camp",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "All the sanctity of a Hindu temple can see there. But don't think athorities giving enough importants for the betterment of the temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sree Mahadevar Temple, Maharshikkavu",
      "rating": 4.6,
      "address": "മഹർഷിക്കാവ്, 4P7W+35V, SH 1, Kerala 691551, India",
      "reviews": [
        {
          "text": "So peaceful✨☀️🍁",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice vibes",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place to worship, near to Main Central road, easily accessible.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}