{
  "places_with_reviews": [
    {
      "name": "Baghpat City Centre",
      "rating": 4.3,
      "address": "Calcetto Store, Ground floor, Naksh collection, Meerut Rd, near Rashter Vandana Chowk, opposite Canara bank, New Colony, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "it is a big market.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Center of Baghpat City",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bageshwar Temple",
      "rating": 3.8,
      "address": "W6P8+JXM, Baghpat Bangar, Baghpat, Uttar Pradesh 250609, India",
      "reviews": []
    },
    {
      "name": "Sinauli",
      "rating": 4.8,
      "address": "W6RG+VF6, Old Town, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Sinauli is an archaeological site that has found links to early Vedic Age Civilizations, that may be linked to Mahabharata or Ramayana.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Sinauli. A village where evidence of historical/mythical civilization has been found.\nGraves of some of the first warriors were found in Sinauli. Their swords were also buried with the warriors. And also some utensils etc. were also buried. This is the first civilization where evidence of burning and burial has been found together.\nBodies of women warriors have also been found in Sinauli. But the legs of all the women warriors were chopped off.\nNow a new discovery has been made in Sinauli in which a chariot has been found there. Carbon dating has shown that this chariot belongs to the time when the world did not even know the bullock cart properly. This chariot was driven by horses. Many more evidences have been found in Sinauli. For example, for the first time, the use of four pillars has been found to keep the graves above the ground.\nBefore the evidence found in Sinauli, it was believed that India had never made weapons and weapons were brought to India from other countries. But the evidence found in Sinauli shows that India had started making weapons even before the world.\nSinauli has once again proved that India has taught everything to the world. India was and will remain a world leader.\n\nThanks for reading my review.",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Nivada khobbipur Shiv Mandir member (Ravi)",
      "rating": "Unknown",
      "address": "X6J9+MV6, Baghpat, Uttar Pradesh 250619, India",
      "reviews": []
    },
    {
      "name": "Shiv mandir",
      "rating": 5,
      "address": "W6VH+56H, New Colony, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Very good tample. Big spece inside.",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "HANUMAN TEMPLE",
      "rating": 4.8,
      "address": "W6V8+6MG, Baghpat Bangar, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai Bala ji",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai Hanuman",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Good temple .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jay shri ram",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Pakka ghat mandir",
      "rating": 4.6,
      "address": "W6W6+7CW, Yamuna Rd, Bhajan Vihar, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Pakka Ghat Mandir is a temple which is one of the best place to visit in baghpat ......Baghpat is known for some places including Pakka Ghat Mandir......Peace and peace...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A great place to visit. If you are devotee of Loard Shiva then this place is defenetly  for you. This tample has a rich history and it is contemporary of lord krishna era.\nBecause of bank of yamuna river, geographical diversity could be noticed . And yup lot of snakes are also there 😅 . I am going to upload my last visit experience bellow.\nNote: This Video is not promoting to catch any snake in that area. If any sanake Charmer(सपेरा) will found to harm these reptile or other animal, he will be punish under forest dpt. Law.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean and so beautiful temple in Baghpat. It was Sunday when I visited here, from the door it looks like a home. I was amazed when I entered and saw that it fully cleaned and cool place. In case you are late then use it as your home. People inside this temple are very good. I can't explain my happiness when I was here. Very soon I'll visit here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Not so big temple , fine place to visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice place to visit rt!!",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Markaz masjid",
      "rating": 3.8,
      "address": "Mohalla qureshiyan, Desraj Mohalla, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Awesome",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Police line",
      "rating": 5,
      "address": "X6G5+VGQ, Baghpat, Uttar Pradesh 250619, India",
      "reviews": [
        {
          "text": "Its a great place for bhajan and. Bakti for more details visit insta,fb,youtube @vlogpeetam",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Sanatan Dharm Hanuman Mandir Pt. Gautam G",
      "rating": 4.6,
      "address": "W6V7+RXM, Baghpat Bangar, Baghpat, Uttar Pradesh 250609, India",
      "reviews": [
        {
          "text": "Very very nice and clean temple. Free space inside the temple enough so that anybody can take rest. Peoples/culture around this temple is very good. When I visited here I was in a little early so decided to visit next time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple in my area....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good and well arranged temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful Temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}