{
  "places_with_reviews": [
    {
      "name": "Maneejri Masjid Dargah Shareef Bahraich",
      "rating": 4.2,
      "address": "HJR8+W22, Dargah Shareef Rd, Baikuntha, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Dargah Sharif\nHazrat Ghazi Saiyyad Salar Masud, a famous eleventh century Islamic saint and soldier. His Dargah is a place for reverence for Muslims and Hindus alike. It was built by Firoz Shah Tughlaq.\n\nIt is believed that people taking bath in the water of this Dargah become free of all skin diseases. The annual festival (Urs) at the Dargah is attended by thousands of people coming from far-off places of the country.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice masjid",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Dargah is situated inside city around 4 km from bahraich bus stand. If one decided to stay near dargah will have to reach earliest by 2100 hrs. After this the hotels are closed nearby.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A group of guys (kind of caretakers inside the masjid) misbehaved with me because I was wearing sleeveless t-shirt in the summer of Jun. He could have simply reminded me the tradition on the attire and I would have acknowledged. I am a Hindu and was not aware of Muslim culture properly, neither I saw any notice about attire. Those guys belongs to extremists.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Maneejri Masjid Dargah Shareef is Very Nice Mosque in Dargah Area",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mari Mata Mandir",
      "rating": 4.5,
      "address": "HH4G+6MQ, Bhogajot, Uttar Pradesh 271825, India",
      "reviews": [
        {
          "text": "Mari Mata Mandir is situated along the banks of Sarju ji, near the Bahraich - Lucknow Highway & Nanpara Bypass. The place is a calm and relaxing place to visit with occasional small fairs are held at the temple, the place also houses a hanuman ji temple in near vicinity.\nThe place feels magical to visit, not much rush is observed on normal days however the place is rushed on festivals\nJai Mata Di",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place on the bank of ancient river Saryu. Temple of Mari mata along with temples of shiva and Shree Hanuman.\n\nA small fair is also organised here on Monday and Navratri so it becomes crowdy these days as many devotees come here to get darshan as well as many village people come here  to do shopping.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very renowned mandir in this area\nSituated at bank of saryu river, if you're new must visit, but its highly needed to give\nattention to cleanliness.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Mari Mata temple is situated near saryu river ( now converted into nallah)  .\nQuiet and calm place.\nCrowd during Monday and fairs.\nI would like to request to the government to clean this river and make Ghat and gardens.\nTemple committee should also do this if they pay attention.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The temple is located in vast area. Its a peaceful place except on religious ocaasions when there is crowd and during fairs. Transport on share basis is available.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Hathila Shah Baba Dargah Sareef",
      "rating": 4.4,
      "address": "Hatile baba road, HJ7G+G84, Aminpur Nagraur, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Ok location",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful place in bahRaich for the religious minded people",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Irshad Ali Siddhartha nagar",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "My nice village",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Gullabir Mandir",
      "rating": 4.5,
      "address": "HHQX+CPV, Salarganj, Gulamali Pura, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Amazing temple. Feels very pious and devotional. Lots of open space and lake. Nice picnic spot also. Must visit place in bahraich.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "So good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This temple belongs to Bhagwan Ram Leela Committee Bahraich. After takeover this temple, many changes has been made by committee. Now this temple is very clean. Every year after 8 days of Holi a fair is organised by committee known as आठो का मेला.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Gallabir mandir nice place at the end of Bahraich city. Maharaja Suheldev statue is present here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I have seen this temple. Good place for peace of mind.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Sidhnath Mahadev Mandir (Shri Panch Dus Naam Juna Akhhada)",
      "rating": 4.6,
      "address": "HHGV+4QM, Brahmnipura, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "This temple of Shivji is known from the time of Pandavas of the legend epic Mahabharata. One of the famous temple of Bahraich. It has a High level of spiritualism power and energy",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "हर हर महादेव,\nEverything is so tempting here, but I suggest everyone to buy prasad and other offerings from elsewhere.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good for devoties and relaxing place\nThis place is the best ever I visit in baharaich",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good and positive vibe",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Maa Sangharini Mandir Bahraich",
      "rating": 4.6,
      "address": "HJG3+6WM, Ghasiyaripura, Ramawapur, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "All temples are special.This is the nearest temple to my home so i used to visit there whenever i feel low.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "nice temple of Maa Kali on very good location",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice temple has some good staff they are very friendly",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Yes, This is near bandhan guest hose. This temple has very largeplace.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hazrat Rajjab Saalar Masood Ghazi-Hathile Baba",
      "rating": 4.9,
      "address": "Shahpur Jot Yusuf Hathila , Bahraich 271801, Aminpur Nagraur, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Masha Allah",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "RAJU JCB WALE",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Love",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Masha Allah",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Masha Allah",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Mari mata",
      "rating": 3.3,
      "address": "HHCX+633, Brahmnipura, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Mr",
          "languageCode": "en-US",
          "rating": 3.3
        }
      ]
    },
    {
      "name": "Chhoti Beriya Mandir Bahraich",
      "rating": 4.2,
      "address": "HJ97+P54, Nawagarhi, Ramawapur, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "Best place to learn bike and car\nTemple is also very beautiful\nHere's enough space to pray without any hassle",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The history of the fair at the Choti Beria Temple is very old. Temple priest Magan Bihari Pandey said that Guru Purnima festival has special significance. On this day, thousands of devotees come to the temple for worship. Devotees from far away villages come to worship the mother on Guru Purnima, and ask for their wishes. A huge fair is organized on the temple on their day.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "You can do worship here in great peace.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very peaceful place and there a group nearby the temple",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I like this place.  Because it is beautiful and holy temple on  their.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "جامع مسجد بہرائچ Jama Masjid Bahraich",
      "rating": 4.4,
      "address": "HHGQ+X62, Qazipura, Chandpura, Bahraich, Uttar Pradesh 271801, India",
      "reviews": [
        {
          "text": "This is main Jama Masjid of Bahraich city. Situated in Qazipura locality and has a large campus.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Sajjan",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "under New construction",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Pray your namaz mostly in jama masjid ( becz more sahwab is here)",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}