{
  "places_with_reviews": [
    {
      "name": "Brigadier Hoshiar Singh Statue",
      "rating": 4.4,
      "address": "Mahavir Park, Bahadurgarh, Haryana 124507, India",
      "reviews": [
        {
          "text": "Brigadier Hoshiyar Singh Metro Station is Last Station of Inderlok To Bahadurgad Metro Line.. you can also get roadways buses for Rohtak, Hisar, Jind Haryana",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Entry to checking is very difficult, due to blocks they are putting for keeping line. Be careful while standing down the metro station for bus or waiting for anyone. Thiefs are very common. Go towards road until the necessity comes. Otherwise wait nearby the metro counter.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very good metro station, because this is the first metro station. And I get seat each time I travel by metro..☺️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Five stars for their attention to detail and personalized approach to astrology readings.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This metro station is very clean, and also metro train is neat and clean.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Baba Haridass Ji's Temple, Jharoda Kalan, New Delhi",
      "rating": 4.8,
      "address": "Jharoda kalan Jharoda kalan new Delhi near by c.r, p.f, Bahadurgarh Rd, City, Delhi, 110072, India",
      "reviews": [
        {
          "text": "Baba Haridas Temple in Jharoda village is an excellent abode if you want serenity in your life. In this temple you will find statue of Baba Haridas, Lord Shiva, Lord Krishna playing with cows. Baba Haridas is the official lord of Jharoda. Many places of Jharoda are also named after Baba Haridas. This temple is built in the Nagara style with fine textures. Inside the temples you will also find footprints of Baba Haridas.\nBut remember this, you have to walk on foot for utmost 1km. But after 1 km walk you will find that it's worth to get there.\nI personally sit in the temple for 10 minutes quietly and I find a connection with Baba Haridas. I will visit next year also .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "We first visited the talaab then this temple which are both beautiful and worth visiting. The place is serene and nice. The roads are too narrow and muddy to travel though. A car can either go or come at one time only.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Excellent place\nThey better start adding LESS chlorine in the water of mahlla, please.\nPlace of worship for worshippers, favourable energies for that.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The temple is very good and the managment staff of the temple is also very good during the during the peak time the croud is well organized",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Situated in village Jharoda kalan delhi is a divine temple of baba haridass. The fame of the temple proves that if you are a true bhakt of divine power, you will  also get blessings of that supreme authority. During chat mela huge crowd comes to take blessings of baba.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Aashram",
      "rating": 4.1,
      "address": "PWFP+5M4, Nahara - Nahari Rd, Delhi, Haryana 124505, India",
      "reviews": [
        {
          "text": "I don't know how it's work",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Not bed but i dont visit this place quickly",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best medicine 💊",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Gurgaon",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Okay lamy",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "ISKCON Temple Bahadurgarh",
      "rating": 4.6,
      "address": "Rama Krishna Nagar, Bamnoli, Bahamnoli, Bahadurgarh, Haryana 124507, India",
      "reviews": [
        {
          "text": "One of the best Iskcon temples in Delhi NCR.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful and calm atmosphere throughout 🥰♥️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "So beautiful and serene. The temple feels so calm between all the chaos. You'll feel all the positivity and good vibes here. Very beautiful and peaceful. I'll recommend visiting this temple to everyone around. You'll feel the energy, the presence here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited Bahadurgarh Iscon.\nFelt same feeling like Iscon Varindavan.  Same architecture.\nVery peaceful .\nLord Krishna blessed us .\nBut only one thing there were no devotee's today because of Covid.\nBut really v v nice.\nBahadurgarh is blessed bt Hare Rama Hare Krishna.\n.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Who does not want blessings of lord Krishna.\nV decent neat n clean pure but hardly any devotees because is far away from township",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tikri kalan",
      "rating": 4,
      "address": "MXM7+2XQ, Tikri Kalan, Delhi, 110072, India",
      "reviews": [
        {
          "text": "Clean metro station. High fog level. Visibility poor today.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "avreg",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Tau Devilal Park",
      "rating": 4,
      "address": "Delhi Rohtak Corridor, Madhya Marg, MWW9+GWV, Sector-6, Bahadurgarh, Haryana 124507, India",
      "reviews": [
        {
          "text": "Place is good, spacious & centrally located but is poorly maintained by the authorities. Lot of unscrupulous vendors flock on to this place with suspecious persona. Policeman must be deployed there for safety of ladies & children",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Visited this outlet with my friends for lunch. The staff was really kind and polite and the services were prompt as well.\nSo we ordered Shahi Paneer Chawal , Palak Chaap Chawal , Deluxe Thali and Chaap Platter. All the dishes looked delectable and tasted so good. Also talking about the quantity it was pretty amazing. Thoroughly enjoyed every bit of it.\nWould highly recommend you guys to try this outlet as soon as possible.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Amazing  park. Spent the day getting sunburnt but it was worth it. The staff are very friendly and we were shown exactly where to go to enter the park, find the locker rooms and store our belongings",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "If you want real peace. Visit it at the time of mid day. Its good for having friends get together place. It has lots of facilities to seat and take selfie.and enjoying the beauty of this parks.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Park is clean and lush green best for weekend picnic with family and friends.. big park close to sector 6-7 near road is rohtak delhi road. Walking track pollution free 4 km from delhi border..",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Ganapati Mangal Dham Temple",
      "rating": 4.7,
      "address": "36, Delhi Rohtak Corridor, Ganapati Dham Industrial Area Sankhol, Udhyog Vihar, Bahadurgarh, Sankhol, Haryana 124507, India",
      "reviews": [
        {
          "text": "On Ganesh Chaturthi, I visited there. It is a wonderful place to visit with family. Situated on the primary Rohtak Road. A quiet and serene place to get blessings from Ganpati Ji.\nBrigadier Hoshiyar Singh Metro Station is about 1.5 km away.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A great initiative of a humble man to build such a beautiful temple.\nLoved the calmness and peacefulness of this place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very huge Ganesha statue looks beautiful. Neat and clean temple. Good place for family outing. In the night, you can see laser show as well.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is an amazing place in small town bahadurgarh. The temple is clean and quiet. The Ganesha statue is overwhelming. Kids love this place and so does my grandma.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place near main road and one thing is that below Ganpati Temple there is also good place and many God is there like Hanuman G, Radhakrishna,Ram Sita, Bholenath",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Hanuman Mandir Balour (Haryana)",
      "rating": 4.7,
      "address": "MWCF+5J6, Balaur Rd, Balaur, Haryana 124507, India",
      "reviews": [
        {
          "text": "This is a Good spritual place. It is situated in front of Judicial Complex/ Court/ Tehsil. But Hanuman Mandir is more older than new court Bahadurgarh.\n\nVery beautiful Hanuman Temple..... It is not very crowded.\n\nJai Bajrang Bali.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "My worship place Awesome",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai hanuman ji K",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "An ancient temple of Hanuman ji. People visit here from various parts of country. Have deep faith in this temple. Jai baba ki..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I can only explain that your every practical wish will be fulfilled here with the condition that you will take vibhuti as per Baba ji advise & create a trust in your mind that with the Grace of Shri Balaji my wish will be now fulfill",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Jama masjid",
      "rating": 3.9,
      "address": "MWM7+WRW, Adarsh Nagar, Bahadurgarh, Haryana 124507, India",
      "reviews": [
        {
          "text": "Magnificent, huge, marvelous. Awesome vibe around. Great architectural wonder.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Mashallah peaceful place.\nThis masjid is near government ITI and canteen.\nShuru khutba -1:15pm",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very Nice Masjid (Jama Masjid) in Bahadurgarh, near Govt ITI jajjhar road, Bahadurgarh....\n\nI visited today 2-10-20",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very peaceful place parking also available",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Historical place, near old Delhi railway station ,it is the very good creation of architact. See this place & feel wahhhh what a good place",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Balaji Mandir",
      "rating": 4.8,
      "address": "MWCQ+PJ4, Najafgarh Bahadurgarh Rd, Sector-9A, Delhi, Haryana 124507, India",
      "reviews": [
        {
          "text": "Very Religious Environment With Positive Vibes.....All Must Visit Here😊🙏❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very old, beautiful and peaceful palace",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Temple is temple depends on your faith and believe",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "So sweet hanuman mandir",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Ancient Hanuman ji Mandir, with actually there you find sweet shops  which have very much reasonable price for the sweets. There you find mesmerising aura of lord balaji.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}