{
  "places_with_reviews": [
    {
      "name": "Shri Baijnath Temple",
      "rating": 4.8,
      "address": "VPO, 2JXV+HHJ &, Teh, Baijnath, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "The Baijnath Temple, dedicated to Lord Shiva, is located in the town of Baijnath in Himachal Pradesh, India.\nIt is one of the oldest temples in the region, believed to have been constructed in the 13th century.\nThe temple complex is renowned for its exquisite architecture, featuring intricate stone carvings and sculptures.\nDevotees flock to the temple throughout the year, especially during the Mahashivratri festival, to seek the blessings of Lord Shiva.\nLegend has it that the temple was built by Ravana, the demon king of Lanka, as an offering to Lord Shiva.\nThe main deity worshipped here is Lord Vaidyanath, known as the \"Lord of Physicians,\" believed to possess the power to heal ailments.\nThe temple surroundings offer a serene ambiance amidst the picturesque landscape of the Himalayas.\nVisitors can also explore nearby attractions like the hot springs believed to have medicinal properties.\n\nNestled at the foothills of the Dhauladhar Ranges along the left bank of the river Binwa, lies Baijnath, formerly known as Kiragrama, which served as a frontier post from the early 13th century. The village's name suggests its origin from a settlement of the Kiras, a war-like tribe from Kashmir.\n\nLegend has it that during the Treta Yug, Ravana sought to appease Lord Shiva by performing penance at Kailash. When his prayers went unanswered, he proceeded to Kurah (believed to be Manimahesh in Chamba Distt.) and began sacrificing his ten heads. To prevent Ravana from attaining invincibility, the Devas beseeched Lord Shiva's intervention. Upon their request, Shiva not only halted Ravana but also restored his ten heads, earning the title of Shri Vaidyanath. As per Shiva's boon, Ravana requested unparalleled power and consent to carry and consecrate him in Lanka. Shiva agreed on the condition of an uninterrupted journey. To facilitate this, Shiva transformed into a Linga in two parts. Carrying the Linga basket, Ravana proceeded south until he reached the Gokarn area (Baijnath), where he felt the urge to relieve himself. He entrusted the basket to a cowherd with strict instructions not to place it on the ground. However, when Ravana delayed his return, the cowherd, finding the basket heavy, inadvertently placed it on the ground, thus establishing the Linga at Baijnath, with one half as Vaidyanath and the other as Chandrabhal.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Situated on the foothills of the Dhauladhar Ranges on the left bank of the river Binwa lies Baijnath. Originally known as Kiragrama, Baijnath was a frontier post, as far back as the beginning of the 13th century. The name suggests that the village owes its origin to a settlement of Kiras, a war-like tribe from Kashmir.\n\nIt is believed that during the Treta Yug, Ravana tried to propitiate Lord Shiva by performing penance at Kailash. When his prayers went unanswered he went to Kurah (believed to be Manimahesh in Chamba Distt.) and started sacrificing his ten heads. Lest he attained Rudra status and became immortal and invincible, the Devas prayed to Lord Shiva to stop Ravana, . At the behest of the Devas, Shiva not only stopped Ravana but also restored his ten heads and hence came to be known as Shri Vaidyanath. On being granted a boon by Shiva, Ravana asked for incomparable power and permission to carry him and consecrate him in Lanka. Shiva agreed but on the condition that they should not stop on the way. On Ravana’s request, Shiva assumed the form of a Ling in two parts. Putting the parts in a carry basket Ravana started walking south. As he reached the Gokarn area (Baijnath) he felt an urgent need to relieve himself. Seeing a cowherd he handed over the basket with the request that it should not be placed on the ground. As Ravana delayed in returning and finding the basket to be heavy, the cowherd placed it on the ground and thus the Linga got established at Baijnath, one half as Vaidyanath and the other as Chandrabhal.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Old temples have that overwhelming aura. You will feel god’s presence.\nMust visit. 🕉️🕉️Har Har Mahadev !!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "There is everything. But according to me management needs to be improved on their quay system. Which must be an improvement for everyone,especially for tourists. Because they are coming from away",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Its very old Shiva Temple. Its located just beside baijnath bus adda. Infact the city is beside and runs because of this mandir.\n\nLots of worshippers throughout the day. The architecture and beauty with surrounding gives you a distant feeling of Kedarnath.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sherabling Monastery",
      "rating": 4.6,
      "address": "Baijnath Bhattu monastery, Keori, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "The most beautiful monastery I have seen. It's just renovated.. colours are so aesthetic and cool. If you are in bir please visit this beautiful place. Campus is so huge and lively.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Loved the place, huge monastery with a cricket and football ground and school.  Very peaceful environment in the quiet. They hv a cafe run by the monks and is recommended to visit on your trip. Souvenir shops are loacted near to this cafe. The drive to this is less than 30 mts from Bir. Keep this place on Yr itenary.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Sherabling Monastery is located inside a larger complex which houses not just the monastery but also a monastic school, monastic residential complex and other monuments as well. The entry to the monastery is free, one only  needs to register at the entrance. It is advisable to ask the guards before entering the way to the monastery or follow the location on maps as once inside the complex there are many paths and you could get lost. The monastery is a quiet and serene space which houses a large idol of the Buddha. Photography and videography are not allowed inside. As a sign of respect it is advisable to maintain silence. The other building worth visiting inside the complex are the eight stupas. These are located an almost 20 mins walk away from the main monastery. Vehicles are not permitted inside and walking is the only option available. But it is worth visiting if you are in Bir.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a good place to hang out. You will find peace and good aura there. You must be good at walking if you want to explore every portion of the monastery. Although there must be some good eateries.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very peaceful monastery, must visit when in Bir. It also houses an institute for Buddhist studies. You can visit the monastery at anytime during the day. They have a guest house as well as a small cafe that serves the most amazing momos and tomato soup.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Mahakal Shiv Temple",
      "rating": 4.8,
      "address": "Village post office Mahakal, 2M53+HG5, teh, Baijnath, Mahankal, Himachal Pradesh 176128, India",
      "reviews": [
        {
          "text": "A sacred place devoted to lord Shiva as Mahakal baba. Very peaceful, calm and beautiful atmosphere. The temple area is surrounded by green mountains and natural spring water flowing. Shani Dev and Durga Mandir are situated in the premises along with Hanuman ji. A natural holy pond is also there behind the temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most ancient and beautiful Shiva temple in Dev Bhoomi Himachal Pradesh. If you are into art and history, then it's the place for you. Every wall is sculpted all the gods and goddesses were placed on the temple walls and all together looks so beautiful. The temple is very clean and maintained, the surrounding is very calm. Best place to visit with family, friends or even you are alone. The temple is near the bus stand. So, no transportation problem.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai mahakal\n\nWatch this video to know more about the place\n\nhttps://youtu.be/_O6K21cYaZM?si=u6c40-P-DAFiQ3yz",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Most beautiful place. It is a historical tample of lord Mahakaal❤️.It is  almost 30kms from Palampur, temple is well maintained. Roads to this place are good and don't need specific skill to drive to this place.Also take a bath here 🚿 Environment is very neat and clean and find a peace of mind here. Beautiful place you must have to visit atleast for one time. Kaal bhi kya kere uska jo bhagat ho Mahakaal ka ☠️ Jai Baba Mahakaal.❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A small temple with several subsidiary shrines, of unknown antiquity, but clearly ancient in structure. The small compound is  clean and well-maintained. On non-festival days, this can be a quiet place to reflect and meditate. There's a cremation ground close by and a rivulet flows on one side of the temple. There are no pushy priests, vendors or beggars, making a visit to this holy place, an entirely pleasant experience.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Bagalamukhi Temple",
      "rating": 4.3,
      "address": "3M8V+QRW, Bag, Bharag, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Sorry to write that now a days after Mahatmaji no one is caring Ashram like it has to be. No service, seva for Mahatma, Sadhu. No facility.\nI'm wondering what happened to humanity as now a days Ashram are mainly for comfort, fun, and earning machine.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Devi Temple, Kalholi",
      "rating": 4.8,
      "address": "Kalholi, 3MQC+9MX, Dharehr, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Mata baglamukhi mata temple is approx 56 km from palampur and 27 km from jwalamukhi temple. This temple is situated in himachal pradesh in kangra district. This temple is must visit place by my recomendation. Mata baglamukhi is also known as stambhan mata. This temple is approx 209 km from chandigarh",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great👍",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai maa Baglamukhi🙏 holy religious place full with calmness and blessings",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful place ....Kuldevi Mata of Bhagwan Shree Ram Chander g....",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Baglamukhi Devi Temple,\nKangra, Himachal Pradesh.\n\nLocated 30 km away from Kangra District in Himachal Pradesh near Dharamshala, the Baglamukhi Devi temple is surrounded by the Dhauladhar range of Himalayas. The name Baglamukhi is derived from two Sanskrit words “Bagla”, which means bride and “Mukhi”, meaning face. The temple is among the many establishments scattered in various other parts of the country dedicated to Goddess Baglamukhi.\n\nAround 30 km from Kangra District, Baglamukhi Temple is a Siddha Peeth close to both Jwala Ji and Chintpurni Devi Temple. The deity, Baglamukhi is one of the 10 Mahavidyas and believed to be the destroyer of all evils. Yellow colour is the most favourite colour of the Goddess. That is why the temple is painted in yellow colour. The devotees do wear yellow attire and yellow desserts (besan ki laddoo) are offered to the deity. People worship the deity to win the legal confrontations, to defeat their enemy, to prosper in business and to win the heart of beloved.\n\nThe name Bagalamukhi comes from two separate Sanskrit words, 'Bagala' meaning 'bride' and 'mukhi' meaning 'face'. In essence, it translates to the deity having captivating and hypnotising powers in her face or herself which fights the evil away. It is said that yellow is the favourite colour of the goddess which is why the Baglamukhi Temple has been painted yellow in colour. All the worshippers of the Goddess wear yellow coloured clothes, and yellow sweets are offered to the deity. Many festivals are celebrated at Maa Baglamukhi Temple including Navratri, Guru Purnima, Vasant Panchami, and other special pujas and aarthis.\n\nIt is considered that the Goddess loved the yellow color, and hence the temple is painted vibrantly in the yellow shade. The entrance, all the domes and the pillars are painted in yellow. Inside a tiered dome, which is supported by pillars, there is a huge prodigious havankund. The holy place enshrines the idol of Goddess Baglamukhi embellished with yellow ornaments, garments, and flowers.\n\nBaglamukhi is one among the ten mahavidyas, the wisdom goddesses. Her abode is considered to be a Sidha Peetha. According to the mythology, she emerged on hearing the prayers of other Gods when the huge storm has erupted over the earth. It is believed that she calmed the storm, and since then she is worshipped as the enemy destroyer. This temple is one among the pars of famous Nava Shaktipeeth Yatra.\n\nThe temple is located in Bakhandi, Sameli, Himachal Pradesh. It is well connected by roads to various other parts of the state. Buses and taxi facility are available from cities like Delhi, Una, Chandigarh. Hoshiarpur, etc. The best time to visit the temple is during the month of October for the auspicious Navratri celebrations, celebrated with great joy, style, grandeur and vigour.\n\nTemple Address\n\nBaglamukhi Devi Temple,\nBanakhandi - Haripur Road,\nSameli, Kangra District,\nHimachal Pradesh 177114\n\nTimings\n\nBaglamukhi Devi Temple open at 06:00 AM to 09:00 PM - Everyday.\n\nJai Mata ji",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shiv Mandir",
      "rating": 4.7,
      "address": "V. P.O. THARA TEH. DISTT. (H.P) 176125, Baijnath, Thara, Himachal Pradesh 176063, India",
      "reviews": [
        {
          "text": "Visit and be blessed. Beautiful HISTORICAL temple. Surrounded by beautiful sceneries. Cool and calm environment. Can be reached by train, taxis, or personal vehicles. It is easily noticeable from from the main road. Parking facilities are also available. Hotels and restaurants are also nearby. So you can get breakfast, lunch and dinner easily.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Only god worship gives you inner peace. The temple was really good not from inside but from outside as well. The Shiv bhgawan temple was really beautiful. Real peace of mind.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best religion place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "10 days ago",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Pure Devine, almost 1000 yrs old temple",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Baba Balakrupi Mandir",
      "rating": 4.4,
      "address": "3J2M+VWQ, Panchrukhi - Paprola Rd, Paprola, Himachal Pradesh 176115, India",
      "reviews": [
        {
          "text": "Famous temple near paprola bus stop.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A great local deity and beautiful place to visit",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Wow nice 🙂",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice 👍",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A known temple among the locals.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Baijnath mandir bansaha",
      "rating": 3,
      "address": "2JWV+5PF mandir bansaha, Baijnath, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3
        }
      ]
    },
    {
      "name": "Baijnath Bir Billing",
      "rating": 5,
      "address": "teh, Vpo, Baijnath, Kasba, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Best",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Kangra Valley View Point City of Lights",
      "rating": 4.3,
      "address": "NH154, Dhar Bagi, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Spectacular view..\nRugged terrain of various size hills are clearly visible from this spot. Someone get a vastness and magic of nature..\nBizzare cold wind also win your heart...!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "If you are adventurous trip lover person. Then this route is for you.\nKangra Valley is a natural wonder that leaves a lasting impression. The lush greenery, meandering rivers, and towering mountains create a picturesque setting. The valley's charm lies in its serene atmosphere, offering a peaceful retreat for those seeking solace in nature. The Kangra Fort is a historical gem, adding a cultural touch to the region. However, some areas might be less developed, impacting amenities and accessibility. Overall, Kangra Valley is a paradise for nature lovers, hikers, and history enthusiasts. Embrace the tranquility and soak in the beauty of this enchanting destination.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Perfect point to view baijnath and paprola valley down under",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Superb view valley of flowers..must visit point",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This place was really nice. But not as expected. Sun set was beautiful from here. You can visit this place.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}