{
  "places_with_reviews": [
    {
      "name": "Waghjai Mata Mandir",
      "rating": 4.6,
      "address": "Waghjai Nagar, Bhor, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Small tample of waghjai mata. having great nature in surrounding and in navratri every day you feel special here because in yatra you will find good food and rides also.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing as well as very  bhaktimay fulfilled with lots of positivity",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful and Quiet place. Pollution free area where you can see many birds, surrounding temple area.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place...cleanliness is maintained very well",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple, clean surroundings, pleasant atmosphere, natural view.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Nageshwar Temple",
      "rating": 4.6,
      "address": "Ambawade, Bhor, Maharashtra, 3QCR+P5P, Ambawade, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Beautiful ancient temple, very quite place with water stream on one side. No cleanliness, not well maintained. This is the best example of how ignorance of local authorities can ruin the beautiful places like this.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Nageshwar temple is built 2000 years ago by naag tribes community.\nThis place is very nice and situated on river.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ancient temple which has undergone multiple restoration. Beautiful temple with the water stream on one side.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Off beat visit. No restaurants near by. Ideal and quiet place. On the way to Kengalgad and Rayreshwar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is 2000 yrs old. The surrounding is very calm. If ur near bhor and got some time then u can visit it. There's a runnel there and the water is clean to get refreshed.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kalubai Mata Mandir",
      "rating": 4.9,
      "address": "3VR3+PFW, Nilakanth, Gokavadi, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Janubai Mata Mandir जानुबाई माता मंदिर",
      "rating": 4.8,
      "address": "Ambade,, 3R5W+M6Q, Bhor, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Nice blessing place. next to Bhor gao. From here you can find 1 more best location that is mandhra devi temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Calm & serene place. Must visit this mandir if planned for mandhardevi.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Clean calm tempal also marriage hall,  cow orphanage",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very Owsome place. My Religious Feeling attached to it.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very clean n well maintained temple !!",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Nazare",
      "rating": 4.3,
      "address": "3RH2+H4Q, Nazare, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Peaceful place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Road are to Damascus and dengerous",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nazre Suspension Bridge If you come here one day, do check this area",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Swami samarth temple Bhor",
      "rating": 4.7,
      "address": "4, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Beautiful temple of lord Swami Samarth. Specially you can visit here in July to September, there is lot of greenery surrounding the temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing temple with very clean and peaceful environment..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visiting this temple not only gives you peace within but also pulls you closer to nature. Well maintained temple. Also shelter is there to avoid rain and heat.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This Temple is Shree Swami Samartha Maharaj Temple owner is Rayrikar Mukunda....\nThis Temple area is Look Like same of Akkalkot Swami samartha maharaj....\nAwesome place for yog kriya & meditation also.......",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing temple with very clean and peaceful environment. When I visited this place for the very first time with my family we all loved it due to amazing Shri Swami Samarth Murti and overall environment of the temple. Must visit place if you are visiting Bhor.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bhor",
      "rating": 5,
      "address": "3RHC+CFH, Palsoshi, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Khandoba Temple, Pale",
      "rating": 1,
      "address": "3R6M+9QH, Pale, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "Nice 🙂",
          "languageCode": "en",
          "rating": 1
        }
      ]
    },
    {
      "name": "Bhordara view point",
      "rating": 5,
      "address": "4RGP+8J, Bhor, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "At the end of August month we are experiencing new kinds of flowers that are growing over here and have some similarities to flowers growing over Kaas plateau. These flowers are grown over here and are grown over a few patches. This place is wonderful for evening walks. People from Bhor city use to visit and exercise at this place. Best time to visit in Monsoon and Winters. This place is well known but only few are visiting the place.\nPeople who are nomadic they bring their cows and buffaloes for fodder. No disturbance for people who are visiting this place. So for yoga, peaceful natural time spending, bringing beloved family members must consider this place 😀",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Best place to visit if you want to have a view of Bhor city and the outskirts. No crowd at all, that's what makes this such a quiet and relaxing place outside the Bhor city. Best to visit in the rainy season as there is so much greenery and clouds literally going over your head which makes this such a surreal experience. Underrated place. Must visit",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "SHIV MALHAR KHANDOBA MANDIR BHOR",
      "rating": 4.5,
      "address": "Shiv Malhar Gad, Sanjay Nagar, Bhor, Maharashtra 412206, India",
      "reviews": [
        {
          "text": "One of the powerful GOD temple  of Hindu religion. It's awesome creativity and also have Lord Patal vishnu temple, Lord shiv temple, great maratha king Shree chhatrapati shivaji maharaj statue and also have other relative temples. Heaven ✨❤ feel.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great  temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This mandir is nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}