{
  "places_with_reviews": [
    {
      "name": "Sherabling Monastery",
      "rating": 4.6,
      "address": "Baijnath Bhattu monastery, Keori, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "The most beautiful monastery I have seen. It's just renovated.. colours are so aesthetic and cool. If you are in bir please visit this beautiful place. Campus is so huge and lively.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Loved the place, huge monastery with a cricket and football ground and school.  Very peaceful environment in the quiet. They hv a cafe run by the monks and is recommended to visit on your trip. Souvenir shops are loacted near to this cafe. The drive to this is less than 30 mts from Bir. Keep this place on Yr itenary.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Sherabling Monastery is located inside a larger complex which houses not just the monastery but also a monastic school, monastic residential complex and other monuments as well. The entry to the monastery is free, one only  needs to register at the entrance. It is advisable to ask the guards before entering the way to the monastery or follow the location on maps as once inside the complex there are many paths and you could get lost. The monastery is a quiet and serene space which houses a large idol of the Buddha. Photography and videography are not allowed inside. As a sign of respect it is advisable to maintain silence. The other building worth visiting inside the complex are the eight stupas. These are located an almost 20 mins walk away from the main monastery. Vehicles are not permitted inside and walking is the only option available. But it is worth visiting if you are in Bir.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a good place to hang out. You will find peace and good aura there. You must be good at walking if you want to explore every portion of the monastery. Although there must be some good eateries.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very peaceful monastery, must visit when in Bir. It also houses an institute for Buddhist studies. You can visit the monastery at anytime during the day. They have a guest house as well as a small cafe that serves the most amazing momos and tomato soup.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Bangoru Waterfall",
      "rating": 4.7,
      "address": "Bir-Billing Rd, Bangoru, Gunehr, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "Keep 2 hours to visit this place for the trek to there and back. A guide is strongly recommended (150 ~ 300 per person), make a deal with the guide. If in a car park at the first opportunity and trek the way up, with a bike u can go a little further. Mesmerizing beauty of the falls. The last 150 meters one needs to walk in the river water to reach the base of the falls. Some tea, Maggi vendors are there for small eats. Enjoy.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This waterfall is not for the faint hearted! Even though its just a 1 km trek, the whole path is like an obstacle course! A guide is a must as the terrain is full of boulders to be scaled and narrow paths where one needs to be alert. The guide charges are around 300 per person and there are no other charges. We took around 3 hrs including the trek to and fro. But all this effort is worth the view and feel to be near the fall. On your way back from the fall, you could indulge in some chai and maggi or even some siddu. It is a lovely experience if in Bir and are up for more adventure than just paragliding.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful waterfall , please be sure to go with guide there .. rest the journey to waterfall is quite adventurous",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Just a normal waterfall, chumma Instagram hyped! But def take a guide the trail can be dangerous! Guide cost around 400 rs . Trust me it’s not like a super wow place , but then I’m from Kerala and waterfalls are common.\nThere a lady any there! Sells local food, she’s an amazing personality.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "No offence the waterfall is beautiful I liked it but there are some instructions\n1.Bring a guide with you because the trail for waterfall is not easy and they will help u alot .\n2.You have to walk in water so if u dont like to get in  water it's not the one for u buddy.\n3. Make sure to hype up ur hiking spirit cuz u have to climb slippery stones.\n4.Avoid going in monsoon days.\n5.its a good place for young people and adults but it's a  risky thing for kids...\nOverall the place is Good , you can enjoy so much, it's fun and even u can eat siddu and momos, have a cup of tea.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Little Bir",
      "rating": 4.6,
      "address": "Khasra No 855, 856, 857 Village Keori Post Office Bir, Near Landing Site , Tehsil Baijnath, Bir, Suja, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "My wife, friend, and I stayed here for almost 2 weeks while on a paragliding trip to Bir. Location is great, it’s a short walk to the landing zone. Hanging out on the rooftop was a great way to enjoy the mornings/evenings here. The food at Little Bir is top notch, we explored many of the local restaurants and the food here is right up there with all of them. The rooms were great and we had hot water the whole time which was lovely after long days of adventuring. Above all the staff here were amazing and helpful our entire stay. They really helped make our stay comfortable and enjoyable. 10/10 will come back and stay here again.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nestled amidst the lush greenery of the mountains, this property in Bir offers a serene retreat from the hustle and bustle of city life. The staff, led by the hospitable manager Kush, goes above and beyond to ensure a comfortable stay. The cafe serves delicious food, making dining a delightful experience. Plus, the property's proximity to the main city adds convenience without sacrificing tranquility. Overall, a perfect blend of nature, hospitality, and convenience. Highly recommended for a rejuvenating getaway.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Had a wonderful stay in Little Bir. I took the winter room which has a wonderful charm. The food is amazing and the location is also great. The staff here is extremely friendly and always helpful. The view of snow mountains to the right and valley in front is just amazing. The food and especially the chai is awesome. I met so many wonderful people here and definitely will book this again for my next visit. Bir is one of my favourite places and Little Bir is definitely worth the stay.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A genuine review:-\n\nThought rooms and location were decent but the staff were very rude towards customers.\n- They won’t allow you to play music.\n- They closed the common room so early and don’t even bother to open even after multiple requests.\n- Food was below average and very expensive.\n- There were no woods available for born fire.\n- Gym equipments were dirty. Only bench and some dumbbells were available.\n- There was no vibe at all like other hostels with fun activities. It was so boring.\n\nOverall very bad experience because of rudeness of staff and boring environment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean and big rooms. The staff is very helpful. Pocket friendly stays and a worth it trip. It's a perfect location for all the activities and adventures ( has paragliding landing site within walking distance). Market is nearby and overall this is definitely a good place to stay at Bir.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Bir Camps | Riverside Family camps",
      "rating": 4.8,
      "address": "Bunhla Marhola, village gunehr p.o. bir teh baijnath, distt, Bir, Bunhla Marhola, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "Located beautifully along river stream side. River is accesible after a bit of walk. Clean fresh tents with good service and helpful staff. recommended for couples and group stays.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most beautiful camp stay you will ever find in Bir. The camp is surrounded by mountains and beautiful views and has a river also. The rooms are neat and clean and the staff is kind and friendly. The owner Mr.Riteshji is very helpful. From our cab service to paragliding and trekking and sightseeing in Bir everything was done by him. We had no problem with the commuting and it was a perfect stay. You will find sukoon in Bir Camps ",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "how much ever i say it's not enough... the wonderful scenery, the lovely stay (tent experience is awesome!!),. exquisite locales, lovely food  wonderful people who welcomed us and took care of us .. sir Palsra,.. we'll never forget you !!thanks bircamps for an unforgettable stay !!!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's an amazing location, nice and clean rooms, owner ritesh and all staff so polite and friendly behavior, food taste is very good like home taste .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I used the café while out on a trek to the river. The Bir Camps is in a fantastic location, all by itself, overlooking a river and with expansive views of the nountains surrounding the Bir valley. The place has been aptly named by the owners as \"Sukoon\"(divine peace). Even though I wasn't staying here, the caretaker welcomed me and I sat on the sunny lawn, with the river murmuring below and birdsong in the bushes around. I ordered a brown bread toast and tea. Both were very good. The tea was so good, that I ordered another one. After that I lingered on, enjoying the sunshine and the beautiful scenery for over an hour. It was difficult to tear myself away from \"Sukoon\".",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Mata Maheshwari Temple Bir",
      "rating": 5,
      "address": "2PRF+V23, Bir, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "A decent hike off the Mandi Pathankot highway, up the hill and one comes to this temple. The hike a beautiful passing through forests and a Shiv temple. The path is very well laid out and can be done without any guide. Take your time to soak in the views. Once at the top, the views of the surrounding valleys are amazing. Worth half a day.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Beautiful trek with an amazing view of the town. The shiva temple and mata temple are at the  peaks of the mountain. Both have highly spiritual vibes.\nSunset is worth watching 📷😇.\nLong lasting view of mountains.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "A moderately difficult trek up the mountain when the weather is good - but pretty amazing views at the top. Trekking through the pine forest is a treat in itself.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Best spot for Sunset in Bir",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Realy wondurful place .\nGot spritual wives here🙏🙇",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Bagalamukhi Temple",
      "rating": 4.3,
      "address": "3M8V+QRW, Bag, Bharag, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Sorry to write that now a days after Mahatmaji no one is caring Ashram like it has to be. No service, seva for Mahatma, Sadhu. No facility.\nI'm wondering what happened to humanity as now a days Ashram are mainly for comfort, fun, and earning machine.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bir Billing India",
      "rating": 4.8,
      "address": "Bir Billing India, 1 st floor Near, Take Off Point, Biling, Bir, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "Best paragliding site in Asia. Even a visit to this place is mesmerizing for the 360 degree view. Visit to the cafe nearby, stay a while and get lost in nature. Enjoy the paragliding takeoff from this points. The drive is about 45 minutes from Bir. Recommend.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Last month, I had the extraordinary opportunity to visit Bir Billing, and it was truly mesmerizing! The highlight of my journey was undoubtedly the majestic ice-capped peaks, the ethereal clouds, and the blissful absence of crowds. I relished immersing myself in the serene beauty of the valley. Additionally, Bir Billing is renowned for its exhilarating paragliding experiences, making it a must-visit destination at other times of the year for thrill-seekers.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It was a wonderful experience flying with this amazing team. My paragliding pilot was karan and he was amazing with his flying skills. He made sure that I had an awesome experience to remember. Thanks to Karan and the team for driving till the takeoff site and making land smoothly. Much recommended to everyone.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Bir Billing is one of the top most famous Paragliding hub located in HP.\n\nBir is such a lovely place & the beauty of Billing makes it more scenic when you feel it on the top of hills.\n\nParagliding here is Asia's 2nd highest point & probably the top most reason of more & more tourists here.\n\nBir has lots of other lovely tourist places ie waterfall, monasteries etc, in main town, lots of nice cafes, hostel etc, this take off site is located around 14km from bir & it's in billing, while the landing site is nearby town itself from where it takes around 15 min walkin to the main town.\n\nHad a very wonderful experience here in trip, so much yummy food across different places, did paragliding, enjoyed waterfall, cafes etc.\nPeople here are very nice & supportive.\n\nIt's highly recommended to be here to enjoy natural beauty, adventure sports etc.\n\n#birbilling\n#incredibleindia\n#HimachalDiaries\n#Paragliding\n#Waterfall\n#ScenicBeauty",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I went to Bir Billing during monsoon and I was amazed to see the serenity of this place ! The best thing about my experience was the sunset , the clouds and there were hardly any crowd at that time ! I so much enjoyed the beauty of the valley and it’s also famous for paragliding if anyone wish to do that can visit other time of the year",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Camp Oak View",
      "rating": 4.6,
      "address": "Bir Billing, Village Gharnala, Post office Bir, Teh Baijnath, Himachal Pradesh, Bir, Bari, Himachal Pradesh 176077, India",
      "reviews": [
        {
          "text": "Recently visited this beautiful property and the experience was incredible. It was a rainy day and we were near the main Tibetan market in Bir and while we were driving to the camp, Varun was calling concerned for us and he made sure we reach the site safely. The whole staff was very generous and lovely.\n\nThe food was completely homely style and was very delicious.\n\nIndeed a great experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Stay at Camp Oak View in wooden Machaan Cottage is best hotel rooms at such beautiful location., Best experience for hotel stay , sunset from cottage beds. Forest view on other side with snow covered mountain peaks. We stayed for 3 nights here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best experience ! we stayed for 3 nights here. Location of this Hotel / Camp Oak View in Bir Billing is amazing 4 km from Paragliding Lanidng site, taxi’s easily avaiable at 300 at any point of time in evening late night. Road leads to Camo Oak View is through forest and seams like going some special place. Once reach Camp it feels we are in Nature with best view of mountain and valley. Evening Team arranged hike to sunset point, we spend one hour where amazing view of valley and paragliding happening along with. Best experience, Suggest every one to stay in such location of Camp Oak View. Having option of cottages and Camps and much better than hotels. Bir area is bit congested. Traveling for relax yourself and find it best as per our requirement. Team helps me for all ways from planning activities, visit places around and meals. Thanks we visit again. Cheers for team.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Machaan Tents are amazing and the view from them was mesmerizing.\nThe host, Rahul, himself is a gentleman and he took care of everything.\nThe food was also good. The memories we brought from this camp is for lifetime.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I recently had the pleasure of staying at Camp Oak View in Bir Billing, and it was an exceptional experience. The staff went above and beyond to make our stay comfortable and enjoyable. The breathtaking views surrounding the camp were truly mesmerizing, creating a serene and rejuvenating atmosphere. The facilities were well-maintained, and the overall ambiance was perfect for a peaceful getaway. I highly recommend Camp Oak View to anyone seeking a memorable and refreshing retreat in the beauty of Bir Billing.\nThe standout of my stay at Camp Oak View was the exceptional service provided by the staff, particularly Rahul. His dedication and attentiveness added a personal touch to the experience, making me feel genuinely welcomed. Rahul’s professionalism and friendly demeanor significantly enhanced my stay, creating a positive and memorable impression. Kudos to the team, especially Rahul, for their outstanding hospitality.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mata Maheshwari Temple",
      "rating": 4.8,
      "address": "2M9V+V54, Ahju, Gusainka, Himachal Pradesh 175032, India",
      "reviews": [
        {
          "text": "I had an absolutely breathtaking experience at this temple! The trek through the serene pine forest was enchanting, and the view from the temple during sunset was simply magical. It's the perfect place to find inner peace and connect with nature. Highly recommended for those seeking tranquility and stunning vistas",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very peaceful and very picturesque! We were lucky to have temple Prasad on the occasion of Navami.\n\nI can’t express how tasty the food was, it was Kangri Dham.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Amazing place to witness sunset and 360 degree view of Kangra Valley.\n\nLocated on a hilltop in Ahju around 5 kms from Bir.\n\nWe went for sunset and reached on top at 7:20 PM.\n\nThere is an area on the top of temple where we couldn’t reach as temple and entry to stairs was closed.\n\nWeather in that area is very unpredictable but luckily we witnessed sunset.\n\nWe decided to descend back but it started raining heavily, we found a shelter in a room like area.\n\nThere was no one except us 2, I was chilling in a T-shirt underestimating the circumstances.\n\nPriest of the temple also came despite heavy rain showers and asked us to stay in temple for that night as weather was extremely bad.\n\nWe waited for 1 hour there and started descending slowly at 8:30 PM and reached down at 9 PM.\n\nWe had MATA MAHESHWARI Blessings with us.\n\nI will not recommend anyone to go there solo in evenings.\n\nTREK -\n\nIt is a moderate trek of 45-60 minutes starting from a white coloured gate with “Jai Mata Maheshwari” written on it.\n\nTo be honest, Trek is not easy. Don’t rush. Keep food and water with you as there will be no shops and person around to help at odd times.\n\nIt is also visible from Landing site as a mobile tower is placed on top of the temple.\n\nDate of Visit - 5th June, 2023",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The temple is built on the peak of the mountain, 40 mins hike .. hike is well paved so it can be visited without a guide .. I suggest you keep yourself hydrated and use good shoes for hiking..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Perched atop the hills in Bir, Mata Maheshwari Temple offers an unparalleled vantage point to witness the most breathtaking sunset view in the area. As the sun gracefully descends, it paints the sky with a kaleidoscope of hues, while the city lights below come alive, creating a mesmerizing panorama that is simply awe-inspiring.\n\nTo reach the temple and experience this natural spectacle, one must embark on a 20-minute journey that winds through picturesque trails. As you make your way up, surrounded by lush greenery and a sense of tranquility, anticipation builds for the spectacle that awaits.\n\nUpon arriving at the temple, you'll be greeted by the divine presence of Mata Maheshwari, the deity revered by locals and devotees. Beyond the spiritual aura, the real treasure lies in the spellbinding view that unfolds before your eyes.\n\nAs the sun begins its descent, the sky transforms into a canvas of vibrant colors. Shades of gold, orange, and pink dance across the horizon, casting a surreal glow over the surrounding landscape. The panoramic vista from the temple showcases the Bir valley in all its glory, with the twinkling city lights adding a touch of magic to the scene.\n\nThe tranquility of the temple's surroundings and the ethereal beauty of the sunset create a moment of serenity and introspection. It's a time to pause, reflect, and appreciate the wonders of nature unfolding before you.\n\nWatching the sunset from Mata Maheshwari Temple is an experience that touches the soul and leaves an indelible mark on the heart. It serves as a reminder of the immense beauty that surrounds us and the power of nature to captivate our senses.\n\nWhether you're a nature enthusiast, a spiritual seeker, or simply in search of a breathtaking view, a visit to Mata Maheshwari Temple promises an unforgettable encounter with nature's grandeur. Let the sunset at this majestic temple in Bir be etched in your memories as a moment of pure awe and wonder.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Devi Temple, Kalholi",
      "rating": 4.8,
      "address": "Kalholi, 3MQC+9MX, Dharehr, Himachal Pradesh 176125, India",
      "reviews": [
        {
          "text": "Mata baglamukhi mata temple is approx 56 km from palampur and 27 km from jwalamukhi temple. This temple is situated in himachal pradesh in kangra district. This temple is must visit place by my recomendation. Mata baglamukhi is also known as stambhan mata. This temple is approx 209 km from chandigarh",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great👍",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai maa Baglamukhi🙏 holy religious place full with calmness and blessings",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful place ....Kuldevi Mata of Bhagwan Shree Ram Chander g....",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Baglamukhi Devi Temple,\nKangra, Himachal Pradesh.\n\nLocated 30 km away from Kangra District in Himachal Pradesh near Dharamshala, the Baglamukhi Devi temple is surrounded by the Dhauladhar range of Himalayas. The name Baglamukhi is derived from two Sanskrit words “Bagla”, which means bride and “Mukhi”, meaning face. The temple is among the many establishments scattered in various other parts of the country dedicated to Goddess Baglamukhi.\n\nAround 30 km from Kangra District, Baglamukhi Temple is a Siddha Peeth close to both Jwala Ji and Chintpurni Devi Temple. The deity, Baglamukhi is one of the 10 Mahavidyas and believed to be the destroyer of all evils. Yellow colour is the most favourite colour of the Goddess. That is why the temple is painted in yellow colour. The devotees do wear yellow attire and yellow desserts (besan ki laddoo) are offered to the deity. People worship the deity to win the legal confrontations, to defeat their enemy, to prosper in business and to win the heart of beloved.\n\nThe name Bagalamukhi comes from two separate Sanskrit words, 'Bagala' meaning 'bride' and 'mukhi' meaning 'face'. In essence, it translates to the deity having captivating and hypnotising powers in her face or herself which fights the evil away. It is said that yellow is the favourite colour of the goddess which is why the Baglamukhi Temple has been painted yellow in colour. All the worshippers of the Goddess wear yellow coloured clothes, and yellow sweets are offered to the deity. Many festivals are celebrated at Maa Baglamukhi Temple including Navratri, Guru Purnima, Vasant Panchami, and other special pujas and aarthis.\n\nIt is considered that the Goddess loved the yellow color, and hence the temple is painted vibrantly in the yellow shade. The entrance, all the domes and the pillars are painted in yellow. Inside a tiered dome, which is supported by pillars, there is a huge prodigious havankund. The holy place enshrines the idol of Goddess Baglamukhi embellished with yellow ornaments, garments, and flowers.\n\nBaglamukhi is one among the ten mahavidyas, the wisdom goddesses. Her abode is considered to be a Sidha Peetha. According to the mythology, she emerged on hearing the prayers of other Gods when the huge storm has erupted over the earth. It is believed that she calmed the storm, and since then she is worshipped as the enemy destroyer. This temple is one among the pars of famous Nava Shaktipeeth Yatra.\n\nThe temple is located in Bakhandi, Sameli, Himachal Pradesh. It is well connected by roads to various other parts of the state. Buses and taxi facility are available from cities like Delhi, Una, Chandigarh. Hoshiarpur, etc. The best time to visit the temple is during the month of October for the auspicious Navratri celebrations, celebrated with great joy, style, grandeur and vigour.\n\nTemple Address\n\nBaglamukhi Devi Temple,\nBanakhandi - Haripur Road,\nSameli, Kangra District,\nHimachal Pradesh 177114\n\nTimings\n\nBaglamukhi Devi Temple open at 06:00 AM to 09:00 PM - Everyday.\n\nJai Mata ji",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}