{
  "places_with_reviews": [
    {
      "name": "Bakkhali sea beach",
      "rating": 4.2,
      "address": "H775+7R2, Bakkhali, Lakshmipur Abad, West Bengal 743339, India",
      "reviews": [
        {
          "text": "Bakkhali Sea Beach is a charming destination known for its wide sandy shores and refreshing sea breeze. Located in South 24 Parganas district of West Bengal, India, it provides a peaceful retreat for beach enthusiasts. The beach offers a relaxed atmosphere, and visitors can enjoy long walks along the coastline. While the infrastructure may not be as developed as some popular tourist spots, the natural beauty and tranquility make it a worthwhile visit for those seeking a quieter beach experience.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is a very nice place for a day-out. The beach is located at 26 KM distance from Namkhana railway station. There are transport options available to reach Bakkhali from the rail stations. This beach is not yet over-crowded.  There are many shops around and one can best enjoy the spectacular sun-set view and definitely can linger on a rent chair to spend the evening time along with a cup of coffee. We have visited this place multiple times during the summer.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Bakkhali is located in West Bengal. To reach it, take the train from Kolkata to Namkhana. Then you have to get down to Namkhana and go by auto for half an hour. It is a very beautiful sea beach. Here all hotels are available in cheap.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is one of the most flat beaches I have ever visited. It is pretty safe to swim though the presence of mud can be a little irritating. I remember going pretty far into the water and still not be too deep. The waves also appeared calm even during the peak high tide. The best part was however the presence of life guards in the water who were keeping a watch and preventing people from venturing deep. The only thing I hated about the place was the public washroom. The ladies' washroom was pathetic and practically crowded with locals. Three or four ladies were randomly taking bath together leaving the washroom more messy. If you have ladies in your group who plan to take a shower post their beach activities, do book a hotel room instead of relying on local washrooms.\n\nThis is a sort of family beach......you wont find any shacks selling drinks on the beach. It might be a bummer for some of you guys. Also better to avoid two piece swimsuits here as this beach being overcrowded can invite unwanted stares, a cute playsuit or shorts would look equally well though! Indeed, for a short weekend trip, it is an ideal spot.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Bakkhali is West Bengal's first coastal town on the Bay of Bengal.  Although not as popular as Digha, people love to visit here.  The problem is that the sea that people come here to see is far away.  You can bathe in the sea only when the tide comes.  Another big reason for its loss of popularity is that people have to face a lot of problems here when bringing a car.  I am drawing the attention of the administration in this matter.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mousumi Island",
      "rating": 4.5,
      "address": "H775+7R2, Bakkhali, Lakshmipur Abad, West Bengal 743339, India",
      "reviews": [
        {
          "text": "This is the worst place to go and waste your time. I would request everyone not to go there. It is really a dirty, unhygienic and congested place, rooms are too much suffocating. Bad Smell comes from water. Muddy water and bad odour coming from river. The rooms are full of flies. it's not the place for a family to go and spend time. It is only considered to be a heaven for bachelors and drinkers.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good and awesome place to spend holiday",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Durdanto place",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Henry's Island Sea Beach",
      "rating": 4.5,
      "address": "H7CX+X7V, Henry Island, West Bengal 743339, India",
      "reviews": [
        {
          "text": "Henry's Island is truly a picturesque beauty. Nestled amidst nature's splendor, this island offers an enchanting escape from the hustle and bustle of city life. The pristine beaches, with their golden sands and crystal-clear waters, are a sight to behold. The lush greenery surrounding the island adds to its charm, creating a serene and tranquil atmosphere.One of the highlights of Henry's Island is its rich biodiversity. Nature lovers will be delighted by the variety of flora and fauna that call this island home. The dense mangrove forests provide a habitat for numerous species of birds and animals, making it a paradise for birdwatchers.Overall, Henry's Island is a hidden gem that deserves recognition for its scenic beauty and tranquility. Whether you seek relaxation or adventure, this island has it all. A visit to Henry's Island promises to be a memorable experience filled with natural wonders and breathtaking landscapes.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is an amazing Beach at Henry Island, pristine silver sands awaits you, after a brief walk through Mangrove Forest, the walk is comfortable as recently a concrete pathway has been added. It's a very picturesque location, almost out of film location. Most people skip this beach or just give it a cursory look, but a walk on this beach will fill you with amazement. Early in the morning is the best time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The secluded sea beach here will surely mesmerize you. The place is famous for its calm, secluded nature and scenic views. Henry Island is around 6 KM from Bakkhali. Red crabs can be seen on this beach, the beach is not suitable for bathing. Beware of quicksand. It is an ideal destination for nature lovers. If you want to enjoy the secluded nature here, then staying here is the only option for you. For booking room online, visit West Bengal State Fisheries Development Corporation (WBSFDC) website.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a White Sand beach, where you can go from Bakkhali. It is mainly area for sight scene at Bakkhali. You can come here by local TOTO or also you can come with your 2 Wheeler or 4 Wheeler.\nHere is a ticketing system for Entry which costs Rs.10 Per head. Beware of stolen sand also. You can see the proper notice board for your safety.  When you enters between mangroves this feels very good.  But is closes entry after 4 pm.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Enjoy the tranquility of sea with less crowded beach and virginity of sea shore vegetation. There is 2.5 km drive inside the park. Parking place inside. One has to walk after that for 5 min to get the seabeach. A coffee shop at parking and toilet is about 5 min walking distance from parking.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Bakkhali Sunset Point",
      "rating": 4.5,
      "address": "H6CV+J5Q, Susni Island, West Bengal 743339, India",
      "reviews": [
        {
          "text": "Bakkhali Sunset Point, is a breathtaking destination that promises an unforgettable experience for visitors seeking to witness nature's mesmerizing display. Perched along the coastline, this vantage point offers panoramic views of the horizon, where the sun gracefully dips below the edge of the sea, painting the sky with a kaleidoscope of colors.\n\nThe tranquil ambiance of Bakkhali Sunset Point provides the perfect setting for contemplation and reflection as visitors gather to witness the magical moment when day transitions into night. As the sky transforms into hues of orange, pink, and purple, the beauty of the sunset casts a spell, captivating all who behold it.\n\nWhat makes Bakkhali Sunset Point truly special is its serene atmosphere and unobstructed views of the horizon, allowing guests to immerse themselves fully in the awe-inspiring spectacle of nature. Whether you're enjoying a romantic evening with a loved one or simply seeking solace in the beauty of the natural world, this spot offers a serene retreat for the soul.\n\nVisitors can also capture stunning photographs to cherish the memory of this enchanting moment forever. As the sun sets on the horizon, casting its golden glow over the landscape, it's impossible not to be swept away by the sheer beauty and tranquility of Bakkhali Sunset Point.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great sunset place nearby bakkhali\nTook toto with family to go there after Henry island\n\nExcellent photography can be obtained",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Bokkhali sunset point is a hidden gem where you can see stunning sunsets, relax on the white sand beach, enjoy delicious seafood, and explore nearby attractions. It is a peaceful and simple place for nature lovers.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's place with stunning view of sunset and peacefulness....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Many tourists don't know about the place. That's why local totos driver dimand a huge of money. By the way this place is go beautiful and looking like magical on twilight...",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Frazerganj Sea Beach",
      "rating": 4.1,
      "address": "South 24 Parganas Frezerganj, Bakkhali, Lakshmipur Abad, West Bengal 743357, India",
      "reviews": [
        {
          "text": "This place is nice place to visit.\nYou can go in beach when it's low tide.\nBut now the beach area is under construction to save villages from any type of natural calamity.\nSo you may not enjoy the beach and fantastic view of this beach  until the works Will end.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "In the beach, there is The abandoned house of Mr Andrew Handerson Fraser - a former British Officer, who developed this area and that is why the name became \"Fraserganj\".\n\nNice place to visit here. Several windmills are there on the sea shore along with a base of the Indian Navy.\n\nLess crowded and peaceful beach",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Really shocked to see the condition the whole area is in. One can find only devastation of nature looking around the place. The whole beach is wrecked by natural calamities. The bungalow of Mr Frazer is also is a very poor state. The government must do something to change the state of the place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The beach is not very pleasant, neither is the temple right next to it, or the dilapidated Frazer house. A close up photo of the windmills is the best bet here.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very cool place…\nBeautiful seaside",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Bakkhali picnic spot",
      "rating": 4.1,
      "address": "Bakkhali, H757+VVV, beach, Fedric Island, West Bengal 743339, India",
      "reviews": [
        {
          "text": "The place is good to visit. One thing that is good is that you can enjoy the sea without any Disturbance. Low number of visitors so it's good to enjoy the sea.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice & big white sand beach... Best for weekend trip.. nice place to spend time with friends and family... But don't expect a beautiful sea bath experience...",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very beautiful place to weekend visit or picnic with friends or families in any holiday.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Whole area is covered by walls alround. There's concrete path and covered seats there adjacent to the wall. Picnic spot area is little far from sea beach. There's parking available outside the picnic spot. Bakkhali police post is just in the front gate. To reach sea beach from here, you need to cross the market and selfie point area, a 5 minutes walk",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The place is beautiful for Picnic. Weather is too pleasant ☺️",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Kalisthan Sea Beach",
      "rating": 4.1,
      "address": "Bijoybati, Haripur, Bijaybati, West Bengal 743357, India",
      "reviews": [
        {
          "text": "Kali Sthana Beach It is located in Bakkhali. No one visiting Bakkhali comes to this place. An acquaintance brother of mine has his home in Bakkhali and he brought me to this beach. I fell in love with this beach at first sight, this beach is lonely and beautiful. When the tide comes in, the water overwhelms the long beach and at low tide it becomes even more beautiful with red crabs, as if someone has decorated the beach with rose petals. The beach was damaged by typhoon Ayala so the government planted a lot of jhow trees, today those jhow trees may have grown too big. This is one of my favorite unknown places.I love ❤️ this place. Propulsion is low but SEA BEACH AREA is beautiful to enjoy with friends.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Virgin beach, still hidden from typical bakkhali tourists..explore the place before it gets ruined. A good place for red crabs and Sand piper sighting.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Really nice place. Although, if you ask locals, there is a place Kalisthan, but there is no such place as Kalisthan Sea Beach. It is basically the same place as Lalganj/Lalgaunj Sea Beach. Its a riverside beach. Very pleasing to the eye, crescent shaped beach. Secluded and serene too.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place, must visit kalisthan beach.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's mind relaxing spot 🧡",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Lal Gaunge Sea Beach",
      "rating": 4.1,
      "address": "H7VP+XP6, Henry Island, West Bengal 743339, India",
      "reviews": [
        {
          "text": "It was like most other beaches nothing special but the only thing I enjoyed was hunting small red crabs🦀🦀 and freed them immediately, I didn't hurt any sea creatures 🦐🐬🦞🦑🐙🦪🐠",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This is a beautiful Sea Beach in Wast Bengal.Need development in this area other wise amazing.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "No infrastructure for tourism and local administration is also indifferent to develop the areas 😔",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "tourists free zone, only nature...\nAwesome 👌",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best place to view red crabs.\nDo visit only in low tide seasons.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Henry island",
      "rating": 4.5,
      "address": "H775+7R2, Bakkhali, Lakshmipur Abad, West Bengal 743339, India",
      "reviews": [
        {
          "text": "Henry Island in Bakkhali offers a serene escape with its tranquil beaches and lush greenery. The picturesque landscape and relatively secluded atmosphere make it an ideal spot for nature lovers seeking peace. However, amenities may be basic, so it's advisable to plan accordingly for a more rustic experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Henry Island dates back to the European era in India. It is named after a European who surveyed this  island which is covered with mangrove forests. Situated in West Bengal, Henry island is only 10 minutes away from the coastal tourist place called Bakkhali.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must Check this spot while going for bakkhali as side scene. Nice place for roaming around but taking bath in the beach is strictly prohibited....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This beach was very quiet and very comforting and relaxing. Try to go in the noon time at around 3.30-4 so that you find it less crowded and can enjoy its beauty.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice beach and greenery. From the parking area the beach is at a few minutes walking distance. This place is not very crowded. Good place to spend some good time with the sea.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "বনবিবি মন্দির",
      "rating": 4.5,
      "address": "H75C+XVF, Fedric Island, West Bengal 743339, India",
      "reviews": [
        {
          "text": "Some 10 minutes of walk from Bakkhali Entry point, have go inside the forest of 'Jhau', little elevated by white sand. Once you come inside the Temple area, you will forget its Bakkhali. Temple Structure gives feel of Shimla, forest feels like Sunderban and wild sounds felt like Africa. A must visit. Detailed video on our Youtube channel 'World Of SD'",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is around 1 km from the entry point of bakkhali beach and one needs to walk along the beach to reach here... The small temple is surrounded by lash greenery..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Located 2km from Bakkhali sea beach only way visiting via foot. Simple mandir place for worship surrounded by trees, sand and beach.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The journey to the temple is an excellent experience on walking, I would suggest everyone to visit the temple and Dev/Devi's.\nWe started walking through the sea beach for approx one and half kilometres then turned left to the jungle.\nThere we found a small temple in the woods in the area of forest department, which is known as Bondevi or Bonbibi temple.\nAnyone would like the atmosphere around, there is a big snake which stays on the tree adjacent to the temple... the priest said we never seen.\nWe enjoyed the temple and it's atmosphere and to & fro walking through the beach and I strongly recommend everyone to visit Bondevi's temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple inside the forest and beside the Sea Beach.\nIt is almost 400-500 years old temple according to the Temple Priest.\nThe fishermen never go to The Sea for fishing without worshiped this Temple God.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}