{
  "places_with_reviews": [
    {
      "name": "Dechen Choekhor Buddhist Monastry",
      "rating": 4.7,
      "address": "V49X+479, Gompa Rd, Sarabai, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "We were just roaming around and came here...one of the most beautiful monestry I have ever seen.. the temple was closed taked to some monks there they opened the temple specially in for us... Architecture is one of a kind and people are super nice...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The serene place, can spend some quiet time there..You will also love the art on the walls.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful and a must visit place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "In all probability, this is the most beautiful monastery I have ever visited. It is calm and welcoming, the gardens deserve most of your time. You can spend anywhere from half an hour to a whole day here. If you're enthusiastic enough, there's an offering at 7:30 am which is an experience of a lifetime. Extremely picturesque place, a hidden gem.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Love this place.. so peaceful.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bhuntar",
      "rating": 4.5,
      "address": "V4PW+F5X, Bhuntar, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "Bhuntar is a very beautiful place with excellent scenic beauty. Parvati river meets with Byas river (Bipasa river ) here.This place is as such very good, calm and quite. Cool sounds of flowing rivers give the mental peace ness . Old Iron made bridge over the river is the added beauty of this place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This location is ideal for solo travelers seeking to appreciate the enchanting hills for trekking or admiring breathtaking scenery. I recommend it to anyone interested in spending their weekend near Chandigarh, indulging in traditional Himachali cuisine, and relishing the pleasant weather. For adventure enth\nThis place is best for Solo traveler to enjoy the treeking hills or see the beautiful sceneries . I sug\nThis destination offers an optimal experience for solo travelers who seek the allure of trekking through majestic hills and marveling at captivating natural landscapes. It is highly recommended to anyone with an inclination to spend a delightful weekend in proximity to Chandigarh, savoring the delectable traditional cuisine of Himachal Pradesh and reveling in the pleasant climate that graces the region. Furthermore, adventure enthusiasts will find their ultimate haven in Bhuntar city, renowned for its exhilarating rafting opportunities.\n\nThe allure of this place lies in its ability to cater to the desires of solitary explorers. Whether one seeks the thrill of embarking on a solitary trek amidst the undulating hills or simply yearns to bask in the beauty of awe-inspiring sceneries, this destination promises to deliver. Its pristine landscapes, adorned with verdant foliage, winding trails, and breathtaking vistas, are a true paradise for nature lovers.\n\nFor those seeking a weekend getaway near Chandigarh, this place offers an escape from the bustling city life. Immerse yourself in the rich and flavorful traditions of Himachal Pradesh by indulging in their authentic cuisine. The region's delectable delicacies, prepared with fresh local ingredients and age-old recipes, tantalize the taste buds and provide a unique culinary experience.\n\nMoreover, the region's cool and refreshing weather adds to the overall charm of the place. The pleasant temperatures create a comfortable atmosphere for outdoor activities and exploration. Whether it's trekking along challenging paths or simply relishing the tranquility of the surroundings, the cool climate enhances the overall experience.\n\nFor the adventurous souls yearning for an adrenaline rush, Bhuntar city stands out as the ultimate destination. Its reputation as a hub for thrilling rafting adventures attracts adventure enthusiasts from far and wide. Brace yourself for an exhilarating ride as you navigate through the gushing rapids, feeling the rush of the water against your skin and the adrenaline coursing through your veins.\n\nIn conclusion, this place offers an unparalleled experience for solo travelers. It combines the joys of trekking amidst picturesque hills, witnessing breathtaking natural sceneries, savoring traditional Himachali cuisine, and indulging in thrilling rafting adventures. Embark on this journey and create unforgettable memories that will stay with you long after you bid adieu to this enchanting destination.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to have fun on vacation but not on rainy days",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place to stay if you want to visit Kullu, Manali, Kasol, Tirthan Valley, Prashar Lake, sissu and more.\nPerfect pitstop for travellers.\nYou can even explore local places like Adi brahma temple, Dechen Choekhor Monastry or small treks around the place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Vishal mega mart\nMuch convenient  than other grocery store in kullu.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Basheshwar Mahadev Temple (Ancient Hindu Temple)",
      "rating": 4.8,
      "address": "Bishweshwar Temple Rd, Bajaura, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "The 2000-year-old temple dedicated to Lord Shiva showcases the rich cultural and architectural heritage of the region. It stands as a testament to the devotion and artistic prowess of its creators, attracting spiritual seekers and history enthusiasts alike.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A temple dedicated to lord Shiva. It has a historical significance. Visit to feel the charm and authenticity of the temple.\nIt is about 300meters away from the highway.There is space for parking.\nPS: the temple was lit up and decorated due to the festival of sawan.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Scenic and calm. The temple is beautiful and looks even more beautiful around sunset. The road is kind of narrow to pass two cars so you can park your car on the main Manali road near some shops, and walk to the temple. It's nearby and gives a good feel too walking there looking at the mountains",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful Shiva temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best place to visit in kullu district. It's located 15 km before kullu. Beautiful Shiva temple",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Triyugi Narayan Temple",
      "rating": 4.8,
      "address": "V623+P8J, Bhuntar - Diyar Rd, Diyar, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "A beautiful place away from crowded places..Very religious place but be particular about time it closes at 11.30 am and again opens at 4.30 pm. Great scenic beauty on way to this place from bhuntar",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Real peace one can experience",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great place....having peacefull environment.....🤗🤗",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is a temple of Lord Vishnu.Temple is situated in beautiful place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Ancient temple with beautiful place",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Khokhan Shri Adi Brahma Temple - Kullu District, Himachal Pradesh, India",
      "rating": 4.5,
      "address": "V4GJ+VRV, Khokhan Rd, Himachal Pradesh 175126, India",
      "reviews": [
        {
          "text": "This is very historical and peaceful place.And aadi Brahma bless all the peoples",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Peaceful historical and religion place. I walk around 2.6 km from shamshi bus stand and came back around same distance to bhuntar bus stand. Temple is awesome and historic. It's must visit place in bhuntar.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Aadi Brahma Mandir of Kullu is an architectural wonder constructed in the Himalayan Pagoda Style.The entire structure is approximately 20 meters tall entirely made up of stone, wood, and schist slate. The wooden bells hanging from the roof of the temple produce hypnotizing sounds. It is believed that this temple was built in the 14th Century, somewhere around 1350 A.D.\n\nFor Peace and Blessing One Must Visit this Place 😍✌",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place to sit and enjoy the calmness. Temple is also beautiful. But main temple door was locked.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place, bird singing and small village",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Ropa Valley",
      "rating": 4.7,
      "address": "Village Ropa, tehsil, Aut, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "Nice place to visit...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "felt good",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Raj Orchards",
      "rating": 4.1,
      "address": "NH 21, Kalehli, Post Office Bajaura, Kullu, Himachal Pradesh, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "good but littel bit canfused",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best quality fruits available here.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Cool place in any weather",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Ok, for a way side amenity.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good place for photography",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Shiv Temple",
      "rating": 4.6,
      "address": "R5W6+JGV, NH21, Bajaura, Himachal Pradesh 175125, India",
      "reviews": [
        {
          "text": "Quite beautiful temple with lush greenery, boundaries with high altitude mountains",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful place with a divine history and mystery. The banyan tree is having hidden ganesh photos. It was built by Pandavs on their travel towards heaven via himalayas. There are several other temples like this and each one has its own importance.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is 15 km away from Kullu. It has a ninth century temple dedicated to Lord Shiva and has intricate stone carvings.\n\n￼Bajaura is on the main road where BASHESHWAR MAHADEV temple is situated about 200 m from the village in a plain between the main road and the Beas river. It is believed to have been built in the mid 8th century. The temple of Basheshwar Mahadev (or Vishvesvara Mahadev) is located at Bajaura on National Highway 21, about 4 kms from Bhuntar Airport. There are about twenty recorded stone-temples in Kullu of which the Bajaura temple of Lord Shiva (Lord of Universe) is the largest one.  The temple looks a bit squat with an unusually flat Shikhara.The outer surface of the temple is covered with the carvings.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's an old temple made up of stones. Legend says that it was build by Pandavas in one night during there exile. Must visit during Kullu Manali tour.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A great sacred place, the temple is beautifully carfter with stones. This is an old Mahabharata time temple.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Markanday Rishi Temple",
      "rating": 4.9,
      "address": "R5FG+VPX, Himachal Pradesh 175121, India",
      "reviews": [
        {
          "text": "Right in the middle of apple orchards. A beautiful location for cycling.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very Good",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Awesome place must visit",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Bhole nath temple",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Place of worship",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Brothers Adventure 6862",
      "rating": 4.6,
      "address": "R5Q9+4Q4, Ranghrubehar, Hat, Himachal Pradesh 175121, India",
      "reviews": [
        {
          "text": "Nice place to adventure",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very bad. Very cheating",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Full on enjoy.. You can also try",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Adventure lovers must visit....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Here you will do river rafting and paragliding.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}