{
  "places_with_reviews": [
    {
      "name": "Bhamarghoda",
      "rating": 4.2,
      "address": "Kalupur, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "shraddha digital studio official",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice product 💙",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Hotel is closed just tea and other products is served",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "❣️",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "If you like to drink  tea than visit here...",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bhim Bhameda Mahadev Temple",
      "rating": 4.6,
      "address": "X8CW+934, Gujarat 388265, India",
      "reviews": [
        {
          "text": "Nice and scenic. Huge round rocks all around. Very strange and spiritual. Has 2 temples on top and kids garden. Good for sunset. Awesome place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "What a place having peace environment. The main temple in situated over a single bhimkaay shila [biggest rock].\n\nThe place is having some adventures places like hanuman temple, ramji gufa and matarani temple.\n\nLoved the place and nearly you can found the hotel that is also good to stay.\n\nFood in the hotel is also good.\n\nLoved the place i wish every year at one time i will visit this place.\n\nAt night time the decoration of the temple is also awesome.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We were here to see the rocks and balancing rocks . there is nothing special here. Accpet some good views and lots of rocks\n\nOne should not plan a social trio for this. If you are around this place .. you should visit it once for 15 to 20 mints",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice scenic place for sunset. Kids garden and has 2 temples. It has strange round rocks which are huge in size. Must visit place in Bala Sinor.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Like SHRI KEDARNATH one big shilla is here at the back of the Shiv mandir. Very surprising.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Garden Palace Heritage Homestays",
      "rating": 4.4,
      "address": "Palace road, Brahmani Society, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "Garden Palace Heritage Homestays was very nice\nVery Comfartable bad and sofa, room is very clean and staf coprative, all services very fast.\nThis hotal available in budget friendly rooms.\nTransport facility available all time",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nawab Saab & Begum Saheba run a lovely homestay in their ancestral property. They gave us the warmest hospitality, paying attention to the slightest detail. The food is delicious and with very unique flavors. The location is very peaceful, quiet but right next to the quaint old town of Balasinor. Go here to experience a slice of history & to see old world India not tampered by gentrification",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Balasinor State was founded BY Gujarati Muslim ruler Nawab, Sardar Muhammed khan Babi belonging to the family of last deputy Governor of Gujarat province in Mughal Empire. The rulers were titled Nawab Babi. It was a 9 gun salute state belonging to the Rewa Kantha Agency of the Bombay Presidency. The Last ruling Nawab Nawab[citation needed] was HH Nawab Muhammed Salabat Khanji II who died on 25 January 2018.The heir and son of Nawab Muhammed Salabat Khanji II Nawabzada Sultan Salauddinkhan Babi, born 1979 and educated at the Rajkumar College, Rajkot was crowned the titular Nawab of Balasinor on 4 March 2018 at the Raj Tilak and Gaadi Dastoor ceremony performed by both Islamic and Rajput traditions at their Garden Palace In Balasinor after the 40 days of mourning ended on 3 March 2018.\n\nI had great meeting with HH NAWABZADA SULTAN SALAUDDINKHAN BABI.He had shown the whole palace with full of paintings n ancient monuments\n\nUnique-u really feel that how gracefull were our royals lived earlier.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Next to the dinosaur park, you can enjoy a taste of royalty by learning about Balasinor’s royal family while enjoying the luxurious rooms and wildlife, such as bats, goats and roosters (that wake you up)!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Amazing place feel like the Mughals Era palace must visit ambience is superb",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Balasinor",
      "rating": 4.9,
      "address": "X83M+82F, Kalupur, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice",
          "languageCode": "en-US",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Ambaji Temple",
      "rating": 4.6,
      "address": "Saliyawadi Darwaja, Balasinor, X85Q+V47, Mullavada, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "Beautifully constructed temple of Goddess Amba. The eternal source of energy. Well maintained and spacious temple. Small garden enhances beauty of this sacred place. Weather around temple is quite peaceful. Ample parking space for vehicles. Devotees come to seek blessings of Goddess Amba. Recommended to everyone.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's 5 Star place lots of viewers are coming for darshan of Ambe maa it has very good place.viewers are coming in every events here, parking is good and highly recommend.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amba Mata Mandir have routine devotees from town to worship Maa. People's faith in this spiritual place is priceless. Jay Maa.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful n nicely maintained Ma Ambaji temple. Opp to it can find Lord Shiva Temple & Lord Hanuman temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best Temple to Sandhya Aarti and Pray to God. Very peace and relaxing atmosphere in early morning.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Kedareshwar Mahadev Temple",
      "rating": 4.7,
      "address": "X8FP+GM9, Gujarat 388255, India",
      "reviews": [
        {
          "text": "The complex as a whole is well kept, clean & very pleasant in winter & that too early in the morning . Birds, cows. Buffelos, goats, monkeys & rising Sun with clean breeze. Wonderful.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing place to worship lord shiva family. You will forget your worries of the world, very peaceful and true temple where lord shiva has been present lively.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kedareswar Mandir is place  where people of the town visits everyday to worship Bholenath, This temple is around 1200 years old is belief of people. It is surrounded by the natural beauty on Kedareswar Hill. People often come for jogging on this road as well as visit to sit there and relax on evening. It's my routine place to visit there and relax  .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's really cool and chilling place in the town and very famous Mahakal's temple and it also has park from small childrens. personally recommend because of lots of memories, any type of public can come here like senior citizens, mother and father, friends.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lord Shiva Temple-Most peaceful ....\n....one of the 11 Shiva temples of balasinor....\nBest places of Balasinor - surrounded by greenery and spectacular views -\nTemple is having a small garden with a playground for little kids and also a community hall to arrange various programs.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Balasinor Fort",
      "rating": 4,
      "address": "X85J+F7C, Mullavada, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "Fort is closed for a long time",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Aapeswar Mahadev",
      "rating": 4.8,
      "address": "X8PV+VR9, Gujarat 388265, India",
      "reviews": [
        {
          "text": "Very nice atmosphere ,natural  scenario..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best place for Puja Vidhi",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "apeswar mahadev with near place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice hindu religious place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good picnic spot!",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shudarshan Lake view",
      "rating": 3.5,
      "address": "Eid Gaah Road, X86P+875, near Garden Palace, Brahmani Society, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "This lake is now taken care of, but there was a lot of work to be done around this",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Lots of garbage in lake. Not maintained",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Just a lake.. Opposite Balasinor palace",
          "languageCode": "en",
          "rating": 3.5
        }
      ]
    },
    {
      "name": "Ahmedabad darvaja balasinor",
      "rating": 4.8,
      "address": "road, Kalupur, Balasinor, Gujarat 388255, India",
      "reviews": [
        {
          "text": "historical place",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    }
  ]
}