{
  "places_with_reviews": [
    {
      "name": "Ujjayanta Palace",
      "rating": 4.5,
      "address": "Palace Compound, Indranagar, Agartala, Tripura 799001, India",
      "reviews": [
        {
          "text": "It's actually the state Museum of Tripura.\nHere you will find all the history of Not only Tripura but the whole North East from the history to till the date.\n\nWe will get to know about a lots of things here, from the Kings who ruled here to the Britishers & their atrocities. How the Tribal groups of North East overcame all these & still living here following their traditions with Pride.\nIf you visit Tripura, I recommend to visit this place First.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the most popular tourist places in Agartala, beautiful architecture at display here! There is a Light and Sound show in the evening which enlightens people about the history of Tripura in brief manner! Loved the place!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I have visited many museums in India but this is one of the best. I would recommend visiting the museum inside the palace. You will learn about North eastern tribal community culture, tradition, history, artifacts, struggle etc completely.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ujjayanta Palace is a regal gem in Agartala, Tripura. Its blend of Mughal and European architecture enchants visitors. The museum inside is a treasure trove of regional history and culture. A must-visit for history buffs and architecture enthusiasts alike!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the most iconic places in Agartala. You'll fall in love with this.\n\nThe majestic royal palace of Agartala. It has turned to a museum of the royal history of Tripura and North East India.\n\nPhotography is prohibited inside the building, thus, only photos of the outside is here.\n\nThe museum is huge. It consists each and everything of Tripura, starting from the communities live here, the religious sites, archaeological sites, mountain, tea gardens, floras and faunas.\n\nYou'll need at least 2 hours to complete the whole museum.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Jagannath Bari",
      "rating": 4.5,
      "address": "R7PJ+G6C, Palace Compound, Krishna Nagar, Agartala, Tripura 799001, India",
      "reviews": [
        {
          "text": "Among many religious statues and displays like Ramayana and Bishnu avatars, this place has also Jagannath, Balaram and Subhadra idols; but has been famous as Jagannath temple. A temple mainly for Vaishnavas.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jagannath Bari Hindu Temple is a serene haven that captivates with its divine atmosphere. The intricate architecture and vibrant spiritual energy make it a must-visit destination. Stepping into the temple, one is greeted by a sense of tranquility that transcends the bustling world outside.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jay Jagannath, serene place to visit in Agrartala , you can also get Prasad served as Lunch here with a fees of INR 100.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Situated in West Agartala Jagannath Bari is a very good place if u want to visit agartala and stay for 2-3 days at cheap rates.. Rooms are good with attached bathrooms.. Overall a divine environment with Nam Kirtans every time.. But food is not that good.. Prefer having food from outside Mandir.. Only lodging is Affordable.Lord Jagannath , Balaram , Subhadra is Worshipped Here.. Dinner token costs rs. 40/head and lunch rs. 100/head but not that good.. If u want to stay at cheap rates at a good place with family admist divine and godly environment then u can stay here",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shri jagganath Bari\n\nBeautiful temple marvelous place to achieve self realisation.\nJagan Nath Bari is not just a temple, it is a whole world in it self.\nBari is dedicated to Lord Jagan Nath. There are many other temples inside this Bari.\nVery beautiful representation of various stories in the form of physical sculptures.\nStay for devotees and other pilgrim and even for any one can be arranged inside Bari.\nCommunity kitchen ia also here to serve the devotees.\nA pond outside the Bari is open for swimming.\nVery cool and calm place. Must visit if you are here in Agartala\n\nShiv parati pariwar with many small temples of lord Krishna inside\n\n🙏",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Akhaura Railway Station",
      "rating": 4.3,
      "address": "V6F4+F7C, Azampur Rd, Akhaura, Bangladesh",
      "reviews": [
        {
          "text": "Very beautiful railway station.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Absolutely lovely",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Amazing place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "New look. Double lane. Nice. Employees should be trained more.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "construction going on. but the foot-over which is situated over the rail line is disgusting...",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Science City Agartala",
      "rating": 4.2,
      "address": "Badharghat, Agartala, Tripura 799014, India",
      "reviews": [
        {
          "text": "This Place is ok... But plenty more to add yet... The astronomy section is quite informative... And the Fun Science section is entertaining for kids... planetarium isn't open yet... That's all...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "\"Embark on an enlightening journey at Agartala Science City.\n\nwhere discovery meets fun! Explore captivating exhibits meticulously curated to delve into the wonders of the universe, from celestial bodies to groundbreaking inventions like Galileo Galilee's Telescope and Newton's laws.\n\nDive into the excitement of the fun zone with interactive activities like the Mirror Maze, revealing unseen marvels of the cosmos.\n\nDelight in a mini Zoological Museum, immersive 3D theater experiences, and charming puppet shows.\n\nWith ample outdoor spaces, it's the perfect setting for creating unforgettable memories with loved ones.\n\nPlus, enjoy a special student discount of 10 Rs per person with a valid Student identity card...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Ticket Cost: 30/-\nA good place for school student group. But they have displayed very limited content. 3D room was locked. Ground floor rooms were open. One was an Astronomical unit and other was India's development in various field since Independence. Another room was",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It’s Good but it’s incomplete. I think it will be more interesting when it’s going to complete",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A great place for science lovers. Must visit❤❤",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Nehru Park",
      "rating": 3.9,
      "address": "Gorkhabasti, 79 Tilla, Agartala, Tripura 799006, India",
      "reviews": [
        {
          "text": "Place is good, kids can have fun very lush green area but one thing there are lots of mosquitoes that's why 4 stars best for couples and spend romantic time here nicely.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Not a very good experience. It is better to go there before the evening. After then there were so many bad experiences that I can't tell. But here it is specially made for children but you can also go with friends. But I don't recommend going at night. Thank you.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Not recommended to go there with yur parents at all 😂 Many couples in many chipa chapas, #chilloutplace",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "It is situated in Gurkhabosti. One can take Auto to reach there or personal vehicle. Entry charge is ₹ 10. Weekly close on Thursday. Not maintained nicely. Kids section is very entertaining.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "This park is a small dedication to Mr. Jawaharlal Nehru. Who was an Indian anti-colonial nationalist, secular humanist, social democrat, and author who was a central figure in India during the middle third of the 20th century.\n\nMe and my family visited this place on 18 April 2018. Must visited place in Agartala,Tripura",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Fourteen Gods' and Goddesses' Temple",
      "rating": 4.5,
      "address": "R8RW+H3P, Khayerpur, Old Agartala, Mekhlipara, Tripura 799008, India",
      "reviews": [
        {
          "text": "A historical temple built by The ruler of tripura as it was their \"Kuladevata\".Nothing much to see apart from the temples.Thus place comes to life during the annual mela which draws people from various parts of the country.A pond is there adjacent to the Temple premises which is currently very dirty.Animal sacrifice is still carried on as traditional offering to the goddess kali.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful, serene and believed by many to be place \"jagroto debota\" (god who  is alive). Must visit.\nImportant: visit early in the morning if you want to see the daily puja or make offerings.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful and holy place. The Fourteen goddess are worshiped in this temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Exceptional structure. Here 14 gods and goddesses are reside. But you can only see them on a particular time of the year. Otherwise you can only see 3 gods and goddesses throughout the year.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place with large pond. Development work is on..... nearby govt museum is must see place..... some 15km from Agartala city on Guwahati-Agartala Highway.\n\nNear the sacred 14 goddess temple during the month of July every year a Kharchi festival is organised and thousands of pilgrims and devotees visit this festival.\n\nIt is a local saying that one who visits Tripura Fourteen Goddess Temple once comes in Agartala fourteen times more.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "ISKCON Agartala",
      "rating": 4.4,
      "address": "Math Chowmuhani, NH8, Shiv Nagar, Indranagar, Agartala, Tripura 799001, India",
      "reviews": [
        {
          "text": "ISKCON mandir ai it's bests.. Had prasadam. ❤❤",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's was a Great experience, when I went to Iskcon for the first time...Just all your negative thoughts will vanish within a Moment...just go and Do kirtan or sit at a corner and chant Hare Krishna ❤️❤️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jay Jagannath, the ISKON temple is near the Museum Palace (~2 km).\nYou can also get some snacks options along with shop with puja items.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A very nice place for Krishna devotees. Can join Hare krishna naam gaan.\nWell made in a small area. Very clean.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Sometimes I take the 20 ruppee tiffin i.e. puri sabzi for breakfast which is really great in taste. I also attended few events such as last rites of an acquaintance. While today I have gone there to attend a wedding which is performed under the ISKCON norms. It is my first time to witness this kind of wedding, it was very simple but has its own charm in it. The food there was also delicious. It included fired rice, pakoda from the Banana blossom, sabzi with baby corn and panner, daal, another panner dish, Chutney, at last, vanilla ice-cream. The menu was short though it could make ones stomach full. Even the people there were very nice and polite.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Indranagar Kalibari",
      "rating": 4.7,
      "address": "R7WX+5FQ, Indranagar, Agartala, Tripura 799006, India",
      "reviews": [
        {
          "text": "Visited this for a furenal ceremony of one of my relatives the atmosphere was peaceful surrounding was well decorated followed by the temple it self with gardening skills and lighting. The quality of the served food was average. Dining hall is also available neet and clean . Staffs behaviour was good . Agartalas first temple having the sculpture of lord \" Kal Bhairav \" parking is not available",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very old Kali temple. Decorated beautifully during Kali Puja. Direct autorickshaw is available from Agartala Motorstand.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "If you once see the Maa Kaali here I promise it would worth. Though it's a road side temple but inside you'll definitely forget everything and get yourself lost in the calm and fresh ambiance... Must visit once.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best place ❤️❤️ most of the time I use to visit here! May ma bless us all 💖🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Photos taken during Diwali 2019. Most respected goddess in Agartala",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Tripura State Museum",
      "rating": 4.5,
      "address": "Laxminarayan Bari Road, R7MM+Q3M, Palace Compound, Indranagar, Agartala, Tripura 799001, India",
      "reviews": [
        {
          "text": "Well maintained, good place to visit and if are first time visitor than I will recommend you to watch the light and sound first which will start from 06.00pm in evening ticket price will be 100 rupees and it will give history recap of Tripura state.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I visited there when I was small and couldn't remember clearly everything. I have visited the previous day with my mates we learned many new things about our state, various culture, tribes, kings, people and many more. I recommend that if someone plan to visit Tripura, it's one of the best place to explore more things about the state. Everyone should visit this palace even once ever in life.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A beautiful White House of Agartala. One should must visit this place to know the history, heritage and culture of Tripura through the Palace museum.\nI would suggest that everyone should bring their children at this place at least once in a lifetime.\n\nThings like these helps a lot in the development of a child.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lots of knowledge about the growth of people culture of agartala is displayed in a beautiful way. Could have enhanced more if they could have put any audio display to understand better because it takes time to read and follow each and every article.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's very beautiful museum. I like it",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Azampur Station Jame Mosque",
      "rating": 4.4,
      "address": "Azampur Railway Sta Rd, Bangladesh",
      "reviews": [
        {
          "text": "One of the most beautiful mosque in Ajompur.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice mosjid at azampur railway station",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very beautiful mosque!! Spacious and comfortable environment available here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small and nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small place without any facility. Hardly any ticket is sold on ticket window. All tickets are bought by touts and they sell to passengers at premium / black price. It is same in entire Bangladesh,",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}