{
  "places_with_reviews": [
    {
      "name": "Narsingh Mandir",
      "rating": 4.4,
      "address": "PF4Q+H2V, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Very nice mythological place... Everyone should visit at least once in their life... A beautiful park of a huge Hanuman murti is present nearer to temple... Bathing in the cascade water will give you most amazing feeling... From Nrusinghanath to Harishankar is about 20 km via mountain path... One should go in mountain path by walk to get the best natural beauties as it comprises of many beautiful cascades...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Most attractive place to visit and may blessings God Narsingnath  and bath in water fall",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A nice place for picnic. Narsingh Mandir is situated in paikmal dist of bargarh Odisha. You can go to this place by bus also for paikmal auto facility is available here.The nature of narsingh Mandir is very attractive .it is vary good place for picnic .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A NYC place for picnic. Nrusinghnath temple is situated in paikmal dist of bargarh odisha. U can go to this place by bus.also from paikmal auto facility is available here.nearest rly station is harishankar road.nature of beauty is very attractive. Also u can take bath in the river. Mind blowing place for tourist.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One of the oldest temple in Balangir. So many people do there Thread ceremony and marriages here. It's situated at the middle of the town. Nearer to Bus stand.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Sailashree Palace",
      "rating": 4.2,
      "address": "MFV9+79W, Palace Line, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Sailashree Palace, also called the Balangir Palace, is a historic complex located in Balangir city, Odisha, India. Back in the days of Kalinga, many royal palaces graced the landscape, and this one stands out among the most renowned. King Rajendra Narayan Singh once called this palace home.\n\nOriginally named Badal Mahal, the Balangir Royal Palace was built by Maharaja Rithviraj Singh Deo between 1910 to 1920 AD. Maharaja Dala Gunjan Singh Deo had laid the foundation stone before that, around 1895-1910 AD. The palace's design is attributed to a chief architect from Rajasthan, and it took the collaborative effort of thousands of laborers and masons from Balangir and Rajasthan to bring this majestic structure to life.\n\nShailashree Palace in Balangir is a mesmerizing tapestry of history and heritage, weaving together the tales of more than 110 years of regality. The palace stands as a testament to the grandeur of Rajendra Narayan Singh's era, capturing the essence of a bygone time. From the intricate architecture that whispers stories of royal affairs to the rich textures adorning its walls, every corner resonates with a profound sense of legacy.\n\nAs you stroll through the palace, the ambiance immerses you in the opulence that once echoed within its walls. The detailing in every nook and cranny reflects the artistic finesse of a bygone era, while the surroundings exude a tranquil serenity, providing a perfect escape from the hustle of modern life.\n\nThe palace not only encapsulates the architectural brilliance of its time but also offers a journey through the cultural nuances of the region. The surrounding landscape, with its lush greenery and historical aura, complements the majesty of Shailashree Palace, creating an experience that transcends time.\n\nI wholeheartedly recommend a visit to Shailashree Palace for anyone seeking to immerse themselves in the grandeur of history. It's a rare opportunity to step into the shoes of royalty and appreciate the legacy left behind by Rajendra Narayan Singh. The palace stands as a living testament to a regal past, inviting visitors to uncover the layers of heritage woven into its very foundations.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is a tourist attraction in Balangir & the palace of former chief minister of Odisha Late Raja Rajendra Narayan Singhdeo, Who was also the king of this District and the owner of this palace named as Saileshree Palace, with the collaboration of district administration and former MP Mr. Kalikesh Narayana Singdeo they can make this place more and more attractive for the outsiders or the tourists 🙏",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful place with old vibes . Love the architecture 😍",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "When you see an ancient architecture standing in front of you with such majestic look you can't take away your eyes from that structure. This palace is encircled by hundreds thousands of trees . I really want to give a very big thank you to the people who have maintained that place since ages. The palace is really beautiful and some people appointed to take care of the palace. Please have a visit here and behold the majestic look of these ancient architecture.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "FamilyHome of royals of balangir. Now a BJD party office and closed for general public. There are 2 temples inside the compound.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Durga Mandap, Talpali Pada",
      "rating": 4.3,
      "address": "Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Not know",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awsum place during durga puja festival... This locality is like village... Full of natures.. As nearby there are two beautiful pond.. Its very peaceful place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best place for worship. Durga puja is celebrated very impressively.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Suggest to the committee members \"establish a Women Library\" thanks",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beside my home. Durga Puja  celebrate  here",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "KHUJENPALI TEMPLE",
      "rating": 4.5,
      "address": "MF9X+6MJ, Khujenpali, Pandrapita, Odisha 767002, India",
      "reviews": [
        {
          "text": "Very peaceful serene holy place, with multiple temples, worth place of worship. Famous for Shiva temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Too good and calm place. Very spacious.  Ideal place for marriage. For kids too as so much space is available for them to enjoy",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hindu Temple in a nice location, devotional atmosphere, good parking place, nice ambience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Peace environment and a nice place for family gathering or any marriage or birthday ceremony.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "In this place we can see :-\n\n1.Siba ji mandir\n2.Maa Chandi mandir\n3.Maa Durga mandir\n3.Ram ji , laxman ji ,and sita mata mandir\n5.Hanuman ji mandir\n\nThis is one of the famous temple (lord siva(siba mandir)) which we can get to see everything like  water source,  nature ect.\n\nThis is just a few distance from the balangir main market .\n\nIt is so amazing during the rainy season or we can say during kabad yatra(BOL BAM)\n\nTwo specious place are there for #small to #medium bhojan(prasad_sevan) or #events . they are providing everything for that event.\n\nThank you for your time 🙏",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Maa Durga Mandir",
      "rating": 4.7,
      "address": "PF4Q+MW6, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Very peaceful place. Nice temple. Beautiful Devi Durga statue.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Durga Mahishasura-mardini, the slayer of the buffalo demon.... One of the most important texts of Shaktism is Devi Mahatmya, also called as Durgā Saptashatī, which celebrates Durga as the Goddess, declaring the Supreme Being and the creator of the universe as feminine.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple of maa durga",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "So excellent temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is very good and big",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Maa Samaleswari Mandir",
      "rating": 4.7,
      "address": "Back side of Samaleswari mandir, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "The best temple in the city, in the heart of the town, little crowds, no parking place for 4 Wheeler.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I feel peaceful mind & soul whenever I'm facing difficulty of my life",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit place and divine place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best place with spiritual Vibes",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best mandir ...very old... spiritual feelings .....beautiful place to worship...so spiritual very close feelings associated with it.....nice temple in that place...prasad is very good......the people are very good....all tge designs are very excellent as it is designed by very skillful workers m...nice place ....🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Metakani Mandir (ମେଟାକାନି ମନ୍ଦିର)",
      "rating": 4.6,
      "address": "Tikrapara, Malpada, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Need some changes only\nPlace is all good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Saw from outside",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place for piece",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the Famous Place Of Western Odisha..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Small temple but number of people visit here..",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Durga Mandap",
      "rating": 4.5,
      "address": "MFXM+6Q8, Rugudipada Ram Mandir Rd, Rugudipada, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "Maa Durga Temple is here every Thursday you can came to visit here for aarti. Har mangalbar ko yanha aarti bahat hi dhum dham se kiya jata he dhol nagada bajaya jata he. If you want to really come to visit this place then please you must come on Thursday at evening.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "At the time of dusera this place is decorated like a palace..Number of person comes here to visit..as well as this is located on main road so its easy for the new comers to find this place...Here the road is also very wide due to which any one can visit by driving their four wheeler..This is the famous durga mandap of balangir..From here any one can visit the market place..Near this mandap there are also lodging facilities plus the restaurant so its helpful for the visitors to stay nearby area..Another this this is the place only to visit on dusera puja time...In normal days nothing is done here....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is the bigger durga mandap of balangir.During Durga puja, Navadurga were worshiped every year.During those days this place crowded.Decoration of the place each year most attracting.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best Durga Puja Celebration in Balangir. At the time of Aarti, a huge number of people gathered there.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jai maa DURGA",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Palace Line Durgamandap.",
      "rating": 4.1,
      "address": "MFWG+45Q, Bhawanipatna - Balangir Hwy, Palace Line, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "It's one of the best puja  mandap in  balangir area .You can see here heavy crowd during dusshera. Ravan dahan during dusshera is the most attractive things and they do it in a unique way.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Jay shree ram",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Puja Committee Members Good Service Surve Puja Time.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Club for  dashara festival.. Good  management       team... I like it.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Sunni Sadar Masjid",
      "rating": 4.2,
      "address": "PF2V+H4W, Tikrapara, Balangir, Odisha 767001, India",
      "reviews": [
        {
          "text": "It is a place for warship of Muslims community, they pry to Allah for there magfirat (For getting Heavy) here, they get relaxation by doing Namaz (Prayer) here, It is a masjid 🕌 for the Sunni Jamat of Balangir, Situated at near Prahari Chowk on the way to kansaripada.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I’m from east of Odisha, but this Barelly mosque is so peaceful and beautiful that I’ll dare to visit again when come to Bolangir.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Loveable worship place 😍",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is a place for prying of Muslims in Balangir town, as per the muslims of Balangir town it is a Sunni Muslims Mosque 🕌 ( Masjid )",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful mosque jumma khutba time is 1:15.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    }
  ]
}