{
  "places_with_reviews": [
    {
      "name": "ITI Square",
      "rating": 4.2,
      "address": "FWP8+62V, Mallikashpur, Balasore, Odisha 756001, India",
      "reviews": [
        {
          "text": "A square with one way towards chandipur, opposite towards angar Gadia, and the other towards Balasore town with opposite to Bhadrak road . Many types of vendors and shops are available here .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place for a evening tour , U can try street food . It is lovely and affordable too.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is one of the traffic junction, so you don't need a ticket to enter. You just need to watch traffic lights.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A square with one way towards chandipur, opposite towards angar gadia, and the other towards mid town balasore with opposite to bhadrak road. Square avail with all types of vendors. Everything can be available.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Many times traffic problem issue there and the evening time so romantic",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Remuna Golei | ରେମୁଣା ଗୋଲେଇ",
      "rating": 4.1,
      "address": "GV7V+P5M, Kalidaspur, Balia, Remuna, Saraswatipur, Odisha 756019, India",
      "reviews": [
        {
          "text": "In this area the roads are very uncomfortable. They Govt should to develop this area. In this area very large amount of dust particles are found but not in any other places in Remuna. Except this area all other roads in Remuna are clean and safety and the roads are constructed very good.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice experience.\nThe staffs are very well in mennered...",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very good and disciplined place",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This is very beautiful place",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Roads and lights are bad",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Fakir Mohan Golei",
      "rating": 4.4,
      "address": "Railway Colony, Balasore, Odisha 756001, India",
      "reviews": [
        {
          "text": "very nice experience, humble behavior by staff nice stay...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Busy place, so much of traffic... wait wait...it is not always like that. Only at morning and evening time this place is more busy....\n\nOther than that at occasions this place shows the night beauty with the different colors of light.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This place has everything that a cosmopolitan needs. From basic amenities to government offices, this place has all the facilities; be it India Post, railway station, grocery shops, shopping malls, healthcare units, petrol pumps, eateries etc. Well- maintained traffic is the key behind smooth transport in this area.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This place is the centre of Balasore town.this place is named after our greatest writer poet and freedom fighter FAKIR MOHAN SENAPATI.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Super service provider Titan eye Plus balasore 2. I recently visited Titan eye Plus and had a fantastic experience.The staff was incredible helpful, guiding me through a wide range of frames to find the perfect fit.A wonderful assortment of eye wear choice.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bampada chaka",
      "rating": 3.9,
      "address": "FVVQ+9M6, Chennai - Kolkata Hwy, Artung, Balia, Balasore, Chhanpur, Odisha 756056, India",
      "reviews": [
        {
          "text": "Accident prone area.\nHere Balasore-Nilagiri Gopinathpur Railway Tracks crosses the National Highway .",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very, very, very, very dangerous crossing. I cross daily. Now overbridge work started so more dangerous for two wheeler.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very heavy traffic due to railway line and trucks going to and fro in 4 different directions.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very crowded and heavy traffic always",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Dangerous, 8 way crossing ,black spot ,accident place..Roads are damaged not for children..in night very danger for 2wheeler drive.",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Rameswara Mandira(Temple)",
      "rating": 4.5,
      "address": "Kukudapada, Balia, Baleshwar, Odisha 756001, India",
      "reviews": [
        {
          "text": "If you are in balasore, once you should go there. It's a Lord Mahadev temple 🌸 Serenity and peace.They also provide Best hygienic prasad at a affordable rate. You can book in advance for Marriage ceremony. Good Parking space available.Near to Remuna golei. Cheap Transportation- you can go there by your own vehicle or by town bus 🚌 from bus stand.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very culturally devine place...... Peace 🕊️.   Visit once you will be happy to see the environment...... Very big pond also present there..... My fab mandir in BLS.....\nHar har Mahadev..... Jay Mahakal🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful temple dedicated to Lord Shiva, loved and revered among the people of Baleshwar. There is adjacent temples dedicated to Goddess Parvati, Lord Radha Krishna, Lord Hanuman and a big Nandi!\n\nOne can contact the temple priests for special puja and homa, yagna, abhisheka, etc. The temple management committee manages the administrative activities very well. There is a nearby large Pond dedicated to and managed by the Temple.\n\nAuspicious functions like Upanayan sanskar, marriage, etc. are hosted by the temple committee at affordable rates and very tasty, hygienic prasad is also available. The rate chart is attached here. Rates are very economical.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place to visit in Balasore. Peaceful environment ❣️ I love this place 😊\nDo visit here.\nRameswaraya Namaha 🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful. Prasad sebana is the best here as compared to other temples",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Jhadeshwar Temple",
      "rating": 4.5,
      "address": "GW4G+9Q7, Chowk, Bank Colony, Manikhamb, Balasore, Gopalgoan, Odisha 756001, India",
      "reviews": [
        {
          "text": "There is also a Puja mandap Durga held there",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is awesome and beautiful environment inside the temple due to a big Banyan tree.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's the old Lord Siva temple. Within the temple premises, there are many other deities like lord Jagannath, Balabhadra, Subhadra, and Hanuman. It also has a pond inside for the use of the temple. The peaceful and spiritual consecrated place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Old temple but not maintained properly. It need more attention from local governing body. Temple campus is not organised and cleaned. Hope there will be some improvement near future.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's good temple but sometimes it's so crowded outside that there is no space left outside to park the vehicle. Also good Prasad is available.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Emami",
      "rating": 4.1,
      "address": "FWV7+89X, Artung, Balia, Balasore, Odisha 756001, India",
      "reviews": [
        {
          "text": "Some say the temple is a wonderful architectural model of the Puri Jagannath Temple and Sun temple of Konark.\nSome say the temple is a beautiful place with amazing architecture and a wonderful scenario.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's joyful 🥰 😊 🥰 moments to every get Enjoy your Trips and saw the The Jagannath Swami 🙏🏻👑♥️🙏🏻👑♥️ in the Temple",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Can't express in words 🤗",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Wow",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice 👍",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Police Line Square",
      "rating": 4.5,
      "address": "FWMQ+4VP, Antaryami Ln, Mallikashpur, Taziabad, Isamnagar, Odisha 756002, India",
      "reviews": [
        {
          "text": "Heavy traffic need a over bridge",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Busy area",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "ISKCON BALASORE, SRI RADHA RASIKA RAY MANDIR",
      "rating": 4.3,
      "address": "Office's Quarter, Road, Mallikashpur, Gopalgoan, Odisha 756002, India",
      "reviews": [
        {
          "text": "Experience was great, good hospitality, Prasad was very tasty and pure hygienic place.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good place . Calm and if you want to do kirtan it is the best place in BLS.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You can know why someone is going to temple  after visit this temple and taking with pujari and devotee\nThe pujari and and devotee are really beautiful ❤️",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "1 Life changing\n2 Spiritual knowledge\n3 Association of devotees\n4 Final reason is worship place of Radha Krishna",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful place in Balasore! Spiritual and enchanting!",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Tarini Temple",
      "rating": 4.4,
      "address": "FWPH+7HX, Mallikashpur, Balasore, Odisha 756001, India",
      "reviews": [
        {
          "text": "This temple is inside Balasore town in malikashpur.\nThis cross is known as Tarini chouk.\n\nIf you are near you can visit morning and evening time.\n\nNana(pujari) available in both of the time.\n\nYou can give Coconut  🥥 sindura for puja.\n\nOverall nice and good place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The one I sent the day of school of medicine and I will fill you many happy memories of the best way for me with any of dj mix fruit of a or jabab of a while and I will send the best regards Michael sent to the day and time in class room of a while and Swachh the day before yesterday but we will be in the day and time of dj mix fruit of a or to tk tool in class room of funds to be a while ago but we are going through a or displa my new i i i my email id in the best way for full details on Tuesday of each of dj mix fruit and vegetable and Swachh the day before yesterday I sent it and it was excellent of dj of a while and I will send the best regards David David David David David David I am not sure how much you can do of the best way for me with any of a or to of dj of",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ghatagaon Maa Tarini Pitha is a place of famous pilgrimage centre of Odisha. Maa Tarini Temple is raised in modern time, the crude form of deity justify its ...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I love this place.\nMaa tarini is save us everyday",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This place is jast osm & great felling, the temple view is an amazing",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}