{
  "places_with_reviews": [
    {
      "name": "Ancient Shri Madhukeshwara Temple (Banavasi)",
      "rating": 4.7,
      "address": "G2P9+43P, Ratha Beedi, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "One of the oldest temple, around 1200 years old by Kadambas.\nMadhukeshwara means honey colour shivalinga.\nNandi is very special here, one eye seeing shivalinga and one more eye is watching parvathi. Nandi is slant here not straight.\nIn pillars of this temple near nruthya mantapa, we can see both image and mirror image i mean if u put 1 hand,  u will get to see 2 hands.\nSaathvi ganapa you have to see in this temple, it is like proof that u visit this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visiting a heritage place like this, is a positive experience as it allows us to connect with history, appreciate cultural significance, and learn from the past. It fosters a sense of pride, understanding, and preservation of our collective heritage. Loved it.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A wonderful Rock Art temple with beautiful pillars with carvings located in Banavasi which is 25 km far from sirsi. The temples is dedicated to Lord shiva. In main garbhagudi exist madhukeshwar lingam which  is in the color of honey(madhuram). This temple was built by kadamba dynasty which is the oldest Kannada kingdom.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing architecture, if you are interested in historic places this is one place to be around. This temple is from 5th century. The details of the sculptors and overall building architecture is amazing. The advancement at which these temple was constructed tells us how good we were.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Madhukeshwara Temple ( 9th century ) dedicated to Lord Shiva - Situated at Varada river, this ancient temple complex of Banavasi is considered to be the first capital of Karnataka. dated back 375AD. The architecture of the temple is excellent..🙏🏻",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Gudnapura",
      "rating": 5,
      "address": "G2M8+XVH, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Divine place with awesome lake",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Peaceful ,❤️❤️❤️❤️",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Shri Bangareshwara Temple Gudnapura",
      "rating": 4.6,
      "address": "HX3M+2XC, Gudnapur, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Nice and calm place - close to Banavasi",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bangareshwara temple on the banks of Gudnapura lake. Cool calm place to spend good time",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice and calm temple with a lake view.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is amazing place 😻\nA must visit for sunset or sunrise.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place and Temple #live_in_a_peace here peacefull place spend a very good day with a family.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pampa Vana (ಪಂಪ ವನ)",
      "rating": 3.8,
      "address": "G2H9+V4X, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "No maintenance... It's not good to visit in summer... Bcz of no greenery",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Pampavana is the sacred place of karwar district, here one of the kadamba empires old temple locate, here we can see some ayurvedic plants,basically its a park,situated very near to the madhukeshwara temple in banavasi.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Place is like abandoned.... Not safe to visit after dark. And location on Google Map is wrong. It is 200 meter before. Perhaps this might be corrected in future.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "No maintenance. Need more improvement. Lot of development opportunities are there.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Calm place. Less crowd during week days I believe..",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Banavasi Sri Kadambeshwara temple ಬನವಾಸಿ ಶ್ರೀ ಕದಂಬೇಶ್ವರ ದೇವಸ್ಥಾನ",
      "rating": 4.3,
      "address": "G2M8+WW3, Near madukeshwara temple, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Please keep the temple surrounding clean. Now it's filled with bottles, papers and waste.\n\nThe Temple administration should work towards cleanliness. Tourists who are visiting shouldn't throw plastic and waste everywhere.\n\nStrict action should be taken. Please maintain lines for Darshana inside the temple. Vehicle parking should be done neatly. Have the proper guidelines inside the temple. Display of temple history has be to be properly everywhere.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good and calm place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice devotee place.  Hindu Temple, which is very old and lot of stone carvings are done. Very good and historic Architecture. Peaceful place where there is no much noise and disturbance. It is located in Banavasi, 23kms far from Sirsi Town.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent neat and clean very old",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "ಬನವಾಸಿ ಹೆಬ್ಬಾಗಿಲು",
      "rating": 4.5,
      "address": "G2R7+J66, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Entrance gate to Banavasi Madhukeshwara temple. It is on main circle of Banavasi. Banavasi was capital of kadamba dynasty. A historical place. River Varada flows through this small city. The famous Madhukeshwara temple is built on banks of this river. Temple is built with carved stones.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I don't like the way they maintaining",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Kumareshwara temple visit once",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Entrance gate of banavasi. Looking great for this area.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Aadi Madhukeshwara Devasthana",
      "rating": 4.7,
      "address": "G2H8+6FR, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Banavasi is the oldest town in the Karnataka state. It has grown up around the Madhukeshwara Temple built in the 5th century and dedicated to Shiva the supreme God in Shaivism, a major branch of Hinduism.The town once was the capital of the Kadamba rulers, an ancient royal dynasty of Karnataka. They established themselves there in A.D. 345 and ruled South India for at least two centuries.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Live historic museum feel. So much to know from this place. So well designed temple. Beautiful.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful sculpture\nThe temple has rich history And the priest at the temple makes a good effort to educate all tourists about the same.\nBest time to visit would be evening",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very ancient beutiful historical place.I want to visit again and again.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful place. We had a good walk and a good time. Very well made temple considering how old it is.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Namadeva Kalyana Mantapa",
      "rating": 4.1,
      "address": "G2R6+QFG, Banavasi, Karnataka 581318, India",
      "reviews": [
        {
          "text": "Probably  PROUD to place of the  BANAVASI",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best wedding place in banavasi",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good but need improvement",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good space",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice wedding hall",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Bailapura",
      "rating": 5,
      "address": "GX5G+JX, Kamaruru, Karnataka 581340, India",
      "reviews": [
        {
          "text": "Fantastic",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "JAMIA MASJID AHLE HADEES",
      "rating": 4.8,
      "address": "G2R8+C3H, Hospet Rd, Banavasi, Karnataka 581318, India",
      "reviews": []
    }
  ]
}