{
  "places_with_reviews": [
    {
      "name": "Bandhavgarh Fort",
      "rating": 4.5,
      "address": "Bandhavgarh National Park, M2MP+599, Bandhavgarh Qila Trail, Bandhavgarh, Kila Bandhogarh, Madhya Pradesh 484664, India",
      "reviews": [
        {
          "text": "This must be saved, preserved under the world heritage site. There are some Buddhist caves and statues around 2000 years old but are not in good condition. A team of experts surveyed more than 40 caves several days amidst all dangers in the dense forest. These are Buddhist caves. Most of these are related to Buddhism. Locals believe there can be more than 100 caves in Bandhavgarh Park area. There's a lot of Kushan-e-era Brahmi records. Survey of five big temples has been done so far. The heights are parakottedar forts. Caves, temples, records and large statues scattered among the forest in the plain area. The statues are up to 20 feet tall.\nOverall this is a very good archeological and historical site. It should be preserved well.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Qila Trail in Tala Bandhavgarh.\nVery old, Ancient structures are there of Indian lords, Stable, Court and some more at the top.\nThese structures are from 10th Century.\nVery beautiful place to be, serene, natural, scenic, ancient.\n\nAlthough the trail is permanently closed for the tourist's but it opens for local people on Janmashtami Festival day.\n\nAs tourist, one can go till Vishnu statue but not to the top.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Such a wonderful place to explore the erstwhile richness of 10th century.\nIt is located on the hills of Bandhavgarh tiger reserve, rising 811 meters above sea level.\nNo records are available to show when Bandhavgarh fort was constructed. It is thought, however, to be some 2000 years old.\nMaharaja Vikramaditya Singh moved his capital to Rewa. The last inhabitants deserted the fort in 1935.\n\nMy good luck you can say that I have visited this fort few times and seen its remaining natural history and the ariel landscape view of the reserve.\nNow this fort is closed for tourists,  Sheshchaiya the large Vishnu statue at the base of the fort at foothills can be visited at present time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Bandhavgarh comes in Umaria district of Madhya Pradesh. Here you can see lots of lion and tiger deer. There are many tourist places to visit here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit......Buddhist caves are so awesome 👍... Buddhist history awake here....,.please visit here.....namo buddhay ❤️",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Tala Gate Bandhavgadh Yatra",
      "rating": 4.6,
      "address": "Gate Bandhavgadh Yatra, Tala, Kila Bandhogarh, Madhya Pradesh 484661, India",
      "reviews": [
        {
          "text": "Beautiful forest and the best bet for tiger sighting.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great convenience if you booked your entry pass online.\nWater and washroom is available at tala gate. You do not get and food store here\nYou'll get the food at mid of the jungle.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shesh Shaiya",
      "rating": 4.7,
      "address": "M2MQ+Q87, Kila Bandhogarh, Madhya Pradesh 484555, India",
      "reviews": [
        {
          "text": "The Shesh Shaiya is the 65ft tall statue of Lord Vishnu that lies on the seven hooded serpent (Sheshnaag),the king of serpents.\nIt is situated on top of a hill amidst the luscious greenery of the Bandhavgarh National Park in Madhya Pradesh. You can visit this place as a spot in your morning tiger safari. This place is the epitome of serenity and everything pure. I had such a calming and beautiful experience here. The river that originates there is known to provide the entire city with water.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Out of this woeld place. Calm , serene, mesmerizing.  Large Trinity statues of god Shivji n Vishnu ji...I shall never forget...wish to visit again n again. The statues r more than 2000 yrs old. God Brahma's idol is eclipsed tree roots. It's inside the Tala zone  of Bandhavgarh safaris for tigers. Must visit, if at Tala.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is serene view.\nPhotographs come really good here due to the natural beauty.\nThe sound of nature and the Flow of water.\nCome here for the peace of mind, you will definitely fall in love with the nature.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Absolutely mesmerizing place and a must visit for anyone going to Tala Region at Bandhavgarh National Park! At first look, one will get the feel of being in an Indiana Jones movie, but the longer you stay, the more you will develop a feel of absolute serenity and calmness.\nLooks especially beautiful in the morning time with sunlight filtering through the jungle leaves. I still get goosebumps thinking about it.\nA must must go !!!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A very nice  sculpture of 1000 years old.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kabir Gufa Mandir",
      "rating": 4.2,
      "address": "M2HR+QJX, Kila Bandhogarh, Madhya Pradesh 484555, India",
      "reviews": [
        {
          "text": "It's a wonderful place to visit",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is the place where the Kabirpanth starts.\nMust visit place for kabirpanthis. This place has it's historical and geographical importance.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "🙏🙏",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Old is gold",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bandhavgarh Laxman Temple",
      "rating": 4.2,
      "address": "M2PQ+338, Kila Bandhogarh, Madhya Pradesh 484555, India",
      "reviews": [
        {
          "text": "What a beautiful combination of nature, natural resources and history.\nSuch a magnificent place_💙",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful place every one visit in life time",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Tranquil",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Paradise place.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bandhavgarh museum",
      "rating": 4,
      "address": "P2C9+625 Bandhavgarh Ticket Counter, Vijayraghavgarh - Barhi - Bandhavgarh Rd, Tala, Madhya Pradesh 484661, India",
      "reviews": []
    },
    {
      "name": "Rampur Photographer's Point, Bandhavgarh",
      "rating": 4.8,
      "address": "M3X4+WJW, Kila Bandhogarh, Madhya Pradesh 484555, India",
      "reviews": [
        {
          "text": "Amazing place amidst jungle",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Bandhavgarh safari booking counter",
      "rating": "Unknown",
      "address": "P2C9+C26, Badchhad, Tala, Madhya Pradesh 484661, India",
      "reviews": []
    },
    {
      "name": "Elephant Enclosure",
      "rating": 1,
      "address": "P28C+VHX, Tala, Madhya Pradesh 484661, India",
      "reviews": []
    },
    {
      "name": "Sadguru Kabir Dharmdas Sahab Asharam Tala",
      "rating": "Unknown",
      "address": "P2C9+MWM, Tala, Madhya Pradesh 484661, India",
      "reviews": []
    }
  ]
}