{
  "places_with_reviews": [
    {
      "name": "Avchitgad Fort",
      "rating": 4.7,
      "address": "F4G9+274, Nidi Tarf Ashtami, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "\"Avachitgad fort is a historical gem nestled amidst breathtaking natural beauty. The trek to reach the fort is an adventure in itself, offering stunning vistas and a sense of exploration. The fort's ruins stand as a testament to its rich history, evoking a deep sense of awe and wonder. The panoramic views from the top are simply mesmerizing, making the trek worth every step. For history enthusiasts and nature lovers alike, Avachitgad fort is an absolute must-visit, offering an unforgettable experience that seamlessly blends history, adventure, and scenic beauty.\"",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A short range trek\nany age people can trek very descent trek carry food water\nfirstly at base village a huge parking area\nthen just walk you will get a huge shivkalin well huge with water and small which is dried\ninformative board related to avchitgad\nthen you have to just walk upwards this whole trek you have to just walk upwards after half and hour you will get veergad\njust take right turn walk through stones and will get mahadwaar\nabout mahadwaar huge wall with a shirp scuplture after entering you will a big cannon wer fireball inside it is stuck it will the best thng you have never seen\nmahadevmandir and 5 huge water tank wer 2 tank water you can drink then goin forward you will get cannons and bhagwa flag\nthis fort is small you can plan one day trip exploring this fort is very well experience\nyou must try it in every season\nmust visit place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A good historical fort as we can see some thrilling old structures. I like the fort the most. The trekking is easy, though. A small but must visit place for all treck lovers. I recommend visiting if you are a bigginner. The trecking path is easy for even small kidd as well.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good silent place for a small trek.\nDo stay at VARDHANI, Medhe ... amazing place !!!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Avchitgad fort is in roha town.\n\nOne need to reach the village and park your vehicle near Vitthal mandir where the road end.\n\nWalk for some time on that mud trail until you reach a well.\n\nThe trail to the fort starts behind the well.\n\nThe trail is well marked and it takes and hour max to reach the Mahadarwaja.\n\nOn the first pleateu there are few veerghal which are arrange properly under a tree.\n\nAvchitgad has a ballekilla which has separate darwaja which is in ruins now.\n\nThere are around 7 canons on the fort.\n\nThere are 2 massive buruj on two ends of the fort.\n\nThere is set of 5-6 water cristern on the fort, there is a small single cistern on the western end and other cistern which is carved inside the main fortification.\n\nThere is a massive water tank or well which has a small shiv temple near it.\n\nIt takes around an hour to explore the whole fort.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Dhavir Maharaj Temple.",
      "rating": 4.7,
      "address": "C4Q7+W4M Shree Dhavir Maharaj Mandir, Wali, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "1.5km from the town is the temple of Shri Dhaveer Maharaj. The original place of the idol further.\nBeautifully maintained with a garden and other amenities, it is a place to spend a quiet evening or morning with blessings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dhavir maharajTemple. Dhavir Maharaj is the prime deity of Roha. Every year the town celebrates Navaratri Festival by having a 10 day Festival at the Dhavir Temple which ends on the 10th day - \"Dasra\" during Navaratri. On the following day of Dasra, Palkhi of Dhavir Maharaj is taken through the town where it visits each and every house for the Aarti.The Dhavir Temple was built by Balwantrao Vithoji More in 1849. There are two stories told about how Dhavir Maharaj became Roha's Gramdaivat.\n\nBefore leaving the Dhavir temple to begin the Dhavir Palkhi, it was given 'SALAMI' by the Raigad Police. Salami means police stand in a line and fire bullets from their rifles.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Spiritual and peaceful temple also atmosphere. Shree Dhavir Maharaj is Roha's \"Gramdaivat\".",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The best place seen in Roha. Temple is built up with Marbles. Dhaveer Maharaj mandir is a famous thing in Roha. Dhavir palkhi is celebrated after next day of Dahsera. People come here with hopes and there wishes get completed. There is a residential facility also available called as Bhakta Nivas.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sacred place of Shree Dhavir Maharaj.\nVery quiet place to spend some time around the temple.\nOne of two places in Roha where you will always fill to come back.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Hanuman Tekadi Temple.",
      "rating": 4.6,
      "address": "C4Q7+2M8, Maharashtra State Highway 97, Wali, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "If you are looking for a peaceful place in Roha, visit Hanuman Tekdi. The Hanuman Mandir is neat and clean.\n\nIn evenings, you can see the best of the sunsets here. There is nice breeze in the evening, extremely fresh air, full of oxygen. You will feel refreshed. Children will have a nice time running around and playing up and down the steps.\n\nYou will see a good view of entire Roha from top.\n\nPeople also go to the Tekdi daily by walking in the morning for exercise.\n\nYou can also walk down to the Dhavir temple from here via a short trek.\n\nAll in all, a fantastic place in Roha.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Picturesque and peaceful spot to spend some quality time with friends and loved ones, I highly recommend checking out Hanuman Tekadi in Roha, Raigad. This location is truly a hidden gem and offers breathtaking views of the entire Roha city.\n\nThe old Hanuman temple located here is also a sight to behold, with beautiful and intricate carvings that are sure to impress. But what really sets this place apart is the natural beauty that surrounds it. You'll find yourself surrounded by lush greenery, fresh air and a sense of calm that is hard to come by in the hustle and bustle of city life.\n\nVisiting in the evening around 4pm, when the sun begins to set and the sky is painted with beautiful hues of orange and pink. It's the perfect time to enjoy the stunning views and spend some quality time with friends and loved ones.\n\nHanuman Tekadi in Roha, Raigad is an excellent choice for a hangout spot with friends and partners. Whether you're looking to enjoy some peaceful moments or to simply take in the beauty of nature, this spot is sure to leave you feeling refreshed and rejuvenated.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Use to be my family's go-to place on weekends. Right now, it's not in great shape.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is a beautiful place in roha district",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "You can take a look of whole roha city from this temple if you want to take a cinematic shoot without dron then this is the right place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Residence of Param pujya Shri Pandurang Shastri Athavale in roha",
      "rating": 4.6,
      "address": "C4P9+43J, near Gangal Medical Stores, Wali, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "It's under reconstruction / restoration stage.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was a great experience like visiting ancestors' place and getting charged for their goals to complete and realising self",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Site is under construction today on 30 Oct 2022; may take around 6 months to reopen.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We are staying very near by",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Talaghar Waterfall",
      "rating": 4.4,
      "address": "C43J+WFQ, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "Nice waterfall to go along with family",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Awsome place to hangout in mansoon....\nmust visit",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Go on weekdays\nWill enjoy the most\nNo crowd",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nature at its best, must visit rainfall. Awesome views.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small but beautiful waterfall..near Roha",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Roha Jama Masjid",
      "rating": 5,
      "address": "Jama masjid, Wali, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "Cool and silent place",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Beautiful masjid ❤️❤️",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "helpful for everyone",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Astami Masjid",
      "rating": 4.3,
      "address": "Unnamed Road, 402109, Roha Ashtami, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "This place is architecturally very beautiful, and it is so well maintained. For photographers, it is a treat, you will get your wide angle lens to work for sure, try to visit post rainy season, try to visit post afternoon to avoid heat, it is accessible by car, ample parking space is available, carry water bottles though, no shops can be seen outside.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Big masjid with sufficient two wheeler parking, adjustment needed for four wheeler parking but still you can find parking for four wheeler as off road side.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A very good experience ever for the salaah",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nearest masjid in ashtim",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Upper Mohalla Masjid Roha",
      "rating": 4.7,
      "address": "karim suleman street, Upper Mohalla, Wali, Roha, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "Putting together a website is a task, finding the right individual or company is even more complex. Codyzyners not only  have great taste in design but they can guide you through the process and beyond.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "For the past few months i have been working with the Codezyners, they did a phenomenal job designing my website and social media pages, They are so incredibly talented, i would highly recommend Codezyners If you're looking for a graphic designer or a web developer,  they bring a vast knowledge of innovation idea's and creative solutions and they are awesome to work with...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very good nice place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very co operative society",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Bhuwaneshwar Mahadev Mandir",
      "rating": 4.6,
      "address": "C4HG+R4W, Bhuwaneshwar, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "The Temple Is Located Away from main city and is a very quite place .... Renovation of temple is done .... It\nIt was a very old temple before from ancient times ..... Visiters should keep it clean",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful and full of positive experience....and nature surrounded place.\nAnd historic tooo...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very old and historical Shiva Mandir in Roha. It is very popular and visited by many Shiva devotees.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Thanks. Best shop in These area",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Feeling peace ...nearer to shiva",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "हनुमान मंदिर खारापटी",
      "rating": 4.4,
      "address": "Alibag-Ramraj_roha Road, F453+FWX, near Medha Post Office, Kharapati, Ashtami, Maharashtra 402109, India",
      "reviews": [
        {
          "text": "A small temple of Lord Hanuman on the road to Roha... A 5 minute pit-stop will do no harm... the lane next to the temple will lead you to Kundalika river... If the tide is right you can take a cool  swim and also get some foot spa by baby fishes..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful temple of Lord Hanuman, by the side of road. Very nice environment around. A well maintained temple.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Superb Place.... Where you can meet Ram bhakt Hanuman....",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a temple which is besides the roha-alibag road near Kharapti.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jay hunuman",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}