{
  "places_with_reviews": [
    {
      "name": "Bandipur National Park",
      "rating": 4.4,
      "address": "Karnataka, India",
      "reviews": [
        {
          "text": "It is a beautiful drive through Bandipur Tiger Reserve Forest with nice scenery, many deer and a few elephants. We can spot many deer on either side of the road. Phone network is not available.  Getting down from the vehicle, playing music, etc are prohibited in this area.\n20/- entry ticket.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Bandipur National Park experience. Picture this: as you ventured into the park, the air was filled with excitement. The wildlife encounters left you speechless, from majestic elephants to graceful deer roaming freely. The lush greenery surrounding you was like stepping into a vibrant painting, with every tree and plant telling a story of nature's beauty. It was a truly unforgettable journey filled with wonder and awe! 🌳🦌✨",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The best Safari. We booked safari from our stay serai hotel. It was really good which was around 4 -5 hours duration.\nWe can experience animal watching, taking pictures very closely. We got to see many animals.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Wonderful wild-life sanctuary. Need to enjoy the sanctuary with an open mind - without expectations of the tiger sightings. And you'll be pleasantly surprised at the variety of flora fauna present around the park. The safari drivers put in a lot of effort to try for tiger sightings, we were lucky to sight one.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "So don't follow the maps location blindly. The actual start point of the safari bus/Jeep is actually 8-10kms before this maps point. Fortunately spotted while zooming past and stopped.\nThe bus /Jeep starts on time, you need to be quiet and vigilant to spot the animals (tiger spotting might be rare, saw one). Snacking options at the safari point available.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}