{
  "places_with_reviews": [
    {
      "name": "Bandipur forest one way elephant seeing area",
      "rating": 4.3,
      "address": "MJGM+4GG, Nagapattinam - Coimbatore - Gundlupet Hwy, Bandipur, Karnataka 571126, India",
      "reviews": [
        {
          "text": "Most memorable one. It is on the way to Ooty and Bandipur and madhumalai forests are connected. Very clean and maintained. They will check for any plastic bottles if people are carrying and take them away. On the way you can spot elephants, deers, forest bull etc. Need to go slow and clam",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a spot in forest road that connects Gundalpet and Ooty where the road is bifurcated to one way roads. This is marked as a place where the elephants cross the road often.\n\nWe can feel the charisma of deep forest here with dense tree and with the wild animals on the sides. Probability of seeing wild animals are hight at this place. Last time when I\npassed through here at 9 AM, I could see deers and peacocks.\n\nThe road condition is superb here, but the passengers are not allowed to park the vehicle inside the forest.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice route for a peaceful drive\nThe place is even more beautiful in raining",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You will only get a short drive, like 5-10mins through Bandipur Forest area when on Gundulpet to Gudalur route. Remaining route covers forest area of Mudumalai tiger reserve in Tamil Nadu. On my trip, as soon as we entered Bandipur, we spotted multiple herds of deer and was lucky enough to see two elephants and a baby. The roads are nice and you are sure to spot deers chilling around settlements too.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice nature view… But less vibe during summer",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bandipur",
      "rating": 5,
      "address": "MJ8G+5WP, Mysuru - Ooty Rd, Bandipur, Karnataka 571126, India",
      "reviews": [
        {
          "text": "Beauty 😍",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "bandipur wildlife sanctury",
      "rating": 4.3,
      "address": "MJ9M+32H, Bandipur, Karnataka 571126, India",
      "reviews": [
        {
          "text": "Bandipur National Park is one of the best national park I ever seen. I had veen to many national parks, but none matches bandipur national parks where tigers are present everywhere. There are many animals that are present in bandipur like wild boar, deer, tigers and peacocks and many birds. There are many cottages are available to stay at night in bandipur. Cottage facilities are not so good. These are average maintained. The food at bandipur is also average. But if you want to see a Tiger walking free, then Bandipur is a must go place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Maguvinahalli sani mahathma swami temple",
      "rating": 5,
      "address": "MMM2+GM3, Mel Kamanahalli, Karnataka 571126, India",
      "reviews": [
        {
          "text": "Fantastic place",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Thavargatte Mahadeswara temple Badipura",
      "rating": "Unknown",
      "address": "MJ8C+F4, Bandipur, Karnataka 571126, India",
      "reviews": []
    },
    {
      "name": "Lake in bandipur forest",
      "rating": "Unknown",
      "address": "MJ36+7H, Bandipur, Karnataka 571126, India",
      "reviews": []
    }
  ]
}