{
  "places_with_reviews": [
    {
      "name": "Baneshwar Temple",
      "rating": 4.5,
      "address": "7V4F+6MR, Baneshwar Temple Access Road, Nasrapur, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Baneshwar Temple, dedicated to Lord Mahadev, offers a serene and peaceful environment surrounded by lush greenery. Ample parking is available for both two-wheelers and four-wheelers, making it convenient for visitors. Entry to the temple is free, allowing easy access for devotees. Adjacent to the temple, there is a beautiful garden, though there is a separate charge for entry to the garden. The temple's tranquil setting and free admission make it a lovely spot to visit for spiritual solace.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nestled amidst the serene embrace of nature, Baneshwar reveals itself as a tranquil sanctuary, where ancient spirituality and vibrant biodiversity converge in harmonious symphony. At the heart of this verdant oasis lies an ancient temple dedicated to Lord Shiva, an emblem of timeless devotion, cradled by two sacred ponds teeming with life—fishes and tortoises glide through their waters, embodying the cycle of life and renewal.\n\nEnveloping the temple, a dense canopy of trees whispers the ancient tales of the land, their leaves dancing to the rhythm of the breeze. A well-crafted path meanders through this green labyrinth, offering pilgrims and nature lovers alike a chance to wander in meditative contemplation, grounded by the earth beneath their feet.\n\nDespite the whispers of misguidance found on the web, the modest entry fee of Rs.20 ushers visitors into a realm where nature's spectacle unfurls—a so-called waterfall that, though modest, charms the eye from the vantage of a thoughtfully constructed viewpoint, overlooking the Shivganga river basin.\n\nFor the young and the young at heart, Baneshwar extends its playful embrace with a quaint playground, its swings and sculptures of giraffes, elephants, eagles, and tigers sparking the flames of imagination. Adventure beckons through the thrill of rope bridges and zip-lining, each activity a testament to the spirit of exploration and the joy of soaring heights.\n\nThe sanctuary’s care extends to practical comforts as well—ample free parking, inviting eateries, and a floral haven at the garland shop. Though the call of nature may be less pleasing in one respect—the facilities provided—this minor note does not mar the overall symphony of experiences.\n\nBaneshwar is more than a destination; it’s a journey through time, nature, and spirituality, rated highly in the hearts of those who seek its serene touch. Best visited in the rain's embrace or winter's gentle chill, it remains a canvas of experiences, painting memories that linger long after the visit.\n\nAs legends whisper of tunnels connecting to historic forts and the tales of kings who once graced its grounds, Baneshwar stands as a testament to history, culture, and the enduring beauty of the natural world. A visit here is not merely a day spent but a moment cherished, wrapped in the green embrace of the earth and the watchful gaze of the ancient.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great temple 🛕  of Lord shiva. Having many fish and turtle to see. Having very nice garden nearby. Recommended to visit the place in rainy season. Because that garden have nice waterfall view.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a beautiful temple existing since last many years, with trees (and beautiful small water bodies in monsoon),a garden and a small public gym.\nGarden ticket cost is 20 rs per head in 2024.\nTemple is open to all.For entry inside main core(गाभारा/गर्भगृह), there is a dress code of bare chest, full pant/dhoti and no leather belt/wallet for men and decent ethnic clothing and no leather purse for women.Very sweet locals and very clear instruction boards.\nThe turtle pond outside is a source of amusement for many kids and even adults.\nTemple will be crowded on main days like Somvati amavasya, shivratri etc.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shri Skhetra Baneshwar temple built by Nanasaheb Peshwe in 1749 on the Shivganga river is surrounded by dense trees. Very calm place. Ample parking space is available. One has to follow decent dress code and keep outside belts, leather items and shirts for gents. When near Bhor or Narayanpur a must visit temple and have darshan of Devon ke Dev Mahadev. The history n instructions of the temple has been posted in my photos uploaded.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Baneshwar waterfall",
      "rating": 4.3,
      "address": "7V4C+GCR, Pune, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "This is a small waterfall inside Baneshwar Van Udyan which is located right beside Baneshwar temple. The parking is common for all these 3 places. Although the Van udyan is well maintained, this waterfall was a complete disappointment. It could hardly be seen. The view point is so badly placed that not a proper view of the fall can be seen. There is an entrance fee of Rs. 20 per person.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nature lovers !!!\nNice place, not so crowded even on weekends. You can visit the temple and then the waterfall or else can directly take the route to waterfall via the farms.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The quality of the chicken is great. We visited here a few days ago and we ordered Chicken malvani handi along with chicken tandoori as a starter.\n\nI will say chicken is tasty but rassa is too bad i didn't like the quality of chicken rassaa . please improve it which is causing damage to the image of the restaurant.\nThe ambiance is great.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Lovely place.. long jungle walk is amazing also the waterfall.. we went 5here in summer but surely will visit again in rainy season..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Great place to visit. A well maintained huge garden and activities for kids. Close to nature and do visit the waterfall. Best time to visit - Rainy or immediate after the rainy season.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Baneshwar Agri Tourism One Day Picnic Spot near Pune,Hurda Party pune",
      "rating": 4.2,
      "address": "91 Baneshwar vasti,Nasrapur gaon, near, Baneshwar Temple Access Road, pune, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Baneshwar agri tourism is the best agri tourism for hurda party near pune.\n\nBaneshwar Agro Tourism is local agro tourism in Pune. They've organised various activities to show you the culture and food within the city.\n\nEnjoy the beauty of Nature with Singing Birds, Fresh Air, Delicious Organic Veg Food, cooked by handpicked vegetables directly from their Farm.\n\nBaneshwar has been designed keeping your physical and mental well-being in mind.\n\nBaneshwar Agro Tourism can also offer transportation to and from any of these tours as per your request.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A nice place to visit in any season. Feels cool in summer too. Baneshwar is a place which has many attractions mandir (temple), birds chirping, good constructed van-udyan, play areas for children , veggie farms, a place for open eating, a small adventure park and a waterfall too (which of course can be seen only in good season)",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Loved the place lots of games to play indoor outdoor games",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Pretty decent place for a weekend holiday drive. Easy to get to with friendly locals.\nWear trekking boots as some of the paths are slippery during the rainy season...I don't think this place is much when the river is dry.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A good place to visit with family. But has time constraint being followed strictly, which is 8:30 to 17:30. We were there at 17:40 and missed the opportunity to have fun at waterfall, as entry was denied. So be cautious of time.\nSpacious parking is available.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Nasrapur Jama Masjid",
      "rating": 3.9,
      "address": "6VXH+722, Mahabaleshwar Jama Masjid Rd, Nasrapur, Malegaon, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Best place for connecting with Allah and Jumma prayer at 1:40.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Juma Namaz is at 13:45 hours (1:45pm)",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Masjid is the worlds best place for Namaz\nIts a Jumma Masjid",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "This is only one place in nasrapur for namaz",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very popular place",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Spiritual Life Center",
      "rating": 4.6,
      "address": "6VWJ+7W9, Malegaon, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Good place for spiritual refreshing. Ancient structures still standing strong. Food is good. God bless the cook.\nLittle more landscaping will work wonders to this place. Gardener needs to pay more attention to the gardening and maintaining the lawns.\nChapel has that ancient feel. The pew and the pulpit appears to be very old yet still strong and being used.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Absolutely Quite, Calm n Huge campus surrounded with nature. Really good place for Spiritual Seminars and Bible Study camps !!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place for spiritual camp, visited almost 55  years back hence faint memories .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beutiful place ❤️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful plam. Peaceful, natural",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Baneshwar Mahadev Temple Entry",
      "rating": 3.7,
      "address": "Nasarapur, 6VXG+CV5, Gaon, Malegaon, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Nasarapur baneshror madhir padhimage",
          "languageCode": "en-US",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "माऊली अनाथा आश्रम निराधार सेवा संस्था.",
      "rating": 4.9,
      "address": "7V2F+9H, Malegaon, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "If possible keep status and on all whatsapp group on mobile and\nsend to friends Post on Facebook and other accounts will help at least.",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "Even if the help is small, it is important to do it. Ram Krishna Hari",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "Shri Guruji is doing very good work\nGood luck to them",
          "languageCode": "en-US",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Sri Baneswar Mahadev",
      "rating": 4.5,
      "address": "6VXH+PWJ, SH65, Nasrapur, Malegaon, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Fine place  for spritual visit ... Ancient temple of lord Shiva ...",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kurunjai Devi temple",
      "rating": 4,
      "address": "7V4C+97, Didghar, Maharashtra 412213, India",
      "reviews": []
    },
    {
      "name": "Khedshivapur Talishwar Shiv Pindi Mandir",
      "rating": 5,
      "address": "Unnamed Road, 7V93+6RM, Jambhali, Maharashtra 412213, India",
      "reviews": [
        {
          "text": "Ausome place.",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    }
  ]
}