{
  "places_with_reviews": [
    {
      "name": "Alun-Alun Kota Banjar",
      "rating": 4.4,
      "address": "JGJR+5JC, Banjar, Purwaharja, Banjar City, West Java 46311, Indonesia",
      "reviews": [
        {
          "text": "This area is located on the side of the road and there are many food such as telur gulung, es markisa, cilok, cilor, jagung rebus, etc. The food is very diverse, but unfortunately I can't find typical Banjar City food here. There is no parking space, so please park on the side of the road or at the mosque. Coincidentally, Alun alun Banjar City is next to the Banjar Mosque.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Hotel Mandiri, bed and breakfast only, room with ac, nice place and friendly.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A decent place to take a short break before continuing the trip .. There are lots of traders too, but during the day many stalls are closed .. The view is quite interesting ,, good for photos as well as for blogging❣️❣️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "nice to visit this little city, such a lovely place and peacefully",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Well",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Rumah Makan Cobek Beti Lesehan Cipadung",
      "rating": 4.3,
      "address": "Jalan Brigjen M. Isa 291 Cipadung RT.07 RW.03 Kelurahan Purwaharja Kecamatan Purwaharja, Mekarmukti, Kec. Cisaga, Kota Banjar, Jawa Barat 46386, Indonesia",
      "reviews": [
        {
          "text": "Nice place to eat. The sambals is good and the food is fresh. The interior little bit dark even at bright day. They said that the fish is freshly from the pond. So the quality is very good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Food and service was average for a restaurant like this. Typical for a small town in West Java. Menus were old and dirty but the food was fresh and filling. We have eaten at this chain more three times now and each time there was something not available that day that was on the menu. If you eat there be prepared to be told that something you want isn't available that day.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "gurame is the best option, fresh and not smelly, ayam kampung is also delicious, with fresh sambal terasi and lalapan",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent taste, delicious recipes, good facilities, and clean bathroom.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Great value.\nI like all",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kota Banjar Patroman",
      "rating": 4.6,
      "address": "JGWH+V34, Mekarmukti, Cisaga, Ciamis Regency, West Java 46386, Indonesia",
      "reviews": [
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good city",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Banjar Patroman...the easternmost city in West Java...as the gateway to West Java",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Wana Wisata Situ Mustika",
      "rating": 4.1,
      "address": "JGQW+394, Karangpanimbal, Purwaharja, Banjar City, West Java 46332, Indonesia",
      "reviews": [
        {
          "text": "Near the Banjar City. Good forest view. However, It's neglected.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Great place for family trip or gathering",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Easy to access from Banjar Train Station. You can walk in less than 30 minutes or just take grab or gojek.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Two parks not operating yet, but they told those are on the ticket",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Banjar Grand Mosque",
      "rating": 4.5,
      "address": "JGJR+59W, Banjar, Banjar City, West Java 46311, Indonesia",
      "reviews": [
        {
          "text": "Comfortable place to pray",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place but small car park",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Comfort place for pray",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "love it",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place for pray",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Masjid Baitul Jannah",
      "rating": 4.6,
      "address": "JG9R+264, Hegarsari, Pataruman, Banjar City, West Java 46322, Indonesia",
      "reviews": [
        {
          "text": "Good mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The mosque is easy to access, it is on the edge of the main road (Jalan Raya Ciamis Banjar), close to Banjar station. For those who are traveling, it is suitable for stopping to pray or rest. The main room is quite spacious. The yard is large, you can park a car or motorbike. Motorbike parking costs Rp. 2,000,-\nAfter the Isha prayer (19.18) the gate on the right was closed and the mosque door was also closed, the lights were turned off.\nThere are many stalls around the mosque for those who want to have a snack or quench their thirst.\nCleanliness of toilets & ablution areas needs to be improved. There is an infaq box for cleanliness but the toilet is not comfortable to use. Mosque carpets should also be washed regularly so that prayer is more comfortable, especially when prostrating ☺️\n\n6/16/2023",
          "languageCode": "en-US",
          "rating": 4.6
        },
        {
          "text": "Tourists who are expected to arrive in Pangandaran in the morning will often stop at this mosque for morning prayers. Large buses and private vehicles also fill the parking area, some even parking on the side of the road.\nThe coffee and snack shops opened at dawn and were busy serving customers.",
          "languageCode": "en-US",
          "rating": 4.6
        },
        {
          "text": "The mosque is clean, the parking area is spacious enough for lots of cars and motorbikes. The ablution place for men is next to the mosque, while for women it is in the corner next to it. There are many canteens here, so it is also suitable as a place to rest. After prayer you can eat or drink. The location is in the city, easy to reach. Enjoy!",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pusdai Kota Banjar",
      "rating": 4.3,
      "address": "JGQM+FFW, Banjar, Banjar City, West Java 46311, Indonesia",
      "reviews": [
        {
          "text": "Good job",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "ok",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This Pusdai is near the Banjar Terminal, there is a quite large mosque, there are toilets, next to it is the Banjar City Regional Library. The parking area is quite large, suitable for cars and motorbikes. Behind it there is a kind of garden for sitting around.",
          "languageCode": "en-US",
          "rating": 4.3
        },
        {
          "text": "If it's a hot day, hopefully in the future there will be more trees, so it's cool, or coolers will be added. Overall the mosque is good. Keep it even more clean for both visitors and administrators 🙏🙏",
          "languageCode": "en-US",
          "rating": 4.3
        },
        {
          "text": "The mosque is comfortable, the toilets are clean so you have to pay",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "PEMANCINGAN GALATAMA TELAGA SALSABILA",
      "rating": 4.9,
      "address": "JGCM+MQX, Banjar, Banjar City, West Java, Indonesia",
      "reviews": [
        {
          "text": "I came here for dinner, not for fishing. Fishing is closed due to the dry season. It's usually full of people fishing here when it's open. The one with the doctor and the beautiful notary, hehe",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "great view, can hang out while watching the anglers.",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "Mango, the atmosphere is nice, clean and spacious, there is another cafe",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "Keep gassing, don't give it slack 🤣🤣🤣",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "Joss for those who like fishing for baboon catfish 👍😁",
          "languageCode": "en-US",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Al Mujahidin Grand Mosque",
      "rating": 4.7,
      "address": "Jl. Raya Banjar - Pangandaran No.281, Hegarsari, Kec. Pataruman, Kota Banjar, Jawa Barat 46322, Indonesia",
      "reviews": [
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "God",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The mosque is nice, the ablution place is comfortable, neat, the water is large, cool, comfortable, safe in the mosque, the air conditioning, the carpet is soft, well maintained, the parking area is spacious",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Comfortable and delicious",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Very clean, comfortable for praying",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "GKI Kota Banjar",
      "rating": 4.4,
      "address": "Jl. Kantor Pos No.56, Hegarsari, Kec. Pataruman, Kota Banjar, Jawa Barat 46322, Indonesia",
      "reviews": [
        {
          "text": "It was a nice church",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Christmas celebrate",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The church is full of memories. Thank you for every valuable thing I can get. I also learned many valuable lessons here. GBU... hopefully we can meet again another time.",
          "languageCode": "en-US",
          "rating": 4.4
        },
        {
          "text": "Those who are traveling to Pangandaran but want to worship first when passing through Banjar, can join in worship at GKI Banjar",
          "languageCode": "en-US",
          "rating": 4.4
        },
        {
          "text": "Place of worship opposite the hometown house",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    }
  ]
}