{
  "places_with_reviews": [
    {
      "name": "Ekteswar Shiv Temple",
      "rating": 4.6,
      "address": "Lalbazar dgp by pass, NH 60, Bankura, Ekteswar, West Bengal 722101, India",
      "reviews": [
        {
          "text": "A temple dedicated to lord Shiva, Bholenath. Oum namah shivay.🙏\nLots of marriages happen here. An ancient temple near dhaldanga more bankura. Must visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Ekteswar Siva Temple is a truly captivating spiritual haven that stands as a testament to the rich heritage and cultural significance of its region. Nestled amidst lush surroundings, this temple exudes an aura of tranquility that instantly transports visitors to a realm of devotion and introspection.\n\nThe architecture of the Ekteswar Siva Temple is a harmonious blend of intricate craftsmanship and divine symbolism. Its towering spires and ornate carvings narrate stories from ancient scriptures, creating an immersive experience for devotees and history enthusiasts alike. The temple's design not only reflects the artistic prowess of its creators but also provides a tangible connection to the spiritual narratives it houses.\n\nStepping within its sacred confines, one is greeted by an ambiance of reverence and devotion. The air is filled with the scent of incense, and the soft echoes of prayers create an atmosphere conducive to introspection and connection with the divine. The inner sanctum, adorned with vibrant frescoes and adorned with traditional motifs, serves as the focal point for devotion and meditation.\n\nBeyond its architectural magnificence, the Ekteswar Siva Temple holds a deeper significance within the local community. It serves as a hub for religious gatherings, festivals, and cultural events, fostering a sense of unity and shared identity among its visitors.\n\nVisiting the Ekteswar Siva Temple is not just an architectural exploration; it is a spiritual journey that resonates with the soul. Its serene surroundings, awe-inspiring design, and spiritual ambiance combine to offer an experience that leaves an indelible mark on the heart and mind. For anyone seeking to immerse themselves in the cultural and spiritual heritage of the region, this temple stands as a must-visit destination that offers both solace and enlightenment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is called Old Dwaraka as it is situated beside the river Dwarakeswar. Only temple of historical importance. Many devotees come here to fulfill their desires.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is something Heavenly place in Bankura.  The temple and the vibes are so peaceful.  Har Har Mahadev..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great Old temple dedicated to lord Shiva. It's a historical temple. Very nice place for prayer.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Machantala Watch Tower",
      "rating": 4.4,
      "address": "63P8+2CJ, Subhas Rd, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "This watch tower is located at Machantala crossing , which is  heart of the Bankura town . I think this is the only watch tower in this town .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Machantala Watch Tower is a historical landmark located in Bankura, West Bengal..   It's just a four road crossing where this small tower kind of thing is build.. I love❤ Bankura.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I love this particular place .This is like a light house because everytime when I have to share my location in bankura,I mention this clock tower 🗼",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's doing great as a clock and a tower too... It's a Muslim probe area. The traffic police are doing great... Lately it's been a good place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a watch tower of Bankura.\n\nIn the tower's four side has clock.\n\nThis is the biggest and best wall clock in Bankura.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Junbedia more bankura",
      "rating": 4.3,
      "address": "63W7+VX6, Junbedia Main Rd, Arabinda Nagar North, Bankura, West Bengal 722155, India",
      "reviews": [
        {
          "text": "This place is really good once you visit here you will be enchanted it is our ink temple of chenchura",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very busy place, lots of traffic. Busy hours are peak between 9:00 am to 11:00 am and 5:00 pm to 7:00 pm. At that time it is better to move carefully on this road. The road condition is fairly good so be careful while crossing the road. All kinds of essentials can be found near this intersection, but there are no such good fast food shops around. But if you want to buy good sweets, you can definitely come here, there are many good sweets shops around this intersection.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the busiest place of Bankura. The road which is going towards Mankanali-Ukhradihi should extend by concern authorities.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is one particular side of my town. New tuition and residential hub. Bypass through junbedia is getting saturated with new new brands and shops. Its newer part of the town well connected in transport point of view",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Junbedia More, which is a crossing of five roads is an important roadways place in the Bankura District of West Bengal in India and there is a system of signal with police kiosk along with Civic Volunteers to run the traffic movement smoothly. There are vegetable market, stationery, grocery, medicine and the famous sweet shop of high quality in cheap prices named New Satimata Mistanna Bhandar . There is a statue of Rishi Aurobindo Ghosh and Ramkinkar Baij, the famous Sculpturist born in Beliatore .",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "College More",
      "rating": 4.3,
      "address": "63Q5+R9V, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "College more is one of the most crowded places and valuable too.there are so many food stalls are there and the rates are also in budget ,it’s like the heart of Bankura town",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Well there are many vendors there who offer good food for low prices\nThere are also many tea stalls",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "So unfortunate...\nVery bad situation in the Hospital.\nHospital Management is so poor.\nHospital Management are not provided bill due to high charge then WBHS.\nExample : WBHS package:Rs. 16000\nThey charged: Rs. 54000\nBill amount: 16000\n\nHospital Management taking rest amount (Rs.28000) only by cash transaction.\n\nHospital inside and out side not clean properly.\nPatient are waiting on the staircase.\n\nSo, my suggestion to the people, don't consider this hospital if are a WBHS holder.\n\nMay be same situation in cash of other health scheme.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Important location for various places in Bankura next to college / hotel / residential areas",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "In NH60 one of the most busy place and various street food available by evening",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Lokhatora Mahasamshan",
      "rating": 4.7,
      "address": "63PJ+HJ7, NH60A, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "One of the best temple is here of Bankura.Every year one mela is conduated here on the occation of puja.very clean with a large surrounding.If you go ther eyou will find peace after seating there sometime.I liked this place very much.recommend to everyone.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place. Nice place to visit the campuss in  evening . A big mela is organized every year during kalipuja , diwali for 7 days.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful natural places.. This place our end of the Journey 🥺🤝",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the largest cremation ground with electric furnace (Chulli) in Bankura.well decorated and well maintained. There helds a big  fair during Kali Puja for 7 days. Many temples are there of maa Tara and Kali in the samshan.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice place, nice view to enjoy",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Heavy More",
      "rating": 4.3,
      "address": "63XP+Q8R, SH 8, Jagannath Bati, Mithila, West Bengal 722155, India",
      "reviews": [
        {
          "text": "nice place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Satighat Chhinnamasta Temple",
      "rating": 4.5,
      "address": "63QF+MR2, Sukanta Pally, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "Located in Satighat of bankura district. The temple is dedicated to Mata kali in the form of Chinnamasta. Goddess Kali is depicted in her enraged form at the temple: 'Headless' is the literal translation of Chhinamasta. People visit this Mandir for the holy darshan of Maa Chinnamasta Kali.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice place to worship Devi Chhinnamasta. The Ramji temple is just behind it.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very sacred temple of goddess chhinamasta.just beside satighat bridge.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful temple of Chinnomosta at Satighat, just next to the 4 way road crossing, opposite to the Hanuman Temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Completely associated with love and god",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Idgha Mahalla Masjid",
      "rating": 4,
      "address": "Machantala, 63P8+528, NH314, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "One of the best Masjid in Bankura town ..",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It is Bankura zilla Sunni Hanfi JAMA Maszid.\nIt is very popular and beautiful place.\nVisit here also",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Beautiful and the biggest Mosque of Bankura situated in the main centre place on Subhas Road near Machantola. During festival the surrounding area is beautifully decorated with light. Special quality Aatar, Surma and Lachha Simai are sold here. People specially kids wearing glittering dresses gathered in the Mosque for attending prayer.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "One of the beautiful place in bazar ❣️ traffic is a little problem...\n\nBesides that's everything is superb..\n\nOldest mosque of bankura",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very old nice masjid located in the heart of the Bankura,an ideal place for religious Muslims.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Doltala Hanuman Temple",
      "rating": 4.3,
      "address": "63PF+M6R, Gopal Bari, Pathak Para, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "It's a small temple but good place to give location. One can easily locate it",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's located near to Doltala Sabji Bazar",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A God of Hindu religion. The temple is very big and nice.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peace place.. beside sabji market here on this place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Machantala More",
      "rating": 4.4,
      "address": "63M7+VV9, Bankura Machantala Mini Market Head Post Office Rd, Bankura, West Bengal 722101, India",
      "reviews": [
        {
          "text": "very good place for one day visit\nnatural calm and cool environment for tourists attraction",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place ...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ha",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Machantala intersection is the heart of Bankura city.",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    }
  ]
}