{
  "places_with_reviews": [
    {
      "name": "Dudhsagar waterfall",
      "rating": 4.3,
      "address": "74XF+PHQ, Bandoli, Goa 403706, India",
      "reviews": [
        {
          "text": "Dudhsagar Falls: A Majestic Encounter\nwith Nature\n\nMy trip to Dudhsagar Falls was an unforgettable experience. Nestled amidst lush greenery, the cascading waterfalls create a scene of breathtaking beauty. The journey itself adds to the charm, be it a trek through nature or a train ride offering a unique perspective.\nOnce you reach the falls, the cool water mist will be a welcome embrace, especially on a warm day. But be prepared, as the cascading water itself is refreshingly chilly!\n\nAnd don't worry you can swim here but don't forget to bring extra cloths there are changing rooms available and free of cost\n\nDudhsagar Falls is a true gem of Goa, and I highly recommend it to anyone seeking a connection with nature.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Overall a good tourist place to visit. Beware of monkeys. Do the online registration for jeep before coming if you are planning to go via jeep.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Dudhsagar waterfalls is in the midst of the Bhagwan Mahavir Wildlife Sanctuary. Frim Collam one has to take cars on payment basis. Charges are given below in picture. This jeep ride is for approximately 10 kms. After the jeep one has to walk through the borders for about 100 mtrs. Scenic beauty is awesome. If one is on Goa trip Dudhsagar falls is a must visit. Online booking of jeep is desireable. ₹.100/- per person will be charged per person by the Forest department but will be paid by cards only.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice Waterfall... This video is during Summer s. You can imagine how it would be in rainy season. Visit during rainy days from june onwards. You will just see water flowing like anything from everywhere & in pure white color as if milk is flowing.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful waterfall with small stretch of trekking and 40 mins of adventurous jeep riding",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Kamakshi Temple",
      "rating": 4.8,
      "address": "82CM+8JJ, Shiroda, Goa 403103, India",
      "reviews": [
        {
          "text": "This is one of the biggest temple in Goa. Everyone must visit this temple. U can see different built structure, the make up of devi, wow. Even though some other temples are nearby main temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "You have a direct bus to this temple. And from bus stop,  temples is at walking distance. Temple is so serene and peaceful. And it's architecture stands out. Worth visiting.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "More than 450 years old place of worship of a so called taking care of all  your evils. Belived to be one of the strongest of Goddess Durga's incarnation and supposed to be came down from Gauhati Maa Kamakhya.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nestled in the heart of the vibrant state of Goa, amidst the lush greenery and serene surroundings, lies the Kamakshi Temple, a sacred abode of divinity and tranquility. Dedicated to Goddess Kamakshi, a form of the supreme Goddess Parvati, this temple stands as a symbol of devotion and spirituality, drawing devotees and visitors from far and wide.\n\n**Historical Significance:**\nThe history of the Kamakshi Temple dates back centuries, steeped in mythological tales and religious lore. While exact origins are unclear, the temple is believed to have been established during the medieval period by the Shankaracharya of Shringeri, a revered Hindu saint and philosopher. Over time, the temple underwent renovations and expansions, evolving into the magnificent architectural marvel it is today.\n\nArchitectural Marvel:\nThe Kamakshi Temple showcases exemplary Dravidian architecture, characterized by its towering gopuram (entrance tower), intricate carvings, and vibrant colors. The temple complex is adorned with ornate pillars, intricately carved ceilings, and sanctum sanctorum housing the divine idol of Goddess Kamakshi. The serene ambiance and spiritual aura of the temple captivate the senses, offering solace and peace to all who step foot within its sacred premises.\n\nReligious Significance:\nGoddess Kamakshi is revered as the divine embodiment of love, compassion, and wisdom. Devotees flock to the temple to seek her blessings for prosperity, happiness, and fulfillment of desires. The temple hosts various rituals, pujas, and festivals throughout the year, including Navaratri, when the entire temple comes alive with fervent devotion and celebration.\n\nCultural Heritage:\nBeyond its religious significance, the Kamakshi Temple holds immense cultural importance in the region. It serves as a center for spiritual learning, hosting discourses, bhajans, and cultural events that promote harmony and unity among people of diverse backgrounds.\n\nVisitor Experience:\nFor visitors, a visit to the Kamakshi Temple is not just a religious pilgrimage but also an enriching cultural experience. The tranquil surroundings, majestic architecture, and devout atmosphere create a sense of peace and serenity, allowing one to connect with their inner self and experience a moment of transcendence.\n\nIn essence, the Kamakshi Temple in Goa stands as a testament to the rich cultural and spiritual heritage of the region. It beckons seekers of truth and devotees alike, offering them a sanctuary of divine grace and spiritual solace amidst the hustle and bustle of modern life.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the famous temple situated in shiroda.This temple is maintained very well. You must visit the holy pond which is opposite of temple only and nearby there are many small small temples also.Mostly visit during navratri or Amavasya but this time too much crowded as compare to other days.Truly blessed 🙏",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Kamakshi Temple Arch",
      "rating": 4.7,
      "address": "82CM+8XC, Shiroda, Goa 403103, India",
      "reviews": [
        {
          "text": "Shiroda Kamakshi Temple, located in Shiroda, Goa, is dedicated to the goddess Kamakshi. The temple showcases traditional South Indian architecture with vibrant colors and intricate carvings. Devotees visit to seek blessings and experience the spiritual ambiance of this sacred place. It serves as a cultural and religious landmark in the region.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice place and very peaceful",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very soothing place to go. Not a Goan. Here in Goa for studies. Very few places in this village where I come for peace. And this is the TOP MOST!!! of it.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best temple in goa,kamakshi temple is very clean ,it is very beautifull temple in goa ,there are many function carried out,it is not much crowded on normal days but crowded on amavasya ,there is canteen available for food which is clean and hygienic  ,it has very big area ,kamaksi temple is vry beautiful and peaceful",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "God bless us , all i hav to say 🙏Must visit For blessing 🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Menezes Braganca House",
      "rating": 4.3,
      "address": "Guddi - Chandor Rd, Culsabhatt, Chandor, Goa 403714, India",
      "reviews": [
        {
          "text": "Goan heritage house.\nThe family itself explain and provide tour of the house.\nThere are 2 house owner so the entry fee is Rs.200 & Rs.250 per head.\nIt's a unique experience and a must visit place is Goa.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I wanted to explore the architecture of Goa and we decided to travel to Chandor to visit the heritage houses.\n\nThe Menezes Braganca house is the second house we visited. We started out with a hall which had beautiful Chinese vases and paintings. The flooring was absolutely beautiful. The chairs, beds and the furniture were well maintained and beautiful.\n\nThe dining hall was magnificent, it had lots of plates from all over the world. The heritage and history behind this house is fascinating. One of the most beautiful houses that I've seen.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This house is full of history and has two parts: one which is Braganza house and the other is Braganza Pereira house, which also has a unique story behind it. We went to the Braganza house first, and were blown away by the amazing artifacts and furniture of olden days. Next, we went to the side house, and were given an amazing tour with history of the owners and all the artifacts present in the house. For this, we paid 200 rupees per person and it was worth it. Due to some ongoing pre-wedding shoots, we weren't able to see the famouse Ballroom.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The entire house is divided into two parts/wings, one of which is the Menezes-Braganza wing and the other is the Braganza-Pereira wing. In my opinion, Rohan Braganza who personally tours you around the former wing has put in much effort to learn about the history of his ancestral home and I was delighted to go back in time (figuratively) and enjoy the antiques of this home.\n\nThe other part of the house has the same layout and most of the same furniture and antiques, so most would ask you to skip it, but I’d still recommend visiting both wings for a feeling of completion.\n\nBoth tours come at a cost of 250/- and 200/- respectively.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Its a big mansion. Two houses, 250 /- per person and 200/- per person to enter the house. If you want to explore traditional Portuguese houses you can visit.My trip is a budget trip so I didn't get inside.Now ancestors are Living here.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "NV Eco Agro Tourism Pvt Ltd ( NV Eco farm )",
      "rating": 4.1,
      "address": "P. O. Kirlapal- Kilapal- Goa, Dabal, via -Sanvordem, Kodli, Goa 403727, India",
      "reviews": [
        {
          "text": "This is truly a place filled with serenity. Enjoyed our dayout at this beautiful property. The owner and the staff were very friendly and really kind. We loved the activities specially the zip line. The buffet lunch was so good and delicious. The pool was very clean. The property is well maintained. This place was just what we needed.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "I would like to start with the negatives. The food was pathetic. They gave us previous nights remaining veg chana curry and Stale paav (bread) in our included breakfast. I seriously couldn't believe this (Owners if you read my review please look into this). They only serve Buffet lunch and dinner which is 500 RS / head and was not mentioned anywhere in MMT. However they were later kind enough to offer us Thalis at reasonable rates.\n\nStaff was friendly but was a bit unprofessional.\nShilpa and 1 caretaker Uncle were very polite and helpful.\n\nThe positives\nThe property and it's location is amazing. Cottages are very well maintained. There are few adventure activities which were nice and reasonable. There are 3 Swimming pools which were very clean.\n\nThe experience would have been 5 star if the food would have been great.\nOwners please look into the Food thing. Everything else was great.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The place was good..... But the swimming pool which was given to us was not filled before hand, it took almost half of the day to get filled. We had taken our own food. And the rest we cooked there (Barbeque, Tea, Tea snacks).",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Staying in nature’s lap, everything is well connected to nature.\nStay cottages were clean and well planned, food was basic with hygiene maintained, I recommend order food in advance if you need anything additional, as for us evenings dinner was little chaotic, we needed to ask for everything, same happened in morning trail or trek too, if a little more organised this place is A Gem.\nUsed Zipline, adventure activities, must to try, also natural swimming was nice concept.\nButterfly park, Nakshatra garden and long swings under Banyan tree made our morning pleasant.\nWill visit again, and will make sure to book food choice and morning activities in advance.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Enjoyed our stay here, the staff is courteous and very helpful. The walk through the property with guidance of the staff gave us an insight of what we miss in the city. The natural pool is beautiful. Food  is yummm and decently priced. Thank you for a beautiful experience.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Church of Nossa Senhora de Belem",
      "rating": 4.5,
      "address": "726V+HVP, Villa Formosa, Chandor, Goa 403714, India",
      "reviews": [
        {
          "text": "The best feast of 3 Kings in Goa takes place at this Church on every 6th of January every year. Love the stalls with great Goan music along with tasty Goan snack's, beer, drinks and yes Housey to play. Love it every year.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place and crossroads to spend some peaceful time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A beautiful village surrounded with natural beauty ,a gift from God.  Green chandor clean chandor. A heritage village which is having past years history with historical heritage house's and monuments. Many tourists visiting this place. It's have many chapel's and the church feast is celebrated on 6 January. Chandor was once upon a time a capital of Goa.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "3 kings feast takes place at this church on 6th of January.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great religious place clam place for worship😇",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Fernandes Heritage House",
      "rating": 4.3,
      "address": "Fort Area Salcette, 7342+8PQ, Cotta Diasvaddo, Chandor, Goa 403714, India",
      "reviews": [
        {
          "text": "This is a good old Heritage house. Its a Hindu - European style house.\nThere are many artifacts and the house owner still stays here. Entry fee of ₹150 per head. The house owners explains everything beautifully.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "If heritage interests you then  reimagining a bygone walking up and down the same steps that have been tread before gives you a different perspective of  the era. Viewing the things on display with Fernandes family member as a guide will be worth the effort.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Do visit this place at chandor in south goa . They have a good collection of antique items .",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "5 stars to hospitality of Mr. Fernandes and the nature of antiques. But this place is sort of a lesson to know what goes into maintaining the antiques. My guess is that due to poor cash flow from the tourist business or a lack of professional view towards maintenance things..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Some old world Portuguese structures , furniture and nostalgia can absorbed here … the facade it beautiful… needs upkeep to b better but since owners r managing it it’s very homely .. you pay 150/ rs per person for viewing .. has got some really old history ,parts of the house is 500 years old.. they have some interesting artifacts from that time too… wish it was kept a little cleaner and managed better… it has a little river flowing through their backyard..",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Our Lady of Miracles Church",
      "rating": 4.5,
      "address": "65H2+CV3, Sanguem Rd, Sanguem, Goa 403704, India",
      "reviews": [
        {
          "text": "Too much of crowd, clothes above knees are not allowed inside the church. Overall good place to get few pictures clicked",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best for taking pictures outside it at night, was a bit crowded.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The daily mass services are the best part of this church. Two masses everyday on weekdays\n\nWeekday masses:\n1. 06:30 AM (mon-sat))\n2. 07:30 AM  (mon-thu, sat)\n3. 09:00 -12:30  (Fri) Mass along with prayer service\n\nSunday Masses\n1. 06:30 AM\n7. 08:00 AM\n8. 09:30 AM ( mass for catechism children)\n\nMasses on special days are announced before the time and also gets listed out on monthly magazine of the church",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Definitely not tourist place. Had an unpleasant experience with local nuns who were there when we went there 😔. They don't even allow us take single photo of inside",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is sanguem church very cutee n huge there is a ourlady of miracles statue in it if u pray with faith u will get wt u pray for. Every year in the month of may sanguemkars celebrating feast of ourlady feast with great pomp...",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shivgad",
      "rating": 5,
      "address": "Shivgad, Bharbhat Shiroda, 828R+XW6, Ponda, Shiroda, Goa 403103, India",
      "reviews": [
        {
          "text": "Old temple ....i have seen this place before",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Superb view",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "place of reverence",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Volulim Waterfall",
      "rating": 4.9,
      "address": "83PW+JRR, Kodli, Goa 403706, India",
      "reviews": [
        {
          "text": "Very good place to hangout. No pollution. Water is very clean.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Awesome",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    }
  ]
}