{
  "places_with_reviews": [
    {
      "name": "ISKCON Baramati (इस्कॉन, बारामती)",
      "rating": 4.6,
      "address": "Trimurti Nagar, Near Malgunde Colony, Jalochi Rd, Opp, Sahyog Society, Baramati, Maharashtra 413102, India",
      "reviews": [
        {
          "text": "Beautiful, religious, peaceful place\nHare Krishna hare hare...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is heaven ❤️ where you can get peace and happiness",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful environment I love it so much.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple, mesmerizing interiors. Heart catching Altar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very nice temple with sincere and friendly devotees",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sayali Hill",
      "rating": 4.7,
      "address": "5HFX+MH2, Saily Nagar, Sayli Hill, Baramati, Maharashtra 413102, India",
      "reviews": [
        {
          "text": "It's very peaceful place. It's a beautiful temple of Shree Ganesha. You must visit. Away from noise and silent place. You can spend your evening time here with your friends or family.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the most peaceful and spiritual places ... The lord Ganesha temple has scenic beauty and an extremely soulful environment. My Recommendation visit either in the evening late or early morning.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sayali Hill is known for Ganesh Temple Area. Located on bhigwan Road with decent population and residential apartments. It's developing area in baramati City.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A temple on small hill having beautiful garden and positive vibes.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Such a beautiful & trusted place like a heaven\n#my favourite place",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "संत बाळूमामा मठ बारामती",
      "rating": 5,
      "address": "Baramati, Maharashtra 413133, India",
      "reviews": [
        {
          "text": "Must visit place. Peaceful place.\nFeel positive vibes.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Most beautiful and peaceful place on the earth 🌎🙏💐",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jay Balumama",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "good",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "It is a very nice and very simple area but it gives peace of mind. During life, there are many problems, whether it is financial, hospital or mental satisfaction. Only God can give us relief in such times. Treatments are free here, superstitions are not followed here, only Amavasya, Purnima Ekadashi were closed, one more day, tuesday or saturday, I don't remember, please make sure the rest of the information is true. A large leaf shed will appear",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Ganpati Temple",
      "rating": 4.7,
      "address": "5HFX+MH2, Saily Nagar, Sayli Hill, Baramati, Maharashtra 413102, India",
      "reviews": [
        {
          "text": "One of the best temples in town. Located near Abhishek Hotel. Must visit if not already. Whenever I come to Baramati, I visit this temple. Such a beautiful architecture and surrounding. Very peaceful and positive vibes. 🙏🏼",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place was relaxes the mind. There environment was very nice and it is very Peaceful ❤️. There was beautiful ganpati bappa's temple in this garden. So this was very nice and peaceful place...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful and peaceful place. They should not change the archeological - Original black stone finish of stone with paints.\n\nFor me, it's having a nostalgic value as well..!!😌",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place. Lord ganesha temple is very beautiful and like ancient. Area is very clean an pleasant. From this place we get positive vibes.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place , full of pleasant and pure atmosphere. One surely gets positive vibes at this place. Thoroughly well maintained with cleanliness, plenty of parking space outside, with grass lawn for children to play and a stage attached to it. Best place to attend Yoga sessions, exercise sessions, etc. Evening time is also good as many of the people, especially senior citizens visit this place on a daily basis. Also it's situated at a hill type place, which is at a height so there's always fresh air all around and one can get a good upper view of the local place nearby.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mr. Sharadchandra Pawar Museum",
      "rating": 4.7,
      "address": "VP College,, 5JH5+QMF, Vidyanagari, Vidya Nagari, Baramati, Maharashtra 413133, India",
      "reviews": [
        {
          "text": "An inspirational collection of gifts that gives a glimpse of versatility, vision, kindness, scale, reach and popularity of the man behind it!! A must visit place if you are around the area.\n\nThe museum is clean, well maintained and updated. Washrooms are clean. Food available around the school campus in which the building is located. Ideal for school picnics, group visits and young, curious minds!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's located inside the Vidya Pratishthan Campus Baramati. Here we can see the Mr. Sharad Pawar's legacy. He received thousands of gifts from across the world. All gifts are preserved here. Here we can see the legendary, Popularity of the Mr. Pawar. The monument show's the journey of Mr. Pawar. It's worthy to visit here. Very clean ambiance, polite staff. If you are Mr. Sharad Pawar's follower then it's place for you to see how the people's from all over the world love's him",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the place where a man can take lesson for his entire life to live with dignity.Honble Pawar sb is the real grass root leader of the nation .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The museum presents you the life and work of a great leader, Sharad Ji. Literally, this man has got presents from all over the world like China, Singapore, Pakistan, France, America etc. Each photograph in the museum is filled with details. You will get to learn many more new things once you visit their. The infrastructure of the museum is quite advanced and well maintained. The atmosphere is natural due to the surrounding college campus. I must say that it's a place where you should go once in a lifetime to actually know who the person he is.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Pawar saheb is a living legend",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Aayesha Masjid",
      "rating": 4.6,
      "address": "5H7V+GJH, Shiva Nagar, Baramati, Maharashtra 413102, India",
      "reviews": [
        {
          "text": "One of the finest place to visit for Friday and daily namaj prayer..\nNeat place\nPeace and purity..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jumma timing 2.00 pm....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Nice place to worship",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful Mosque For Prayer",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Janvastu Museum",
      "rating": 4.4,
      "address": "5JH5+RMW, Vidyanagari, Vidya Nagari, Baramati, Maharashtra 413133, India",
      "reviews": [
        {
          "text": "Its nice ... some antique awards and gifts of sharad pawar is preserved hear...good place to visit with children.\n\nIt opens between 10am to 4 pm.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This place is good and clean.\nHere all the gifts and memories of Padmashri Sharadchandraji Pawar Saheb are collected by his wife.\nThis museum is very good and best.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "No 1 collection Of Photos Awards Gifts and mostly Pens. All Memories of Sharadchandraji Pawar Saheb are very nice. Most Attractive thing in museum is pradmavibhushan and signature bad all players India Other countries.🖒🖒🖒🖒🖒🖒",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great place to visit, you'll got to know more about hon'ble Mr. Sharad Pawar ji and his awards and achievements and also you'll see his belongings which he had received from different countries.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Excellent place to visit ..I recommend if you are going for servicing of your automobiles   in nearby areas  .spare time to visit this place instead of waiting in customer lounge",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "SHREE. MANDHAR DEVI(KALUBAI)TEMPLE",
      "rating": 5,
      "address": "6J47+4CC, E 128, Industrial Dr, Choudharwadi, Maharashtra Industrial Development Corporation Area, Ganesh Nagar, Baramati, Maharashtra 413133, India",
      "reviews": [
        {
          "text": "👌👌",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Chatrpati Shivaji Maharaj Chowk",
      "rating": 5,
      "address": "At post Mudhale tal Baramati, 5JH5+M4F, dist, pune, Baramati, Maharashtra 413133, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Mahakaleshwar Mandir",
      "rating": 4.6,
      "address": "5J44+CM7, Jalochi, Maharashtra 413102, India",
      "reviews": [
        {
          "text": "Very nice and clean temple of Mahadev",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice, very big temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Hindu temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good Mahajan eshwar Mandir in Jalochi Village.",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    }
  ]
}