{
  "places_with_reviews": [
    {
      "name": "Dhanokhar Hanuman Mandir",
      "rating": 4.5,
      "address": "W5HW+JRC, Dhanokhar churaha, Begum Gunj, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Located in the heart of Barabanki City\nVery crowded area specially on Friday and Sunday",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "very famous temple of Hamuman ji at barabanki city....\njai Bajrang Bali",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Gd place for shoping and worship place too",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jai bajrang bali when I always get depressed I come here to spend some alone time to get relief and i think some magic is here in this temple of lord Hanuman because what i prayed i get that but it doesn't means you don't work 🙂 just keep me blessed lord 🙏🙏🙏#hanumanji #dhanokharmandir",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Though This holy place is situated in a crowded place,but it has a great value among natives of Barabanki.The Hanumanaji's vigrah of This ancient temple is worth seeing and praying.People have great faith and loyalty for Sri Hanumanji.A huge crowd from every corner of district is gathered on all Tuesdays of Jyesth month of Panchang calendar.One must visit and pray Sri Hanuman ji at this temple as it's a place where one can get his desire fulfilled.जय श्री रामजी, जय जय श्री वीर हनुमानजी।",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Clock Tower",
      "rating": 4.4,
      "address": "Postal, Ghantaghar, Main Market Rd, Satyapremi Nagar, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "The overall experience is very good. If possible visit between 4:00 pm to 9:00 pm as during this time most food joints would be open. You can also visit it in morning before 9:00 am to enjoy the tasty breakfast options available.\nOn Fridays, you will be able to witness a flea market (so don't forget to check it out of love love shopping)",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is Very Charming place 💕🌹🥰\nFeeling gd in Morning & Evening time.\nA huge market is held here every Friday. In which all kinds of things are available.\nThere are many markets for gold, silver and artificial jewelery here.There are also shops selling all types of utensils like steel, copper, aluminium, iron and plastic etc.Many collections and shops of ladies and gents wear are available here. A wide variety of things to eat and drink are available. And there is a bank here also.\nIn this area, a market is organized on Fridays from Dhanokhar intersection to the water tank and Pirbatawan turn.In which thousands of people come. And do shopping. In which most of the people come from the female category. Both non-veg and veg items are available here. In the holy month of Ramadan, all kinds of things like sweets, biryani, kebab, sirmal, lassi, shahi tukde, halwa paratha etc. are available here. , Here the clothes worn in weddings and the bells and laces used in them are found. And bridal decoration items are also available.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Old Clock Tower of Barabanki is a historic landmark in the city. It is a magnificent structure that stands tall and proud, and it is a symbol of the city's rich cultural heritage. The clock tower has a unique design that sets it apart from other clock towers in the region. It is a perfect example of colonial-era architecture and its intricate details are a testament to the craftsmanship of the builders of the time. The clock still works, adding to the charm of the tower. Thus it's not allowed visiting people can climb to the top of the tower and enjoy a panoramic view of the city. The tower is well-maintained and is a popular spot for tourists and locals alike. Overall, the Old Clock Tower of Barabanki is a must-visit for anyone interested in history and architecture",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lovely place to hangout with friends and family, lots of options available for your carvings.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is not a kind of place where you visit for have fun. It remains too crowded because of traffic congestion and shops around it",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Peerbatawan Nageshwar Nath Mandir",
      "rating": 4.4,
      "address": "W6P2+CC2, Peerbatawan, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Very beautiful place .please also visit the park nearby the temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice & Awesome temple of lord shiv and beautiful lake and garden also available 🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "An ancient temple of MAHADEVA is placed just along with the village faizullaganj.\nSanatan Dharma school is also along with this temple.\nThe students who want to learn and write Sanskrit and all about Sanatan Dharma. They can go for it.\nI strongly suggest this temple to visit.\nThere is a Sarovar in between the temples.\nLooking awesome.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nageashwar Nath temple is situated in peerbatawan barabanki. This is a very famous temple in barabanki. Where people celebrate Aarti, mundane sanskar, pooja,-archna and other spiritual process .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "😁",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shri Mahadev Mandir",
      "rating": 4.6,
      "address": "W6M2+29M, Choudary Nagar, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Actually this place is the best place for the devotees of Shiv Baba.. Father Shiv fulfills all the wishes of his children.. ❤️❤️🙏🙏🙏",
          "languageCode": "en-US",
          "rating": 4.6
        },
        {
          "text": "Har Har Mahadev",
          "languageCode": "en-US",
          "rating": 4.6
        },
        {
          "text": "Om Namah Shivay",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kailash Ashram Barabanki",
      "rating": 4.6,
      "address": "W5MR+6V2, Satyapremi Nagar, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Jai Shiv\n# have not words to describe",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Just go to the temple and feel the potential of nature 🥰",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place! It is a holly temple of Bhagwan shiv Name as according to there place beacause as per believes lord shiva was lived at kailash hill and that was too cold place. and Lord shiva do the Sadhna  over there to get relaxed. There is a Hindu priest to do worship over there and also maintain the cleaning of here. He have the good behavior and nature so finally it is also a good place at near of Chaya chauraha.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is good , nice and one of the famous temples in the area and district. It has beautiful Lord's shrine. And tge Sgivalingam is also very well decorated. Many of tge main occassion take place here. Hail before Supreme Lord Shiva",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is devine & Peaceful temple of Lord Shiva & Other God ❤️❤️❤️❤️\nMond blowing 😍😍",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "January",
      "rating": 4.3,
      "address": "W55G+JQ9, Barabanki, Jinholi, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Vikas Kumar",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good",
          "languageCode": "en-US",
          "rating": 4.3
        },
        {
          "text": "Rahup",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Ram Van Kuteer Ashram",
      "rating": 4,
      "address": "Hadiyakol, jungle, Awas Vikas Colony, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Shri Mankameshwar Mahadev Mandir",
      "rating": 4.4,
      "address": "W5MP+FG4, Preet Vihar Colony, Rafi Nagar, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Established by Laxman younger brother of Lord Rama, it is a very sacred temple. People who have been here have been granted their wishes. A beautiful place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Visit this place on a less religiously important day....  otherwise its too crowded",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Little congested but Good place with some  lake of services....",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice and Very Spritual place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Need to more clean and arranged",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Kashi Dham Mandir",
      "rating": 4.3,
      "address": "W6M5+QHF, Nabiganj, Ramna, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "Good 👍",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Feeel...good and positive on this place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good temple",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Kashi Dham temple is away from the crowded area, it gives peace to the mind and the wishes made with true heart are fulfilled here. Jai Shri Kaashidham, Jai Mata of the true court.",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Santoshi Mata Mandir",
      "rating": 4.3,
      "address": "W5PW+47R, Faizabad Rd, Peerbatawan, Barabanki, Uttar Pradesh 225001, India",
      "reviews": [
        {
          "text": "best place for worship goddess santoshi mata ji",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice temple",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Divinely presence in Santoshi Maa Mandir.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very popular as a landmark of Peerbatawan Barabanki!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice old temple",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}