{
  "places_with_reviews": [
    {
      "name": "Dak Bunglow More",
      "rating": 4.4,
      "address": "11, Jessore Rd, Rail Gate, Gupta Colony, Barasat, Kolkata, West Bengal 700124, India",
      "reviews": [
        {
          "text": "Dak Bunglow more in Barasat on jessore road is a vital place or you can call it a junction for road transport.This location is in a prime place.From Barasat, Hridaypur,NH 34,near railway gate no 11.Buses from Bangaon to Dakshineswar passes through this point.Many govt offices is located here.Shoping Mall, star mall,Narayani Nursing home,Madhyamgram chowmatha are close to this place.This is three point road.one is towards airport, another is towards Barasat Bangaon,and another is towards Barrackpore via hela battala.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a major connector for many long routes. All major bus routes cross here. Availability of anything is almost available.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's not a tourist place or a park , it's a junction of roads and very highly crowded area of Barasat ,Kolkata",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Busy area , full on crowd.\nLot's of place to eat",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Narrow turn on high road.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Kamakhya Temple, Barasat",
      "rating": "Unknown",
      "address": "PF5V+PWH, Barasat, Kolkata, West Bengal 700124, India",
      "reviews": []
    },
    {
      "name": "Madhyamgram Chowmatha",
      "rating": "Unknown",
      "address": "380/14, Jessore Rd, Purbalaya, South Bankimpally, Madhyamgram, Kolkata, West Bengal 700129, India",
      "reviews": []
    },
    {
      "name": "Madhyamgram Kalibari",
      "rating": "Unknown",
      "address": "Sodepur Rd, Ward Number 6, Basunagar, Madhyamgram, Kolkata, West Bengal 700129, India",
      "reviews": []
    },
    {
      "name": "Lokenath Mandir",
      "rating": 4.6,
      "address": "LARICA TOWNSHIP, Sainik Nagar, Barasat, Kolkata, West Bengal 700126, India",
      "reviews": [
        {
          "text": "This is a beautiful temple. This temple is situated between Madhyamgram & Sodepore",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful temple , peaceful ambience, cleanliness topnotch is a must visit during the Sandhya arti , which starts from 7:00 pm is an event which will be worth experiencing .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "JOY BABA LOKENATH\nA beautiful temple which is made by white marvel. The temple is very neat and clean and environment is very good.If you come here the mind will be full of tranquility. It is situated just beside the Barasat-Barackpore road.\nIt remains open from 8 a.m. to 12.30 p.m. &  4 p.m. to 7.30 p.m.\nJOY BABA LOKENATH",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Peace Finding Area with Baba Lokenath's Mandir...\nA Beautiful Mandir on Barasat Barrackpore Road...\nSerenity and Calmness surrounding the Area...\nMust Visit for All Devotees...\nJoy Baba Lokenath",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I like this place... Very calm and beautiful.\nToday I find some people are confused about the timing of the temple.\n\nHere, I have posted a photo with details\n\n8:00 AM to 12:30 AM & 4:00 PM to 7:30 PM",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hanuman Mandir Badu Madhyamgram",
      "rating": 4.7,
      "address": "Madhyamgram, Badu, West Bengal 700128, India",
      "reviews": [
        {
          "text": "You'll find peace here..\nThe only thing I can say",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful environment\nCalming atmosphere",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Chamatkaari Hanumanji Mandir!🙏 Daily morning and evening Aarti is mesmerising. A place full of positive vibrations and devotion.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful Hanuman ji mandir. It is huge and the people are very kind and welcoming. I believe I found peace after a long time. You must visit here at least once and you will see the magic of Bajrangbali...you would want to come back again !!! Jai Bajrangbali.  Jai shri Ram !!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Hari Om\nShanti Dham ..as the name suggests\nPeaceful abode of God",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Picnic Spot Badu",
      "rating": 4.2,
      "address": "Thakurhat Road, Madhyamgram, Badu, West Bengal 700128, India",
      "reviews": [
        {
          "text": "Awesome Experience and great place for get together",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The food was not up to the mark. Service was poor. The washrooms are also not clean.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Not much better\n1st of all it’s to far from main road and very narrow road then maintaining not done from long times.\nunwanted Trees are spreading everywhere there are very chances of snake in side the spot. Very poor quality spot. Only one place available that’s cooking place and some free space for fit 3-4 tables. Whole park there are no spaces for setting in the picnic spot. Very bad overall. Don’t booked it.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Badu a place near madhyamgram i.e. 6-8 Km from madhyamgram choumatha. A renowned picnic spot during winter the palace is full of mango garden, beautifully decorated with bunglow to stay , spend some time with office colleague, friends and family...\nPrices during winter is on a higher side specially on weekends and special says .\nRange started from 8.5 Km a little interior to 40k on road side.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awesome open field picnic spot",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Kapasia Kali Mandir",
      "rating": "Unknown",
      "address": "PC9P+J8H, Kapasia, West Bengal 700126, India",
      "reviews": []
    },
    {
      "name": "Moyna Bazaar Mosque",
      "rating": 4.6,
      "address": "PFVM+8XJ, Murali, Kolkata, West Bengal 700124, India",
      "reviews": [
        {
          "text": "Very good mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful mosque best experience in there Alhamdulillah :)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Healthy vegetables are always available here with lower price..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mosque for Muslim",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ramakrishna Math, Bamunmura",
      "rating": 4.6,
      "address": "Bamunmura, Taki Rd, Barasat, Kolkata, West Bengal 700128, India",
      "reviews": [
        {
          "text": "One of the finest Ramkrishna Math in this area. Mind blowing atmosphere. There is a school and a free medical camp inside the premises. Nice place for prayer and meditation. One more attraction is there are lots and lots of colourful flowers inside the asram.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful place. Wonderful guest houses and lot of flowers. Best place for meditation. About 25 km km drive from Calcutta.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Every bit is mind refreshing.  Ancestral place of Revered Swami Sankaranandaji, the 7th President of Sri Ramakrishna Mission",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Situated in the serene vicinity of Bamunmura, the Ramakrishna Math stands as a testament to spirituality, service, and dedication. This institution is more than just a religious center; it's a beacon of hope and a haven of tranquility for many.\n\nFrom the moment you step onto its premises, you are immediately struck by its captivating ambiance. The atmosphere exudes peace and tranquility, creating a sanctuary away from the bustling outside world. It's not just a place for religious devotion, but also a nurturing ground for the mind, body, and soul.\n\nThe in-campus school plays a pivotal role in enlightening young minds, while the free medical camp is an embodiment of the institution's commitment to societal well-being. Such initiatives reflect the true essence of the teachings of Sri Ramakrishna and Swami Vivekananda – that service to humanity is service to the divine.\n\nHistory runs deep in the roots of this Math. The fact that Swami Shankarananda, the seventh President of the Ramakrishna Order, spent a significant portion of his childhood here lends a profound historical and spiritual significance to the place.\n\nDespite its historical prominence, the Math's journey to independence was a gradual one. Initially established as a private ashrama in 1963, it was later absorbed into the fold of the esteemed Ramakrishna Math in 2007. After serving as a sub-center of Ramakrishna Math, Barasat for some years, it was in 2015 that it achieved its independent identity as Ramakrishna Math, Bamunmura.\n\nRamakrishna Math, Bamunmura is more than just a religious institution. It's a symphony of spirituality, history, nature, and service. Whether you seek spiritual solace, historical insight, or simply a peaceful moment among flowers, this Math welcomes all with open arms.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Founded as a private ashrama back in 1963, this was taken over by Ramakrishna Math in 2007 as Bamunmura is where Swami Shankarananda, the seventh President of the Ramakrishna Order spent a lot of time in childhood.\nThis math remained as a sub center of Ramakrishna Math, Barasat for a few years. 2015 saw it become independent as Ramakrishna Math, Bamunmura.\nApart from daily worship and spiritual discourses, this also does social work. It has:-\n1. Allopathic-cum-homeopathic dispensary (I'm fortunate enough to have been involved)\n2. Primary school teaching more than a 100 children (they enjoy school, meal, park, and occasional educational tours).\n3. Clothes and blankets distribution etc too are conducted regularly.\nThere are few small guest houses which have to pre-booked. The ambience is so peaceful and relaxing. Lots of trees welcome you. The compound is very big and if you venture every inch, you'll find so many organisms. Day time, it's calm and night too but less. Not lying to you, I've found owl hooting at night, a type of bird I can't recognize that sings all night long and heck, even a jackal once. As of 2019, there are ~3 dogs and ~2 cats as permanent residents too.\n\nOverall, this is a place I've visiting since I was a small kid and is close to my heart. If you can, just visit here and explore the spirituality and nature. I hope you'll like it.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}