{
  "places_with_reviews": [
    {
      "name": "Dew Dale Resorts, Baratang Island",
      "rating": 4.7,
      "address": "Sundergarh Village Baratang Island, Andaman and Nicobar Islands 744210, India",
      "reviews": [
        {
          "text": "Stayed at this quiet hotel away from the city bustle. Both the manager and staff were super nice and went out of their way to help. The food was yummy too!\nHowever when the power went out in the area, they were slow to get their generator going, and we had to keep calling them. No food delivery to the room, which was a bummer.\nStill, it's a good place if you want some peace and quiet.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This resort at Baratang is placed at such an awesome spot, far from the crowd and surrounded by greeneries. Loved this place. My little one said it was the best place we have stayed in Baratang. Baratang of Andaman is actually a remote area, where one have very limited options to put up, but we were happy and satisfied to have managed a cottage in Dew Dale. The staffs were very cordial and helpful. The foods were served fresh and hot. We stayed for a night in Dew Dale. I would highly recommend this resort at Baratang to my friends and family.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We saw this property on Internet. Baratang people don’t stay there and make day visit. But we stayed at Dew Dale. It was the best decision as we were mesmerised with the pristine nature it offers. Limestone caves, parrot island were simply awesome. The owner Jessy is such a warm person who made our stay thoroughly pleasant. We thank entire Dew Dale team.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dew Dale resorts was like an oasis of calm within the wilderness of Baratang. Mrs. Jessy our host is an amazing person and took great care of us. The location was great and very quiet. The food was amazing as well. The aloo parathas especially were just like home.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing experience at Dew Dale Resorts.  Mrs Jessy Madam and her teams politeness, receptions, rooms and food are exceptionally good.  The staff Mr Hari Prasad and Pradeep are so kind and helpful always.  Hope to visit again the same resorts when we go next time.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "St.Alphonsa catholic Church, Sundergarh Baratang",
      "rating": 3,
      "address": "Baratang, Nilambur, Andaman and Nicobar Islands 744210, India",
      "reviews": [
        {
          "text": "Beautiful ❤️ church at Sundergarh baratang",
          "languageCode": "en",
          "rating": 3
        },
        {
          "text": "Orthodox 🙏🙏🙏",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    },
    {
      "name": "Rapha Church",
      "rating": "Unknown",
      "address": "5QGQ+R95, Great Andaman Trunk Rd, Nilambur, Andaman and Nicobar Islands 744210, India",
      "reviews": []
    }
  ]
}