{
  "places_with_reviews": [
    {
      "name": "Sarbamangala Temple Bardhaman",
      "rating": 4.7,
      "address": "6VQ4+9RW, N Basu Rd, Sarbamongala Para, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "The Sarbamangala Temple in Bardhaman (formerly Burdwan) is a revered Hindu shrine dedicated to Goddess Sarbamangala, a form of Devi Durga. Situated in the heart of Bardhaman town in West Bengal, this temple holds great religious significance for devotees and visitors alike.\n\nThe Sarbamangala Temple is believed to have been built during the 18th century by the Bardhaman Maharaja Kirtichand Rai. Its architecture reflects a blend of traditional Bengali temple design with distinct features such as ornate terracotta carvings, intricately carved pillars, and a towering spire. The temple's sanctum sanctorum houses the idol of Goddess Sarbamangala, adorned with exquisite jewelry and offerings from devotees.\n\nDevotees flock to the Sarbamangala Temple throughout the year, especially during festivals like Durga Puja, Navratri, and Kali Puja, to seek the blessings of the goddess for prosperity, protection, and fulfillment of desires. The temple precincts bustle with activity during these festive occasions, with elaborate rituals, devotional songs, and cultural programs being organized.\n\nOver the years, the Sarbamangala Temple has undergone renovations and maintenance to preserve its architectural heritage and religious significance. It continues to be a vital spiritual and cultural landmark in Bardhaman, attracting devotees, pilgrims, and tourists who come to pay homage to the divine mother Sarbamangala and experience the vibrant atmosphere of devotion and faith.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Vary nice this sarbamangala temple, pujas time at 10am.and every day (bhogprasad) distribute normal prices. At 12am.but this facility tickets time at 10am.near station Bardhaman , some toto motor  go there , per person vara 15 rs only. Near bus stops birhata, kargengate,bardhaman station,",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visited this peaceful mandir, and it was a truly serene experience. The tranquil atmosphere, the beautiful architecture all contributed to a sense of inner peace. The mandir's meticulously maintained gardens and surroundings added to the overall serenity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Famous Sarbamangala Temple. Huge temple compound. 3 Shiva temple is also there. Evening aarti is must watch.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple complex, well maintained and crowded with devotees having small parking place inside the complex.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ichlabad Kiran Sangha Club",
      "rating": 4.3,
      "address": "Kiran Sangha, Ichlabad, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "Very good club. Club management committee very good.every years new new ideas & plan come up about pandals thems or durga murti by members.Thanks all members hard work.l am visit every year this club during the durga puja.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Quite a Famous Club in Purba Barddhaman. They made quite the headline for the best themed Durga Puja in 2019. Wish them Good Luck.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent theme and well executed... got star ananda's \"jelar sera pujo\" award... every should visit this durga puja 2019...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice lighting and sound show. This year theme is haridwar with ganga aarti",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best durga puja theme of 2019",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kalpataru Children's Park",
      "rating": 4.3,
      "address": "6RPW+G98, Alamganj, Sripally, Ambagan, Anjir Bagan, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "One of best park for children & family.\nLandscape & Greenery are so Good.\nFlower garden also excellent.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Call to true park is famous for its green and flower full garden. In the winter season lots of people come here to visit the flower garden area. There is a big ground located here. In the winter time Sishu Mela happens here. In the morning you can play cricket or any kind of sport here.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place for everyone Child to Adult.\nNot GF BF type area.\nGood place for frequentation and mind freshing.\nOpening time - 2.30pm to 6 pm.\nTicket price - adult 10/- child-5/ only.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "4.1 star. Filled with green, soft and maintained grass, children's park, not for couples to spend personal time, fast food shops outside, nicely decorated, enjoyable with family, away from the main city, toto rickshaw available.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It was nice place to visit with family😊",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bardhaman Science Centre",
      "rating": 4.3,
      "address": "Golap bag, University, near Bardhaman University, Bardhaman University, Bardhaman, West Bengal 713104, India",
      "reviews": [
        {
          "text": "Bardhaman Science Centre is an awesome place, especially for kids and students. There are so many cool things that kids will love and learn from. It's not just for fun; students should check it out too. The whole place has a calm and clean vibe, making it a nice spot to spend time. I really loved the place, and the best part is the entry fee only 25 rupees. If you're at Bardhaman Railway Station, it's super close. You can easily hop on a toto and visit this place. It's a great combo of fun and learning.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It was a really very good experience ❤️Good place for hangout with friends, family and child. If you want a very knowledgeable tour for your child and also for your family friends go and visit this place you will love it. ❤️❤️❤️❤️❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A place where u can spend  your time ..as well as your kids will learn and gain interest in Science.\n3d show ..science  show and Planet show available  at a nominal cost.\n\nHowever the standard of 3D show is not upto  mark..and showing the same theme over the years.\n\nParking  facility  availabe.\nArea is wide with a adjacent park",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a beautiful place for the young kids. The playful arena they would just love to enjoy. They will see rabbits, telescope and various playing instruments. They would love to slide , run , weight lifting and even more they just love playing here without remembering the time. They can enjoy every moment here , every second will give them profound joy. The aquarium with fishes floating will be eye soothing for them. The clapping lightening tree , flying ball in the air, various electric activities, scientific imaginations, goods train model, bhulbhulaiya, seeing the well, taramandal, the 3d show - all events the child will cherish forever. Highly recommended to visit here.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place to visit with school kids. Some display items and instrument needs to be maintained properly. Ticket price may be lowered a bit to accommodate more constrained persons. A composite ticketing for all article and shows may be introduced. Entry fee ₹25, science show ₹10, planetarium ₹10, 3D show ₹30. All fees have concessional rate for school kids and military personal.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Vivekananda College More Masjid",
      "rating": 4.3,
      "address": "6VG5+44G, Barabalidanga, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "Vivekananda college more near of the biggest college \" vivekananda mahavidyalaya\" and \"vivekananda development association\".... There have a mosque.. That's the totally old mosque with old designs. That's why it's look like a amazing place. Anyone can visit this mosque there are not judgements what's your religion. If are you belong from others religions then you can also visit this mosque.\nOne more thing, there have a big market.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The college is very good for study... Every professor is good  teaching.... I like the  samir sir math professor..... Sir is very\nGood Teaching 🙂 I like tooo learn more and more samir sir.....",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Only a mosque near College more.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Village Name : Vivekananda College Road, Barabalidanga, Burdwan (\tভিভেকানান্দ কলেজ রোড বাড়াবালিডাঙ্গা )\nBlock Name : Bardhaman\nDistrict : Bardhaman\nState : West Bengal\nDivision : Burdwan\nLanguage : Bengali and English\nTime zone: IST (UTC+5:30)\nElevation / Altitude: 34 meters. Above Seal level\nTelephone Code / Std Code: 0342\n\nWard : Ward\nAssembly constituency : Bardhaman Uttar assembly constituency\nAssembly MLA : Nisith Kumar Malik\nLok Sabha constituency : Bardhaman-Durgapur parliamentary constituency\nParliament MP : Dr. Mamtaz Sanghamita\nPin Code : 713103\nPost Office Name : Sundarghat.\nVivekananda College Road, Barabalidanga, Burdwan is a Locality in Bardhaman City in West Bengal State, India. It is belongs to Burdwan Division .\nVivekananda College Road, Barabalidanga, Burdwan Pin code is 713103 and postal head office is Sundarghat .\n\nBardhaman , Memari , Srirampur , Arambagh are the nearby Cities to Bardhaman.\n\nDemographics of Vivekananda College Road, Barabalidanga, Burdwan\n\nBengali is the Local Language here.\n\nPolling Stations /Booths near Vivekananda College Road, Barabalidanga, Burdwan\n\n1)Sadhanpur Nimnobuniadi Vidyalay Room-3\n2)Koria F.p. School\n3)Krishnapur High School (r-1)\n4)Krishnapur Fp School\n5)Krishnapur High School\n\nHOW TO REACH Vivekananda College Road, Barabalidanga, Burdwan\n\nBy Rail\n\nBarddhaman Junction Rail Way Station , Talit Rail Way Station are the very nearby railway station to Vivekananda College Road, Barabalidanga, Burdwan.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Vivekananda College More Is Very Usefull Place for foreners",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Ramnabagan Wildlife Sanctuary",
      "rating": 4.1,
      "address": "Golapbag, Mouza, Baburbag, Bardhaman, West Bengal 713104, India",
      "reviews": [
        {
          "text": "We went on a field visit from our university department (The Department of Tourism Management, The University of Burdwan) for the Observation of Stodents' Week Programme. We met and talked with the District Forest Officer during the course. We had a free entry and visit to the only wildlife sanctuary in the town.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very peaceful and beautiful place. Had a beautiful experience in a winter afternoon. Mostly the places are clean and the lanes are well done as well. Even lots of different animals are there as well.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A small zoo in Burdwan town surrounded with various trees. This zoo is situated in Golpap Baagh area just beside BU campus. You may see leopards, crocodiles, langoor, deers , porcupines, various birds like vultur here. Thus place is very attractive for your child. The zoo remains closed every  Thursday.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A visit to the oldest National Park in Westbengal. Good for weekend  trip. But need more renovation and maintenance and tourist assistance.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's a very good place ...i also recommend you to visit it. But they don't have any type of snakes and you can also see many more animals ... overall it's a great experience for me and a very family friendly environment.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Nawab Bari",
      "rating": 4.2,
      "address": "6VG3+6CW, Barabalidanga, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "This place is abandoned but still it's a very beautiful and peaceful place . I think they could have managed the place properly so that it would be a good tourist place.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Located at the southern part of Purba Burdwan district, this is a 300+ years old Indo-syrian architecture. In 1715, Mughat emperor Farrukhsiyar built this magnificent monument along with a functional mosque on the tomb of Syed Khaja Anwar, commander of the mughal army. This complex is surrounded with high walls and a deep pond. There is a small pavilion in the middle of the pond which is known as Wind-hall or Hawa-Mahal.\nThough this property is under West Bengal Heritage Commission, no hopeful maintenance is noticed for several years. Nowadays, no tourist or local is allowed to visit this historical sculpture except people who offer namaz in the mosque.\n\nOne of the caretakers told that the most preferable time to visit the tomb is on the occasion of the holy bath on the first day of Magha (a month in Hindu calendar) when hundreds of visitors are welcomed in Nawab Bari to see the holy tomb.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This historical place need to be declare as heritage and need to be preserved well, lack of maintaining authority. According to local people there are Toombs of Auranzeb's grandchildren and many close of his people.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's very good place for all of us . Specially teen agers... Come and visit..this historic place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A good place to visit if you are interested in history but, it has turned into a ruin, which people are ruining even more.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shree Maa Kankaleshwari Temple",
      "rating": 4.6,
      "address": "Kanchan Nagar, West Bengal 713103, India",
      "reviews": [
        {
          "text": "One can spend his evening there. The garden is filled with flowers and the ground is ideal to sit. If you want to take bhog (food) you have to purchase tickets beforehand and even on the same day from the office of the temple and from Vidhayak Sahayata Kendra as well.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A great place. When I go to Kankaleshwar, my mind feels very good. The beautiful surroundings of Naba Nir old age home are also quite lovely. When evening falls, the heart really fills up. There are lights on the field and the mind fills up in the mother's temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "In 1913 AD (1320 Bengali calendar), during the flood of the Damodar River, this Kali sculpture was discovered in the western part of Bardhaman city. The age of the sculpture has not been determined yet. The sculpture is actually an intact stone idol, three feet wide and five feet tall. It has eight arms on both sides, totaling sixteen hands. The sculpture appears to be carved from stone and resembles a human skeleton. The idol has eight arms with various attributes like a lotus, conch, discus, bow, sword, and noose. There are soft garlands around the neck, and at the base, there are statues of Shiva and two attendants on either side. The deity's body has intricate carving, and the head is adorned with a finely crafted crown.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple. The place is really well maintained & organized. A must visit when you are in the town.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nicely maintained. Seating MLA Sri Khokan Das is actively involved in renovation and development of this temple and surrounding areas.  Understand from local persons that Sri Das has organized mairrage of 121 couples this year of different faith. He is doing lot of developmental work in the area. He visits this temple every morning. States need MLA like him. Visited temple on 21.12.3023 evening.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hawa Mahal",
      "rating": 4.4,
      "address": "7R4X+C25, Bardhaman University, Bardhaman, West Bengal 713104, India",
      "reviews": [
        {
          "text": "There are no tickets..... It's in the university... So u can go with peace and in ease.... Lovely place to seat and talk..... It will be better if u don't smoke",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It was such a beautiful place, it's in the University of Burdwan and the campus itself is serene and one would feel nature at its closest. But there was a slight problem, you have to row with a boat to go there and the pond was full with dead water hyacinths so it looked a bit bad but overall it was great 💕",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best place in the University to take a deep breath. It is located in front of the Botany department, & from the accessible spot, you can get the glimpse of the Hawa Mahal island, once used to be the spot of relaxation for the Maharajas of Burdwan, now is occupied by the Botany department with various flower plants, & horticulture. Serene & peaceful.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best time to visit is during month of March.\nEnter the Burdwan University from gate opposite to Burdwan Zoo. After walking for about 3 mins you can see this beautiful place from ghat. Boating to this place was previously accessible, but now it is not maintained properly.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a place in Golapbag, constructed by the Maharaja of Bardhaman. There is an island constructed artificially in a large water body. At the top of the elevated island there is a small dome like structure with seating provisions. Along the slope of the island several varieties of rose and season flowers (winter season) are cultivated and maintained by the Department of Botany, BU. There is a boat for connecting main land with the island. Hawa Mohol is the place where the Maharaj of Burdwan used to go with his queens to spend the evening in a windy environment.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bardhamaneswar Temple",
      "rating": 4.6,
      "address": "6RJV+FXV, Anjir Bagan, Bardhaman, West Bengal 713101, India",
      "reviews": [
        {
          "text": "A most holy and popular place of Bardhaman.  From the name you can understand this is a hindu temple an dedicated to Lord Shiva , we eventually call as Mota Baba or Bardhamaneswar . During shiva ratri , this temple stay extremely crowded . You can visit anytime of the year with your devoted mind . Their are manily shiva linga situated at the heart of the temple . At the back of the temple there are one small open Naryan temple too.  This huge shiva linga was found from under the soil which side is also just aside of the present day temple.  You can see that place also.   The whole temple is made with corrugated tin but i think this temple deserves to be made more beautifully with good architecture.  Government, administration, private companies and devotees,  all should help to build a good strong temple for Vola our beloved Bhola Baba.  Har Har Mahadev 🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Many myths...Four Realities... this is how you can describe Bardhamaneswar Mahadev, popularly known as Mota Shiva of Bardhaman. A myth says it is established by Chand Soudagar, the famous Shiva disciple of Manasa Mangal. Some say it is established by Shashanka, the then king of Bengal. Some believe, it appears itself from the soil, some say half of the Lingam is still underground.... Know not, what is true or false, but this is true it is the widest Shiva Lingam of India and the most heaviest ( nearly 110-120 Ton) of Asia. Another true fact is that, it is a single stone (Monolith) Lingam.And the last true fact is, it is very poorly maintained. The place is a little outskirt of the town but vast and serene. A small structure is there to protect the Lingam...but not something decorative. Need vast improvement in this particular field. Now about the Linglam...a bolt from the blue... you will be speechless after seeing this magnificence.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing shivling. Very few shivling I've seen of this size. Had Darshan on 21.12.2023.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The massive shivlinga belonging to Chand sadagar accordind to folk lore have been excavated here . The powerful almighty resides here. The devotees can touch him and offer their wishlist for his sanction.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a great place of  God shib 🙏🏻🙏🏻🙏🏻🥰❤🥰",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}