{
  "places_with_reviews": [
    {
      "name": "Shri Trivati Nath Mandir, West Bareilly",
      "rating": 4.7,
      "address": "Baba Trivati Nath Mandir Marg, 9CG9+JJ8, Bareilly, Uttar Pradesh 243005, India",
      "reviews": [
        {
          "text": "A very beautiful temple situated right in the heart of the city.\nThe area is large enough to have gardens, multiple temples and a lot of space to walk and sit and spend some time. There are two huge grounds as well, apt for any large gathering such as katha and Ramleela manchan.\nRegular upkeep is evident and a lot of effort has been put in to have everything that a temple should have. Must visit if you are in Bareilly.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the 7 Naths in bareilly ⚛ Must visit this temple,  peace and love is here . Om namah shivay ❤⚜",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a greatest temple of lord shiva, this is a very beautiful temple 🙏❤️❤️💫",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "\"It's not about the place, it's about how you feel\", No doubt the temple is on the list of top 5 beautiful and ancient temples in Bareilly. The feeling you get when you visit shri tibrinath/trivati nath mandir is so great. Must visit and see glimpse of lord shiva statue. May bhole baba bless you. ॐ नम: शिवाय !!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Hello Friends! This is Dharmendra Sir from W Career Academy.\nI would like to give a genuine review about this temple. I think this place is really good to worship and also people believe that it is also one of the oldest temples of Bareilly😊\nWell maintained too🙏\nHar Har Mahadev ❤️",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bankey Bihari Temple, Bareilly (West)",
      "rating": 4.8,
      "address": "9CPG+F53, Unnamed Road, Indra Nagar, Rajendra Nagar, Bareilly, Uttar Pradesh 243122, India",
      "reviews": [
        {
          "text": "Hare Krishna 🙏\nOne of the best temples in Bareilly. It is quite big and have Radha Krishna as the main idol and all other devi devatas also like Shiv, Parvati, Ganesh, Hanuman, Nav Durga etc. Even Ram Parivar and Lakshmi Narayan are there. Nav Durga is very nice and looks very beautiful. But Radha Krishna looks alive, they are actually there, it seems, to give blessings to devotees. I am blessed to have been able to take Darshan of their Lordships. Hare Krishna 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is One of the top famous krishna temple of bareilly . Not only krishna pratima here all Gods pratima is present and along with it on the main door there is pratima of lord shiva jinki jatao me  sakshat Ganga maiya  pratima swaroop ka Darshan  avismaraniye h and on the another side garun pr savar vishnu ji virajman h this scene is not seen in other temples it is gorgeous place for visitors to visit . If anyone wants to take prashad it doesn't need to carry from home on 2m distance there is a sweet shop . Another special thing of this temple is that the prashad that is distributed to visitors is mishri packets which is precious work seeing Corona",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Once in a life, you must visit this place. This is the place when you go once, it will give you feel like going always.\n\nFully crowded place. There is less security as per the crowd. That is always a concern for people to keep theirs belonging safe. Hence you need to be always careful of your pocket whenever you go to this place.\n\nThere is beautiful market near by temple in all the corners. You can buy Peda, Flowers, Laddu Gopal cloths, decorating jewellery etc.\n\nLots of snacks shops are also available to have breakfast, lunch, dinner after Darshan.\n\n#RadheRadhe",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": ":⁠^⁠)  Banke bihari temple is amazing to others temple\n:⁠^⁠) Decoration is most attractive on janamastmi 💫\nStatue and it's clothes are shining everytime 🎆\nI love this temple 💟",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Banke Bihari Temple in Bareilly, Uttar Pradesh is built on a lines of  Delhi's Akshardham Temple. The red stone of Rajasthan has been used in the construction of this temple, the eight gates of the temple and the idols of Jaipur make it special. Few people would know that special architecture and design have been used to build their buildings.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Alakhnath Mandir",
      "rating": 4.7,
      "address": "9CC3+79R, BBL School road, Phool Bagh, Quilla Chhawni, Bareilly, Uttar Pradesh 243502, India",
      "reviews": [
        {
          "text": "One of the famous and oldest temple of Mahadev in bareilly. It is renovated again but the temple still have the same vibes. There are many mini temples in the mid way. Don't forget to shop from the local street vendors. We are the only source of income in the off season for them.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a Hindu temple.\nGod of Hindu Sanatan Dharma is worshiped here.\nThis temple has an important place in the world.\nThere is a very big statue of Lord Hanuman ji built here.\n\nGod is worshiped here every day.\n\nThis temple is located in Bareilly, Uttar Pradesh.\nThis is very beautiful M.\n\nPeople come here every day to have darshan of God.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple of Lord Shiva. Temple complex. Needs cleaning. Tall idol of Lord Hanuman.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple is Ancient and has significant rol to connect people to spiritual roots of their beliefs. Jai Mahakaal",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Har har Mahadev I have visited first day of savan of 2023 it's great place to visit",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Pashupati Nath/ Jagmohaneshwar Mandir, Bareilly",
      "rating": 4.6,
      "address": "Pilibhit Bypass Rd, Pashupati Vihar Colony, Bareilly, Uttar Pradesh 243005, India",
      "reviews": [
        {
          "text": "Beautiful temple of lord Shiva on pilibhit bypass road, the temple design is somewhat monastery style, surrounded by water, but lacks cleanliness in pond, ducks and cat fishes are there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the nath temple in 7naths of bareilly.\nWhatta beautiful place, peace and joy present inside the temple,  beauty of this shivalay us unbelievable 😍  Om namah shivay",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited on a Monday in the month of Sawan that me to wait for few minutes. The water around the temple needs to be cleaned. Rest everything is beautiful",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the SEVEN jewels in the Nath Nagri, Bareilly. It is kinda small temple, with a big pond, with several big fishes and turtles. I liked it. Jai Shiv Shambu.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Teh Pashupati Nath temple is dedicated to Lord Shiva. The inspiration of Architecture of temple is taken from The Pashupati Nath temple of Nepal. The temple is surrounded by water from all side and four ways are to enter into temple over the water from four side. Big size of many fishes can be seen seen and many ducks are dwelling there. Good vibes can be felt here ..truely....",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Baba Alakhnath Ji Mandir Bareilly",
      "rating": 4.6,
      "address": "State Highway 37, 9CC2+CHR, Phool Bagh, Quilla Chhawni, Phool Bagh, Quilla Chhawni, Bareilly, Uttar Pradesh 243001, India",
      "reviews": [
        {
          "text": "The most ancient temple of Nath Nagr, Bareilly as per the discussion I heard while passing by a meeting of old age people.😅 As per the beliefs no doubt, Baba Alakhnath ji fulfills everyone's wish if asked with pure heart. This Nath mandir is somewhat surrounded by forests, you can make this out while entering there. I have also seen some elephants and camels who were cared by Babas or महंत when I used to visit there in my childhood in 2000s. Although now they have only horses, dogs and tortoise. The big statue of Hanuman ji is the first sight attraction of this temple followed by a road covered by trees that provide peace and coolness and it also have some benches. People used to come here for morning walk. During occasions this road is covered by vendors which gives a sight of \"Mela\". But while entering the Mandir's premises be careful about the slippery floor especially in rainy seasons as it accumulates algae all over and there can be chances of a slip so take hard steps while entering.\nRest everything is best.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a centuries old temple dedicated to Shiv. The unique part about this temple is that it is located under the roots of very old banyan tree with natural Shivling. This temple comes under the sect of Naga sadhus and you will not find any pandit here. This temple is open twenty four hours and all offerings and pujas you have to do by yourself. Must visit place for very unique experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Parking space available. Flowers and Puja articles available near the temple. 6000 years old temple. Lord Shiva and Lord Hanuman are major attraction for Devoties. Transportation available to temple from station to temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A nice place to spend some spiritual time in Bareilly. A famous place for bareillians and fans of Bholenath",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a very sacred and beautiful temple of lord Hanuman and Lord Shiva and Lord Shani dev. It has a big statue of Lord Hanuman. It has very much land and a very vast area. It has many small temples in it. It has always a great crowd. People visit here and worship here. Many persons come here to see the bride and bridegroom for the marriages. The fast food is very expensive here. I have visited here twice.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "84 Ghanta Mandir, West Bareilly",
      "rating": 4.7,
      "address": "8CQ2+GH7, Bareilly - Badaun Rd, opp. Chaurasi Ghanta Mandir, Subhash Nagar Colony, Bareilly, Uttar Pradesh 243001, India",
      "reviews": [
        {
          "text": "The temple is highly revered. Hindu's Devi Maa Durga' Temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Here is pleace where we met twice and this place is my one of the fav place\nJay mata di",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is dedicated to Devi Maa. This temple is very ancient temple of bareily. During the festival of \"Navratri\" this became the most busiest place in the world. Please avoid your personal vehicles here because there is a very small parking area. Try to come with public transport. Timings of arti is 6:00 AM and 5:00 PM.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "84 ghanta mandir is on main road on badaun road...\nMany people have faith on this mandir",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple with thousands of heavy bells ,holy place for Hindu Religion, people come from far in NAVRATRI ,goddess Durga is worshiped here.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri baba Bankhandi Nath ji Temple",
      "rating": 4.5,
      "address": "Bareilly Rd, Old City, Jogi Navada, Bareilly, Uttar Pradesh 243006, India",
      "reviews": [
        {
          "text": "Its near syamatganj  old city bareilly 1.50 km distance from syamatganj Bareilly",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very Ancient temple of lord shiva... There are many temples in the premises of the main temple. ... There is also a big pound having shivlings around it.   🙏🏻🚩 Jai ho Baba Bankhandi Nath ji ki....🙏🏻🙏🏻",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The temple is beautiful ,also It has pond and there are 108 shivlings around this pond.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a famous place of Bareilly city, people feel good coming here, LORD SHIVA TEMPLE",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Important advice to everyone who is planning a visit:\n\nIt would be better if you go by a 2-wheeler. There's a parking problem for cars. If you're taking a car over there then try parking it 150-200 meters before the temple entrance.\n\nEverything else about the temple is just awesome!",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Trivati Nath Mandir North Gate, Central Bareilly",
      "rating": 4.8,
      "address": "66, Macnair Rd, Jawahar Nagar Colony, Bareilly, Uttar Pradesh 243003, India",
      "reviews": [
        {
          "text": "I like places  because\n1) I play a instrument.\nAnd more  enjoy in this place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the very famous Hindu temple in nath nagri Bareilly. The temple attracts large number of pilgrims from different parts of the country. The temple committee organises kirtan and satsangs.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Shri Trivati Nath Temple is one of the six ancient temples dedicated to Lord Shiva. It is located on the outskirts of the city of Bareilly. Lord Shiva is also called Trivati Nath. According to legends, Lord Shiva or Trivati Nath prophesied that he would appear in the dream of a shepherd under the three banyan trees located in the dense forest in the panchal area.\nIt is widely believed by the devotees that whosoever worships Shri Tivati Nath with full faith and devotion gets all his desires fulfilled. The temple, therefore, draws huge crowds of devotees every day.\n#NathNagriBareilly\n#Bareilly\n🛕🌺",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Probably the most beautiful Shiv Temple in the city. This temple is among Four nath temple in Bareilly who have decades of long history.\nNice and peaceful place for worship .\nJai Bholenath\nHar har mahadev 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is very ancient temple of lord Shiva\nIt atmosphere is very calm and cool.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Hari Mandir",
      "rating": 4.7,
      "address": "9CFH+QM5, next to hari mandir, Model Town, Bareilly, Uttar Pradesh 243005, India",
      "reviews": [
        {
          "text": "Hari Mandir is truly divine! Its majestic architecture and serene atmosphere instill a sense of peace. Devotees find solace in its spiritual ambiance, while visitors admire its beauty. The rituals are conducted with utmost reverence, and the volunteers are helpful. A sacred place that radiates tranquility and devotion, Hari Mandir is a must-visit for spiritual seekers and tourists alike.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is very beautifull place for worship. We get peace in this temple and its interior decoration is very attractive. You feel like that you are in heaven in this temple. So, Always say, Radhe Krishna",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The most peaceful place for devotion.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A Hindu temple but you will find Sikhs in the majority. They organise, take part and concurrently celebrate each other festivals. Radha asthmi is a day recommended for a visit",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple , Statues of God look like real",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Pasupatinath temple, Central Bareilly",
      "rating": 4.4,
      "address": "2, Stadium Rd, Model Town, Haziyapur, Bareilly, Uttar Pradesh 243005, India",
      "reviews": [
        {
          "text": "Beautiful Temple. Must visit.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice water surrounding mandir of lord shiva. There are plenty of swans for great entertainment of kids specially",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The best lord shiva temple in bareilly . You will get an opportunity to view its real beauty in mahashivratri festival . It has a small pond like structure and you will see all around fishes and ducks with a small mountain like structure on top of which lord shiva with maa parvati are present .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Love it",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very clean and a smart temple",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}