{
  "places_with_reviews": [
    {
      "name": "Kali Mandir",
      "rating": 4.7,
      "address": "Kali mandir, chowk, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "Sach a beautiful temple for Hindu, i had go for visit 1st time and i was impresses to see the temple view i like their renovation design and colour texture\nthis temple is for Kali maa and you can go their for pray for you and your family\nsuch a nice temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Kali Puja is a major festival celebrated at the Kali Mandir temple on Kali Mandir Road in Bargarh. 🎉 The festival honors the Goddess Maa Shyama Kali and is held during Diwali.\n\nYagyans, or fire sacrifices, are also performed as part of the festival.\n\nThe temple's main attraction is a large and beautiful statue of the Goddess Maa Shyama Kali, which is made from an alloy of eight metals.\n\nA new temple for the Goddess was recently built, and it is a popular attraction for pilgrims. 🚩",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the oldest 🛕 temple of\nBargarh.  Many devotees come here from far places too.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "U can visit any time to heal yourself & to boost confidence 🙏🙏🙏\nA single place solution for every problem\nJai Maa Kali l\nJai Shree Ram l\nHar Har Mahadev l",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A huge kali mandir inside bargarh town\nSurrounded by public sector shops road and a park\nNice temple 👌",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Gandhi Park",
      "rating": 4.1,
      "address": "8JPF+47P, Mohanty Pada Main Rd, Mohanty Pada, Dhanger, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "Well working swings nice space.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's very nice place to hangout and best place for kids to play. I really love this place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Its the one and only park situated in Bargarh toen.\nLawns with toys for kids and an outdoor gym for all.\nA functional toy train is also available.\nA cafeteria which serves packaged items and beverages.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place but it's too small and it needs maintenance",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This is one of the most important places of Bargarh as this place is dedicated to the Father of the Nation. Gandhi Jayanti is celebrated here every year. The life and many common activities of Bargarh is centred around this place. Mahatma Gandhi ki Jay.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Samaleswari Temple, Bargarh",
      "rating": 4.6,
      "address": "Talipada, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "I am very blessed, that I got your darshan MAA Samaleswari.My day was full of blessings.The beauty of this temple is Amazing. Its artwork is worth seeing.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice temple , designs are too much unique 🥺❤️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a very good place to visit. Please visit here and get blessing of Maa Samalai",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very spiritual, peaceful and calm environment. A very beautiful temple full of amazing work and craftsmanship at its finest. Great design.\nJai Maa Samlei",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awesome temple of samleshwari mata.........you can't take off your eyes when you see the beautiful creation of temple which seems like the historical one",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "ACC Shiva Mandir",
      "rating": 4.5,
      "address": "9JC4+GJ6, Cement Nagar, Bargarh, Odisha 768038, India",
      "reviews": [
        {
          "text": "There is a lot of space and neat and clean has been kept inside the temple. The atmosphere inside also looks very nice.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful Shiva temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place to visit. Lord Silva's temple with Lord Ganesha, Lord hanuman and Ram temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A peaceful and beautiful temple of god shiva",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Thana Chhak",
      "rating": 3.9,
      "address": "8JM9+VPR, Bargarh Rd, Bargarh Bazar, Dhanger, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "It is a Crowded place near daily market...",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Nice.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "MSK",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Rani Sati Temple",
      "rating": 4.8,
      "address": "9J62+XM7, Dang, Odisha 768028, India",
      "reviews": [
        {
          "text": "Very good place. Environment is peaceful, surrounded by many beautiful trees. At the side of the temple, there is a big magnificent  building, which is used for cultural rites and rituals. Resently i visited the place.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sai Mandir",
      "rating": 4.6,
      "address": "8JR3+856, Slip Road to Sai Temple, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "Its a peaceful place of mind .... beautiful place of devotes, infrastructure well designed,  There is a river flowing near this temple.Sai Bab bless everyone always.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I remember when I was living near of Sai mandir i used to go here at evening time it's feels like so much peaceful arena i never found anywhere else, most beautiful things you can see here, everyday pandit ji do worship and changing the dress of idol of Sai, in the morning and in evening time when they sing arati and play Bhajan it's feels so peaceful, and near you can find jeera Nadi and overbridge",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is the famouse Sai Baba Temple of Bargarh. It is situated 2000meter ahead of Bhatli chowk and this place is very clean and beautiful. A small park is there and a Bhaban is there to organise different types of ceremoney like marriage,party,Badu and so on. Everyday 6pm on evening Aarti is given to Baba and for this so many people are visited there. Specially you find more people on Thursday. This day aftre puja a voga also given to all people present there or going for puja there. Sai Baba Birthday is also celebreat here every year and this is a very famouse and well known place of Bargarh city.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful Place right there 👏👏👏👏🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Go during evening time nd you will get peace nd evening arti nd tranquility which is missing in Bargarh Town.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kailashgiri of Bargarh",
      "rating": 4.9,
      "address": "8JCH+93V, College, in front of Panchayat, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "To be completed soon .A must visit place",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Baba Baidyanath Shiva Mandir, Deogan",
      "rating": 4.4,
      "address": "9H5H+J9W, Bargarh Canal Road, Turunga, Odisha 768038, India",
      "reviews": [
        {
          "text": "Beautiful natural environment. Really peaceful 😊",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Completely at natural environment surrounding with green lusty outfield public transport is lacking.self arrangement is best.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best atmosphere",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It come under ashta sambhu. Temples of God Shiva of United Sambalpur district. It is at deogaon in Bargarh district.Famous for lord shiva temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best for family occasion",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "I Love BARGARH",
      "rating": 4.3,
      "address": "Biju Babu Chowk, Bus Stop, Bargarh Rd, Bargarh, Odisha 768028, India",
      "reviews": [
        {
          "text": "As an inhabitant of Bargarh district I have seen this place it symbolises that we the people of Bargarh love it, respect it, honor it and always want to keep our region,district safe, clean, neat it is not only a written but a concern for everyone to represent Bargarh's environment,its people,geography, land to other districts and become a typical for other districts too I ❤️❤️❤️Bargarh not by mouth only but by actions, works,responsibilities thank you 👍❤️",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Never maintained well. City Roads Dusty and stinked. Never repaired or maintained. Roadside Drains are open and dangerous and full of waste. Cleaning and Traffic and Driving is worst.\n-Never seen Traffic control. During famous Dhanuyatra, only put some funky lights.\nRoads and cleanliness and crowd control is worst ever seen.\n--A kind 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏Request to the responsible Organisation and Persons; Please make it like part of proud India.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful place 😍 just love it",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Visit after 9 or 10 PM, you will love it.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent knowledge of stock market analysis technical trader",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}