{
  "places_with_reviews": [
    {
      "name": "Taj Mahal",
      "rating": 4.6,
      "address": "Dharmapuri, Forest Colony, Tajganj, Agra, Uttar Pradesh 282001, India",
      "reviews": [
        {
          "text": "It's a beautiful place and a beautiful structure. The view of yamuna is amazing on the backside, properly maintained and garden view is also great. A must visit place with friends or family. Just one thing which was not okay that washrooms are not properly maintained other than that it's a great area and great place. I really enjoyed being there 👍🏻",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Don't hire photographers and guides. Service not good.\nThey'll eat your money.\nInstead take your own camera.\nPeta sweet is very famous here  but again bargain. Ask rates in 3-4 shops and then buy.\nOf course an iconic place. Enjoy",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is just phenomenal when you look up-front...... It is even more beautiful when you look up close. The pictures can never define it's beauty. It is truly one hell of a wonder.... And we went at the golden hour .... The sunset made it look even more magnificent....\n\nPs: Don't visit on Friday as it remains closed on Fridays",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited my first ‘7th Wonder of The World’ and I was absolutely blown away by how beautiful it was. We had a guide who was very knowledgeable about all aspects.\nThere are a lot of vendors who try to sell you items which are probably not authentic.\nDon’t fall for the photographers too who will charge you an arm and a leg.\nA must see!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "the one of the wonder monuments which we must visit at least once in our life. It's truly a world wonder. Try to visit at opening time , so we can avoid being too crowded and have a peaceful atmosphere.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Agra Fort",
      "rating": 4.5,
      "address": "Agra Fort, Rakabganj, Agra, Uttar Pradesh 282003, India",
      "reviews": [
        {
          "text": "The Agra Fort is a must-visit for its rich history, stunning architecture, and cultural significance. It offers a glimpse into India's heritage with its intricate designs, museums, and captivating sound and light show. Accessible and informative, it's an ideal destination for history and architecture enthusiasts alike.\nOverall Clean and beautiful place.\nThere will be crowd while purchasing tickets, but still worth to wait , as when you get inside you will be pleased.\nA must-visit for history enthusiasts, architecture lovers, and anyone interested in exploring India's cultural heritage and also it is easily accessible by public transport and offers guided tours for visitors. It has facilities like information centers, restrooms, and souvenir shops, making the visit convenient and informative.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Agra Fort! It's absolutely amazing! The architecture is stunning, and the history behind it is so fascinating. I loved exploring the different palaces and courtyards. It's definitely a must-visit if you're in Agra! 🏰✨",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the famous tourist attractions of Agra, The Agra Fort is a masterpiece of its own. Made up of red stone, this place is huge.\n\nProbably the best time to visit Agra fort is in the winter/Rainy season.\n\nAgra being hot, you will not be able to enjoy this gem of a place.\n\nBuy tickets online to avoid the queue and carry a water bottle or 2 because it is huge and might take you 3-4 hours just to see this place.\n\nParking facility was also available nearby",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This landmark is a must-visit spot. You can catch a glimpse of the Taj Mahal from the windows of this fort. The greenery is well maintained, but remember to bring your sunscreen, caps, and sunglasses as it's all outdoor exploration.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "An absolute must visit, you can walk around all day and enjoy the different sights. Unique architecture, lots of details and so much to see. I recommend really taking your time here and investigating every corner. There are plenty of great picture opportunities as well. Play with the squirrels as well!",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Taj Mahal Agra Tour Guide (Govt. approved) English & German family",
      "rating": 4.5,
      "address": "Dharmapuri, Nai basti, Tajganj, Agra, Uttar Pradesh 282001, India",
      "reviews": [
        {
          "text": "Beautiful monuments! Incredibley a must visit place if you want to enjoy beautiful marbles architecture. Situated near yamuna river makes this place more enjoyable. It's a wonderful one of the 7 wonders of the world so it's always been memorable to visit Taj Mahal. Always been crowded. One can easily spent 3-4 hours here enjoying the architecture. Online tickets are also available. Agra is lucky to have Taj Mahal.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A perfect afternoon with a perfect guide! We wanted to go in the morning to see the sunrise, but he advised against it because of the fog. We decided to take him on his word and go in the afternoon. Whe where so happy that we went in the afternoon! The whole day it was foggy, right up until an hour before our trip to the Taj Mahal. We had beautiful sunshine the whole time there.\nHe was patiently the whole time if we wanted to take pictures and explained us about the Taj Mahal whenever we where walking if we felt like it. Could not ask for a better guide!!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It was nice experience while touring  Tejo mahalaya.\n\nThe theories have been widely discussed on internet forums for several years but most discussions centre their arguments around Oak’s theory. His theory says Taj Mahal was most likely built by Hindu ruler Jai Singh I, and the Taj Mahal was actually a Shiva Temple and Rajput royal palace named Tejo Mahalaya. It was captured by Shah Jahan and then turned into a tomb and as renamed Taj Mahal, he claimed.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place. It is one of the seven wonders of world. Wheelchair is allowed. One should book online tickets .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I came on October. It was really hot. I came on week day so it wasn't so crowded. You have to walk to the gate and going through security check. Don't bring any food because they will throw it away. There are few types of ticket, if you want to go inside the Taj Mahal or visit the museum, you should pay more money.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Gurudwara Guru Ka Taal",
      "rating": 4.7,
      "address": "Chennai - Delhi Hwy, Maharishi Puram Colony, Agra, Uttar Pradesh 282007, India",
      "reviews": [
        {
          "text": "Gurudwara Guru Ka Taal in Agra is a serene and spiritually uplifting place. The architecture is simply beautiful, with its tranquil surroundings adding to its charm. The history and significance tied to this Gurudwara make it a must-visit for anyone interested in Sikh heritage. Stepping inside, you're greeted by a sense of peace and devotion. The community kitchen (langar) serving free meals to visitors is a heartwarming tradition that showcases the Sikh principle of selfless service.\n\nIt's a place where spirituality and humanity come together, offering a memorable and soulful experience for all who visit.\n\nYou Should Definitely visit here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I visited this place with my family. This is a historical place with amazing architecture. Inside you can find peace and this is a place for spiritual rejuvenation. It remains a must-visit place for people of all faiths seeking a uplifting experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This historical Gurdwara boasts exquisite architecture complemented by serene gardens. Additionally, it offers accommodation and Langar facilities, providing a tranquil and spiritually uplifting experience for visitors. Convenient parking is available, and its proximity to the Agra ISBT adds to its accessibility.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a historical pilgrimage site for the Sikh faith, dedicated to the martyrdom of the 9th Guru, Sri Guru Tegh Bahadur Ji. It is located next door to Sikandra in Agra.\nIt is build at the place where the Guru voluntarily got himself arrested (and was martyred) by Aurangzeb's forces, for the sake of freedom to practise one's faith.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Gurudwara Guru ka Taal is a charan chow ,historical place whereby Shri Guru Tegh Bahadur ji came from Anandpur Sahib at the behest of his nine year old son,Gobind Rai(Shri Guru Gobind Singh ji)for saving the Hindus from the atrocities of Aurangzeb,the Mughal emperor who was forcing them to convert to Islam.Shri Guru Tegh Bahadur ji offered his voluntary arrest from this very place and post several discussions and refusal of  offers of alms ,riches,power,land etc.by Aurangzeb,Guru Saab was kept in a dungeon(Tahkhanna) now known as 'Bhaura Sahib' for nine days before being taken to Delhi for Shahidi.This Place was also visited by Guru Nanak Dev ji,Guru Hargobind Singh ji (6th Guru) and Guru Gobind Singh ji.\nClose by,is Gurudwara Manji Sahib within the vicinity.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Itmad-ud-Daula",
      "rating": 4.4,
      "address": "Moti Bagh, Agra, Uttar Pradesh 282006, India",
      "reviews": [
        {
          "text": "Itmad-ud-Daulla in Agra, known as \"Mini Taj Mahal,\" is a small gem. Its detailed architecture rivals the Taj Mahal. The calm atmosphere and history make it a must-visit.\nThis hidden treasure gives an intimate experience, perfect for those who want Mughal splendor on a smaller scale. A delightful addition to the Agra itinerary.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Short quick visit, but worth it. You can see some great symmetry, and take some. Great pictures to be taken. Pro Tip: You can take some cool pictures through the stars and the shapes on the windows, just have the person stand on the opposite side and focus your camera through the whole. Check out my example picture which is attached.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Itimad-ud-Daulah, otherwise known as the Baby Taj was very good for gentle scroll.\n\nThis was the first Mughal tomb to be built entirely of marble. Gentle walk  by a large garden make you think about both mouseleums.\n\nBaby Taj was built by Nur Jahan and completed the construction of the building of the Tomb of her father in 1628 AD, nearly 7 years after his death.\n\nTaj Mahal was built in period of 1632 to 1648.\nShah Jahan's favorite wife, Mumtaz Mahal, was the niece of Nur Jahan,. Mumtaz Mahal. died suddenly in 1631, after giving birth to the couple's fourteenth child. She is buried today directly under the center of the great dome of the Taj Mahal. in her memory by her deeply grieving husband.\n\nHmmm.....makes you think.......\nDefinitely worth visiting.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "To be honest I found this to me more ornate and exotic compared to the Taj Mahal. This has great examples of geometric pattern ornate inlays. Do miss this gem .\nThis one one of the main highlights for me in Agra.\nFollow me for travel tips on Insta @shivoham.08",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Taj Mahal was inspired by Itmad-ud-daula , 30rs ticket. Along with the main building, the structure consists of numerous outbuildings and gardens. The tomb, built between 1622 and 1628, represents a transition between the first phase of monumental Mughal architecture primarily built from red sandstone with marble decorations, as in Humayun's Tomb in Delhi and Akbar's tomb in Sikandra – to its second phase, based on white marble . Located on the eastern bank of the Yamuna River, the mausoleum is set in a large cruciform garden criss-crossed by water courses and walkways.\nThe tomb is a must visit , less crowded, parking facilities available.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Tajmahal Eastern Gate Parking",
      "rating": 4.4,
      "address": "5383+G66, Telipara, Tajganj, Agra, Dhandhupura, Uttar Pradesh 282001, India",
      "reviews": [
        {
          "text": "It's always a pleasure to visit one of 7 wonders of the world! I could almost spend the entire day admiring the architecture!\nFor people visiting first time it's advisable to have a official guide to take you around. Beware of what you are allowed to carry inside.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's about 1.5Km away from Taj Eastern Gate entry but after walking about 150 meter on can get Gold Cart upto Taj Eastern Gate and they charge 20/- per person. One can easily walk also from this place.\n\nOn weekends this parking is overcrowded though there is sufficient space available. On weekends try to visit as early as possible to avoid crowd.\n\nParking charge is Rs 100/- for cars",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Paintings on the wall are the main highlight. This area is an army cantonment area as you can tell. The roads are well made. Although the street lights can be improved",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Taj Mahal's timeless beauty is truly captivating. Its majestic presence and intricate details are irresistibly attractive, making it a magnetic force for anyone seeking architectural marvels. A visit to the Taj is an enchanting experience, leaving a lasting allure that beckons you back in your thoughts.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Taj is the one of the seven wonders in this world. You must visit this place at least once in your life. It's a cemetery of the Mumtaj most beloved begum of badsah Sahjahan.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Tomb of Akbar",
      "rating": 4.4,
      "address": "Tomb of Akbar The Great Area, Sikandra, Agra, Uttar Pradesh 282007, India",
      "reviews": [
        {
          "text": "Excellent red sandstone architecture. One can find the symmetrical architecture in all Mughal period architecture. 1\n* 1-2 hour are more than sufficient for the visit\n* in the evening it was crowded but was appearing very pleasant.\n* one can easily reach it as all public transports are easily available up-to this place. Just go to sikandara and from there it's just in the walking distance.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A giant monument, quite beautiful with lots of greenery. Built in Indo Mughal style this tomb is a perfect example of Hindu and Islamic fusion architecture. Red stone+ white marble this combination gives a different aesthetic look. Totally photogenic place especially for Instagram.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The tomb for Akbar was envisioned  by himself in 1605.\nIt is a huge five-story structure and is designed combining Islamic, Buddhist and Rajasthani architectural elements. One of the highlights of the complex, apart from the tomb, is the courtyard which is covered with quadrilateral gardens.\nFour floors of the tomb structure, made during Akbar's time, are of red sandstone whereas the fifth one was completed in marble by his son Jahangir.\nThe arched entrance gate of the main tomb comprises the 99 names of Allah in Arabic.\nIntricate inlays of marble, verses from the holy book Quran and stone carvings contribute to the design on the interior walls. An architectural masterpiece.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ok for the first time visitors. If you are expecting it to be very beautiful lower down your expectations. It is again the common mughal architecture built here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Today I visited there,this is so beautiful place in agra,there are visit many foreigner.this tomb is contributed to Akbar.there is i realise that it old is gold .",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Red Fort of Agra",
      "rating": 4.7,
      "address": "52HC+VFH, Agra Fort, Rakabganj, Agra, Uttar Pradesh 282003, India",
      "reviews": [
        {
          "text": "A building with hundreds of years of history. We were fortunate enough to have a guide that explained what each part of the complex was used for and I would really  recommend this to enjoy the experience fully with context behind each area. Big variations in the architecture between father and son. In particular the transition from red sandstone to white marble",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Agra Red Fort has so much history and is such an incredible place. You can see the Taj Mahal from here and it is really spectacular. I would definitely recommend making this a stop on your travels as it is just incredible.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Red fort of Agra is recognized as one of the World’s Heritage sites by UNESCO. It was the main residential palace for the emperors of Mughal Dynasty. It has seventy feet high walls and had been built in 94 acres of area . Some areas were still under renovation but it was worth visiting.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Red Fort of Agra is important historical monument. It was built by Akbar and this inspired the Red Fort of Delhi. As the name suggests the fort is made of red sandstone. The fort is surrounded by a moat. The fort was divided into palaces of Akbar, Jehangir and Shah Jehan. The Diwan i Khas does not have a throne like the one at Delhi, but it still has much of the inlay work in the upper section. There are wonderfully carved marble water fountains in most of the inner chambers of the fort. Definitely worth a visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Red Fort in Delhi is very similar to Agra Fort, both have the same Mughal architecture, structure, nomenclature etc. Agra Fort is better preserved, and more accessible (as large parts of Red Fort are held by the Indian Army). Fort in Agra is much better then fort at Delhi.\n\nEmperor Shah Jahan commissioned construction of the Red Fort on 12 May 1638, when he decided to shift his capital from Agra to Delhi. Originally red and white, Shah Jahan's favourite colours, its design is credited to architect Ustad Ahmad Lahori, who also constructed the Taj Mahal.\nIt Was Originally White In Colour. ...\nIt Is A World Heritage Site. ...\nKoh-i-Noor Diamond Belonged To The Fort's Royal Family. ...\nThe Entrance Of The Fort Is Called Lahori Gate. ...\nThe Rang Mahal Is Situated In The Premises Of The Fort. ...\nIts Original Name Was Qila-E-Mubarak",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Khatu Shyam Mandir",
      "rating": 4.6,
      "address": "28/256, Pathwari, Belanganj, Civil Lines, Agra, Uttar Pradesh 282001, India",
      "reviews": [
        {
          "text": "Jai Shree Khatu Shayam ji….very peaceful place to visit with family & friends…this temple is situated in Belanganj Agra….",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jai shri shyam 🙏 i think everyone will once go there.\nAnd love this temple, love khatu shyam. Their everyday poshak of flowers just mesmerize your eyes.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is realy great with beautiful designs all over and peaceful and soothing ambience\nThe fact that they did not allow lighting deepaks inside is also great\nThe only major issue is it is on the midst of a very busy marked and that too on a very narrow road without even parking area This results in a lot of chaos and spoils the whole mood of peace\nFinding a place to leave your vehicle even two wheeler is a  hectic task\nThe temple is also the major reason of hindrance in the path of traffic flow",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best temple of hindu of khatu shyam  a character of Mahabharat.\nMemory making place . At least visit one time",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Here all wish completed and it's 👍 great place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Mankameshwar Temple, Agra",
      "rating": 4.7,
      "address": "Daresi Rd, Rawatpara, Sheb Bazar, Mantola, Agra, Uttar Pradesh 282003, India",
      "reviews": [
        {
          "text": "Located near the Fort railway station, Agra, Shri Mankameshwar Mandir is one of the most famous and most visited places of worship. Lord Shiva is the presiding deity at the temple, which attracts devotees from all over the country. This temple is believed to be one of the oldest temples in the city.\nThe temple is known for its beautiful architecture and intricate carvings that depict various scenes from Hindu mythology. The temple is a popular pilgrimage site for the devotees of Lord Shiva.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai Mankameshwar Mandir 🙏🏼\nHar Har Mahadev 🙏🏼🖤\nThis Mankameshwar Temple is one of the popular and ancient temples in agra located at Rawatpara, behind Agra Fort Railway Station...\nLots of devotees come here to worship lord shiva.\nWhile entering the temple, the first thing you will see is Shivalinga and After going further, you will see more statues of Gods.\nThe temple is very nice and the taste of the prasad is also very good, I like the prasad very much. 😍❤️\n\nOverall my experience was very nice..❤️\nFollow me to get well updates about places. 🤗",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I would like to say to all the Sanatani brothers and sisters that these temples are very good but do not have that much name. So henceforth, whenever you go to Agra, this temple is barely 1.5 kilometers away from Agra Fort Junction. Before visiting Taj Mahal, definitely visit this temple once.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is an ancient Hindu temple dedicated to lord Shiva. Reaching there in working hours can be a little difficult by your own vehicle as temple road is a busy market place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One the ancient Shiva temples of agra. This temple is usually very crowded on Monday mornings. Please avoid keeping wallets and valuables while visiting the place.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}