{
  "places_with_reviews": [
    {
      "name": "Panchalingeswar Temple",
      "rating": 4.4,
      "address": "WPHR+4H8, Ward Number 24, Kalikapur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "Panchalingeswar Temple is in Balasore district of Odisha, India. Panch means \"FIVE\" and lingeswar means \"LORD SHIVA\" . It named after the five Shivalinga that are enshrined inside . The temple is on top of a hillock near the Nilagiri hill. The Shivalingas are said to have been enshrined by Sita, the wife of Lord Rama during their exile. Another story holds that King Banasura worshiped the Swayambhu Lingas at this place given its beauty. A perennial stream, which is the main attraction of the area, regularly washes the Shivalingas as it flows over them. To reach to the temple one has to lie flat on the rock parallel to the stream to touch and worship the lingas inside the water stream.\n\nHow to Reach :\n\nBy Air\nThe Nearest airport is at Bhubaneshwar ( 200km )\n\nBy Train\nThe nearest railway station is Balasore (30 km) which is well connected to all major cities.\n\nBy Road\nPanchalingeswar is well connected by road. A number of Public Transport , i.e. Buses,Taxi are running from Balasore Town to Panchalingeswar daily. It is 30 KM away from Balasore Town.\n\nCurrently it is not allowed to touch the Lingas only you can watch the steam.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Panchalingeswar temple is famous for five hidden shivalinga.. These Five lingas are hidden in a small cave like structure and covered by water. Also a beautiful waterfall is there which is running over these five temple.. These Five lingas are situated on a mountain so some stairs have to claim to reach there.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place for picnic\nLots of shops\n350 stairs\nIf you planning for 1 day tour.. go for it.. add Emani Jagannath temple to complete your day 🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Five Shivalinga is there enrished inside. It is situated in Balasore district of Odisha in the top of the Nilagiri Hills.\nYou can enjoy the view of Nilagiri hills also.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is not Panchalingeswar Temple. It's Pancheswar Temple. The pics are fake. Panchalingeswar Temple situated in Balasore not in Baripada 😅. First I'm shocked 😯 that there's a Panchalingeswar Temple in Baripada. It's 800mtr from Baripada Railway station. I went there and I found that it's a small temple called Pancheswar Temple and the images are belongs to Panchalingeswar Temple, Balasore. 🤣 It's a scam and who the hell did this 😡 ? Please report this place to help others that others will not waste there time.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Jagannatha Temple, Baripada",
      "rating": 4.7,
      "address": "WPHF+QGG, Huduco Colony, Bhanjpur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "A very calm and peaceful place .  You can see the old ancient spiritual formation of lord Vishnu. Sculptures and drawings of religious incidents are Inside the core temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Take yourself to a divine journey with the blessings of lord Jagannath. People often come here to attend Aarti and perform meditation.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Baripada Jagannath Temple is an epitome of divine beauty and spiritual bliss! The intricate architecture, vibrant ambiance, and rich cultural heritage make it a must-visit destination. The temple's serene atmosphere fosters a deep sense of peace and tranquility. The priests and staff are welcoming, providing insightful guidance on rituals and traditions. Witnessing the grandeur of the Rath Yatra is an awe-inspiring experience. The temple's commitment to preserving age-old traditions is commendable. I left the temple with a renewed sense of devotion and a heart filled with joy. Baripada Jagannath Temple is a treasure trove of spirituality that must be explored by every seeker. 🙏🕉️ #BaripadaJagannathTemple #DivineBliss",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the second jagannath Dham of Odisha 😍🙏🙏🙏\nOne gets lots of self satisfaction by going and sitting here.\nWhen you come inside the temple you feel religious because of the holy surrounding.\nThough there is a big rush for the darsan of the Lord, it is worth and you feel satisfied.The evening ritual of replacing the flag atop the temple is great to watch.I feel some sort of sitting arrangement may be provided to the pilgrims to see the proceedings comfortably.Anyway it is a lifetime experience to be inside the temple for few hours.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Mayurbhanj in odisha is a devine place to visit definitely due to the presence of second Puri of odisha is called as baripada which is a land of Sri Mahabrabu jagannath temple. It's a place of each and every devotee to visit the temple of Sri Jagannath , subhadra, and balabadra . Every year once conducted Ratha Yatra which is a auspicious day to participate . There is no ticket to purchase and absolutely free darshan can be available . The statue of Sri Jagannath Swami is just awesome and mostly feel a magical moments in your life 🙏.\nBola jai jagannath Swami ki Jai.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Palbani Square",
      "rating": 4.2,
      "address": "Palbani, Labuor Colony, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "The winter morning view of Palbani Square is very cold and mesmerizing.\nIt's a clean and pleasant.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Yes it's actually best place during the dashera.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "An important square towards Balasore /Bhubaneswar  from Baripada town. A small Marketplace.  Buses towards Bhubaneswar  / Jaleswar pass through this square. Public waiting shed is not available  towards  Bhubaneswar side.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "When did you visit fastival of Durga maa Puja",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "You catch balasore line bus and also catch chitrada line bus here",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "The Belgadia Palace",
      "rating": 4.5,
      "address": "Meher Colony, Baripada, Odisha 757002, India",
      "reviews": [
        {
          "text": "Palace is extremely beautiful and gorgeous. Great location too. Numerous photo spots. Great staff behaviour. Food was delicious, aptly proportioned and served well. We went for our anniversary trip and they organised a cultural show for us.\nBut we didn't like our room, as it was very small. Bathroom is so small that you can't move at all. Dokra room is overly priced. If money is not a concern then Suites are great option.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Belgadia Palace in the most beautiful place to visit in Baripada.\nIt's location, Architecture, design Services and room was so laxury.\nAll are recommended to visit once.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nestled amidst a lush green backdrop of rolling hills and sparkling waterfalls of the rich and diverse Eastern-Indian countryside is The Belgadia Palace. An 18th century victorian brick-built double-storey structure in the classical Western style of Doric-Corinthian column, a mixture of Greek and Victorian architecture. Guests have praised the property's serene ambiance and lush green surroundings. The staff is polite, helpful, and provides personalized care. The property promotes local culture and handmade products.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Amazing experience. Great rooms the whole place gives a sense of royalty feeling, great cultural event, bonfire and top it all amazing amazing food. Staff were great and courteous. Loved it",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A very beautiful, heritage, monumental palace to visit and dine, brings feelings of royal treatment, a place to stay and visit atleast once.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Maa Ambika Temple",
      "rating": 4.8,
      "address": "Ambica Mandir, Badabazar, Bhanjpur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "People of Baripada and the neighboring places in the district of Mayurbhanj hold Maa Ambika, the presiding deity of Ambika Temple in great awe and devotion. They swear by her literally. The temple is a small one unlike the imposing Jagannath Temple of Baripada and other famous temples of Odisha. Its outer walls are painted in gorgeous colors and the temple complex is quite moderate in size. The interior walls display paintings depicting stories of mythological themes.\n\nThe temple is surrounded by many stalls selling prasad, flowers and incense. The official one near the temple main gate sells good khuas and pedas for prasad,.and ghee smeared earthen lamps.\n\nAmbika, the goddess has four arms, each holding a dreaded weapon. She is the incarnation of Goddess Durga. As is the practice in all Durga temples, there is also a temple dedicated to Lord Shiva inside the compound.\n\nMorning and evening Aaratis are elaborate and are well attended. Devotional songs are sung during these times. One can order Anna Prasad in case of a manasika or promise of an offering made earlier. The food is cooked in the temple kitchen before it is offered to the deity before being partaken by family and friends of the devotee.\n\nThe modern temple is located less than one km from Jagannath temple and King's palace and slightly above one km from the private bus stand of Baripada. There used to be animal sacrifices in the temple complex earlier. Do not have the latest status on that.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I am not religious but I feel peaceful when in this tample. My father used to pray here would talk about the olden times and what this tample was when I was a child. I hope everyone visit this temple even if you are not religious yourself 🙏🏻",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is Maa Ambika temple... Situated in the city of Baripada..\nShe is adhisthatri devi of Mayurbhanj.\n\nSpeechless... You cannot explain your maa... You only can feel her love care and présence\n.... She is our maa every time with us... Maa keep your blessings with everyone 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "All the old residents and devotees of India Baripada who have faith in Maa Ambika, everyone says to Goddess Ambika that Mata Ambika is very old means she has not even been born. Meaning his generation after generation his father is older than him. His father was the king who was ruling in Maharaja Mayurbhanj. The king of Mayurbhanj had come to Mata Rani and built a temple and established it there.  Since then it has been about one and a half hundred and two hundred years to worship here. Here all the devotees would have accomplished all the work by calling the goddess with reverence.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This place is good for worshipping and you can see the Devi directly without any hinder.. Even offer pushpanjali at your convinience as panditji is\nalways available..",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Dargadahi Square",
      "rating": 4.2,
      "address": "WPRW+6M3, Dargadahi, Noble Colony, Raghunathpur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "\"A Few Relations In Earth Never Dies”,\nTake first Letter From Each Word to Get,\nThe Word That you Mean to Me,\nThanks For Being The Best.\n\nDo you Need A Face – Lift There One That’s Free,\nAlways Handy,\nMakes You Look Younger And Has No,\nUndesirable Side Effects?\nIt’s Called A Smile Keep Smiling Always",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Amazing place for food",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "As a resident of this area I love darogadahi",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's is a in baripada for all the education institutions.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Similipal National park Toursim",
      "rating": 4.8,
      "address": "Takatpur, Baripada, Odisha 757107, India",
      "reviews": [
        {
          "text": "Nice place with nature beauty",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Good but you can see barely a 🐯",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The entire forest area is so beautiful with strikingly amazing flora and fauna...has to be visited to experience..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Wearing a full tight underwear is a must for bathing before water makes embarrassing",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Wonderful place scenario",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Takatpur Square(ତକତପୁର ଛକ)",
      "rating": 4.4,
      "address": "WPJW+QJX, NH18, Takatpur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "Well connected with road\nWide space transportation easily available",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Busy place because of all hostel and College students.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a Educational area, There only live more student, as well as Teacher, lecture ect. The place is also neet and clean.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice campus.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Takatpur square is connecting towards University,MPC Outonomus college, Mayurbhanj Law college etc",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Jagannath Temple",
      "rating": 4.7,
      "address": "WPMX+CR5, Takatpur, Baripada, Odisha 757001, India",
      "reviews": [
        {
          "text": "Second largest jagannath template,like Puri every puja and Prasad are same ...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Baripada jagannath temple\nNice place\nMind fresh place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jagannath Temple, Baripada is 2nd Largest Jagannath Temple in Odisha. also Known as North Odisha Puri",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Baripada is famous for its natural beauty. But most of the people don't know that this place play a vital role for Ratha Yatra. But the ratha Yatra celebrated the next day of Puri ratha Yatra. There is a speciality that Maa Subhadra Rath.Mainly pulled by women only. That's why lakhs of women gathered here to celebrate ratha Yatra. There is no discrimination and conflict among people. All are gathered and maintaining a brotherhood relationship. That is the beauty of Baripada . I love the place most.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This isthe Place where you get peace 🕊️☮️😌\nWhere the almighty God Lord Jagannath live.💖🙏\nHe is the glory of Odisha.\nThe First Sri khatra is Puri, and the second Sri khatra is Baripada's Bada deula❤️🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Murgabadi Square",
      "rating": 4.4,
      "address": "XP4R+CHJ, Ward No.3, Sai Niketan, Baripada, Odisha 757002, India",
      "reviews": [
        {
          "text": "Murgabadi Square is a bustling and vibrant rotary that serves as a vital connection point between NHAI (National Highway Authority of India) and an overbridge. Nestled in the heart of the city, this lively square is known for its diverse range of vendors, small fruit shops, and fast food outlets, creating a lively and bustling atmosphere that attracts locals and visitors alike.\n\nOne of the notable features of Murgabadi Square is the convenience it offers for commuters. The rotary serves as a significant junction, providing easy access to the NHAI and the overbridge, allowing for smooth and efficient transportation flow. This accessibility makes it a popular spot for travelers passing through the area, providing a convenient stopover for refreshments and a quick bite to eat.\n\nThe square is also home to a variety of vendors and small fruit shops, adding to its vibrant and bustling atmosphere. These vendors offer an assortment of goods, ranging from fresh fruits and vegetables to everyday essentials. It's a wonderful place to immerse yourself in the local culture, interact with friendly vendors, and explore the diverse array of products on display.\n\nAdditionally, Murgabadi Square is a food lover's paradise, with several fast food shops and eateries located under the overbridge. From mouthwatering street food delicacies to quick snacks and refreshing beverages, there is something to satisfy every palate. Whether you're in the mood for local specialties or international cuisine, you'll find a variety of options to choose from.\n\nThe ambiance of Murgabadi Square is vibrant and energetic. The sounds of bustling activity, the aroma of street food wafting through the air, and the colorful display of goods create a captivating sensory experience. The square is a lively hub of social interaction, where locals and visitors mingle, creating a sense of community and camaraderie.\n\nWhile the square offers a delightful experience, it's important to note that during peak hours, it can get quite crowded. However, this only adds to the vibrant atmosphere and adds a sense of liveliness to the surroundings.\n\nOverall, Murgabadi Square is a vibrant and bustling rotary that not only serves as a crucial transportation junction but also offers a plethora of culinary delights and shopping opportunities. Whether you're passing through the area or looking to explore the local culture, this lively square is a must-visit. Immerse yourself in the sights, sounds, and flavors of Murgabadi Square, and enjoy a memorable experience that captures the essence of the city.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Just like a wowwww😂😂😂😂",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place 👌",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Fantastic. Connect direction to 3 states Odisha, West Bengal, Jharkhand",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}