{
  "places_with_reviews": [
    {
      "name": "Viratra Vankal Mata Temple",
      "rating": 4.6,
      "address": "Agrawal Bhawan ki gali backside of National Handloom, P9WV+GW9, near Sagar Hospital, Kothwali, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Scared place...very neat and clean..on the top of the hill the magnificent view of Thar desert can be seen.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple is situated in Tehsil Chohtan of Barmer, this temple is mother Viratra Vankal Mata, there is arrangement for the passengers to sit and sleep and there are many scenic temples and the mountains here are very beautiful, there is arrangement for food.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place tp visit in hear of Aravalli parvatmala",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I enjoyed it too very much... It's something very mesmerizing..... Cannot take my eyes of it, such a beautiful architecture.. mountains.. too beautiful to be discribed👌👌💞🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Place where I find the Indian Vulture which is near the viratra mata temple in the hills. Through trekking I reached the top of the hills so where you can see all the  hills and biodiversity.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mahaveer Park Selfie Point",
      "rating": 4.2,
      "address": "Inside Mahaveer Park, Q93X+78X, Madhuban Colony, P S Parisar Colony, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Small & beautiful garden  in barmer city well maintained toy train is good for children's. Mini Toy train service for children's is pocket friendly cost only 10 rupees per child till 9 years old child.Administration should be strict for adults those who are playing cards in public places where children, families coming for little atmosphere change but absolute disappointed due to adult groups retired persons groups playing cards in public places which feels awkward for families.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A very nice park for kids. Slides and other swings available here. The toy train is there which charges Rs 50. Trees and plants there bring serenity in this park which gives relaxation and enjoyment with family. Selfie point is there with ' I love Barmer'. Gym related equipment installed for warm-ups. Outside you will get refreshments of sugarcane juice, paani puri and other snacks.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "There is no cleanliness and the water fountain is running low  There is nothing here except garbage, paan picks are spit everywhere. @nagar parisad Barmer",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice Park .. There Are Jhula For Kids..\nThere Are Grass On The Backside Of Park..\nAnd Also Grass In Front Side..\nThere Were Fountain 2-3 Years Ago..But Now No Fountain..\nVery Good Park For Walkers And Joggers..\nWomen's Used To Come here.. Because It Is In The Middle Of The City.. And It Is Safe Till 10 Pm",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Mahaveer park naturally managed and many flowers and plant 🌱 growed in the park here a selfie point where many people take selfie and enjoying ❤❤ there day...........\nMany instruments for playing and gym.........\nAt the early morning and night 🌙⏰💤💤 time many peoples gathering there and enjoying ❤❤❤❤....",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Chotan",
      "rating": 3.2,
      "address": "Q92W+VM3, Madhuban Colony, Railway Colony, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Harji Ram",
          "languageCode": "en-US",
          "rating": 3.2
        },
        {
          "text": "Choton",
          "languageCode": "en-US",
          "rating": 3.2
        }
      ]
    },
    {
      "name": "Jogmaya Temple",
      "rating": 4.7,
      "address": "Azad Chowk, Jogiyon ka Vass, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "1) It's a temple of jogmaya mata.\n2) It's a second highest temple in Barmer, after sujesvar temple (temple of shiv bhagwan).\n3) I got peace of mind after reaching this temple, you would also get.\n4) I got the whole view of Barmer at the top of this temple.\n5) Facility of drinking water was also available.\n6) I got Prasad nearby to temple.\n\n************************",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Barmer Fort occupies an unrivalled place as Rajasthan’s oldest fort. Located on a steep hill, this fort was built by Rawat Bhima in 1552 AD after he moved to this place from Juna. The hill over which the fort is located is as high as 1383 feet. However, Rawat Bhima got Barmer Garh established at a height of 676 feet to make it safer. The road to the fort is quite narrow; nonetheless, it offers rewarding sights of the region.\nThe main entrance gate of Barmer Fort is from north gate, whereas the safety walls are made towards the east and west gate. Next to the fort is Jogmaya Devi temple which is also known as Garh Mandir. Another shrine located on the same hill is Nagnechi Mata Mandir. Both the temples exude peace and positive vibes, and a mela is held every year at these shrines during the nine holy nights of Navratri. A nominal fee has to be paid to reach Barmer Garh.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Whenever I Come too barmer I everyday visit this temple In the early morning you will find your inner Peace here the temple have A very peaceful environment\nJay Maa Hinglaj Jay Maa Vankal",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Just wonderful place with a lot of peace",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "its more than just a place, heaven.. decades passed but everytime we visit here the freshnen and calm place nearby. the peak of it sees whole barmer at glance 💜",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Naganaray Temple",
      "rating": 4.7,
      "address": "Q98V+WPV, Hinglaj Nagar, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Beautiful and very clean area.....",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good 👍👍👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Devotional peacefully place for our soul",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🚩🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Jasder Dham Park",
      "rating": 4.4,
      "address": "QCFH+68C, Magra, Barmer Magra, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "This is the first time I'm visiting this temple of lord Siva.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Amazing palce nearby Barmer city area.\nThis place is so soulful and peaceful.\nAnd one thing is also fascinating that's greenery around here. And the small pond is also very awesome. You can find a lot off lotas in mid water. here's a temple and a garden also. So this place is perfect for family picnic and hangout with friends.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Its a hidden treasure in Barmer. It is unbelievable to find such a beautiful pond filled with lotus and variety of fish in Barmer. People often visit here performing rituals, feed the fish in the pond or to enjoy the sunset view from here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jasder dham is situated on badmer jodhpur highway near dto office badmer. hare built many temples but main temple is of lord shiva. here a big pond also.number of fishes,bagulas, lives here. there is a park also. peaple visit there for worship lord shiva. and enjoying in park. this is a good picnic spot near barmer city.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Park is well maintained and can enjoy in this summer season",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Chamunda Mata Mandir",
      "rating": 4.5,
      "address": "Chamunda Chauraha, NH-15, Shastri Nagar, Barmer, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The only temple in barmer which is around is surrounded by dirty water whole year\n\nTRAN",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a nyc temple and there is circle chamunda choraha\nIt's named after it",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice palace hindu devi mandir",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Barmer Rajasthan",
      "rating": 4.4,
      "address": "JAT COLONY, डंगरिया, बाड़मेर, राजस्थान 344001, India",
      "reviews": [
        {
          "text": "Barmer is a soothing city of Rajasthan.\nA pollution free city ranked in world wide category.\nHelpful behaviour of everyone.\nEvening's are still natural there.\nThere is no need of any fan or cooler in night life if you are sleeping in open sky under star's ⭐⭐✨✨.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Barmer is a district located in the western state of Rajasthan, India. It is known for its rich cultural heritage, vibrant folk music, and colorful festivals. The district is also home to some of the most beautiful and historic places in Rajasthan.\n\nOne of the most popular tourist attractions in Barmer is the Barmer Fort. Built in the 16th century, the fort is a stunning example of Rajasthani architecture and offers breathtaking views of the surrounding desert landscape. Another must-visit destination in Barmer is the Kiradu Temples. These ancient temples are dedicated to Lord Shiva and are believed to have been built in the 11th century.\n\nBarmer is also famous for its rich and vibrant culture. The district is home to several traditional folk music forms such as the Ghoomar and Kalbeliya dance forms. The district also hosts several colorful festivals throughout the year, including the Barmer Thar Festival, which celebrates the rich cultural heritage of the region.\n\nIn addition to its cultural attractions, Barmer also offers visitors a chance to experience the beauty of Rajasthan's natural landscape. The district is home to several wildlife sanctuaries and national parks, including the Desert National Park and the Jawai Leopard Safari. These parks offer visitors a chance to see some of Rajasthan's most iconic wildlife, including leopards, desert foxes, and chinkaras.\n\nOverall, Barmer is a must-visit destination for anyone looking to experience the rich culture and natural beauty of Rajasthan. With its stunning historical sites, vibrant culture, and breathtaking natural landscapes, Barmer is truly a gem of Rajasthan.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Barmer member is different, the people here are very nice and there is a very good location worth seeing here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Barmer is a developing town, it has the luxury of life with huge growth potential.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Barmer is a district of Rajasthan\nIt's the end of west India touch with Pakistan border\nThere are many types of travelling locations where we travel at a cheap rates",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Barmer Selfie Point",
      "rating": 4.2,
      "address": "Ambedkar Colony, Mahaveer Nagar, Barmer, Barmer Magra, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Things which one can do here :-\n\n1) exercise in an Indira Gandhi circle during morning time.\n2) selfie point to take memorable photos.\n3) one can drink tea and eat something by nearby stalls.\n4) It's a good point to view sunrise and sunset 😀.\n\nBus stand is nearby to this place.\n\n**********************",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good humble and very kind person and good doctor for stomach related problems",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "There is a very beautiful garden where you can capture memories by making photos and videos.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Barmer's first selfie point is being made near the Mallinath Circle of Barmer.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "There is a Garden named is Mahaveer public Park. There are many plants and flowers  daisy",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "विरात्रा माता मंदिर एवं विरात्रा नगर खेल मैदान",
      "rating": 5,
      "address": "PCJC+RMF, Barmer Agor, Rajasthan 344001, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "super area",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    }
  ]
}