{
  "places_with_reviews": [
    {
      "name": "Jatoli Shiv Mandir",
      "rating": 4.8,
      "address": "Solan Himachal pradesh Jatoli, shiv tample, Solan, Jatoli, Himachal Pradesh 173212, India",
      "reviews": [
        {
          "text": "My visit to Shiv Mandir was unforgettable. The temple's stunning architecture and smooth roads made it a peaceful retreat. Inside, the serene atmosphere and devout community left a lasting impression. Kudos to the upkeep team for maintaining such a sacred space. I highly recommend a visit for anyone in search of spiritual solace",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Asia's highest temple in solan Himachal Pradesh... Jatoli means jata of shiva ... Multiple fables and stories are associated with the history of Jatoli Shiv Temple. It is one of the oldest temples of Lord Shiv where an ancient linga has been placed. It is believed that the temple was once the resting place of Lord Shiva.. the beautiful architecture in South-Dravidian style, this temple is believed to be the highest Shiva temple in Asia. In the year 1950, Swami Krishnanand Paramhansa came here, and under his guidance, the construction work of the temple started. His cave where he did sadhna there and chanting happens by priests and localites, after reaching there and hearing the chants, bhajans bounds you in an different aura... There is a kund also and the pristine water of kund uses for skin n other treatments....\n\nTrans - it's around 302 km from Delhi...7.3 km From solan and 51 km from Shimla ...\nKalka Railway Station, about 45 kilometers away, is the nearest station for trains going to Jatoli Shiva Temple. From there, visitors can hire a cab or a car to get to the temple.\n\nYou can arrive at the temple by taking a bus from the Solan which is approximately 6 kilometres away from the temple. The nearest bus stop to the temple is the Solan bus stand. It takes approximately 15 minutes to reach the bus stand from the city. The bus stand is just a few steps away from the road near the temple. After reaching at the base of the temple, you will have to climb the steps leading to its entrance.\n\n#strict Instructions- if you visit temple than wear a traditional outfits, make temple atmosphere comfortable....\n\n#DekhoApnaDesh #devbhoomihimachal #solan #JatoliTemple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful temple. The temple's architecture is really a thing to take a look at. A view around the temple is breathtaking. If you are going to Solan, do visit this temple. You will definitely have a great experience",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Asia,s highest Shiv temple in Solan. Beautiful carving, peaceful felt so good relaxing lovely darshan. Work was going on still more changes. Lovely experience would surely visit again Bum Bum Bhole 😍🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "On my recent visit to India on somebody's recommendation went to Jatoli Shiv Mandir.\nIt was a wow experience. Temple is very beautiful. They have ample parking. Photography is not allowed in the temple premises. But they have a separate roof top specially for Photography.\nIt is a scenic route. Cars can be stopped for various scenic spots.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "WelcomHeritage Parv Vilas Resort & Spa, Kasauli Hills",
      "rating": 4.7,
      "address": "Gandhigram, Dist.Solan, Kasauli, Himachal Pradesh Dist, Kasauli, Himachal Pradesh 173229, India",
      "reviews": [
        {
          "text": "Our group stayed for one night and we had a fantastic experience. The food was delicious and the service was excellent. Special thanks to Rizul and diwankar the Front Office staff and his team, for ensuring everything was organized perfectly. He made our stay hassle-free and enjoyable. We highly recommend this place for a wonderful stay with amazing food. Can't wait to visit again!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Had an amazing time. Room was amazing. Food is very good.\nSpecial mention to Front Office team who made the stay memorable. He went above and beyond and showed great hospitality. Value for money property.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I had the most relaxing mini vacation in this hotel. Super impressed with the hotel. Rooms were exquisite.\nLocation has stupendous views but a bit off the beaten track.\nHospitality was top class.\nFood was varied and wonderfully prepared.\nAnd the best part was the staff. From house keeping to spa to restaraunt to reception and the managers, they were genuinely Warm and superbly trained.\nHighly highly recommend this hotel.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Fantastic stay~food~Services, loved overall experience at kasauli hills parv villa. Sunset is amazing from Restaurant terrace. Amazing curated cocktails and hand licking snacks. More imp kids ~ enjoyed the games at inside the hotel (kids zone).\nStaff is well trained and educated.\nProvides :-\nvallet service - yes\nIrd 24*7 - yes\nParking space - yes\nInternet speed - very fast\nSpa- yes\n\nWhat you want in your staycation.\nWe enjoyed our short trip.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Simply it was lit. Had an amazing stay with my family for 2 nights.\nFood is upto the mark try italian specially ❤️\nCheers to the best staff & management ✌🏻",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mohan Park",
      "rating": 4.2,
      "address": "W492+FM8, Chambaghat, Solan, Himachal Pradesh 173212, India",
      "reviews": [
        {
          "text": "Very nice place. Full of peace.Beautiful temple . Scenes are like kashmir",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Well maintained and beautifully made. Artistic touch is seen everywhere. Peaceful and delightful feeling.\n\nOne of iconic temple and representation of our God's and culture.\n\nHoping to see more additions from history point of view. Kids can learn more about our history through such representation.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Mohan Shakti National Heritage Park is a popular tourist destination located in Solan district of Himachal Pradesh, India. It is situated near the town of Solan, approximately 14 kilometers (8.7 miles) from the city center. The park is known for its vast expanse and showcases the rich cultural and spiritual heritage of India.\n\nMohan Shakti National Heritage Park is spread over an area of around 40 acres and is dedicated to preserving and promoting Indian art, culture, and heritage. The park features numerous temples, statues, and sculptures that depict various gods, goddesses, and mythological figures from Hinduism. It aims to provide a serene and spiritual environment for visitors to connect with Indian spirituality and traditions.\n\nThe park also hosts various cultural events, exhibitions, and festivals throughout the year, offering a glimpse into the diverse cultural heritage of India. It is a popular spot for tourists and devotees alike, providing a tranquil setting amidst the picturesque surroundings of Solan.\n\nStays are available in Solan. Feel free to ask any questions or doubts.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A place to those who seek calmness in busy days.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awesome and peaceful place.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Jungle Lodge Resorts",
      "rating": 4.3,
      "address": "Kasauli Hills, Dharampur - Basholu Road, Dharampur, Himachal Pradesh 173209, India",
      "reviews": [
        {
          "text": "We were out here last week for a family celebration in a group of 50. The property is very nice, nicely managed, staff always more than eager to help and  the food was delicious. The place is reasonably priced for such events (probably because we were here on weekdays and not weekend). Nevertheless, our experience was really wonderful.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful property with great ambience. Location is little away from crowded roads of Kasauli. Property is very well maintained and green. Staff is good and managers also. Live band during dinner made the dinner all the more enjoyable. Food is really good. Overall a lovely and memorable stay with family. Will definitely recommend others for a peaceful and calm stay with kids if you are visiting Kasauli.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I am a senior citizen who has just visited along with my wife and daughter in Jungle Lodge from Delhi and found that the Manager at the reception needs to  learn humility and way of talking with guests. The overall service was excellent along with tasty food.\nHowever, one thing I will specifically request the management that if possible, optional arrangement of mercury light may be done so that if after sunset a guest wants to read , he/she should be able to get necessary lighting.\nBarring the behaviour of the manager and lack of lighting facility (TO READ OR WRITE), the overall experience was good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We booked a two room apartment and got one OUTSIDE the property with a different entry altogether which was not even safe. The whole idea of spending the weekend here was to enjoy the property but we had to walk all the way to the resort again and again which was very inconvenient. Also, the floor and the bed were making creaking noises that we could not even sleep in peace. Very dissatisfied!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Had a wonderful and relaxing stay in their pool villa. Quiet and beautiful location nestled amongst pine trees and away from the city hustle. Perfect place to relax and unwind. Our rooms had all modern day facilities with a private pool and jacuzzi. Service and hospitality were spot on. Indoor and outdoor games facilities are also available at the property.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Jatoli mahadev",
      "rating": 4.7,
      "address": "V4HG+VJ4, Jatoli, Himachal Pradesh 173223, India",
      "reviews": [
        {
          "text": "Jatoli Mahadev is a famous temple located in Solan, Himachal Pradesh, India. It's dedicated to Lord Shiva and is known for its picturesque location amidst the mountains. People visit to seek blessings and enjoy the serene atmosphere. No ticket and parking charges 👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Asia’s tallest shiva temple located in solan district. it is very peaceful and serene. har har mahadev. there is dhaam every sunday in the temple. people from carious states come here ti have the dhaam.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is situated in a quite and serene village area near Solan,you can easily find buses from new bus stand Solan to visit here......langar/dham is served here every sunday do visit :)",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Once you enter the temple, beleive me you won't want to leave the place for a while. The art of the temple, Bhajan and all little things of temple makes you to stay their for a while .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The experience of visiting a temple can be deeply personal and profound for individuals of various religious and spiritual backgrounds. Temples often serve as sacred spaces where people go to connect with their faith, seek guidance, find inner peace, or participate in religious rituals and ceremonies.\n\nUpon entering a temple, one might be greeted by intricate architectural designs, ornate decorations, and the fragrance of incense. The atmosphere is usually serene, encouraging contemplation and reflection. Many temples have designated areas for prayer, meditation, or offerings, allowing visitors to engage in spiritual practices.\n\nFor some, the temple experience involves participating in religious ceremonies such as prayers, chanting, or rituals performed by priests or spiritual leaders. These rituals often symbolize important aspects of the faith and can create a sense of community and unity among worshippers.\n\nOthers may find solace in the quietude of the temple, using the space for personal reflection, meditation, or simply to escape the hustle and bustle of daily life. Regardless of one's beliefs, visiting a temple can evoke feelings of reverence, awe, and connection to something greater than oneself, providing a sanctuary for spiritual growth and renewal.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Maa Shoolini Temple, Solan",
      "rating": 4.7,
      "address": "Solan, Himachal Pradesh 173212, India",
      "reviews": [
        {
          "text": "Shoolini, (Sanskrit: शूलिनी) is the principal form of the Goddess Durga or Parvati, also known as Devi and Shakti. Maa Shoolini (Mahashakti), the form and formless, is the root of knowledge, wisdom, creation, preservation and annihilation. She is Shakti or power of Lord Shiva.\n\nMust visit place in solan...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's the famous temple situated at Solan, H.P.  Maa Shoolini temple is also famous as Kula Devi temple for Solan people. Lovely place to visit with family and friends. No entry tickets are required here.  The Temple is near the old bus stand Solan",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a temple located inside a narrow street . You don’t need to worry regarding stairs. There are around 10 stairs only and then you can finally pay offerings to Mata Shoolini Devi ji .\n\nPeaceful Environment\n*Located near Market of Solan\n* Prasad Counters are inside street\n* You can get all items used for paying offering to God\n* Must visit if you plan to go Solan/ You are in Solan\n\nJai Mata Di 🙏🏻 😊",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is believed that the tour of solan was named after shoolini  maata ,who is the presiding deity of the temple ..\nShoolini,is the principal form of the goddess DURGA OR PARVATI,also known as Devi and Shakti...❤️❤️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dedicated to Maa Shoolini Devi, this temple is a  reverred place of worship where devotees seek Maa Shoolini's blessings. I felt blessed n my soul felt inner peace n calm after visiting this temple.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Dagshai Jail Museum",
      "rating": 4.4,
      "address": "V3P3+M4C, Dagshai, Himachal Pradesh 173210, India",
      "reviews": [
        {
          "text": "A visit to the Dagshai Jail Museum and Cellular Jail is like stepping back in time to the British era. Nestled in the picturesque Cantonment town of Dagshai, the museum and jail offer a captivating glimpse into the past.\nWalking through the corridors, you can almost feel the weight of history bearing down on you. The experience is both humbling and enlightening. The museum and jail are impeccably curated, with informative displays that bring the past to life.\nWhether you're a history enthusiast or simply curious about India's storied past, a visit to the Dagshai Jail Museum and Cellular Jail is an absolute must.\nThere’s no fees to visit the museum and jail. Couple of tea stalls are located near the museum to help you ponder about the past over a cup of tea or coffee accompanied with a plate of steaming hot Maggi 😀",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very historical feeling. Jail where keep freedom fighters during British Empire. Very strict punishment and security there.Gandhi and Nathu ram both spend time in jail.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The jail (built in 1845) had a total of 54 narrow cells (11 of them converted into staff quarters). Of these, a bunch of cells were designated for solitary confinement, and have accordingly forbidding interiors. Included in the cells  are two very special ones: one, equipped with a fireplace and decorated now with a charkha (spinning wheel), housed Gandhiji (at his special request) when he visited Dagshai in 1920. Another cell, almost next to the main entrance to the prison, housed, for a while, his future assassin, Nathuram Godse.\n\nAlso worth seeing in the jail is an interesting and creepy torture chamber, with rusted chains hanging from a bar on one wall, while battered wooden doors lead out into the courtyard beyond: victims of brutal punishment would be led out that way, whether half-alive or as corpses.\n\nThere is also a room that’s devoted to memories of Dagshai and the military regiments that were stationed around here. Pride of place is given to a famous military tune, ‘Dagshai Hills’, with the musical notes for it, as well as photos and paintings of military musicians playing the tune.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A wonderful experience. Went there in the evening when there was no crowd at all. Was fortunate enough have a chat  with a  sweet gorkha jawan who told me stories about the place. It takes you back to those days you read about in the history books . The cells give you a mixed feeling of pride and pain..pride coz you realise the sacrifices of our brave freedom fighters and how much they have endured to free the Country..and pain for the very same reason.\nYou should visit the place for sure.lots to learn from this place .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The experience was tremendous and truly heart felt. Depends on person to person.\nApt for Thana tourism !\n\nA must visit, Dagshai Jail, perched atop the picturesque hills, unfolds a tale that blends positivity with thrilling and haunting elements. The historical significance of this edifice carries an air of mystery, inviting visitors into a captivating journey through time.\n\nAmidst the scenic beauty, the jail echoes with thrilling tales of bygone eras, where each brick narrates stories of resilience and fortitude. The positive aspect lies in its transformation from a colonial-era prison to a tangible piece of history, allowing visitors to unravel the secrets concealed within its walls.\n\nYet, within the confines, lurk the haunting whispers of dark tales, embodying the eerie essence of the past. The corridors resonate with the silent struggles of those imprisoned, casting shadows of the bygone horrors. The chilling narratives intertwine with the positive resurgence of Dagshai Jail, creating an atmosphere that both intrigues and respects the resilience encapsulated within its walls. It's a thrilling journey through history, where positivity emerges from the shadows of the past, and the eerie tales contribute to the enchanting aura of this historical landmark.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shiv Mandir Solan",
      "rating": 4.7,
      "address": "W445+MCF, Kotla Nala, Solan, Himachal Pradesh 173212, India",
      "reviews": [
        {
          "text": "Looked at the photos of previous reviewers. They all got it wrong 😑\nOther photos are of Shree Hari Mandir 🛕 which also thankfully is nearby.\nThis 👇is the actual temple. Don’t waste your time if got allured by pics",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jatoli temple is best place to visit in solan 💛jai babe di",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Out of best nature surrounding temples across the world,\nJatoli Shivalaya is one which is serene, mesmerizing, cool breeze, beautiful blue skies, white cluster of clouds, miles of Green forest. Temple is peaceful, Clean and warm welcome from the staff,Bhandhara with devotees, and Blessings of BHOLEYNATH,\nAnd Babaji Gajanandji all this way Mystic and Heavenly Experience.\nMUST VISIT IF YOU GO TO SOLAN.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Love to visit here the tallest shiv mandir in asia",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Karol Tibba Trek",
      "rating": 4.6,
      "address": "near baghat bank, Chambaghat, Himachal Pradesh 173213, India",
      "reviews": [
        {
          "text": "Harsh arranged for a young gentleman to be our tour guide for the day.  He was very polite and well mannered.  Paced our climb very well. Thoroughly enjoyed the hike up to 7,400 ft. through pine and oak forests.  Getting on to Eagle Rock was an experience.   If you like to hike, this one is a great day trip. Well worth contacting Harsh rather than trying the trek on your own.  Money well spent.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was wonderful, thrilled and safe experience of Karol Tibba Trek. We enjoyed it. Trek leader Rishu Thakur was very cooperative and helpful throughout the trek. Could summit it just because of his support. Thanks to the Team.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a good 10km Trek. Took 7 hours to cover both side. Pandava caves are must to see and a unique experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nothing great about it. Normal trekking, with absolutely no signboards and directions. You'll keep on guessing if you are indeed on the right path. Of course no living soul came across.\nVehicle doesn't go all the way, and you will see just one board at the start of the trek.\nMultiple trekking options better than this available near Solan.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent track to a high historical place. Get ready to climb up 1000 steps, taking you around 5000 ft from the sea level.\n\nYou are going to have an amazing experience in this solitary environment.\n\nPlease keep sticks in your hand as you have monkeys around.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kumarhatti Solan Bypass Tunnel",
      "rating": 4.5,
      "address": "V3JG+WJX, Solan, Himachal Pradesh 173229, India",
      "reviews": [
        {
          "text": "It is such a soothing place.Just loved the experience of visiting here. Must visit this place in Winters for best snowfall and perfect view. Absolutely in love with this place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Wow amazing! I just got to know about it yesterday as I traveled from it.. although I have been to shimla 3 4 times this year but didn't got to know about it 🙂🥲",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The path is smooth and the lights are always on providing clear vison and convenience while driving through the tunnel.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This tunnel actually made life easier for people by reducing distance and time and around them scenes are quite interesting. I’m sharing these scenes with this review.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This point is just like sukoon. Calm air chill your mood, when you are travelling from solan to chandigarh its the only tunnel and its too amazing 😍",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}