{
  "places_with_reviews": [
    {
      "name": "Barpeta Satra Kirtanghar",
      "rating": 4.7,
      "address": "Ward no. 3, Thakur Bazar, Badarpur, Barpeta, Assam 781301, India",
      "reviews": [
        {
          "text": "I visited this place 26march 2024 during the Holi festival. I loved the entire environment and energetic crowd roaming around the Kirtana Ghar, people...religious offerings...loved the locals for decent and devoted manners. Please do visit in your lifetime for a pristine feeling.     Holi place visited during Holi festival. It's celebration is so much fun. A lot.. of people come here to only celebrate Holi from all around Assam....plz 1 time' visit...❣️❣️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Barpeta Satra\nThe Kirtan Ghar is considered to be the largest in Assam. The Three Guru Asanas are placed in this buildings in honour of Shrimanta Sankardeva, Shri Madhavdeva and Shri Badula Ata. The two Satradhikars sit behind the Asanas to hold Nam-Prasangas regularly.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A religious place of barpeta town. It's very peaceful. It is a tourist attraction of barpeta district. Must visit place during holi.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a great place.  Very peaceful and devout place.  Only men wearing Dhuti, Gamucha and Cheleng Sadar are allowed to enter the Kirtan Ghar (main house of worship).  No women are allowed to enter the main Kirtan Ghar.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Barpeta Satra is a well-known sattra situated at Barpeta in the Indian state of Assam",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Hohua Picnic Spot",
      "rating": 3.7,
      "address": "82P6+WR8, Sundaridia, Barpeta, Assam 781314, India",
      "reviews": [
        {
          "text": "Wrong❌ location. It is situated in North Garo Hills, Meghalaya. You can go there from Dhupdhara. It's 18 km from Dhupdhara.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Beautiful nature creation🙌\nVisit and clam your mind😊😊",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Fake location",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Worng location please don't visit this place.\nOriginally Hohua located in Meghalaya state.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Beutiful picnic place hohuwa",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Barpeta Town Jama Masjid",
      "rating": 4.3,
      "address": "82H4+J53, Barpeta-Mandia Road, Pachali, Barpeta, Assam 781301, India",
      "reviews": [
        {
          "text": "I recently had a fantastic experience at ANIRBAAN ENTERPRISE . From the moment I walked in, I was greeted warmly by the staff. They were incredibly knowledgeable and took the time to listen to my concerns about my motorcycle. The service was completed efficiently, and my bike now runs smoother than ever before. I was also pleasantly surprised by their fair pricing, which was a breath of fresh air compared to other places I've been to. I highly recommend ANIRBAAN ENTERPRISE to anyone in need of top-notch motorcycle service",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This mosque is right in the middle of the town, seems to be a wonderful and inclusive place, fostering harmony among people from various backgrounds. Its central location in the town adds to its accessibility and importance as a unifying symbol.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A peacefully mosque situated at barpeta, assam,opposite side of daily bazer",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A decent masjid in the town area of Barpeta.\nA very old one and well visited by people.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Mashallah, its so good place.\nSo many people can perform prayer at a time. So nice place. Places are clean. Muslims across the town area always comes here and perform prayer togather. Availability of water is sufficient. Sound quality is also so nice. Prayer mats are available with so cleans.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Patbaushi Satra",
      "rating": 4.6,
      "address": "72WJ+M6X, Patbaushi, Assam 781314, India",
      "reviews": [
        {
          "text": "Very cool and calm, it's the example of originality that Shankardeva's study went through the spiritualism and the environment that was helpful to create the rich cultural heritage of Assam. It's not focused but it's the original place of the legend. However, this place has been neglected till date, and Barpeta is an example of how the population of Assamese indigenous people are helping the immigrant Bangladeshis to occupy Barpeta over the decade which also includes Indian Government vote bank policy and a great failure of Assam Government.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Patbaushi Satra was established by great guru of vaisnavism Mahapurush Srimanta Sankardeva. He spent about 18 years of his life at Patbaushi Satra where he had composed Borgeet and other valuable writings in the form of dramas. Patbaushi satra is situated about three to four kilometers from Barpeta town, popularly called Satranagari. The literature work written on 'Sashipat' are preserved in the dates along with the other valuables. There are several items like gifts received from Chilarai, Mukha etc. are also preserved in this site.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is the last satra established by Mahapurush Srimanta Sankardev. The area is big and also a museum is there which has some remaining items used by Sankardev's second wife Kalindi.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A revered place for Vaisnavites of Assam. Srimanta Sankardev the doyen of Vaishnavism lived here and preached his learning to his disciples.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great work of Mahapurush SriManta Shankardev are preserved. It shows our rich cultural heritage.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kirtan Ghar",
      "rating": 5,
      "address": "82J3+5JF, Muslimpatty, Barpeta, Assam 781301, India",
      "reviews": []
    },
    {
      "name": "Sundaridia Satra Kirtanghar",
      "rating": 4.9,
      "address": "82PG+WPJ, Sundaridia, Barpeta, Assam 781314, India",
      "reviews": [
        {
          "text": "Sundaridiya Satra located near Barpeta town in Barpeta district is one of the most prominent Satras (Vaishnavite Monsataries ) in Assam. It was established by Sri Sri Madhabdev, the principal disciple of Srimanta Shankardev, the 15th Century Vaishnavite Saint and social reformer. This is the place where Sri Sri Madhbadev stayed for a significant period of time and composed Bhakti Ratnakar and Namghosa, two of his most prominent works. #AwesomeAssam#SundaridiyaSatra\n#Satra#VaishnaviteMonsataries#Shankardev\n#Madhabdev\n#Barpeta\n#Assam\n#AssamTourism",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Divine with blessings of peace, joy and happiness, in this spiritual place. May God bless you all!",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Peaceful",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Beautiful pace",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Kirtan Ghar, Budarurtup",
      "rating": 4.7,
      "address": "82J9+CM2, Budarurtup, Barpeta, Assam 781314, India",
      "reviews": [
        {
          "text": "Barpeta Kirtan ghar is a very special place for me .I have been visiting the place since my childhood. Now that i am  far from barpeta it really reminds me of the place. The place has its own peace and refreshes the mind.\nI always get excited when the festival of holi (DOL JATRA) comes close as i start making plans of visiting the place and having a glace of it one more time.\nI recommend everyone to visit the place during Holi as the place lightens up  during the day as well as at night.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Barpeta Satra, popularly known as Barpeta Kirtan Ghar, was established by Vaishnavite saint Mahapurush Madhabdeva in 1583 AD which was previously known as  Barpeta Than. After Madhabdeva  Still Mathuradasa Atta became first Satradhikar after taking care of the Satra. The structure of the Satra was built as a Kutcha House and in 1878 it was rebuild on concrete structure. One can reach this Vaishnavite Cultural Site by train (nearest railway station Barpeta Road) and well connected by road from Guwahati.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Famous place in Barpeta.Well known for its holi celebration here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best sacred place of Assam with a very peaceful and calm aura, well defining the old spiritual Assam.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Since I was in high school still now have 5 times this place.\nSpecially kirtan ghars in barpeta...\nAll the places are belongs to saint mahapurush srimanta sankardeva.. established by him...",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Barpeta Satra Main Gate",
      "rating": 4.5,
      "address": "8296+65J, Badarpur, Barpeta, Assam 781301, India",
      "reviews": [
        {
          "text": "The Barpeta Kirtanghar gate stands as a majestic testament to the rich cultural heritage and spiritual significance of the revered temple complex. Crafted with meticulous detail and adorned with intricate carvings, the gate serves as the gateway to a realm of devotion and transcendence.As you approach the Barpeta Kirtanghar gate, you are immediately struck by its grandeur. Rising tall and proud, the gate commands attention with its imposing presence. Carved from sturdy stone, it bears the marks of time, each weathered groove and crevice telling the story of centuries past.The surface of the gate is adorned with ornate motifs and symbolic imagery, reflecting the deep-rooted traditions and beliefs of the region. Intricate patterns of lotus flowers, sacred animals, and celestial beings adorn its surface, each element infused with spiritual significance and meaning.At the center of the gate, a magnificent archway beckons you forward, its graceful curves inviting you to step into the sacred space beyond. Flanked by towering pillars adorned with sculpted figures of gods and goddesses, the archway serves as a portal to another world – a world of devotion, prayer, and divine grace.As you pass beneath the archway, you feel a sense of reverence wash over you. It is as if the very air is charged with spiritual energy, enveloping you in a cocoon of tranquility and peace. The sounds of distant chants and the gentle rustle of leaves mingle together, creating a symphony of serenity that fills your heart with awe.On either side of the gate, lush gardens stretch out before you, their vibrant colors and fragrant blooms adding to the sense of beauty and wonder. Tall trees stand sentinel, their branches reaching towards the sky in silent prayer, while colorful birds flit and flutter amongst the foliage, their melodious songs adding to the enchantment of the scene.But amidst the natural splendor, it is the gate itself that captures your attention – a testament to the craftsmanship and devotion of those who built it. Each intricately carved detail speaks to a reverence for the divine and a commitment to upholding the sacred traditions of the temple.As you pause to take in the breathtaking sight before you, you are filled with a sense of gratitude and humility. Gratitude for the opportunity to stand in the presence of such beauty and majesty, and humility in the face of the timeless wisdom and grace that permeates this sacred space.And as you step forward, crossing the threshold of the Barpeta Kirtanghar gate, you do so with a heart full of reverence and awe, ready to embark on a journey of spiritual discovery and inner transformation.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must go place during holy where doljatra is celebrated in full swing amongst locals and people gathers from other parts of Assam to celebrate fakuwa (holi) under the satra of Sankardev",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very satisfying place to spend time",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Surrounded by small shops, residential houses.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful 😍",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Barpeta Gandhinagar Jame Masjid",
      "rating": 4.1,
      "address": "8XMX+6FV, Muslimpatty, Barpeta, Jaher Pam, Assam 781301, India",
      "reviews": [
        {
          "text": "Nice app",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Prayer house for Muslim.Situated at Gandhi Nagar of Barpeta District. 1.5  km away from Barpeta DC office.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's one of the peaceful majzid",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It needs reconstruction and people should contribute to expand area and space for more people.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Awesome place for Muslim people for namaz",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Metuakuchi",
      "rating": 4,
      "address": "8292+JPH, Gajia, Barpeta, Assam 781301, India",
      "reviews": []
    }
  ]
}