{
  "places_with_reviews": [
    {
      "name": "Swargashram, Jharna, Waterfall, Baruasagar",
      "rating": 4.4,
      "address": "Barua Sagar, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "Not a place for family!\nSuch places are rare in this region, beautiful stream of water.\nUnfortunately absolutely no maintenance and no administration.\nYou will get a place filled with Men and Boys bathing in stream wearing undergarments and kids without clothes (Even with soap and shampoo) 🤦.  Garbage spreaded across the area.\nThis is almost killing the nature.\nPeople absolutely ruining the beauty of this spot.\nI think Government should establish any kind of administration to save it.\nApart from this a parking charge is there\n4 Wheeler @20 Rs & 2 Wheeler @10 Rs.\nRespect Nature!\nSave Nature!\n🥹",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place to visit with friends",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "\"A perfect and peaceful place to sit in the evening.\"",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a nice place to visit, it have nice waterfall and this is the main attraction also there are boats available to get ride in cheap cost.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Must visit place. Around 25 kms away from Jhansi city",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Barua Sagar Fort",
      "rating": 4.2,
      "address": "9PGR+5G6, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "Baruasagar Fort is also known as Jhansi ki Rani Summer Special mahal (शीतकालीन निवास) in this fort there are many rooms but except all rooms one room is very special which is cold in Summer and hot in winter",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A good place to visit near Jhansi.You can see a good view of Tal from the fort the and elevation of the fort is very high the why it's provide a good view.A good place to catch up and there is no entry fee at fort.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Barua sagar fort was very old fort. Yet it was very old but in good conditions. Good place for visit if you love history.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Barua Sagar Lake and fort is 20km away from jhansi city. It is wonderful place. There is a waterfall, a big lake name as Barua Sagar Lake and a fort named as Barua Sagar Fort. If you come in jhansi or nearby place You should visit this place.\nOverall good place for picnic. There is no fees for visiting there. Free of cost.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Barua sagar is a very interesting place to visit the lake which is very scenematic to see. The pattern in which the stairs are made beside lake is very very exemplary.\n\nBarua sagar fort is very nice place to visit and trees planted inside the fort are in planted in a queue and fort is at very height that you can see whole city from top of the fort.\n\nKailash parwat beside fort is a awesome place where lord shankar is stepped there and to reach there you have to climb approx 400 stairs.\n\nThere is a forest between fort and parwat\nAwesome place to do trekking\n\nNegative point is that barua sagar,barua sagar fort , barua sagar kailash parwat is very lonely place when i visited there on weekend i saw 0 person niether in fort nor in parwat\n\nAll its a nice place go visit and enjoy your holiday.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mansil Mata Mandir",
      "rating": 4.3,
      "address": "Bus Stand, near Baruasagar, Barua Sagar, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "A good Hindu temple situated outside the main area so you feel very relaxed and calm there. You can buy prashad and other things from the shop which is in front of the temple. Most important day to visit this temple is Monday. Local people tells the story of the temple. The temple is dedicated to an incarnation of Maa Sharda. Some other god temple is also there. Every moday there is bhajan Sandhya.\nYou must visit this place for once.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is famous for completing wish of people",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good temple near bus stand",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It’s great temple for me",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This temple is exactly in bus stand of barua sagar. People believes is way beyond for this temple. Must visit in mondays and fridays and arti time is 8 in the morning and evening.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Jarai-ka-Math",
      "rating": 4.3,
      "address": "9PQ4+HQW, NH39, Barua Sagar, F-1 P-33, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "One must visit at this heritage site. According to Archeological department of India this temple is build in 9th century. As I have visited this temple seems to be built of very old stones. Stone art at walls are magnificent.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful historical place!\nThough its maintenance was not up to the mark as it should have been as it comes under the protection of Archeological Surve of India.\nAbsolutely beautiful carving over walls made with red stones. Unfortunately most of art seems perished due to invasions still historical beauty remains.\nBest part is \"there is no requirement of ticket to enter\".\nA must visit place for history lovers.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Jarai Ka Math is located about 18 km from Jhansi city on the Jhansi – Khajuraho road, it is believed to be built by Pratihara ruler. To the north-east of the Baruasagar lake are the ruins of two old Chandela temples. Nearby is the later Gupta period temple known as Jarai-ka-Math. It is dedicated to Shiva and Parvati. The eastern side of its shikhara is lavishly ornamented with massive stone sculpture.\nIt is a stone temple built during 9th century. Located about 18 km from Jhansi city on the Jhansi – Khajuraho road, it is believed to be built by Pratihara ruler. The temple consists of various kinds of sculptures including the beautiful sensuous ones depicted on the walls.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Its a famous Devi temple for locals.temple's architecture is earthquake proof where a number of research are performed by the Indian government and UNESCO.\nThe temple is protected by the Archaeological Survey of India.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Jarai ka math is a mandir dedicated to Goddess Amba . The Mandir is about 17 km from Jhansi railway station and is near to Barua sagar town. This mandir was built by Samrat Mihir Bhoj in 860 AD and the Mandir is in Panchayatan style of architect.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sharda Maiya Mandir",
      "rating": 5,
      "address": "9P9M+C45, Barua Sagar, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "It's a very nice place to spend leisure,not only religious but also entertaining,",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "All temples are good place but this was the beast place and is located at such a places where you enjoy really very well with our parents or alone. At this place we get tranquillity. No noise pollution appear there. This is auch a silent place to bisit there ....",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "It is  situated at hill station",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Swarg Ashram , Jharna water fall",
      "rating": 4.3,
      "address": "9PJX+PFV, Jhansi - Mauranipur Hwy, Barua Sagar, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "This place is a famous picnic spot, its name Barua Sagar Jharana. Come here and enjoy but only in rainy season.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This waterfall is one of the most beautiful waterfalls here. It is very good here where things come from people come from Niwadi. People come from Tikamgarh. People also went to me. I have slept a lot like this place where.Come, come and you too, come here and see the beauty of the place.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Amazing my Birthplace",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good place to walk .. in baruasagar jhansi",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place for enjoying with family....",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Ghughua math",
      "rating": 4.4,
      "address": "9QG5+WRH, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "Historical Sight,",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I saw us",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "There are many good places which you can visit in Ghoomna if you are local to Hansi.",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Barwa Sagar jharna",
      "rating": 4,
      "address": "9PJX+648, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": []
    },
    {
      "name": "Badi Masjid बड़ी मस्जिद, बरुआसागर",
      "rating": 4,
      "address": "9PGJ+HJX, Barua Sagar, Uttar Pradesh 284201, India",
      "reviews": []
    },
    {
      "name": "GHUGHUWA DAAK BANGLA",
      "rating": 5,
      "address": "9QJ3+XGJ, Talarmanna, Uttar Pradesh 284201, India",
      "reviews": [
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 5
        }
      ]
    }
  ]
}