{
  "places_with_reviews": [
    {
      "name": "Shri Bhagwant Mandir",
      "rating": 4.7,
      "address": "6MMQ+M7J, Mangalwar Peth, Mangire Mala, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Shri Bhagwant Mandir is a Hindu temple dedicated to Lord Vishnu, located in the town of Barshi in the Solapur district of Maharashtra, India. It is believed to be the only temple in India dedicated to Lord Vishnu in his form as Bhagwant.\n\nThe temple was built in 1245 AD in the Hemadpanthi style of architecture, which is characterized by its use of black stone and intricate carvings. The temple has four entrances, one from each of the four cardinal directions. The main entrance is located to the east.\n\nThe temple's sanctum sanctorum houses the idol of Lord Bhagwant, which is made of black stone. The idol is seated on a lotus pedestal and holds a conch shell, a discus, and a mace in his hands. Below his right hand is a carving of the devotee king Ambrish. On the back of the idol is a carving of Shri Lakshmi, the consort of Lord Vishnu. On the forehead of the idol is a carving of a Shivlinga, and on the chest is a carving of the footprints of Bhrigu Rishi, a sage who is said to have worshipped Lord Vishnu at this temple.\n\nThe temple is also a significant historical and cultural landmark. It is a reminder of the rich Hindu heritage of the region.\n\nThe temple is dedicated to the Bhagavat incarnation of Vishnu.\nIt is the only temple in India dedicated to the Bhagavat incarnation of Vishnu.\nThe temple is believed to have been built in the 11th century.\nIt is a beautiful Hemadpanthi temple built with stone and brick.\nThe temple faces east.\nThere are two Nandi statues at the entrance of the temple.\nThe sanctum sanctorum of the temple houses a wooden statue of Vishnu in his Bhagavat incarnation.\nThe statue is beautiful and attractive.\nThe exterior of the temple is also beautiful.\nThe walls of the temple are adorned with statues and sculptures of various deities.\nThe temple is a popular pilgrimage site.\nMillions of devotees visit the temple every year.\nThe Bhagavat festival is celebrated at the temple every year during the period of Vaishakha Shukla Shashthi to Dwadashi.\n\nIf you found this review helpful, please consider liking, sharing, and following for more travel insights. Thank you for your support! 👍👍👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Barshi\n\nbig temple complex. very nicely built up and maintained. Bhagwant ..Shri Vishnu mandir. very attractive and divine murty.  Shri Mahalakshmi devi is just on the reverse side of. Bhagwant murti. Its architectural marvel. They have fixed mirror to facilitate darshan od mahalakshmi devi.  bhakt Ambarish is sitting near Bhagwant paduka.\nread the story. Bhagwant came and gave darshan on  Baras day hence  Barshi name of the town.\nA pakhwaji who was offering prayers by playing veeena , requested us to have prasad at nearby. Its free. they give priority to outside visitors over the regular locals.\nmust visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful and peaceful place in Barshi. Must visit.\nPrsadalaya is nearby. So take that too. It's delicious.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Bhagwant Mandir at Barshi is a temple dedicated to Lord Vishnu. The unique feature of this temple being, Lord Vishnu is accompanied by Goddess Lakshmi but she is placed behind Lord Vishnu with their backs towards each other. One has to take her darshan from the tilted mirror placed near the idol.\n\nThe original temple construction is around early 13th century with the stucco shikhara and Woodwork sabhamandap being a later addition during the medieval times.\n\nThe temple has a huge prakara with a Shri Datta temple besides the main temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "1245AD - very very old temple, absolutely well maintained and also renovated - devotees visit regularly. People apart from Barshi also visit, have faith and worship regularly. Clean & spacious.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Yedai vehir",
      "rating": 5,
      "address": "6MWR+Q44 Yedai vehir, Industrial Estate No.2, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Religious temple near Ganesh Talav and recently boating started that place",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Yedeshwari Mandir",
      "rating": 4.5,
      "address": "6MMG+G7H, Vidya Nagar, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "This temple is built around 20 years ago,  but yedeshwari was established here 70 year ago by one devotee. Devotee wants to visit yeramala but due to some reason she/he can't go.  They established image of yedeshwari here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a historical, mythological, cultural temple.\nGood place for visit",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Always best.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to visit",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "SHREE UTTARESHWAR MANDIR",
      "rating": 4.5,
      "address": "6MQQ+524, Mangire Mala, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Famous Shiva temple in Barshi Shri Uttareshwar Mahadev.\nMahatma Gandhi's ashes were immersed  here in holy kund.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Chintamani Mobile Barshi\nAddress nearby Pandey Chowk Bank of Baroda Devne Galli Barshi\nAll Mobile accessories wholesale and retail",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of most famous Shri Utreshvar maharaj minder of Lord shiva. It was built in the 18th centuries. One of the biggest temple in barshi. Many people visit here daliy for blessing of Lord shiva. In the month of June and July many varkari who travels to pandhrpur stay here for rest of day.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's one of holy place of Lord Mahadeva. Ancient mandir. Very nice. In shravan decoration of flowers and aarti very nice.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A beautifully constructed Temple, need renovation, many legendary stories are related with this Temple.\nMust visit the place.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "बार्शी भगवंत नगरी",
      "rating": 5,
      "address": "6MPV+298, Mangire Mala, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "🙏🙏",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Mali Galli",
      "rating": 3.5,
      "address": "6MMQ+CG3, Sulakhe High School Rd, Bhim Nagar, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Go",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "sM Heeraj",
          "languageCode": "en-US",
          "rating": 3.5
        },
        {
          "text": "Vitthal Rukmai",
          "languageCode": "en-US",
          "rating": 3.5
        }
      ]
    },
    {
      "name": "BARSHI MARINE DRIVE",
      "rating": 4.2,
      "address": "6MRR+83M, Subhash Nagar, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Good Peaceful place. Can be improved with more lights and cleanliness..",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good for spending some time to relax your mind 😇",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place..",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "🤣",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Well maintained",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Baleshwar Mandir",
      "rating": 4.4,
      "address": "6MJQ+277, Barshi - Pune Hwy, Bhim Nagar, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "It is one of the twelth jotirling in the city Barshi. Temple is beautiful & aside of Barshi-Kurduvadi road.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The temple is a place where peace is found on it...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Holy place in Barshi\nPeople love to visit",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Old temple of Shiv",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice temple.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Atrik Rushi Temple",
      "rating": 4.8,
      "address": "6M9V+JC3, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Reminds me of someone 😍 sweet memories har har mahadev",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice temple  .and environmental area is good .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very quiet place.......",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Temple of Great Shiva..\nSilent and holy place...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Ancient lord shiva hindu temple",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Devi Ekvirai Mandir",
      "rating": 4.5,
      "address": "6MPP+567, Mangalwar Peth, Bhim Nagar, Barshi, Maharashtra 413401, India",
      "reviews": [
        {
          "text": "Nice temple.👌",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place to visit",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice olace situated in the heart of the city...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "old godees temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good temple",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}