{
  "places_with_reviews": [
    {
      "name": "Qila Mubarak",
      "rating": 4.5,
      "address": "Fort, Near Fort, Old City, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "Qila Mubarak is a historical fort located in Patiala, Punjab, India. The fort has a rich history and is considered a significant landmark in the region. The architecture of the fort is impressive, with intricate carvings and designs that showcase the artistic skills of the craftsmen from that era.\n\nVisitors can explore the various sections of the fort, including the Durbar Hall, Sheesh Mahal, and Ran Baas. There are also several museums within the fort that display artifacts and exhibits related to the history and culture of Punjab.\n\nOverall, Qila Mubarak is a must-visit destination for history buffs and anyone interested in exploring the cultural heritage of Punjab. The fort's rich history and impressive architecture make it a fascinating place to visit and learn about the region's past.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Qila Mubarak, a historic monument in Bathinda, India. It is located in the centre of the city. But must need to repair.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its a beautiful architecture and very great place to visit with great vibes and views\nThere is also a gurudwara inside the qila and also langar hall\nI visited the qila on makarsakranti from the gurudwara at the qilla you will get. Best views the sky was completely filled with kites.\nThe people were playing djs on their roof so\nI would like to recommend that you visit this place surely whenever you all visit bathinda city the best city in the south Punjab",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a wonderful place in Bathinda city. Quila Mubarak is one of the centre point. From the top of Qila you can see the whole city. Amazing viewpoint. Visitors are coming here to see and know the history of it.its maintained by the archeological department of India.Quila Mubarak Bathinda was constructed by Raja Dab during the period 90-110 AD. Raja Dab was the ancestor of Vena Pal. The bricks used to construct the fort dates back to the Kushana Period. The fort was constructed by the king so that Huns could not invade the kingdom of Emperor Kanishka. It is home to Qila Mubarak, a fort that has borne witness to generations of rulers and several important battles. Most famously, it remains the only living monument that confirms the legends of Razia Sultana—the first and only woman emperor of Delhi.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A place where we can see fort and worship\nBeautiful fort need repair and maintenance",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Rose garden Bathinda",
      "rating": 4.3,
      "address": "6WMQ+3R6, Rose Garden Rd, Hazura Kapura Colony, Guru Gobind Singh Nagar, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "I had an amazing time when I recently went to Bathinda's Rose Garden. My visit was made really pleasant by the wide variety of flowers, the lovely picnic areas, and the roomy play area that brought back memories of Appu Park. Families will love the ambience, which is enhanced by the thoughtful design of the garden. The variety of flowers used to create the lively and colourful environment really amazed me. The availability of clean picnic areas made it possible to unwind in the middle of the wilderness. It was a welcome surprise to see a large play area similar to Appu Park, which kept kids and families entertained.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Garden was clean and calming.. best place for evening walk and sit for a peace of mind. Near by area was very happening. A Mela was there at the time of my visit",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is nice and beautiful park in Bathinda.. well maintained.. and yes the main attraction are roses definitely. Area is quite large.. it has slides, swings and some dummy artifacts like rail engine.. overall a must visit place.. though i am not sure of basic facilities availability as i was not able to find a rest room which was disappointing.. otherwise good place for every age.. dogs are not allowed. Also can be a picnic are but only in winter seasons.. trees are there but those are not have dense shades except couple of very old trees which is generally occupied..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peace..yiu can go with your friends and family..parking charges are there..no entry charges..adding some photos as well",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "As the name of garden, full of different Verity of roses, well maintained, cleaned park.\nPlaying options for kids and exercising equipment available....\nLove to walk in morning and evening at Greener park at Bathinda...",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bathinda large fort",
      "rating": 4.6,
      "address": "Fort, Near Fort, Old City, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "It's one of the few surviving ancient architecture of Panjab. It is considered to be built around 6th century by Qushan Dynasty.\nA well known female historical figure \"Rajia Sultana\" was imprisoned here for a while.\n10th Guru of Sikhs, Sri Guru Gobind Singh Ji visited here while his travel to south, so a Gurudwara Sahib is built inside the premises of the fort in his memory.\nIt's huge and standing at a great height. You can see the whole Bathinda from it's top.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The fort is a magnificent historical site that offers a glimpse into the rich heritage of the region. The fort is well-preserved and provides visitors with an opportunity to step back in time and imagine what life was like within its walls centuries ago.\n\nThe architecture of the fort is impressive, with its towering walls and intricate designs showcasing the skilled craftsmanship of the builders. As you explore the various sections of the fort, you can't help but be in awe of the sheer size and grandeur of the structure.\n\nThe fort also offers stunning views of the surrounding landscape, making it a great spot for photography enthusiasts. The expansive grounds provide plenty of space for leisurely walks and picnics, allowing visitors to soak in the history and natural beauty of the area.\n\nthe Bathinda large fort is a must-visit for history buffs and anyone interested in experiencing the cultural heritage of the region. The site is well-maintained and provides a fascinating look into the past, making it a worthwhile destination for tourists. I highly recommend taking the time to explore this impressive fort.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Oldest fort in India..built in 90-110 AD\nAlthough now only the walls are there with gurudwara it's huge and beautiful..\n#Raziasultan",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A huge fort which is popular because of a Gurudwara Sahib at the top and because Razia Sultan was imprisoned here for a long time. The fort is huge and proudly displays four canons that were brought to India by the first Mughal emperor, Babar.\n\nThe place is huge and being a historical site attracts many tourists but the visit was a disappointment as it is not being maintained properly. Though it is clean but there are foul smells in some parts.\n\nThe entry is free and it is not very crowded.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "\"Rediscovering Sultan Razia's Reign: Bathinda Fort's Historical Tapestry\"\n\nEmbarking on a journey through time at the Bathinda Fort, associated with the trailblazing Sultan Razia, was nothing short of a profound historical immersion. Sultan Razia, a pioneering figure in medieval India, shattered gender norms by ascending to the throne of Delhi in the 13th century, making her the first and only woman to do so.\n\nSultan Razia, born as Razia al-Din, displayed exceptional leadership qualities that set her apart. Despite facing resistance due to prevailing societal norms, she proved her mettle and earned the title of \"Sultan\" in 1236. Her reign was characterized by administrative reforms, a focus on justice, and a commitment to the welfare of her subjects.\n\nHowever, Sultan Razia's path was fraught with challenges. Opposition from conservative factions and court intrigues posed significant threats. The fort, once a symbol of her rule, became a battleground for political machinations. Tragically, Sultan Razia's reign was cut short, and historical records suggest she was imprisoned and eventually killed by her own nobles in 1240.\n\nExploring the Bathinda Fort allowed me to connect with the echoes of Sultan Razia's visionary rule. The fort's architecture, strategically designed during her reign, stands as a silent witness to the remarkable achievements of this pioneering ruler. The artifacts within the fort offered a glimpse into the complexities of her era.\n\nVisiting this historical site is a poignant experience, serving as a reminder of Sultan Razia's struggle against societal norms and her enduring legacy in shaping India's medieval history. The custodians' efforts in preserving this significant heritage deserve commendation. The Bathinda Fort of Sultan Razia is not just a monument; it's a living testament to the indomitable spirit of a trailblazing ruler.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ghora Chownk",
      "rating": 4.6,
      "address": "6X63+W9J, Ghore Wala Chowk, Batinda, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "One of the famous place of Bathinda on the Ajit Road & 100 Feet Road.\n\nIELTS centers, shopping and food items are available",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Famous place in Bathinda on 100 feet road , usually crowded, all eatable chains and educational institutions are around",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good 💯\nCold weather...... Chai 🍵you will get every point",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Most crowded area, you can say it gedi route",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the good chowk of bathinda.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Dabwali",
      "rating": 4.6,
      "address": "6W6W+95X, sirki bazar, Batinda, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "Good nice socthcut location",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Madal town",
      "rating": 4.5,
      "address": "6X46+9C7, Dhobiana Basti Bathinda, Model Town Phase 2, Model Town, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "Hello 🤗",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mata Vaishno Devi Mandir",
      "rating": 4.5,
      "address": "Cantt Main Bhagu TCP Rd, Patel Nagar, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "Nice and well maintained temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hindu mandir, located on a main road, with ample parking space. It is also having spacious Hall for holding religious gatherings.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice temple. Obtain mata' graces. Good Hall for performing holy functions. 🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a religious temple where u can have some peace time. Temple committe celebrates all festivals. You can visit the temple in morning from 5A.M to 11A.M and in evening 5P.M to 9P.M",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful and calm place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Hanuman chowk",
      "rating": 4.4,
      "address": "6W6V+WVG, Mall Road, Malviya Nagar, Bathinda, Punjab 151005, India",
      "reviews": [
        {
          "text": "This is very big and beautiful murti of Hanuman.\nWhen we c this murti u will feel positive and energetic.\nAnd this very close to bus stand and railway station or bhatinda.\nSo you can visit here easyly.\nOr jahan ye murti hai bha ek bahut bada chowk b hai isliye iss chowk ka name Hanuman chowk rakha gaya hai.\nPlsz visit once.\nThank you.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This chowk is famous of bus taking for firozpur faridkot kot kapura",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a tall Sculpture Stated in bhatinda",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Bus 🚌 🛑🚏 stop to go Mukatsr Jalalabad west",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jai baba hanuman ji maharaj\nKhalistan Murdabad",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shree Durga Mandir",
      "rating": 4.6,
      "address": "Model Town-1, Phase-1, Phase-1, Model Town, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "I went there with family on janamashtami. It is little far from parasram nagar. Go there after sunset and it's beautifully lit and very clean. Having darshan of main mandir inside was not chaotic at all and was well managed.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is so devotional and peace full.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neat and clean.ganesh Murthy marvellous.they provide langar to poor people in the evening",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice temple with lots of space and cleanliness....have space for functions too",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neat & clean our temple have a lot of devotees.God bless us & all.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mata Chintpurni Mandir",
      "rating": 4.6,
      "address": "6W9W+69P, Street Number 5, Aggarwal Colony, Bathinda, Punjab 151001, India",
      "reviews": [
        {
          "text": "This is a famous religious place of Hindus. There is a huge crowd of devotee's during navratras, two times in a year. If you are going there don't forget to take a free ticket before going on stairs for darshan. This ticket will be checked near the mandir. Press like if helpful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mata chintpurni Mandir is establish by Aggarwal smaj in Aggarwal colony in front of shri Saroop chad singla Niwas at Aggarwal colony. It a beautiful  tample in this area. One can pray in this mandir to fulfil their ambitions.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the cleanest and best maintained temple. And all due to the temple priest mukesh shastri. Lots of knowledge and expertise in his field.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "There is no worship of god only money earnig work is there but fully ac is there",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}