{
  "places_with_reviews": [
    {
      "name": "Khajuri Gate",
      "rating": 4.1,
      "address": "R674+52R, Achli Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "not for beginners... Aggressive people here..not respect for other states people.. Uses abuses word ... #notsave",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's name is now famous as Love-Kush Chowk. Old entrance gate Khajuri Gate batala is renovated",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Super crowded and unsafe as there is constant flow of two wheeler traffic puts pedestrians in danger as the lane is too slim. Cannot take a car inside and the parking outside is right on the main road, unofficial, unprotected, and almost always full.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A historical gate but pining for proper care. The walls are plastered with posters and graffiti. I wish the administration as well as the people show more respect for our historical monuments.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Inside Khajuri gate,  my home is situated here\nAlso  Shops like photostat, tailor, dairy, halwai, bakery,  kariyana shops all there\nAlso has Famous Shiv Temple",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Hazira Park",
      "rating": 4.3,
      "address": "Hajira, Subash Park, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "Good place for morning and evening  walk",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Unexpected change in the busy city surroundings in the form of a nice refreshing park. This explains why there was so much crowd there when I visited it on a Sunday evening with my family. You could say it's a miniature version of the Lodhi garden in Delhi. It's a protected monument of a Court person of King Akhbar. Cleanliness is a bit on the lower side here, you can see wrappers thrown on the lawns. There is a need to install dustbins in the park and for people to be more sensitive to maintain cleanliness in this nice park.\nNice place for family outings or a quick evening stroll.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Shamsher Khan's Tomb, Batala is a centrally protected monument under Archaeological Survey of India, Tomb is locally famous with a name Hazira Park, is structurally octagonal in shape. Tomb was  built  in Emperor Akbar era. Sham Sher Khan was fauzdar of Manikpur Riyasat. Here is some photographs for your views.\nThank you",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Historical Place.\n\nSamsher Khan Makbara is believed to be the tomb of Shamsher Khan, an army commander of Mughal emperor Akbar. The architectural style suggests it might have been built during Akbar's reign.\n\nOverall, Hazira Park is a place for locals to relax and enjoy greenery, while also offering a glimpse into the historical past through the presence of Samsher Khan Makbara.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It had been my favourite place since childhood.\nUsed to spend good time here during my school amd college days.\nVisited this place after almost 2 decades.\nIt has been restored well by the local authorities.\nThe gardens have come up Very well",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "SHERA WALA DARWAJA",
      "rating": 4.2,
      "address": "R672+5H2, Achli Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "Traffic Conjestion. Taking local rickshaws recommended.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's a entrance of chakri Bazar batala",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Its a small market with a not so spacious entrance but there are lot of shops like grocery shops, clothing, food and etc.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good Place is sopping area",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A market where you can find almost everything from clothing to food, music gadgets to cell phones.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "St. Francis School",
      "rating": 4.4,
      "address": "Jalandhar Rd, near Punjab Roadways Batala Depot, Guru Ram Das Colony, Subash Park, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "Worst school in batala....very rude faculty.. they never think about the mental health of student .....speak awful language! Even character assassinate students",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "After school all the students went to tuitions then how we says it's the best school\nPrincipal greedy for fee only that's y school is not declaring the results of school terms till 21 July 2022\nJust blackmailing parents\nNo parking\nMinor drive bikes without licence\nLot more drawbacks",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Study wise best school in batala.. Online system of study in this pandemic is also good.. But fees are very high.. A poor person can't afford this school... Admission system sometimes also based on lottery system.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best school in the district or even in punjab. I haven't seen any school like St. Francis Batala which is so good in studies, discipline and extra curricular activities. The teachers here have the best knowledge of their subjects and they always guide you. The pincipal and the staff are friendly. I have been to many schools but this is the best one. I would recommend this school to each and every student of batala. They have brilliant results in academics as well. Best school ever.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best school in the batala",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Amritsar Jalandhar Bypass chowk",
      "rating": 4.3,
      "address": "JALANDHAR ROAD BYE PASS CHOWNK, Q6W9+GVQ, Mahajan Colony, Umarpura, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "I am very dedicated to my work and assure u for the best services at lower costs",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bawa Lal G Mandir",
      "rating": 4,
      "address": "R56X+2XR, Unnamed Road, Bhandari Gate, Batala, Punjab 143505, India",
      "reviews": []
    },
    {
      "name": "Maa Kali Dwara Mandir",
      "rating": 4.8,
      "address": "inside Chakri Bazaar Road, Achli Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "It's inside Nehru Gate not Achali Gate",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful kali maa temple best temple god fullfill everyone's wish",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The most beautiful and peace giving place in Batala is the Kali dwara Temple. This temple is associated with the Goddess Kali who is residing here in the form of of Vaishnavi Kali. The Prasad offered in the temple is pure and totally Satvik. You can visit the temple from morning 4 a.m. to 10 p.m. the temple is is open for all the people irrespective of their religion. You can visit the temple and get the blessings of Mata Kali with whole hearted surrendering. The sacred aarti is performed twice in a day. The local public ok and the main Mahant always present at the time of Aarti. You can experience a great force of love and blissful peace. I will suggest you to visit the temple on Tuesday and Saturday especially because these are the sacred days selected for the Puja.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Religious/fomous temple in batala punjab",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Religious place have great recognition. This is best place with great importance  in the Hindus. Everyone who lives in Batala I think visit at least  once in his life. This temple  is centre of religious  belief  of people. Management  of this temple  is very humble  and priest have healing touch. Jai Mata di. Parking is little problem  as car, / bus can not came at this place. Rest if one have sharda ,  people  came here by bare feet and have firm believe  that Mahakali  will full their wished",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Baba Takunj Peer Ji",
      "rating": 4.8,
      "address": "R683+RHP, Krishna Nagar, Achli Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "Good if you have trust.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Famous place in batala",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's a religious place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Thusday",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sitla Mata Mandir, Bhandari Gate Batala",
      "rating": 5,
      "address": "R56V+MWH, Bhandari Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "Famous temple outside Bhandari gate",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nyc",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Sitla Mata mandir....",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Pahari Gate",
      "rating": 4.3,
      "address": "R655+P63, Pahari Gate Rd, Pahari Gate, Batala, Punjab 143505, India",
      "reviews": [
        {
          "text": "The historic Gurudwara Kandh Sahib is accessible from the very old Batala market. Until then, you can view the old haveli and various artifacts from that era.\nWithin a fort lay the whole city. Twelve gates marked its entrance and exit. The former names of these gates, including Sheranwala Gate, Khajuri Gate, Bhandari Gate, Ohri Gate, Thathiari Gate, Hathi Gate, Pahari Gate, Mori Gate, Kapuri Gate, Achli Gate, and so forth, are still in use. Even though their condition needs care, some of them are still living.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It was one of the entry gate to enter old Batala city. It has lost its pristine beauty rather now there is not even sign of old gate.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Area of a Historical city. Guru Nanak Dev Ji Marriage place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Pahari Gate is a passing gate to old Batala City locality,such likely other gates",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Earlier there is gate named Pahari gate\nIt was demolished in past time, only one of the wall is left\nNow this place is called Pahari gate",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}