{
  "places_with_reviews": [
    {
      "name": "Shri Kankaleshwar Temple",
      "rating": 4.6,
      "address": "Kanakaleshwar Premises, Momin Pura Road, near Ambedkar Statue, Mominpura, Beed, Bid Rural, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "A wonderful temple which is situated in middle of a pond. We went around 8 pm and the temple has the pooja and closure around that time. The Pujari said opening poojas and alankaras happen as early as 3 am to 5 am daily.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice peaceful place.\nBut the transportation is not good.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit temple for its architecture. Kind of unknown gem. Very less folks are aware of such a magnificent temple in Beed.\n\nThe temple is surrounded with water. The source of water is underground water. One have to wade through the water. See photos to understand.\n\nOne of its kind of temple. Worth detour if you are around Beed.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very beautiful place for the devotee.\nThe temple is good with nice architecture and idols.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is very beautiful and built with an enormous thought process but after taking a closer look at it,you will realise it is purposefully destroyed.There are few Lingas ,Naga and Nandi just kept outside the temple premises below the baniyan tree.I believe they must be part of Temple but purposefully taken out to destroy the power of the place.Government should pay attention and take the necessary actions.Also temple and surrounding area was not clean.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Khandeshwari Mata Temple",
      "rating": 4.6,
      "address": "2Q2G+C9R, Beed PImpalner Rd, Vipra Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "This is the place where I use to go So many times in a Year, specially for the 10 days of Navratri and Dashara...\nThe Carnival arranged the whole atmosphere created, and games, food, rides etc. So wonderful experience 🥰",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a Gaondevi Temple of Beed. The temple is located almost at one end of the city, however, in Navratri/Dussehra time, the place and nearby area is very beautiful and one should visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place to visit, especially in navratri season.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great place to visit in beed city.historical place well maintained and must have to visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Sukoon you feel while entering this temple is something which everyone craves for ..❣\n#Peace #divinepower",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "beed",
      "rating": 3.4,
      "address": "XQMF+9Q5, Shree Swami Samarth, Beed, Bid Rural, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "Deepak",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "So nice",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "Beedla khup ch bhari aahe firayla janta",
          "languageCode": "en-US",
          "rating": 3.4
        },
        {
          "text": "I am impressed ARHAN MANZIL",
          "languageCode": "en-US",
          "rating": 3.4
        }
      ]
    },
    {
      "name": "Shree Chatrapati Shivaji Maharaj Statue",
      "rating": 4.6,
      "address": "Shivaji Chowk, Datta Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "One of the best statue in the India of THE KING ❤️\nCHATRAPATI SHIVAJI MAHARAJ. The Only beautiful place in Beed .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of best statue in the Beed.\nMost crowded and busiest roadways in Beed where the Roads are open up to travel to Aurangabad, Dhule, jalgaon etc.\nMost of time this place is crowdy.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lovely statue. Absolutely elegant and displays the Maratha valor.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place Called as 'shiv teerth' the name of Chhatrapati shivaji Maharaj ckowk. One of the best historical statue in Maharashtra state region. Glory of Beed city.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beed is a city in Marathwada region of Maharashtra state in India. It is the administrative headquarters in Beed district.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sri Sri Radha Govind Temple ISKCON Beed",
      "rating": 4.7,
      "address": "2Q26+HCJ, New Mondha Rd, Sawata Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "Awesome Temple and with very good positive vibes , this is the first time I visited ISKCON temple. It was really a very good experience. Temple is under construction/renovation at the moment!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful and spiritual place... You can sit here all day and just keep looking to Radha Krishna... Kirtana in the evening mesmerizes the environment even more...\nEvery Sunday after the kirtana and prayer, every devotee and can have yummy and delicious prasadam like khichdi, Dal chawal , pulao etc... this is a must visit place for everyone living in Beed.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The deities here, Sri Sri Radha Govinddevji are awesomely beautiful!!!\n\nOne of the must-visit places in the town.\n\nThank you 🙇",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very Peaceful Environment to connect with Lord Krishna 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Divine place , where world's beuty is present in the form of Shri Shri Radha Govindji. Nice beautiful architecture of temple and pieceful place with gardens , goshala  , river banked and can  get nice gifts in gift-shop.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mohata Devi Temple",
      "rating": 5,
      "address": "Mohata Devi Mandir, Dhanora Rd, Sant Namdev Nagar, Mahatma Phule Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "this temple is at height.Temple-town of Renuka Mata. Yatra is celebrated during Navratri. This temple is india's biggest goddess temple And still temple construction is under process..!! one must visit for divine expeience !!",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Love it",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Calm temple..!",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Beautyful place",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "AhmedNagar road beed",
      "rating": 3.2,
      "address": "XQR2+5H7, Beed - Ahmednagar - Pune Rd, Shriram Nagar, Kranti Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3.2
        }
      ]
    },
    {
      "name": "Shani Maharaj Temple",
      "rating": 4.6,
      "address": "XQW8+MCW bhagwan transports, Vipra Nagar, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "One of the main shani maharaj shakti peeth temple in India..\nPowerful.place ..... Must visit during saade saati, to minimize the negative impact of saade saati...\n\nLocated in beed city... Car Parking not available beside temple...\n\nLocated within a kilometer from beed bus stand...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ancient Hindu open tample. Here is no roof on Shanidev tample.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place... This is half shaktipeeth among three and half shaktipeeth of Lord Shani... there is no roof top to this temple... it is believed that Vikramaditya has spent last two and half year during Saturn transit period here.. Old well you can see here... Easy to reach here.. Good place to visit...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice and simple construction, 1st of a kind temple with no roof. It is said that, anything that comes between Shani Shila and sun, is destroyed. May be that's the reason, even trees cannot cover it. None of the building here has locks  on their doors, do notice it when you visit. The accomodation facilities in bhakta nivas is very good and spacious, at affordable rates.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Khazana Well",
      "rating": 4.3,
      "address": "WQW2+MHX, Beed - Solapur Rd, Aher wadgaon, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "We Help Foundation team always keeps its clean request you all for the same.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Old well ...water was too clean when I visited...you can easily see bottom...it is said that water level never goes down through out the year.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Critical engineering to full fill the water requirements in beed city in anciant time..\nMaharani Champavati spend lot of money for    project...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A historical well,a masterpiece of engineering.Today also in a good condition.Fishes in it add a beauty to it and cathes attraction of tourists.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Historical well, good place to visit to have look how the irrigation system was well planned in Nizam period. Need more cleanliness of the well and surrounding areas.\nKhazana Well was constructed in 991 AH (1583) by Salabat Khan, a Jagirdar of Beed in the period of Murtaza Nizam Shah of Ahmadnagar. It is said that the water level in this well remains unchanged even in droughts. Three currents of water start from the well and irrigate the land of Barg o Zar (meaning ‘Leaves and Flowers’, pronounced in colloquial as Balguzar) around the town.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Krishna Mahanubhav mandir Beed",
      "rating": 4.4,
      "address": "Shri Krishna Mandir Hattikhana, Bir, Beed, Maharashtra 431122, India",
      "reviews": [
        {
          "text": "Peacful & Calm",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Free atmosphere",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice Temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "God of krishna",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}