{
  "places_with_reviews": [
    {
      "name": "Kanaka Durgamma Temple",
      "rating": 4.7,
      "address": "shop no 1, durgamma temple durgamma temple, KHB Colony, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Kanak Durgamma temple is located in the city of ballary, Karnataka. Goddess Durgamma is the main god in this temple. During auspicious days the devotees crowd is unimaginable. Temple is quite old and the architecture is like a wow. Few statues are created in metal and could be found outside the temple. A pond is there inside the temple. Recently the renovation work got completed and all the ancient rocks are covered with tiles and marbles.\nMust visit and get the devotional feel.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple.. ample parking.. goddess Lakshmi blessings",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kanaka Durgamma Temple, Bellary is an ideal destination for a incredible time along with your dear ones.. World standards, remarkable structure, progressive layouts, and nicely-concept execution make vicinity a incredibly coveted factor of traveller..\n\nSo, experience a fulfilling outing at Kanaka Durgamma Temple, in Bellary.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A divine experience. My respect to the sculptors who created Maa outside the temple, aaahhh what an image, feast to eyes, My stomach got full after seeing this particular statue. The positive vibes you get in the temple are high. Sri Mathre Namaha",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Famous in ballari, tuesday and friday are special puja wii be done, spiritual temple with huge crowd on these days, offerings done on these days, special darshana is also available. Few  minutes of  walk from city bus stand it is situated in the centre of the city, with a heartfelt experience of devi durgamma rituals.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ballari Fort",
      "rating": 4.3,
      "address": "4WX6+J3G, Devi Nagar, Ballari, Karnataka 583104, India",
      "reviews": [
        {
          "text": "First we felt it waste of time and money but after reached top approx 400 steps the view was amazing and beautiful… at that movement no one has there… the movement was captured… there best time to visit this place is morning and expect summer…. More history was hidden in this place…. There is no architecture in this place but should learn how to construct…this is one of the best monument… should visit and save it…. Entry fee Rs25 and just 2km from Ballary station….easy transportation….",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's good in construction. But as per tourism point of view nothing in that top port. Not even any evidence of war instruments used. After reaching that much height only you can see the entire city.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Bellary Fort, a historic marvel nestled in Karnataka, boasts a rich tapestry of tales dating back to the 16th century. Originally built by the Vijayanagara Empire, it witnessed successive rulers, including Hyder Ali and the British. The fort's strategic location atop Ballari Gudda hill offers panoramic views of the city below. Though weathered by time, its towering walls and bastions stand as enduring testaments to its storied past, inviting visitors to explore centuries of history.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Bellary Fort is a historical site with more than 3000 years of history. It was constructed at the time of Vijayanagar Empire by Hanumappa Nayaka. The fort was captured by Hyder Ali back in 1769 and was then remodelled by a French engineer. The fort is situated at the Ballari Gudda hilltop.\n\nOne of the major reasons for its attraction is the fort being built on a monolithic rock. The fort is divided into Upper and Lower fort. It is a polygonal fort with only one entrance. There is a citadel of 1976 ft. and includes structures like pools, cisterns, temple and cells. The tunnel is believed to have link to the cities of Sriragapatna and Mysore. The top can be reached with a single rocky way.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome place to visit.. Better to visit in the morning or evening.\n\nImportant: Take enough water while going to the fort... At least 3 litres per person.....",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Royal Circle",
      "rating": 4.1,
      "address": "Bangalore Rd, Satya Narayana Pet, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Under construction very old popular circle centre point of Bellary",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Please put a sign board at overhead bridge at Hosapete Road, so unknown people can know the left side road goes to Cowel Bazar, Jawans road and other areas overcome.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Ballari city will soon have another landmark, a 140-feet clock tower at Gadagi Chennappa Circle. The cost this project is 7crores.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's good place all the more hotels present in ballari",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very nice and friendly",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Sri Kumara Swamy Temple",
      "rating": 4.5,
      "address": "Devi Nagar, Ballari, Karnataka 583104, India",
      "reviews": [
        {
          "text": "It is Sri Kumara Swamy temple located in Ballari City, it is not the Kumara Swamy temple of Sandur, most people have confused & uploaded Sandur Kumara Swamy temple photos in this location, please don't mislead people, delete your photos & reviews here, upload the same in Kumara Swamy temple which is located in Karthikeshwara, Sandur\n\nAbout the temple, it is well maintained, there is Sri Kumara Swamy, Shiva, Ganesha, Anjaneya, Dakshina Murthi, Adhi Shankaracharya, Gayathri, Saraswathi, Navagrahas, Nagas (all deities packed at one place), Mango tree, Peepal tree & many more trees",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good temple & serving every saturday superb &tasty meal around 11am🙏👌",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ancient temple... Which has certain restrictions (Woman shouldn't enter inside the temple) but can visit parvathi Devi temple which is beside kumarswamy temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "For sure you will get peace of mind, vast space.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice historical place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Dr. Rajkumar Park || Ballari",
      "rating": 3.8,
      "address": "Station Rd, BSNL Office Opp, 4WWG+6FQ, BSNL Colony, Cowl Bazaar, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Not safe, Not Recommended\n\nLake with walk path\n\nIt is in Renovation stage but still open for people which is so dangerous.\n\nToo much dirty walk path, and children playground is very small and those are rusty and damaged, no parking place\n\nThey charged 15rs which is worthy to this small park\n\nSurroundings are covered fully polluted area like railway station, bus station, road traffic\n\nLess water in the lake and there is no boating or water fountain running",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Open public park for jogging and running in the morning near ballari junction in front of clock tower. Need to clean and maintain its.this is the only single big park in the City dedicated to superstar puneet rajkumar and their charges are below 👇\n5 year child - free of cost\n5-12 year children - 10rs\nAdult - 15rs",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Park is under repair. No water in pond . Renovation is under progress.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Well developed park, stil needs maintenance. To experience it's calmness visit on weekdays.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "A beautiful walkaround Park which surrounds a large pond, it's well maintained but some areas can  be improved.\nEntry fee is 15 per head, it's very peaceful eventhough it's located in the middle of the city.\nOverall a great place to spend some time.",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Ayyappa Swamy Temple",
      "rating": 4.7,
      "address": "232, Main Rd, 2nd stage, Patel Nagar, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Ayyappa Swamy Temple\nPeaceful 🙏🙏 place very clean maintenance",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the biggest Ayyappa Swamy Temples in Bellary. It’s the largest temple exclusively for Ayyappa Swamy. It’s a gold idol which is astonishingly beautiful. Priests and manager are very friendly. They organize every pooja very well. Every Wednesday is an auspicious day for Ayyappa. This temple is the perfect replica for the great Sabarimala Temple, Kerala.\nSwamiye Saranam Ayyappa.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "> I felt it as a top notch maintenance\n> Feels very blessed and pleasent place\n> Had a very positive vibrations\n> Every Wednesday evening there will be special pooja followed by MAHAPRASADAM\n> Regular Pooja's will be held\n> Sashwatha pooja facility available\n> Feels like visited to Sabarimala",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ayyappa temple in bellary very peaceful and trust maintained temple very clean and neeetly",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice temple and peaceful place where you can plunge in to divinity.. Nice architecture resembling the original temple structure..",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sai Baba Temple",
      "rating": 4.7,
      "address": "3rd Main, Bellary - Uravakonda - Anantapur Rd, Venkateswara Nagar, Satya Narayana Pet, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Famous temple in Ballari, it is built as same as Shirdi Sai Baba Temple which is in Shirdi.. I visit every Thursday to the temple it will be quiet peaceful environment inside the temple and Every Thursday Prasada will be distributed for the devotees,overall a good place to visit in Ballari.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We feel here similar to Shirdi Saibaba temple, very Good temple , get blessings from Lord Sai Baba. Every day Annadaanam for people really great.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I visited this temple once.It was really very good.Ambience was very good.I wanted to stay for more time.It gives a very good feeling.We feel peaceful.Sab ka Malik ek hi. Om Sai Ram.It is one of the best place to visit in Bellary.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place to visit temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple u must visit this place , It looks exactly like shridi Temple..",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sangameshwara Temple",
      "rating": 4.6,
      "address": "216, Moka Rd, KHB Colony, Basaveshwar Nagar, ಬಸವೇಶ್ವರ ನಗರ, Ballari, Karnataka 583101, India",
      "reviews": [
        {
          "text": "Main deity of the Temple is Shiva Linga, on to left Ganesha, on to right Parvathi, immediate left of Shiva Linga is Veera Bhadra, immediate right of Shiva Linga is Kumara, there is nala sethu brick (floating) in glass cube filled with water, there is water tank behind temple, Navagraha and Nagas to the right of temple, ample space to sit in the park, and even bus stop in front of temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Temple to visit. Calm atmosphere. Around temple having walking facility with Gym equipment for daily walking and exercize",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A mini kailash with the statues of Shiva with all his family, Navagrahas n shami tree.  Well maintained park.  Lots of people come every day for walk. Mini function hall at affordable price",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Calm and peaceful place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple of Lord Shiva where people from nearby areas visit here to take blessings. It is a sacred place with great power. Devotees also visit here to Shami tree (Banni Mara in Kannada) for darshan. This place is a pin location for the people residing near to this place.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Kote Malleshwara Swami Temple",
      "rating": 4.5,
      "address": "4WX8+59J, Narayanappa Compound, Fort, Ballari, Karnataka 583104, India",
      "reviews": [
        {
          "text": "This temple has one of the best background view, it has a mighty ancient fort behind. Location is approximately 3 kms from city center.\nIt has a mighty ground in front.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Age old temple with a great atmosphere and peace.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Just a little more time to go to sleep now so I'll be there at like a plan for the day eye on the way I can get a chance to talk to you and I was like I said that I was like oh OK well I guess I will be there in about an hour or two of them are going to be there in like an old friend of yours and you are a very happy birthday to you later on tonight and I don't have received this message in error and delete the original price is firm on price is firm on price is firm on price is firm on the way I am not going to the store to buy a year yet but I'm not gonna be a good night baby I love you until you get off work at the same to e to be there at the same to",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great temple in fort of Bellary... Very old one. Srhee kote Malleshwara swamy. Other name of Lord Shiv ji worshipped here. Om namha shivay..🙏🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This temple is very old temple Worship Lord Mallikarjuna an Take Blessings",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Anganwadi Centre Guggarahatti 2",
      "rating": 4.2,
      "address": "4WC6+44C, Cowl Bazaar, Ballari, Karnataka 583102, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Best for kids",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "One of developing mandal in ballari",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    }
  ]
}