{
  "places_with_reviews": [
    {
      "name": "MATA VAISHNO DEVI TEMPLE",
      "rating": 4.8,
      "address": "Swaroop Nagar line par, 665H+45R, Tundla, Uttar Pradesh 283202, India",
      "reviews": [
        {
          "text": "Very very very peaceful and holy place you get completely silence i suggested to visit this  at weekend and never go no navratri beacuse there will be so much rush at the time of navratri and you can't darshan properly it is on highway from tudla to firozabad national highway after the tudla toll plaza the important thing of this temple is  maa Vaishno guffa because it's seen just like the katra and give felling of Darbar I will enjoy tooo much there will be a park at gate where you can sit many schools are come on school trip with there student this temple is fantastic because it give real feel of Darbar inside the guffa I suggested that everyone must go at once to see this temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Timing information is wrong temple closes at 1pm and reopen at 3pm",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "BUDHIYA KA TAL (BODHI TAL)",
      "rating": 4.1,
      "address": "Burhia Ka Tal, NH2, Dharera, Uttar Pradesh 283202, India",
      "reviews": [
        {
          "text": "Amazing place\n🤔*Budhiya Ka Taal is an ancient place situated on the Agra Tundla Highway.\n🤔*which was built by Itmad Khan in 1592, the courtier of the Mughal Emperor Akbar. His tomb is also here and there are remains of 5 ghats near the pond.\n😨* The local people believe that the spirit of an old woman wanders here. It is said that at this place his spirit haunts the people who killed him and threw him here. Even today, as soon as it is evening, someone is afraid to go here alone.\n🤔*It is said about this place that many things related to Buddhism were found in Budhia's pond.\n🤔*The Archaeological Survey of India has preserved Budhiya Ka Taal.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This place has History.....Many Names of Britishers from British era (1847,1845)carved on the walls of the main tomb. AN MUST GO PLACE TO VISIT.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Bodhi taal/ Budhiya ka taal\n\nAnother important place around Agra (~20km) which is still unknown to people even though it is just 500m away from the main highway.\nA huge pond and a two-storied octagonal building built between it, on which a dome is built and a long bridge to reach this building. It may not seem so interesting to read but it is even more tempting to see in person. However, this place also needs a lot of care and maintenance like the rest of the historical building. The ponds.which are the lifeblood of this place are dry, the names written on\nthe walls and the garbage spread by the people going there (Cigarette packets chips covers..) are like spots on the moon. This place can be protected and developed as a tourist destination.\nThe original name of this place was Bodhi Ka Taal, which later changed to Budhiya Ka Taal. It is believed that Gautam Buddha stayed here. Buddhist idols have also been found in the excavation of the pond. This place is also known for water chestnut cultivation.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Hidden gem in agra",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Wonterful historical place.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Shri Siddh Gufa Sawai, Agra",
      "rating": 5,
      "address": "65WW+R4P, Barhan Rd, Etmadpur, Satta, Uttar Pradesh 283202, India",
      "reviews": [
        {
          "text": "Siddha Gufa made by Yogeswar Maha Prabhu Shri Ramlal ji Maharaj Than his Dicipal Yogiraj  Shree  Chandra Mohan ji Maharaj lived here and did Yog Prachar in all over  India and was President of World Yog Conference  his Dicipal Param Yogini Maa Umashakti  also stayed here . Strong Spiritual divine vibrations are there. You can have Darshan of Shakiputra Yogi Guruji Shree Sanjay Ji Maharaj . Yogi Dashlal ji is also there looking Ashram manegment. My father was also Dicipal of Yogiraj Shree Chandra Mohan ji Maharaj , we are going there from childhood My Father took  Yog Dikcha I think in 1961.Dikcha given  to us by  Param Yogini Maa Umashakti. Lots of  mercy and miracles are happening in our Pahargarh Family.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Feel divinity in lush green surroundings. Well known Yoga Ashram, seat of exalted Yogis. Parking lodging free. Feel at home",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Its is very nice feeling.whenever we go we felt heaven . it's our heaven not for othes only prabhu ji child",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jai shree prabhuji ki,  a divine place, must visit once in a lifetime🙏",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good place for followers\nNow with ample space, you will find piece",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Sawai Ashram",
      "rating": 4.8,
      "address": "65WW+P5G, Etmadpur Road, Barhan, Satta, Uttar Pradesh 283201, India",
      "reviews": [
        {
          "text": "It is one of the most auspicious place, where one can feel the presence of God .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The most beautiful temple I have ever been. Its just not a temple, its an entire world in itself. With peacocks, monkeys and whole world of greenery and peace.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is an ashram of our respected Shri Ramlal ji maharaj",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "this is the ashram of prabhu shri ramlalji maharaj...it is a blessed place for the ones who want to practice yoga and sadhna.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Amazing experience. Near to Yamuna Expressway. Love to go again.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sawai",
      "rating": 3,
      "address": "Sawai, Barhan Rd, Etmadpur, Swain, Uttar Pradesh 283202, India",
      "reviews": []
    },
    {
      "name": "Nagla punu",
      "rating": 3,
      "address": "7637+XV5, Swain, Uttar Pradesh 283204, India",
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 3
        },
        {
          "text": "Pankaj baghel",
          "languageCode": "en-US",
          "rating": 3
        },
        {
          "text": "Hiii cf",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    },
    {
      "name": "JAMA MASJID TUNDLA FIROZABAD",
      "rating": 4.6,
      "address": "Tundla Kham, Tundla, Uttar Pradesh 283204, India",
      "reviews": [
        {
          "text": "Place to offer Namaz",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I love masjid",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good mosque",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tundla Church",
      "rating": 4.7,
      "address": "665M+JPR, Railway Station Rd, Tundla, Uttar Pradesh 283204, India",
      "reviews": [
        {
          "text": "It is situated from the time of British rule. It is historical buildings. It is near from tundla railway station.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a beautiful place. This is not only one church but there is a old church and a new church. The old church is at the time of British India and new church is built before some time. New church is active and Christian Priest do pray accordingly to their Recognition.\n\nThank to read this description like this description and share to your family members. 😃😃😃😃😃😃😃😃😃",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very crowded area.because it is main chauraha of tundla.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Balaji Mandir",
      "rating": 5,
      "address": "66CG+8GV Balaji temple, banna, Mohammadabad, Uttar Pradesh 283202, India",
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jai Balaji Maharaj",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "St. John's Church",
      "rating": 4.6,
      "address": "St. John's Church Mission Compound, 65PQ+CWR, Etmadpur, Uttar Pradesh 283202, India",
      "reviews": [
        {
          "text": "Best spiritual place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean, green and spiritual environment",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}