{
  "places_with_reviews": [
    {
      "name": "Beluru Shri Chennakeshava Swamy Temple",
      "rating": 4.8,
      "address": "Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "One of the oldest ancient temples 🚩 of Lord Vishnu 🔱in India is known for its exceptional carving work. You must visit this place, spend some time, and learn about the temple's history. Interestingly, during that time, India was already aware of sex education and more.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Stepping into the ancient temple at Belur is like stepping back in time into a world of divine beauty and architectural marvel. The temple stands as a testament to the exquisite craftsmanship and devotion of its creators, with every inch adorned with intricate carvings and sculptures that tell stories of gods, goddesses, and mythical beings.\n\nWalking through the temple complex, one can't help but feel a sense of awe and reverence for the artistry and dedication that went into its construction. The atmosphere is filled with a sense of peace and spirituality, making it a perfect place for introspection and prayer.\n\nThe temple's ancient stones seem to echo with the chants of prayers from centuries past, creating a truly divine ambiance. Visiting this temple is not just a journey through history, but a spiritual experience that leaves a lasting impression on the soul.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most important exquisite ancient temples in the world. It’s amazing that it has survived this long without much damage/wind erosion. The stone carvings are incredibly ornate and intricate. It is a living shrine, so one has to follow certain rules while visiting and be respectful to the religious beliefs of pilgrims and worshippers.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Absolutely beautiful place with a soulful connection to God. Highlight of this temple for me were the super detailed carvings and the story they told through them! Truly pictured the whole history being told through architecture and the sculpting of these beautiful Soapstone structures. Must visit  ✨",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Pros\n1.You must visit the temple to see the best architecture, easily you can spend\n1 -2 Hours\n2.Photos allowed in this temple.\n3.You want to explore without distribution better to visit weekdays.\n4.Parking space available.\n5.No entry fees.\n6.Paid separate shoe stands available.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Yagachi Dam Belur",
      "rating": 4,
      "address": "5VJ9+9G2, Attalgere, Karnataka 573115, India",
      "reviews": [
        {
          "text": "It’s a small dam on yagachi river. Around 2.5 km from the belur bus stand. Open through out the day from morning to evening. During or post monsoon would be good to visit when the water would be released. One can walk around in the park which runs across the dam and get a nice view of the water flowing.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good place to visit during rainy season. We didn't found water flow at this time (27 Jan).\nYou can include this place when you are planning for Halebidu and Belur. Full of nature surrounding. Enough parking space and small shops you can buy stone and wood work items. Almost no food option when we visited.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Overall good construction of the dam.  It was closed when I visited probably due to less rain in karnataka.\nBut construction of the dam liked amazing, strong and good tourist attraction.\nIt is very big,  you can see how big,  dangerous it looks.\nThere was a small canal liked very pretty.\n\nGiving 4 start as they need to put more safety by putting big mash on the sides as there are enough opening from where kids can fall.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It is just like any other dam. Not visited by many people.  But, it is very well maintained. A good place to come for picnic.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "The dam is worth visiting only when there is enough water to be released. I've gone there twice, one is summer and other time at monsoon end. But unfortunately couldn't see the dam in its glory. So the rating is totally based on my visits and I might change it in the future.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Hoysala Emblem",
      "rating": 4.5,
      "address": "yagachi bridge, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "Please don't be misled by the reviews and photos mistakenly uploaded by people. The pictures you see are actually of the Hoysaleshwara Temple, not the Hoysala emblem located near the road. The temple itself is truly magnificent and deserves all the praise and admiration shared by visitors.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Hoysala Emblem really shouldn't be labelled as a \"tourist attraction\"; it's a small statue in the middle of the road.\nI give a bonus star though for these fun \"touch me not\" plants in the garden bed next to it!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place,but try going on weekdays",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It was a very nice and beautiful stone architecture must see this place once in life",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a beautiful statue on the bridge towards the city/temple.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Kappe Chennigarāyana Temple",
      "rating": 4.7,
      "address": "5V66+X5M, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "A small shrine located within Chennakeswa temple complex, Belur.\n\nIt is situated on the right side of the temple. When you enter the temple complex, you will find the temple on your left side. It is right besides Soumya Nayaki or Maha Lakshmi temple in the complex.\n\nThis temple is said to have been built by the queen of king Vishnu Vardhan.\n\nNot to be missed when you are at the ChennaKeswa temple.\n\nDefinitely recommended",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It a place you should kit miss. There is magical positve vibe you can feel. Amazing stone works, combination of rich art work depicting various form of emotions,  styles, culture behaviors. Those works are extremely detailed and each one contains micro arts makes it more interesting. If you are a true lover of art take a guide. Certain days are auspicious and parking is difficult.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Adjacent structure to the main ChennaKeshava temple.\n\nThis is again an architectural marvel.\nIt is unique in its own way.\nWhile the main temple was inaugurated by VishnuVardhan Hoysala, this adjacent marvel was inaugurated by the Queen, Santaladevi.\n\nThe idol in this temple is exactly same , but smaller than the idol in the ChannaKeshava TEMPLE.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Heritage preserve location ,peace+calm=weekdays",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice old temple built during hoysala kings period. Well maintained.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ancient Hoysala Shri Pathaleshwara Temple",
      "rating": 4.4,
      "address": "5V77+2G8, SH110, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "One of the most famous places in Belur, the Paathaaleshwara Temple is one of the ancient sculptures constructed by the Ganga kings. Known for the colour-changing lingam present at the temple, the place attracts thousands of tourists. Constructed by carving on stones, this Belur temple has fantastic architecture. Standing in near ruins, this little wonder of Karnataka is an understated one.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A very small temple in Belur. Only locals visit this temple. You hardly get to see the tourists here.\n\nIt’s recently renovated. You can clearly see the work done here. It does have some sculptures from the earlier days here and they are beautiful.\n\nThe Nandi here is again quite beautiful. You can also skip this temple if you are short on time. But if you are in Belur, it makes for a good stopover.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a very small Shiva temple but a good piece of Indian art and culture.  It is very close to Chennakeshavara Temple complex.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very old and beautiful temple in belur which has been renovated recently",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One of the most famous places in Belur, the Paathaaleshwara Temple is one of the ancient sculptures constructed by the Ganga kings. Known for the colour-changing lingam present at the temple, the place attracts thousands of tourists. Constructed by carving on stones, this temple in Belur has fantastic architecture. Standing in near ruins, this little wonder of Karnataka is an understated one.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Belur Matta, ಬೇಲೂರು ಮಠ",
      "rating": 5,
      "address": "5V74+JP7, Gendehalli Rd, JP Nagar, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "This Matta was established more than 150 years ago when a famous Saint chose this place to rest on his way to thirth yatra. Since then the landlord who built a small shelter to make it divine with his presence where the family does Pooja on regular basis to keep the family tradition.\n\nMost often this is been visited by family members and there relatives frequently.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nice calm and divine place with lot of positive energy.\nThere is a kalyani which never dries and you can find water 365 days all through the year . Good place to worship !",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Shri Veeranarayana Swamy Temple",
      "rating": 4.6,
      "address": "5V75+4XF, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "Located to the west of the Kesava temple, the Veeranarayana temple is a small but complete temple with a garbhagriha (sanctum) and a navrang (nine square hall) with 59 large reliefs on the outer walls. Measuring 70 feet by 56 feet, this temple of Belur is dedicated to Vishnu, Shiva, Bhairava (angry Shiva), Brahma, Parvati, Saraswati, Lakshmi, and others. Dating back to the 12th century, some panels depict the Bhima story from the ‘Mahabharata’.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a small temple inside the chennakesava temple complex",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Viranarayana temple is a small temple, west of the Chennakeshava temple\nIts outer walls has 59 large reliefs dedicated to Vishnu, Shiva, Brahma, Bhairava, Lakshmi, Parvati, Saraswati.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "SImilar to other temple in the premises, this temple too has amazing architecture, both within and outside the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Architecture is really good! Its small and you are not allowed to take photos inside the temple.\n\nNo charges to enter.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Amrutheshwara Swami Temple",
      "rating": 4.5,
      "address": "5V56+CWP, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "Old temple is demolished and new temple construction is happening",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a must visit temple....marvelous architecture.....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Sri Nanjundeshwara Temple",
      "rating": 4.6,
      "address": "5V77+H5M, SH110, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "It is one of the oldest temple in Belur which was built before the construction of Lord Chennakeshava temple.Out side the temple you can see another Shiva linga named karigalleshwara which was first inside the temple after that it was damaged by enemies in past later it shifted out side and new one has placed inside.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lord Shiva temple. Very old temple. Well maintained. You will love the Nandi statue inside the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Old and well maintained temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful Temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sri Puradamma Devi Temple",
      "rating": 4.6,
      "address": "5V56+M94, Belur, Karnataka 573115, India",
      "reviews": [
        {
          "text": "Best place to everyone visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good temple\nVery nice place 🤠",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Correct location",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Halebidu",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏🙏🙏🙏👍👌",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}