{
  "places_with_reviews": [
    {
      "name": "ISKCON temple Bangalore",
      "rating": 4.6,
      "address": "Hare Krishna Hill, Chord Rd, 1st R Block, Rajajinagar, Bengaluru, Karnataka 560010, India",
      "reviews": [
        {
          "text": "The place is very peaceful. The complex has a lovely green bush area. The internal temple complex is beautiful, and the temple is well-maintained. However, it seems like this place of devotion has been turned into a commercial area. There are numerous stalls selling everything from food items to clothing to children's games and so on.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing place. Perfect place to visit with family or friends. Very peaceful place. The temple of Krishna is very beautifully decorated. Now everything is turning into business. Everywhere you have to pay money. There is a complex where they have so many shops selling everything to earn money.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "There are about 12+ ISKCON Temples in Bangalore. When I visited the temple, here were not many visitors at that time, arrangements are in place to accommodate a long queue. There is a place to keep your footwear before entry, as well as a place for safekeeping your camera equipment. No photography is permitted within the temple. There is no fee for entry.\nThe temple is orderly, very clean and well maintained. The architecture is striking and is a combination of modern and traditional aesthetics. A prominent feature is a tall – gold-plated flag post. The chanting of “Hare Rama – Hare Krishna” lifted me to a feeling of holiness.\nThis area also has a lecture room, exhibition area and a movie theater showing Krishna related movies and documentaries.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple is so beautifully constructed and the roof painting r so heavenly view along with live devotional song.... Marvelous place with golden structure around the statues of Krishna... All the way from baggage, slipper places well organized and the way till the main sanctum beautiful....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is truly amazing and has such positive and peaceful vibes that can instantly uplift your spirit.The main temple of Krishna is beautifully decorated.This temple offer free and absolutely delicious prasadam to every devotee.There are stalls selling antiques and other unique items.  ISKCON Temple in Bangalore will leave you feeling spiritually enriched and at peace. Don't miss out on this soulful experience. This is a perfect place to visit with your family or friends if you want to spend your day being peaceful. This place provides great peace and makes you feel so light and enlighten.\nBut the sad part is everything is turning into business. From footwear to other things, you will be paying money. Now it is less of a temple and more of a business. They have turned it into a complex where they have so many shops selling everything to earn money. Some place needs to be sacred and should not be turned into business. Slowly everything is getting monetized.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Lalbagh Botanical Garden",
      "rating": 4.4,
      "address": "Mavalli, Bengaluru, Karnataka 560004, India",
      "reviews": [
        {
          "text": "Lush green park, perfect for a family visit. As well for a jog / walk alone. It has a well maintained lake along with a running track (which can be made more run friendly). Currently it's uneven. Overall upkeep can be improved too, with better signage and stricter measures to curb waste spills.\n\nGood that it has entry on all four sides and metro connectivity for better commute.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The trees in this garden are absolutely amazing. Massive, well established, and breathtaking. The garden as a whole is fairly run down, and the glass house that is the \"main\" attraction was very disappointing. It's not expensive to get in, so it's still worth its money, but I was just expecting more, especially with the climate in India.\nBathrooms were clean, a little old, but working. I loved that for once in India, there were bins every 20-30meters, but it's a pity that the locals still throw their rubbish on the ground even with the warning signs that you will get fined.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Visiting Lalbagh Botanical Garden in Bangalore with family is a delightful experience. The garden, spread across 240 acres, offers lush greenery, a serene lake, and a variety of flora, making it an ideal place for a family outing. Visitors can enjoy long strolls, picnic areas, and good snack stalls throughout the garden, making it suitable for families with kids. The garden also hosts flower shows during special occasions, adding to the beauty of the place. With its natural beauty and numerous attractions, Lalbagh Botanical Garden is a must-visit for nature lovers and families in Bangalore.The feedback for a visit to Lalbagh Botanical Garden with family is overwhelmingly positive, with visitors praising the greenery, picnic spots, and overall natural beauty of the garden. It is recommended for families looking to spend a relaxing and enjoyable time surrounded by nature.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A beautiful garden spread across 240 acres of land space in the centre of the city.\n\nLush green and full of exquisite trees and plants, it also houses huge number of birds, hence a delight for nature and bird lovers.\n\nIt has a glasshouse and a Lalbagh lake which are very famous with the visitors. The garden is open from 6 am - 7 pm. Entry is free between 6 - 9 am and 6 - 7 pm. 9 am - 6 pm there is a nominal entry fee.\n\nCome early with time in hand and you would love this place. Lovely place for sunrise and sunsets.\n\nBest place in Bangalore for sure. ❤️❤️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Pleasant Garden. There is a ticket of 30/person for adults. This place is good to spend a couple of hours walking in nature. You can spot monkeys owls eagles ducks very easily. Its green and very soothing place. You can also get a pretty view of banglore from the hill top, there is also a lake in this garden. Overall its a good place to visit with friends family or even alone",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bengaluru Palace",
      "rating": 4.2,
      "address": "Bengaluru, Karnataka, India",
      "reviews": [
        {
          "text": "Not worth paying 240 Rupees.\nWould not recommend spending that much money on this.\nIf you still want to, the palace is good from outside, see and move on.\nInside nothing is there rather than photos of maharaja and some clothes.\nDo not spend 240 rs here instead of this you can visit Mysore palace.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "My visit to Bangalore Palace left me with mixed feelings. I found it quite distinctive in its architecture and surroundings. However, like many others have mentioned, the palace appears quite dilapidated, which was disappointing.\n\nFirstly, the ticketing process was a hassle, especially since the prices for tourists were considerably higher than for locals. Additionally, the extra charge for photography further added to the expenses. Consequently, I could only capture the exterior and the gardens, missing out on interior marvels.\n\nConsidering the relatively steep entrance fee of 480Rs, one would anticipate better upkeep of the exhibits. Inside, an audio guide, available in both Hindi and English for deposit of your ID card, provides insights into its history, somewhat compensating for the lackluster maintenance. Unfortunately, many described items were missing, and the overall state of the exhibits was poor. While some parts have been converted into a museum, others are still retained by the royal family, resulting in a disjointed viewing experience.\n\nDespite its worn-out appearance, Bangalore Palace serves as a hub for various cultural events, from rock shows to marriages. Nevertheless, I recommend visiting Bangalore Palace for its historical significance and the glimpse it offers into India's monarch days.\n\nOverall, while there are areas that need improvement, the audio guide and the palace's unique ambiance make it worth a visit, albeit with tempered expectations.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is always interesting to know about our history and the past. In the Bangalore palace it's the same thing. But i didn't feel the vibe of a PALACE there. Anyway their entry charge is 240 for one person. I don't feel that is even worth visiting that place.\nInside the palace you are not allowed to take any picture of yourself or even the palace I think that is not good for visitors.\nElse as I always tell you, I can give you some glimpses from there rest you should go and try visiting yourself.\nHave a safe journey.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "My experience of visiting the place is mixed, but yes a one time visit and also quite sad on how those kings treated wild animals and made structures using them.\n\nBasically this palace is not much old, have a mixed style of different buildings we have saw some of our journey.\n\nPlease take the audio guide which is free to know about the history of each things that they have mentioned in there.\n\nIn the entrance after the main hall in the wall you can see the head of an elephant chemically treated, and can see legs that are used as stools.\n\nIf you are photo lover you can take couple of snaps there. Garden is not properly maintaining.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful palace. Great tourist attraction, does not have anything to eat or drink nearby so plan accordingly. Rest all is good.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shivoham Shiva Temple",
      "rating": 4.2,
      "address": "Kemp Fort Mall, Parking Sri Ram nagri, 97, HAL Old Airport Rd, Ramagiri, Murgesh Pallya, Bengaluru, Karnataka 560017, India",
      "reviews": [
        {
          "text": "Our Saturday morning visit to Shivoham Shiva Temple was a tranquil and spiritually uplifting experience. The temple's serene ambiance, intricate architecture, and soothing chants created a sense of peace and reverence. Participating in rituals and receiving blessings felt deeply meaningful, fostering family bonding and spiritual reflection. The staff's warmth and the available amenities enhanced our comfort and enjoyment. Overall, our time at Shivoham Shiva Temple was memorable, leaving us with a renewed sense of spirituality and gratitude. It's a sanctuary we highly recommend for those seeking a tranquil escape and a deeper connection with the divine.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "\"Amidst the hustle and bustle of Old Airport Road, a serene sanctuary awaits: the Shivoham Temple. Nestled amidst the commercial fervor, this temple stands as a tranquil oasis, beckoning families and devotees alike for a blissful day out.\n\nAt the heart of the temple stands a magnificent Shiva statue, reminiscent of Mount Kailash, towering majestically against the cityscape. Its divine presence casts a calming aura, offering solace and spirituality amidst the urban chaos.\n\nDespite its bustling surroundings, the Shivoham Temple provides a serene escape for families seeking a day of spiritual rejuvenation and bonding. The temple grounds offer ample space for children to play and explore, while parents can immerse themselves in prayer and contemplation.\n\nBeyond its spiritual significance, the temple also serves as a cultural hub, hosting various events and festivities that celebrate the rich heritage of Hinduism. From vibrant festivals to insightful lectures, there's always something enriching happening at Shivoham.\n\nMoreover, the temple's location in a commercial hub ensures easy accessibility and convenience for visitors. After a soulful visit to the temple, families can indulge in a day of shopping and dining in the surrounding areas, making it the perfect destination for a wholesome family outing.\n\nSo, whether you seek solace in prayer, cultural enrichment, or simply a peaceful retreat amidst the urban chaos, the Shivoham Temple on Old Airport Road welcomes you with open arms, promising a day of spirituality, serenity, and familial bliss.\"",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Pretty Mid in my opinion. Not worth paying the minimum 150 just to pay a visit. On top of that each priest asks for his 50/100 to do some Puja or anything. A temple should never be elitist, where only people who can pay come. Allow everyone to come, if I am happy and most probably people will give money as charity to the temple. You guys can probably earn more this way. On the plus side, at least people were having a good time during the evening prayers. The diyas give a different vibe to this. People are generally friendly. It will take you around 1-2 hours during the weekend. The cave can be a bit claustrophobic with no clear ventilation. So proceed accordingly. Any ways, Peace 🕊️.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very easily approachable temple in the City itself.\nThe entrance is very beautiful and interesting but parking is an issue here.\nBeside the temple entrance, there is a Mall where you can pay and park your vehicle and can visit the temple.\nInside the temple you have to take tickets. If you want to see the status from outside then there is no charge. If you want to go little inside the 50 rupees is the charge and if you want to perform Pooja then you have to pay 150 per person. But you can visit the caves and can go near to the Mahadev statue.\nOverall a very nice place to visit.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Shivoham temple is a 'modern' temple with an activity like package that comes at 200rs/person.\n\nAt every point there is a collection for donations which makes it more of a business venue than a holy place.\n\nRegardless, good place to visit once - especially if you have kids.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Sri Karya Siddhi Anjaneya Swamy Temple",
      "rating": 4.8,
      "address": "3rd C main Rd, 1st phase Girinagar, Kadavanthra, Banashankari, Bengaluru, Karnataka 560085, India",
      "reviews": [
        {
          "text": "Wonderful experience. Once you enter u can feel positive energy. People believe whatever they prayer or ask usually through offering coconut. This coconut is tied for 16 days. It is believed that within 16 days ,our wish gets fulfilled.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Super Spiritual place\nThis place so much crowded on public holidays and Saturday Sundays. They say if we wish something and perform a puja for 16 days and tie a coconut in the temple. It will be successful that what we wished for to try a coconut. They will charge hundred rupees, and they will tell us to chant a mantra in our homes for 16 days, in the period of 16 days, we have to visit four times to the temple.\nRecently from past year, the main temple was under construction. Now it has been renovated and now it is accessible for the public. The interior was splendid. The new work is very good. Now the normal people can visit the main temple. It’s open for everyone.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A great place to visit and get spiritual energy...It is deeply believed as tying the coconut and doing vrat for a month will make your wish come true...a lot of youngsters looking for marriage and few other pending desires visits the place...It is recently renovated and cleanliness well maintained...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Karya Siddhi Anjaneya temple is known for its Poorna Phala Samarpana. Here, devotees offer poorna phala  to Lord Hanuman to fulfil their wishes. Patience is a virtue. So, in order to fulfil your deep-seated wish you must first of all be ready to have complete faith in the divine. And follow a set procedure over a course of 16 days.\n\nPray with all your heart and your prayers will be blessed.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very divine temple with a very positive environment also has a tradition that if we tie coconut wishing for anything it will happen within a given time...",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Bande Mahakali Temple (Moola udbhava Devi)",
      "rating": 4.8,
      "address": "Kempabudhi kere yeri, No 75, shri Bande, Mahakali Temple, Brindavan Nagar, Gavipuram Guttahalli, Srinagar, Kempegowda Nagar, Bengaluru, Karnataka 560019, India",
      "reviews": [
        {
          "text": "Nice Place I visited by seeing so many people visiting this place. It's really such a calm and peaceful place I ever felt in my life after visiting many Temples. 🙏💐🌺🙏 We can see her from too close to our eyes how much time we can. Really I was very happy after visiting this place and by seeing  temple facilities. 🌺🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The best part is that they display live telecast of the arti and abhishekam on screens around the garba griha. This is convenient as the chamber is not large enough to accomodate many devotees.\n\nOn Sunday you will find a lot of people there waiting in queues inside the temple.   Apart from Mahakali you will find shrines dedicated to many other devis. The pooja stalls are inside the temple.\n\nYou will have to pay Rs.5/pair for leaving your footwear safely at the entrance. They luckily have UPI payment method.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good temple to visit. You can offer flowers and coconuts in temple. Most of the people come here to get blessings of maa Bande Mahakali and offer prayers, coconut, removal of Dhrusti(done backside). Crowded on Tuesday, Fridays and weekends",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The ammavaru idol is very big and the temple is powerful. Movie stars also visit this temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Such a blissful place 😊😍I visited first time and it’s so peaceful😊well maintained too 😊you just can’t take eyes off of goddess 😊must visit .Sunday,Tuesday and Friday will be bit crowded",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Snow City Bengaluru",
      "rating": 4,
      "address": "Fun World Complex, 1st floor, Snow city, Jayamahal Main Rd, opposite TV Tower, J.C.Nagar, Bengaluru, Karnataka 560006, India",
      "reviews": [
        {
          "text": "We enjoyed a lot. Very nice experience.\nWe booked in advance.\n\nThey have time slots of 45 min. You get jacket, waterproof shoes and gloves as a paid package. Better to give thick dresses if you are going with kids. Carry your own socks, though you get 50rs 1 pair. Mobile phone charges is 50rs inside snow area\n\n750 ticket on weekends\n650 during week days.\n\nA small canteen is available inside the snow area which serves mom's , sandwich, juice , and few food items.\n\nInside is clean and hygienic. Have ample car parking space.\n\nGood to spend time with family.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good place to let kids experience snow if they have not seen it earlier. The whole show is well organised in terms of timing and the process. It gets really cold after a while though they give jackets, shoes and gloves. Well advised to wear extra socks or good woollen ones definitely . The snacks are not that great but you get something warm after the visit. They can seriously improve it given the footfall they get. Antique coffee machine coffee and soggy French fries just not good enough.  It would cut down one star just for the snacks.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "1. So if your going on weekdays no online or prior booking of tickets needed.\n2. Yes your feet might be numb after some time because of the ice...\nthey will provide you with jackets, long boots, and gloves. You can buy socks but I would suggest taking your own socks because you can't wear those socks again and it would cost you 50 Rs per pair.\n3. There would be snow for 5 mins so be sure to be there not engaged in slides or other activities and lastly there would be some club vibe because of the loud music and lighting.\n4. There was a rope to climb some sort of hill it was a bit on the adventure side because of snow.\n5. Be sure to click good pictures.\n6. If you are taking your kids for a outing then yes it's best option.\n7. There was a kind of food court, we ate Maggie it was just okay okay.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Not worth the ticket price they are charging.\n\n1. Each session is actually for 45 mins. By the time you enter and take pics, couple of rides, time is over.\n2. Kids find it very difficult to walk and enjoy properly since they provide small length shoe where ice enters in the shoes. Make sure to take a long length shoes from them even for kids.\n4. Carry your own thick socks instead of buying from then for ₹50 per pair\n5. Snowfall was as done for 2-3 mins only.\n6. Weekdays special prices for first 3 sessions was ₹500, otherwise they will charge ₹650 and ₹750 over weekends. Too costly for such a short session",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Excellent place during this extreme hot summer,it's a fun place for kids to visit once, the place is decent for the price, there is small cafe which serves Momos, tea n coffee.. If you never experience snow it's worth spending some time. Keep in mind that it's going to be extremely cold in there. so,careful with kids... must visit place...",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Dr. Rajkumar Memorial",
      "rating": 4.5,
      "address": "Kanthirava Layout, Kanteerava Nagar, Nandini Layout, Bengaluru, Karnataka 560096, India",
      "reviews": [
        {
          "text": "Quiet place, Memorials of Dr Rajkumar, ಪಾರ್ವತಮ್ಮ Rajkumar, Puneeth Rajkumar and Ambareesh are at this place. Hundreds of visitors visit here daily. They are emotionally attached to this Kannada Film industry family. They pray, they cry, they sing, they dream. It's something like a mixed feelings of the people here. Even after year's of their non existence on earth, they're remembered everyday by Hundreds and thousands of people. This is what is their achievement. Which cannot be expressed or measured. ,,💕Love Puneeth Rajkumar. An eternal soul. We all miss you....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Well maintainance. Best to visit once. Due to their fans and urge to have photos had lost the peace in this Memorial.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Never expected to see Appu here so soon. Always in our hearts.. ❤️❤️\n\nPlace gets crowded during weekends and holidays, there is police to watch the crowd but there is no line system so people rush in, security personnel should look in to this and maintain silence and discipline.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Start heros Puneet Raj Kumar our mother and father mausoleum.and view point please visit Bangalore",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Fantastic location to visit. You can spend time with your loved ones and friends. However, i humbly ask that you please note that a grandma is selling kadle(Groundnut) next to kanteerava studio. So, make a purchase from her. It'll be beneficial for her daily requirements.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Visvesvaraya Industrial & Technological Museum",
      "rating": 4.6,
      "address": "5216, Kasturba Rd, Near Chinna Swamy Stadium, Ambedkar Veedhi, Bengaluru, Karnataka 560001, India",
      "reviews": [
        {
          "text": "This museum provides an enriching experience for children aged 10 and above, offering educational insights into technology and science. Ideal for science enthusiasts, the well-maintained environment and diverse exhibits make it a must-visit for anyone seeking knowledge. Visitors of all ages, especially children, will find delight in exploring the various sections, experimenting with scientific displays, and enjoying themed exhibits such as the captivating 3D show and the exciting Dinosaur pavilion. Additionally, the museum features dedicated areas for fun science, space, biotechnology, and electrical displays, ensuring a comprehensive exploration of scientific wonders. Don't miss the engaging shows and consider a visit to the canteen on the top floor, though parking may be limited.\n\nParking:  very limited\nRestroom 🚽: present and cleanly maintained\nFood : the top floor has one restaurant (maintained by North Indians, food quality is so so)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is of great learning for all kinds of age. (Except elderly as you need to walk and climb stairs up/down, the lift is very small which is the only con).\n\nThe museum has almost all working models which can help folks to understand the working of it.\nRecommend taking children's here, it can be a whole day of learning.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This museum is very good for children above 10 years because it is very educational place where anyone can gain knowledge about technological and scientific things.\nA perfect place to visit who love science and technologies.\nEnvironment was nice and maintained well.\nMust visit once, it is really a great place of knowledge.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Definitely a must to go place with your kids. It is a 3 floor facility. Make sure you reach there by 10 am there are various shows for which you need to purchase a ticket and make a note of the timings of the show. Try to plan now as schools will be closed and there will be no educational school trips so less crowded. Most of the payment is via upi only so make sure you have needful app. Please plan out accordingly as you may need the whole day. Carry enough water and food which will last for members. There is a canteen on 4th floor but food is somewhat OK not great.Sometimes your text book does not show you everything in such cases visually seeing them function may surely help the development of the child and clarifying the concept . Please make sure you take your child and also please share feedback if my reviews help you in making a decision I will be very grateful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Knowledgeable place. Students can learn theory of different subject with live fun games.\n\nEntry fee - 80 rs per person\nFood- Available at top floor",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ragigudda Shri Prasanna Anjaneyaswami Temple",
      "rating": 4.8,
      "address": "WH7V+P77, KSRTC Layout, Jayanagara 9th Block, Jayanagar, Bengaluru, Karnataka 560069, India",
      "reviews": [
        {
          "text": "The Ragigudda Shri Prasanna Anjaneyaswami Temple, located in Bangalore, is a serene and spiritually enriching place. The temple's architecture, blending modernity with tradition, is captivating. The main deity, Lord Hanuman, exudes a sense of peace and divinity. The temple's ambiance amidst lush greenery provides a tranquil escape from the city's hustle. The regular cultural events and festivals held here make it not just a religious site but also a hub of community engagement. The temple's charitable initiatives and social work further exemplify its significance beyond religious boundaries. A visit to this temple is a soulful experience, offering solace and a sense of connection to spirituality.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "We visited here last Monday on 5 PM.This place is very calm and quiet and beautiful. Not too crowed like other places. The temple contains several small temples apart form the lord Hanuman main temple on a small hill.mesmerizing view from the top of the hill.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very calm and peaceful yet so powerful. Located on a small mountain.\nIt has got stairs to climb, so not a good place for ppl with knee problems or who are old.\nNo Parking space fr 4 wheelers.\nSeparate counter to leave footwear in a bag which can be collected while returning.\nOn 16th feb there was jatre.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A Hindu pilgrim centre which provide utmost  serenity to the devotees. Calm and Devine place with hygiene. Better arrangements for keeping footwears safe. The temple has beautiful ambience (artifical fall)and security arrangements for avoiding rush. The temple is partially situated on the top of a Hillock. However, the toilet is worst in condition.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful place, peaceful, 10 rs for laddu Prasad else it's free. Try to visit after 5 pm on weekdays,it's completely empty and there will be no chaos.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}