{
  "places_with_reviews": [
    {
      "name": "Sree Seetha Ramachandraswamy Vari Devasthanam - Bhadrachalam",
      "rating": 4.7,
      "address": "MV8M+P25, Bhadrachalam, Telangana 507111, India",
      "reviews": [
        {
          "text": "Being a non religious person..\nif phone are not allowed.. nothing much I can say..\nTemple closes between 1-3 pm.. but, my friend (resident)said it's open after 6pm..\nVery accessible..not too much crowded..\nTwo entry points..1st entry has lift option.. second one have don't..\nI visit on good Friday (3 day weekend)..\nNot too many steps..lift available..\nphone must deposit..but most of employees use mobile phone..\n25per laddu..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sri Rama temple, where lord Sri Ram was pleased by badri and granted his wish to stay on his head along with Sita, but he forgot to wear the shank and sudarsan in the correct hands.\n\nYou can keep your mobile/electronic devices and luggage safely in lockers near the temple. If it's not during kalyana mahotsavams near Sri Rama Navami, you can avail free darshan within 10 mins, else you can buy a ₹100/- tkt as well.\n\nThe temple has a museum where all historical things related to the temple, ramadasa and many other things are safely stored .\n\nYou can visit the place where badri's wish was granted by lord Rama after you darshan lord Rama from garbha gudi.\n\nYou can visit the coast of the Godavari river, you kalyana katta, lord Anjaneya temple and people also avail pinda karmas near the coast.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lord Sree Sita Ramachandra Swamy Temple in Bhadrachalam is a Hindu temple of Lord Rama located in Telangana, India. The area is called as Bhadrachalam and is the venue of grand celebrations on Rama Navami day, when the wedding anniversary of Lord Rama and his consort Sita takes place with much fanfare, huge rush on Sunday",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "For piligirms little bit care is less for refresh after reach via hardels of journey through bus from bhadrachalm cross road railway station and prasadam also not prepare as per the estimated visitors over all little care should be increase about temple as well as pilgrims minimum facilities",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple dedicated to Lord Rama, Seetha, and Lakshmana on the banks of River Godavari. Bhadrachalam is approximately 112 km from Khammam and 188 km from Rajmendry (AP). Bhakt Ramdas has constructed the temple and composed many Kirtanas, which are known even today. The temple is located on a small hillock, and one has to climb 20 or 30 steps. Well maintained and clean temple. There are several small shrines and separate shrines for Goddess Mahalakshmi, Bhadradri, and Lord Hanuman. Temple also has a shrine for Ramdaa. The tradition followed at the temple is Vaishna Agama, similar to that of Sri Rangam. Sri Rams Navami, Mookoti Ekadasi and annual Bramotsavam are celebrated. One must visit this beautifulvt",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sita Rama Temple.",
      "rating": 4.5,
      "address": "Seetharamachandra Swamy Temple, Bhadrachalam, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "The Sita Ramachandraswamy Temple at Bhadrachalam exudes spiritual serenity, with its intricate architecture and tranquil surroundings creating a perfect ambiance for devotion. The divine aura and the melodious hymns during prayer services contribute to a truly uplifting experience, making it a must-visit destination for seekers of spiritual solace.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "🚩",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A nice place to visit near the river is awesome",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful inside the temple. You can take steps to reach up somewhere around 70 steps need to climb.. for old people there is a lift as well. Temple is situated on the bank of the River Godavari. We can take general Darshan in ordinary days. Or they have special Darshan of 100, 500 I preferred taking general Darshan since it was normal day without rush.  Phones not allowed inside temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "We are Rama Bhaktas. Yes... It's our home town. We grown up watching Rama, listening Rama and praying 🙏🙇🙌 The Lord Rama. Bhadrachalam Rama temple 🕌is a well known after the movie Sri Ramadasu came into picture. It's same as shown built by Kancharla Gopanna the famously called Ramadasu. Temple is situated on the banks of the River Godhavari. Temple has several associated temples like Maa Godhavari mandir, Sri Hanuman ji Mandir. The Garbha Griha is so peaceful. One should visit and have archana here which is possible only in normal days, as it will be crowded on special days like Hindu Festivals, Rama Navami, and others.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Pamuleru Picnic Point",
      "rating": 4.2,
      "address": "Sridhara, WESTGODAVARI, ANDHRAPRADESH, JW77+MF8, Sridhara, Telangana 507114, India",
      "reviews": [
        {
          "text": "Best place to enjoy with kids....",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place to visit for family and friends best picknik point for kids 1 feet water here",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Enjoyed a lot 🤩",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place playing with kids in weekends.... Just like beach best time to visit winter and summer",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Best place to visit in week days but weekends  little more crowd is there",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Amba Satram Temple",
      "rating": 4.6,
      "address": "MV7M+P74, Ambasatram, Bhadrachalam, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "This satram is at walkable distance from Bhadrachala Ramayya Temple.\nThis satram is well maintained by Sringeri Sharada Peetham. It also includes Veda Patasala.\nOne can experience peace of mind here.\nThey provide Annadanam every afternoon.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Here, you will see the 2 vessels which was usedby Rama & Lakshmana  to prepare the food.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We went here at mid day, due to the burning sun we were thirsty and hungry, after reaching here we had cool water and fortunately some family had done pooja here, so we got prasadham from them. The location is peaceful with beautiful flowers and nature, we had seen the Rama and laxmana pots(gundigalu) which have some stories on them. Enjoyed this temple visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good holy place with helping hands",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏🏻🙏🏻🙏🏻🙏🏻 divine exp at the feet of Sitarama.. With the blessings of Shri Bharathi theertha swami",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kodanda Ramalayam",
      "rating": 4.7,
      "address": "MV8M+P3R, Bhadrachalam, Telangana 507111, India",
      "reviews": [
        {
          "text": "Maintanence is very bad. There is a one  line for both free and paid for few metres and bad experience at prasadam counter literally counter guys stealing our money by giving less prasadam tickets to our money. Please be careful. Rest everything is good. Jai Sri Ram",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "great holy place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ramalayam is famous worship place,  a very peaceful atmosphere is present at ramalayam. There is uchitha darshanam(free darshanam) but queue is long it is based upon day . Sometimes it takes only 5 minutes but some times it takes 2-3 hours also. On regular days darshanam can be made fastly on special occasions it is a bit harder. Prasadam is made with fully hygiene environment. And it is available in the temple it self (at backside entrence). Best place to find peace in you.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "we visted  this temple during telangana agitation. only very few people.it took 5 minutes for .we took darshan several time, we attent ekantha seva at 9.30pm ,melukolupu in 5am in morning. very nice experience.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Abhayanjaneya Swamy Temple",
      "rating": 4.5,
      "address": "MVFP+6JH, Bhadrachalam, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "Blessed to have visited this temple and participated in Aditya Hryudayam Homam ..\n\nThe main priest  (Shri  Ravikiran Sharma Garu) of the temple and the other participants of the homam were very welcoming....\n\nJai shree Ram...Jai Hanuman ...look forward to visit again with the divine blessings of Lord Hanuman",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is very famous Hanuman Temple in Bhadrachalam. There is a small park just opposite to the temple with big statue of Hanuman, On the other side of the road there is Venkateswara Swamy and Ayyappa Swamy Temple. Just 2 mins walk from the temple you can see river Godavari.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is one of famous temple BCM, it is beside main road, behind the temple, public garden is there, which is very greenery and having the kids playing items, can spend evening over here",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It was very nice temple. But there is no proper pavement here to walk into it. You have walk on stones and sand...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Make arrangements for senior citizens and disabled.  Very difficult to climb the steps.  No railing for support.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Sri Lakshmi Narasimha Swamy Temple",
      "rating": 4.9,
      "address": "Ahobila Matam, Ahobila Matam Road, near Ramalayam, Bhadrachalam, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "Blessed to visit this place, most of pilgrims are not aware about this",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Sri Yogananda Lakshmi Narasimha Swamy Temple in Bhadrachalam is a sacred place for Hindus to worship Sri Lakshmi Narasimha Swamy. The place has peaceful environment.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "One who visit the bhadrachalam should visit this place for sure just a walkable distance from temple, di don't forget when viewing bhadrachalam",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Great devotional place ... Clean environment",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Ram Mandir",
      "rating": 4.1,
      "address": "MV9V+GC8, Bhupathi Rao Colony, Khammam, Bhadrachalam, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "New hotel.  Nattukolla.biryani.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Andhra Pradesh - Telangana Border (Bhadrachalam)",
      "rating": 5,
      "address": "JWX5+JPR, Rajahmundry - Bhadrachalam Hwy, Gundala, Andhra Pradesh 507111, India",
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Veleru Sree Lakshmi Narasimha Swamy Temple",
      "rating": 4.6,
      "address": "Sridhara, WESTGODAVARI, ANDHRAPRADESH, JWF2+C47, Sridhara, Telangana 507114, India",
      "reviews": [
        {
          "text": "It is A Famous Temple and Having Grate History and It Is existing From Kakateeya Dynasty",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Yes it's my native place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "God bless you",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "God is great",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}