{
  "places_with_reviews": [
    {
      "name": "Rukmani Balaji Temple Balajipuram Betulbazar",
      "rating": 4.4,
      "address": "National Highway 19B, Balajipuram, Betul Bazar, Madhya Pradesh 460004, India",
      "reviews": [
        {
          "text": "The Rukmani Balaji Temple is an architectural marvel that captivated me from the moment I stepped in. The intricate design details and craftsmanship showcased in every nook and cranny were simply breathtaking. The serene ambiance of the temple instantly calmed my mind, making it a truly soothing experience. The caves surrounding the temple added an adventurous touch, creating a unique and memorable visit. Overall, it's a must-visit for anyone seeking a blend of architectural beauty, tranquility, and a touch of exploration. We visited the temple when we were travelling to nagpur from Bhopal.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is around 150 km from Nagpur. Temple is well maintained. It is on Nagpur Bhopal road. The complex has various temple. Some free access temple and some are ticketed temple. One Vaishno Devi darshan temple is there, where you need to climb some heights(75 foots), but needs more safety measure. Hope temple authority take care about it. Overall experience is good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Architectural Marvel at Rukmani Balaji Temple\n\nThe Rukmani Balaji Temple in Betul is a splendid tribute to Lord Vishnu and Rukmani, marvelously reflecting great architectural prowess.\n\nMeticulously maintained, the temple grounds are serene, adorned with natural lawns and vibrant flower beds that create a peaceful ambiance. This temple isn't just a place of worship; it's an artistic masterpiece that deserves to be visited at least once for its divine beauty and tranquil surroundings.\n\nA visit here offers a spiritual and visual feast, leaving visitors in awe of its grandeur and elegance.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Balajipuram stands as a contemporary temple devoted to Lord Balaji, emerging as a significant tourist attraction and pilgrimage center near Betul. A must-visit for those journeying between Bhopal and Nagpur, the temple offers a serene and spiritually enriching experience. Overall, Balajipuram is undeniably a great place to explore.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nicest place we ever visited.. feel so energetic and fresh we you visit here.. Place is good all facilities including stay and parking is available for family. We shot a small vlog on our Youtube channel so please also watch it at Jyoti Prashant Vlogs",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Balajipuram Temple Aeroplane Point",
      "rating": 4.4,
      "address": "VW6J+8J6, Betul Bazar, Madhya Pradesh 460004, India",
      "reviews": [
        {
          "text": "Betul is district of madhya pradesh\nBalajipuram temple is here in this temple lord vishnu and temple area is very nice neat and clean there is a one vatika vihar to dedicate to lord ram life about 14 year journey of lord ram in forest area\nThere is a one artificial snake you can enter in snake in mouth and visit inside of snake and exit point is tail\nYou can reach betul by rail is well connected by itarsi bhopal nagpur etc\nBy road also",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice environment around this temple. Best enjoying place in BETUL city. Please visit and enjoy your trip with friends and families.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best place to meditate , relax, and 2 kilometres walking in between trees. 25 ₹ charge for walking tour, 70₹ for boating. Don't choose boating.  Please go Once, this is one of a kind",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "So graceful temple to come with family...you would love it.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "ARCHITECTURE DESIGN OF THIS TEMPLE IS EXCELLENT & AMBIENCE IS VERY NICE & COOL...",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Kargil chowk",
      "rating": 4.2,
      "address": "WV2W+P96, Genda Chowk Sadar Betul, bazaar, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Main center place of betul. Near by you will find fresh vegetable market. Kothi bazar, cinemas, restaurants all places are very reachable from here.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Main attraction of our city. known for kargil war memorial",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice Place Near To Main Bus Stop Near To Railway Station And Many More Things",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is a square from where one can go to the railway station, bus stand and Sadar and also has a very beautiful view.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Maa Chandi Darbar.",
      "rating": 4.2,
      "address": "WV8X+H5V, maa chandi darbar, Gondu Mandai Chicholi, Tikari, Rojhada, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Hindu Devi Maa Chandi Devi temple. Temple  is newly constructed.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Kalka mandir",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Badora chouk, badora betul",
      "rating": 4.3,
      "address": "VVQX+VJ8, Bajpur, Badora, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Despite having a very good road and intersection, the municipality does not pay attention to this intersection. Despite having a police post, a big vegetable market, a petrol pump and roads leading to three places, there are no traffic signals, dividers on the road, better roads, and vehicles.  There is no parking facility 😒",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "very busy area but the hub of farmers and agricultural stores\nanaj mandi is also located here",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's like ok ok",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Mandir",
      "rating": 3.3,
      "address": "WV2W+FC6, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3.3
        },
        {
          "text": "Gahym",
          "languageCode": "en-US",
          "rating": 3.3
        }
      ]
    },
    {
      "name": "Shri Hans kirti ashram betul",
      "rating": 3.7,
      "address": "WV4Q+4V7, Sadar, Agnihotri Colony, Badora, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Limited religious activities. Whois the finential contributor?.lohat is the motive?",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Well maintained and doing activities for social work",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "It's a religious place of Satpal Maharaj ashram",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "It organises PHILOSIPHICAL & spiritual sessions as",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Nice and spirituality area or place",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Shani Mandir Betul",
      "rating": 4.7,
      "address": "VWX4+FHV, Housing Board Colony, Ganj, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Very old Hindu temple situated in Ganj,very spiritual atmosphere every saturday many people from even far places come here for the special Aarti. Prasaad here is very tasty really!!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "...... Special\nOli Here For Shani Lord\nand Pytm accpt here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai Sanidev Maharaj",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Jai Shani Maharaj\n\nDon't forget to come to Aarti every Saturday at 7 pm.",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Jai shanidev",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "KOSAMI DAM VIEW POINT",
      "rating": 4.2,
      "address": "WV2C+R9X, Kosmi, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "Kosmi Dam is a prominent water reservoir located in the district of Betul, Madhya Pradesh. It is a man-made structure constructed across the Kosmi River, which is a tributary of the Tapti River. The dam serves multiple purposes, including irrigation, water supply, and hydroelectric power generation.\n\nVisiting Kosmi Dam offers a serene and picturesque experience amidst the natural beauty of the region. The dam is surrounded by lush greenery and provides a tranquil atmosphere for relaxation and recreation. The expansive water body created by the dam offers opportunities for boating and fishing activities.\n\nNature enthusiasts can explore the scenic surroundings, which often include hilly terrain and forested areas. The area around the dam is also known for its diverse flora and fauna, making it a potential spot for birdwatching and wildlife observation.\n\nIt's important to note that while Kosmi Dam is a beautiful destination, it's always advisable to follow safety guidelines and local regulations when visiting such sites.\n\nAdditionally, availability of specific amenities like boating facilities, viewing points, and accommodations may vary, so it's recommended to check local resources or contact authorities for the most up-to-date information before planning a visit to Kosmi Dam in Betul, Madhya Pradesh.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Best place for outdoor visit and recreational area in betul where you can go to picnic with your family",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "That's my own place my farm is beside the Dam.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Lovely view",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Every animal",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Hanuman AKHADA MANDIR, TIKARI",
      "rating": 4.7,
      "address": "Hanuman Mandir, Akhda chowk, Tikari, Rojhada, Betul, Madhya Pradesh 460001, India",
      "reviews": [
        {
          "text": "The hanuman mandir mantain cleanness and etc",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is very old .but in this temple dakshin mukhi Hanuman ji Maharaj very powerful and they are completed all wish for everyone.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very famous temple in betul you will feel very positive and strong after blessings of loard Shree Hanuman ji ....The peoples of betul have very kind in nature you really like them so must visit this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Simple bt it's very beautiful nd spacial temple.. 👌👍🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Shree Hanuman temple, oldest and popular place of Betul",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}