{
  "places_with_reviews": [
    {
      "name": "Beypore Beach",
      "rating": 4.3,
      "address": "Beypore, Kozhikode, Kerala 673015, India",
      "reviews": [
        {
          "text": "Not the lush green kerala that I know… the pier walk was good and clean with a lot of benches to sit and take in the scenery. But empty plastic bottles line the shoreline. The floating bridge experience was good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The place was nice. The state tourism has set up a floating bridge, extending 100 meters into the sea from the beach. People can experience walking over the waves, which is amusing. There is also a concrete sea walk, which is a nice place to sit and relax, cherish the sunset. If you are lucky, you will be able to spot dolphins from here. On the downside, there was maintenance activity ongoing around the beach, where I believe they are reconstructing the park, so its noisy and dusty around that area. The beach is also littered and no cleaning staff were present. I would also request the tourist and local people to build awareness on cleanliness and not to litter such places.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beach is beautiful clean and well maintained. Good parking place arrangements. There was fest when I went that is new year time. There were many stalls and water sports competition going on.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The beach was awesome. They are couple of sports activities available like boating, floating bridge etc. In the evening, one can enjoy with beautiful sunset 🌇",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A Serene Fusion of River and Sea Baypore Beach\n\nBaypore Beach, nestled in the heart of Calicut, Kerala, is truly a gem waiting to be explored. Its unique blend of river and sea creates a mesmerizing panorama that's both captivating and serene. The ongoing construction hints at an even more breathtaking future, promising a heightened experience for visitors. Whether you're seeking solitude or quality time with family and friends, Baypore Beach is a must-visit destination in Calicut. Immerse yourself in nature's beauty and embrace the tranquility of this remarkable coastal haven.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kadalundi Bird Sanctuary",
      "rating": 4.2,
      "address": "Kadalundi Market Rd, Kadalundi, Kerala 673302, India",
      "reviews": [
        {
          "text": "Discover serenity at the bird sanctuary, boasting scenic backwater boating and lush mangrove forests. Birdwatching opportunities abound, making it a photographer's paradise. Ideal for outings with loved ones, it offers a tranquil escape into nature's embrace. Truly a gem for creating cherished memories with friends and family.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "First trip of the year. We were there in the afternoon. The cooperative attitude of the boat owner and those around him was good. This was my first experience of seeing mangroves in person. We could not go through the jungles as it was full of mud. We saw the migratory parrots from a distance. How fun is it to watch the jumping of small fishes?. All this was a positive experience.🥰💞",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Love the one-hour boat ride. It was very peaceful. We saw many types of birds in shallow water areas, and fishermen catching fish.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is recognized by kerala government and it is very much safe.\nIt was memorable experience. You can feel the authentic kerala scenic views. They we have one hour ride and two hours ride.\nPer hour 800 and two hours 1500.\nWe opted for two hours for our boat. Staff is very polite and explained about the islands there. We can not allowed to enter into islands as part of our journey. We could see jumping fishes around the boat. Boat driver explored us different types mangrove forests in our trip. It took exactly two hours to return back to base location. Just amazing experience. Since we were late around 11am it was too hot even in January and birds were not found much . During summer we can't bare the humidity. If you are planning in the summer you must visit at morning hours. Look at the attached pics. Just awesome",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Boat ride to many mangrove forests - this is a totally different experience. Not many birds were present though, mainly cranes. Boat men are very good and cooperative. Bit hot though! Value for money.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Chaliyam Beach",
      "rating": 4.3,
      "address": "5R52+4H3, Chaliyam, Kozhikode, Kerala 673301, India",
      "reviews": [
        {
          "text": "Chaliyam beach is located near the Chaliyam Azhimukham, where Chaliyar river joins with the Arabian sea.\nIt's a small beach without much facilities or shops that we see in prime beaches.\nChildren were playing in the beach. The beach was quite and calm devoid of rush. You can see a long Pulimuttu adjacent to beach. The evening view, especially sun set from here is a magnanimous view.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Chaliyam beach is a calm and beautiful beach situated in Kozhikode district .A good place to enjoy with family  and friends. Good for sitting at the very end of the sea bridge and enjoying the sea and the wind. It is possible to travel by vehicle till the last part of the bridge. The fishing harbor is located next to this.  From there you can buy fresh fish at cheap prices",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The place was tranquil.\nBest sunset view..\nA very good place for photoshoots",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The sunset at the beach was a breathtaking display of nature's beauty.\nThis beach is a haven for relaxation and rejuvenation, making it an ideal escape from the hustle and bustle of everyday life.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Chaliyam beach is one of the best beach in Calicut district. This beach situated in the border between MALAPPURAM and Calicut district. We can walk in to sea through bridge. It will be good experience.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Floating Bridge",
      "rating": 4.1,
      "address": "Unnamed Road Pulimood, Beach Rd, Kozhikode, Kerala 673015, India",
      "reviews": [
        {
          "text": "It's a good place to visit. 120 rs per head for 15 minutes.\nI visited at Evening when sun is down or else it will be so hot and sunny.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It’s awesome experience, all safety equipment available, staff behavior was good.affordable tickets cost.first floating bridge in kerala.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The floating sea bridge offers splendid views, serene ambiance, and a unique experience.\nTicket charge is Rs 120 per person for 15 minutes.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Visit the site in the evening for the sunset view. The beach however is not worth it but the experience on the floating bridge was what the kids liked.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It was a good experience. Rs. 120 per person. I was in a group of 15 and enjoyed it. The few of us were feeling motion sickness due to up and down motion of bridge due to waves. It is the best if you don't want to get wet in salty water with some sand in your pockets and all over your body.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Idiyangara Shaikh Masjid",
      "rating": 4.5,
      "address": "16/472, Francis Rd, Thekepuram, Kuttichira, Kozhikode, Kerala 673001, India",
      "reviews": [
        {
          "text": "Probably the oldest and first of this kind in Calicut but renovated. Large masjid, air-conditioned. Maqam is oft visited throughout the year. Very popy. Parking area inside for five or six cars and several bikes.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "So many believers come here every day. Especially in their anniversary time",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Idiyangara Shaikh Masjidh is a historic mosque located in Kozhikode, Kerala, India. It is believed to have been built in the 16th century by a Sufi saint named Sheikh Shamsuddin Mohamad Bin Alauddin al Himsi. The mosque is famous for its annual festival, called Appavanibham Nercha, which is celebrated forty days before Ramadan. During the festival, devotees offer rice cakes, miniature human body forms, and other items to the mosque as a form of thanksgiving and prayer.\n\nHere are some things to keep in mind if you're planning to visit the Idiyangara Shaikh Masjidh:\n\nDress modestly. Both men and women should cover their shoulders and knees.\n\nRemove your shoes before entering the mosque.\n\nBe respectful of the worshippers and avoid talking loudly or taking photographs inside the prayer hall.\n\nIt's customary to make a small donation to the mosque before leaving.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "🤍",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Religious and historical place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "EL-Ruha Retreat Centre",
      "rating": 4.9,
      "address": "St Pauls House, Calvary Hills, Kadalundi, Kerala 673302, India",
      "reviews": [
        {
          "text": "El-ruha retreat centre is a holy place which is led by the holy spirit. I had an amazing inspiration while going to the el-ruha retreat centre.I am amazed by the people's recovery in situations  where they failed, when they knew about el-ruha retreat centre they started to know more about the power and the love of God , Jesus,  and the Holy spirit. I am very thankful to the team of el-ruha retreat centre to help others to know more about God's love.Thank you El-ruha retreat centre.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This is a place of worship in its purest form, fr Raphael is a prophet in every sense of these times, holy spirit is always with him, like was with earlier prophets, truly one comes to the faith beyond ones human logic, anyone who doubts Jesus is one true God should come for 4 day retreat here. Hallelujah, praise lord Jesus Christ",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "I felt the Devine presents of Jesus.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very nice retreat centre. We will get a heavenly feeling. 👌",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Retreat is awesome,we can feel holy spirit.Name of place itself calvary hills.There we can see large cross bearing jesus..Felt like i reached in heaven.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Valayanad Devi Temple Vadakkenada (Northgate passage)",
      "rating": 4.5,
      "address": "6RW3+5H3, Valayanadu, Kozhikode, Kerala 673016, India",
      "reviews": [
        {
          "text": "A blissful experience.\n\nHad the blessed opportunity to light the lamps in the exterior of the temple and found   It absolutely therapeutic.\n\nCalm n soothing visit.\n\nDo visit if you are visiting Kozhikode (Calicut)",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Valayanad Devi Temple in Kozhikode is a revered Hindu shrine dedicated to Goddess Bhagavathy, also known as Valayanad Devi, who is worshipped as the presiding deity.\n\nSituated amidst the serene surroundings of Kozhikode district, the Valayanad Devi Temple stands as a symbol of faith and devotion, drawing pilgrims and devotees from far and wide to seek the blessings of the divine goddess.\n\nSurrounded by lush greenery and serene natural beauty, the Valayanad Devi Temple offers a peaceful retreat from the hustle and bustle of daily life, inviting pilgrims to connect with the divine and experience the eternal presence of the goddess in all her glory.\n\nFor those seeking solace, guidance, and blessings, the Valayanad Devi Temple serves as a beacon of hope and a source of spiritual nourishment, inspiring devotees to deepen their faith and devotion with each visit.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Valayanad Devi Temple is a beautiful and historic temple that is well worth a visit. The temple is unique in its architecture and practices, and it is a fascinating place to learn about the Saktheya tradition of Hinduism.\n\nThe temple is well-maintained and clean. The priests are friendly and helpful. The atmosphere at the temple is peaceful and serene.\n\nThe temple is located in a convenient location, just outside of Kozhikode. It is easily accessible by car or bus.\n\nOverall, Valayanad Devi Temple is a great place to experience the rich culture and history of Kerala.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Biggest devi temple in Calicut",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "What a beautiful temple...My God...The diety is so pretty..A blissful experience...",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mubarak Masjid",
      "rating": 4.6,
      "address": "6RM4+V56, Mankave Pantheerankave Road, Mankave, Kozhikode, Kerala 673007, India",
      "reviews": [
        {
          "text": "This is located in waynad chooram  wrong location and wrong address",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Big masjid in kerala\nGulf masjid model architect",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Masha Allah....  Largest and most beautiful masjid.....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Biggest masjid in kerala.\nTop4 biggest masjid in india",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wrong pictures has been uploaded. The real one is below.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kadalundi Beach View Point",
      "rating": 4.4,
      "address": "4R9H+HCH, Kadalundi, Kerala 673314, India",
      "reviews": [
        {
          "text": "It's a great place to visit. Even though it's sunny, we don't feel the heat as the view point is covered with coconut trees. We can sit and relax there, sometimes with family and friends. Nearby shops offer snacks and drinks, allowing us to enjoy the beautiful beach view. It's a perfect spot for capturing some amazing photographs.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Most favourite place. One of the best place to watch sunrise and also a place to spend evenings with family and friends. Early morning visit is extra cool with the fishers around and calm environment. Also try to keep the place clean.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kadalundi Beach View Point offers a stunning panorama of the Arabian Sea and the scenic Kadalundi River. The vantage point provides a breathtaking view of the convergence of these natural elements, creating a picturesque landscape. The serene beach, along with the tranquil backwaters, offers a peaceful retreat for visitors. The surrounding greenery and the sound of waves add to the overall charm. Kadalundi Beach View Point is a must-visit for those seeking a serene escape and a glimpse of Kerala's coastal beauty. During the weekend and evening observed that too busy with visitors and limited parking space. Some shops and restaurants are nearby.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kadalundi Beach, nestled on the Malabar Coast in Kerala, offers a tranquil escape with its golden sands and calm waters. Surrounded by picturesque fishing villages, it's a serene destination for relaxation, water sports, and enjoying stunning sunsets along the Arabian Sea.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great place to watch the ocean waves..... Peaceful vibes.... Good place to chill with friends and family and great spot for children's to play in the sea",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Sree Valayanad Devi Temple",
      "rating": 4.8,
      "address": "6RV3+GJR, Valayanad Temple Rd, Govindapuram, Kozhikode, Kerala 673007, India",
      "reviews": [
        {
          "text": "\"Visited the temple recently and was struck by its serene atmosphere – a perfect escape from the hustle and bustle. The intricate architecture and well-maintained surroundings create a peaceful ambiance, ideal for reflection and spiritual connection. The staff's welcoming demeanor adds to the positive experience, providing a sense of warmth. The well-marked paths and informative signage on the premises make navigation easy for both locals and tourists. Overall, a truly divine visit, leaving me with a sense of tranquility and spiritual upliftment.\"",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the beautiful devi temple in Kozhikode..well maintained and nice atmosphere.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Photogenic place for all types of functions..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is one of the most powerful temples of devi .A good number of people come for worship and the marriage hall is nearby .must visit one time with family .... Darshan timings are there plan accordingly.limited parking outside and has to park on road side",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Traditional ambiance..\nThe guruthi might be finished after 9 or 10 pm and prasad will only be disturbed by then but we have to bill it very early.\nWomen are not allowed to enter during the guruthi time .",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}