{
  "places_with_reviews": [
    {
      "name": "Maa Mundeshwari Temple",
      "rating": 4.6,
      "address": "Mundeshwari Dham Rd, Bhabua, Paunra, Bihar 821103, India",
      "reviews": [
        {
          "text": "It is said to be among one of the ancient temples, which was destroyed by Mughals (or some other muslim ruler). Currently the temple is under ASI (Archeological Survey of India). The temple still exists in half destroyed condition and you'll find damaged statues kept near the temple and also the Shikhara (Top of the temple) was destroyed. The statue of the deity inside the temple exists in damaged condition.\nThe temple is located on top of the mountain, so choose your mode of transport wisely. If you are visiting with your private vehicle, then the Temple's trust will charge you some 10-50rs, based on your vehicle.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very Beautiful, peaceful, holy place and had its special impact on the Hindu religion and this temple influences the reality and power of goddess , the route and track of reaching to temple is at another level of adventure, and all this is in the lapse of nature and the beauty of this temple is heartwarming. Really this place has all my love and respect.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Reason for visit this temple\n\n1. World's oldest hindu temple.\n2. World's oldest god Shiva temple\n3. To many mythology and reality stories।   of this temple.\n4. Nature views\n5. Less expensive things than other temples.\n6. Many more....\n\nI promise you if you visit once you got fall in love of this temple and area.\n\nHighly recommended ❤️❤️\n\nThankyou!!!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was a very good temple called as oldest hindu temple in the history of india. But it require some developments in the temple area",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the oldest living temple from North India. It's dedicated to Maa Mundeshwari Devi, believed to be a heaven for tantric tapasya back then. You can also see a centuries old Shivlinga and a beautiful Nandi adoring the centuries old temple. The temple closes from 12 to 12:30 PM for aarti. Wait time for darshan is 10 to 15 minutes on a Sunday. You will be mesmerised by the Nagara style architecture of the temple. There are 528 steps to the temple but a road directly reached the base of the temple. Around the temple, you will see thousand years old ruins from the temple. Kindly do not sit on those ruins as they are a rich heritage of our country.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mundeshwari dham gate",
      "rating": 4,
      "address": "2HR7+XM7, Mundeshwary Dham Marg, Israrhi, Betari, Bihar 821101, India",
      "reviews": [
        {
          "text": "Very charming. It was my first time here. Maa mundeshwari devi ji is present at the top of the hill. The scenes are amazing, very soothing. Must visit.\nJai mata di🙏❤",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Must get some take care and renovation",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Famous ancient temple of Kaimur, Bihar. Only need to redevlop basic amemtities, road and infrastructure for better transport and easy to reach shrine2",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very Best",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice look",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Amva ke sati Mai shahpur",
      "rating": 4.5,
      "address": "XHVV+66C, Unnamed Road, Kurasan, Balbhaddarpur, Bihar 821101, India",
      "reviews": [
        {
          "text": "Jay mata di,\nVary nice temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good person for their",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Verry nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Like",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "मुंडेश्वरी धाम रामगढ़ मोड़",
      "rating": 4.4,
      "address": "XHMF+96G, Mundeshwari - Chuan - Parari Rd, Paunra, Bihar 821103, India",
      "reviews": [
        {
          "text": "Rahul",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Closed !!\nBecause of Covid-19",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Maa Mundeshwari devi and historical place",
          "languageCode": "en-US",
          "rating": 4.4
        },
        {
          "text": "Jai mata at ❤️🙏",
          "languageCode": "en-US",
          "rating": 4.4
        },
        {
          "text": "Jai maa mundeswari",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Nauhatta",
      "rating": 3.3,
      "address": "2JV4+368, Bhabua, Bihar 821101, India",
      "reviews": [
        {
          "text": "My home",
          "languageCode": "en",
          "rating": 3.3
        },
        {
          "text": "Asfaq Nadaf",
          "languageCode": "en-US",
          "rating": 3.3
        }
      ]
    },
    {
      "name": "Gayatri Devi Temple माँ गायत्री जी मंदिर",
      "rating": 4,
      "address": "No 10, 11, Bhabua Rd, Ward No 18, Bhabua, Bihar 821101, India",
      "reviews": [
        {
          "text": "Only one gayatri temple in bhabua at chak bandi road ward no 10.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very nice temple. i usually visit here on sunday morning.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A Spiritual Centre under the Divine Guidance of Shantikunj, Haridwar",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "it's really nice place, area is not good",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "One of the temple in bhabua",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "KAIMUR STAMBH",
      "rating": 5,
      "address": "Near Rajendra Sarovar, At NH 219, Bhabua-Mohaniya, Road, Chainpur, Bhabua, Bihar 821101, India",
      "reviews": [
        {
          "text": "Its a churaha Besically",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Rajendra Sarovar BHABUA",
      "rating": 4.6,
      "address": "beside Kaimur Pillar, Bhabua, Bihar 821101, India",
      "reviews": [
        {
          "text": "Nice place for time pass with friends and for rest also.\nThis place is also for celebrate birthday of friends.\nNo any tickets. This is totally free. Safe for kids and children.\nThis srovar is used for walking in morning by olders.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful Place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "best view of this pond very popular in bhabua\nbelawatiya pokhara kaimur stambh",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Maa mundeshwari",
      "rating": 4.5,
      "address": "XHR7+H3W, Naughara, Mokari, Bihar 821103, India",
      "reviews": [
        {
          "text": "This temple of Maa Mundeshwari is on the peak of Panvara mountain in Kaimur district. This temple was built during the Gupta period. This is the oldest functioning temple of India, that is, worship has always been happening in it without any stop. There is a pentagonal Shiva Linga in this temple. Apart from this, there are also idols of other gods and goddesses. The temple is octagonal. There is beautiful carving on it. To reach the temple, stairs have been made for pedestrians and a path for vehicles to reach the top. The idols are scattered in the temple premises.",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Ruiyan",
      "rating": 3,
      "address": "4H5M+766, Ruiya, Bihar 821109, India",
      "reviews": [
        {
          "text": "Ruiya Gram Panchayat",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    }
  ]
}