{
  "places_with_reviews": [
    {
      "name": "Aradi Chhaka, Bhadrak",
      "rating": 4.3,
      "address": "Aradi Chhaka Bus Stop, 2FXQ+X3H, SH 35, Samaraipur, Bhadrak, Odisha 756181, India",
      "reviews": [
        {
          "text": "Just traffic things and the road was like..🤮😏\nIn rainy seasons the pacific ocean comes here for  holiday.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Aradi Chhaka is a normal place there is nothing extra you will get to see some Shop and a petrol pump and road conditions is very bad and there is always dust on the road...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Experienced faculty and good environment.....",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Jay ma sarala\nFollow me smart sanjay-97 my insta id",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I think this chhaka also goes under bhadrak municipality but i didn't under why there are no traffic lights in all over bhadrak town",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Maa Bhadrakali Mandir(oldest kali temple)",
      "rating": 4.7,
      "address": "Bhadrakali sahi, Aharapada, 2G8P+3MX, Haripur, Odisha 756128, India",
      "reviews": [
        {
          "text": "The Goddess on who's name the place Bhadrak is named. The temple is located in interior village of Haripur and it is 10kms from Bhadrak town.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple of Goddess Bhadrakali. The place is named Bhadrak from this. Just about 8-10 km from the city, but both the roads are clumsy and crowded. The serpentine roads warrant careful & slow driving, hence taking much more time to travel. Ample parking space is there.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is good but lacks basic amenities like a toilet and drinking water. The road to the temple is narrow and needs expansion.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "●This is the temple of Maa Bhadrakali,based on whose name City Bhadrak is named.\n\n●This temple is very beautiful and old architecture of Bhadrak .\n\n●It is a very peaceful and pious place.\n\n●Devotees from different places visit this temple to pray to Maa Bhadrakali to get her blessings.\n\n●This temple has also others God's temple inside like Mahapravu Jagannath,Pravu Balabhadra,Maa Subhadra and Mahadev Shiv ji Temple.\n\n●The walls inside the  temple also bears paintings of  various  of Besha of  Mahapravu Jagannath,Pravu Balabhadra and Maa Subhadra and SAPTAMATRUKA  BESHA of Maa Bhadrakali.\n\n●This temple also has idols of NABAGRAHA and DASHA MAHAVIDYA.\n\nI would like to suggest that every person must visit Maa Bhadrakali Temple. Her blessings will always keep you happy in your life.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jay Maa Bhadrakali🙏 the \"Aradhya Devi\" of local people of Bhadrak District hence the name Bhadrak. This temple has a huge premise where you will find some other temples such as Jagannath Temple and Shiv temple. A large part of the temple is dedicated for Hawan purposes. Beautiful architecture & separate space for male and female worshippers. Neat and well maintained by the staffs. Huge parking space is available right in front of the temple.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Khanquah Sharif, Gulshan E Ghouspak(MAMA JAAN, BABA JAAN), Bhadrak, Odisha",
      "rating": 4.6,
      "address": "Sarkar Nagar, Bypass, Puruna Bazar, Bhadrak, Odisha 756100, India",
      "reviews": [
        {
          "text": "Good place, Very clean and Green Environment. Timming from morning 8am to 5 pm To Jiyarat One of the Moat polular place in Bhadrak for their beloved people's.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is an religious place of Muslim,called bade Baba jaan and mama Jaan dergah.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a beautiful & peaceful shrine in Bhadrak\nIt's always gives us happiness whenever we visit the dargah...\nWe are having BabaJaan & MamaJaan Mazar here with us in Bdk. Thanks to ALLAH (swt)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace is the ultimate need of human body.... If you are going through anything bad,you should go to this place or any other dargah.....its believed that the soul of baba or pir sahab is there and listen all the prayers.... You just need to. Sit there and start monologues..... You will find surely peace there...... Don't beg pir baba's mercy.... Because he is the medium in between you and the almighty allah.... Beg mercy to god through baba.... Remember this....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very holy place,you will find ultimate peace here",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Siridi Sai Temple",
      "rating": 4.6,
      "address": "2FF5+F6V, Nalanga, Bishnupur, Odisha 756112, India",
      "reviews": [
        {
          "text": "Very beautiful temple near Bhadrak district court beside NH 16.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a nice spiritual place to get peace of mind. It's really worth visiting this holy and divine place. Everybody must visit at least Once in a life time. I was visited last week here are some snap...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a nice place near by NH-5,Nalanga, Bhadrak",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful weather damn😎😍",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a beautiful temple.\nSri Sai Baba worshipped here.\nIt's situated at Nalanga just near NH-16 and it's just 3km away from Bhadrak town.\nIt's environment is very peaceful and if you want to spent some peaceful time then it's best place for you.\nOutside cleanness of this temple is not so good.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "ISKCON Bhadrak (Sri Sri RadhaGovinda & GauraGopal Temple)",
      "rating": 4.6,
      "address": "GauraGopal Temple At:Kuansh, FACOR Office, Chandan Bazar Rd, near Old, Mohanty Sahi, Buddha Vihar, Bhadrak, Odisha 756100, India",
      "reviews": [
        {
          "text": "It's District Iskcon temple of Bhadrak. The temple is now in it's building stage. We will feel a good vibe if you ever visit this place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place in the whole world . Hare Krishna ❤️😊🧡",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a devine please ... I love going there ..\nGot some association with prabhuji specially (Namachar prabhuji)having a good time here in bhadrak my hometown... Blessed 🙏🏻",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a Peaceful and devine place ...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "To know the topmost reason behind the death and birth you most come to this temple and get vaishnav sanga , sadhu guru and lords mercy 😊😊😊😊",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Jagannath Temple(ଜଗନ୍ନାଥ ମନ୍ଦିର)",
      "rating": 4.6,
      "address": "Bypass, Bankashi, Bhadrak, Odisha 756100, India",
      "reviews": [
        {
          "text": "Shri Jagannath Temple Established 1985...\n\nActually, the main diety (mool sthanam) is Lord Shiva goes by the name of Baba Bhadreshwar and Maa Banadurga Devi (Maa Durga) but not sure why being called as Jagannath Temple...\n\nI missed to asked about to the priest over there...\n\nMay be next time you visit, you can ask but overall this place gives you so much shanti, relaxation to heart and mind...\n\nMust pay visit here...\nJay Baba Bholenath🙏\nJay Jagannath 🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful and old temple in the Bhadrak main city located on the Salandi Bypass road towards Tihidi. Dedicated to Lord Jagannath, Balabhadra, Subhadra & Sudarshan in one premise, Lord Bhadreswara in another and Goddess Baghuasuni in the last.\n\nThe temple is well maintained. Apt for various functions like weddings, Upanayan, etc. are done in a systematic way. Separate rooms and Mandap are available for such activities. Required documents are verified for weddings.\n\nAnna prasad is available for eating as well as take away. In ₹60, you can have good quality Rice, Dal, two types of curry ( I had sajanaa chhuin, alu, baigana, badi besara and buta alu tarkari on 22.02.2022), a khataa and Kheer. One can have as much as he/she likes. Payment through UPI is also available.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good temple. Prasad available on all days. Gets really crowded on the days when there are weddings.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is very imazing place, the atmosphere of their is very cool and quite...\nThe flower garden is so Beautiful 😍\nJai Jagannath ❤️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good peaceful place. Also very clean.\nSome development work is going on May become even more better.\nHave a function hall inside the premise for marriage, Pooja and functions.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "I Love Bhadrak",
      "rating": 4.4,
      "address": "Tahasil Road, Samaraipur, Bhadrak, Odisha 756100, India",
      "reviews": [
        {
          "text": "Very nice place.There are so many tourist places.I suggest everyone to visit the places in Bhadrak.Definitely you will be satisfied.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Super place and u can do full masti with anyone ...so I suggest everyone ..go and enjoy .. looking very nice place and colour full park",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Really nice place....#selfie point.❤️❤️❤️beside new collector office bhadrak.Near flower market bhadrak.Nice location for it ,any one can visit this place and took photos.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The place is outstanding and it gives smooth vibes too ! The location is fabulous in terms to distance.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is a very good selfie point at bhadrak ..I really love this place ...go and enjoy with your friends 😍...last time I visit bulls and cows are roaming around their so request to the security guard to take care of that ...",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Satabhauni Mandir",
      "rating": 4.4,
      "address": "2GJ2+CVM, Korakara, Bhadrak, Bilabari, Odisha 756181, India",
      "reviews": [
        {
          "text": "Good place for traveling",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very beautiful place ❤❤❤",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is a very good place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Usual place for spaind time",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Love it",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Dakhineswara Kali Temple",
      "rating": 4.8,
      "address": "3GC3+C9J, Bankashi, Bhadrak, Odisha 756101, India",
      "reviews": [
        {
          "text": "One of the beautiful & clean temple near NH dedicated to goddess Maa kali ,good & clean atmosphere to bring your child for worship ..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This beautiful temple is dedicated to Goddess Kaali.\nNicely maintained premises and not much crowded.\nYou get different vibe when you visit this place.\n\nYou feel some kind of eternal peace over here... I visit whenever i am going home.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Neat and clean\nPlace like heaven\nMaa kali 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Creative place near Dakhineswara kali",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very well laid out spacious temple.\n\nDaily morning & evening Arati done.\n\nClose to Bhadrak new bus stand\nAmple parking place.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Maa Kali Temple",
      "rating": 3.9,
      "address": "3G2C+87J, Puruna Bazar, Bhadrak, Odisha 756100, India",
      "reviews": [
        {
          "text": "One of the oldest temple of goddess bhadrakali (ma kali). Situated in Bhadrak Odisha.\nYou must have own vehicle to visit there  as local transportation is not available.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "This tample is very power full\nIf u want to know then pls pls visit out maa kali tample",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Bhadrakali Temple is located in the outskirts of the revenue village Aharapada which is at a distance of 8 km away from Bhadrak town in the south- west.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Happy place",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "It's an emotion for us",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    }
  ]
}