{
  "places_with_reviews": [
    {
      "name": "Ghanta Ghar Clock Tower Bhagalpur",
      "rating": 4.1,
      "address": "6XXJ+FPH, Adampur, Bhagalpur, Bihar 812001, India",
      "reviews": [
        {
          "text": "Living this place is more in Evening Time bcz the water fall in evening looking awesome 👍 and the temple of maa budhiya Kali is best you can see some photos :::-",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A historical and  famous places of Bhagalpur. It is situated at the centre like heart of Bhagalpur.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Ghantaghar is situated in the heart of bhagalpur. It is one of the most significant landmark mark in this historical silk city. It is famous tourist attraction of Bhagalpur. One of the most iconic structure with wide roads, bustling shops and fastfood stalls around... Glad to see this place as it reminds me of the old days here in my hometown.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This place was situated at the center of Adampur Chowk. It has a historical significance which I didn't  able to know though it plays an important role as a 'landmark'. There were many small businesses around that place like fastfood stalls. The architecture of the Ghantaghar was old-like(due to the period it was built). Moreover it looks like this structure has been recoloured in the past recent years.\nTherefore I am very happy to see this place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's a remarkable landmark and discrete in it's presence\nAnd is well maintained and lit during national holidays\nAnd properly defines it's value to the city of bhagalpur and guides travellers to their destinations",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Budhanath Temple",
      "rating": 4.6,
      "address": "7X3F+VWR, Jogsar, Adampur, Bhagalpur, Darabpur, Bihar 812001, India",
      "reviews": [
        {
          "text": "Budhanath Temple in Bhagalpur emanates serenity with its intricate architecture and spiritual ambiance. The sacred atmosphere, coupled with the soothing chants, provides a profound experience for visitors seeking tranquility and a connection to spirituality. A must-visit destination, where cultural richness and divine energy seamlessly converge.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Vary famous and one of the most visited temple in Bhagalpur. It is located on the banks of ganga river. However you will find a lot of rush whenever you visit. Still a must visit place if you are in Bhagalpur. There is a resturent nearby which can be a go to place. If you need some quite time, but there is a catch you will find a lot of couple roaming around there, so it could be some time a little crowded sill a good place to checkout....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent place to worship Lord Shiv. Suggest everyone to visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One Of The Biggest Temple of Bhagalpur. It was the Temple of Lord Shiv . Here every type of Function are organised related to lord shiva 🕉️🕉️🕉️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Holy temple of Lord Shiva for worship. It has hundreds of years old Shiva Linga at the centre place of it. It is situated at the bank of river Ganges. Original name is Briddheswarnath Temple, commonly known as Budhanath Temple. It has a beautiful view of Ganges nearby from its terrace. Usually not crowded, except special days. No waiting time usually. If you're here, don't miss to visit the Driftwood Park nearby.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Barari Ghat, Bhagalpur",
      "rating": 4.2,
      "address": "729F+XJF, SH 58, Large Industrial Area, Barari, Bhagalpur, Bihar 812003, India",
      "reviews": [
        {
          "text": "Now it is on developing period. It's very beautiful place the sunset scene is heal your life burden and gives you a peace and you are there till evening please attend the evening arti . Ghat is now constructing just like nit ghat or other developing ghat .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Compared to other ghats, the ghats here should be made more beautiful. There is a lot of dirt here. The government needs to pay a lot more attention here, and according to me, all the ghats of Bhagalpur should be made the same so that like NIT Ghat in Patna, Bhagalpur will also become a tourist place and there is a need to create a lot of tourist places in Bhagalpur because if guests come here, we cannot take them anywhere.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Barari Ghat is the Oldest and  the popular Ghat for Ganga Asnaan and Puja.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Favorite place for ganga snan nearby from bhagalpur area.\nConstruction of new bridge is undergoing",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "One of the longest bridges on Ganga",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Sri Bhoothnath Mandir",
      "rating": 4.6,
      "address": "Tilkamanjhi - Champanagar Rd, Chunihari Tola, Goshalla, Bhagalpur, Parnathpur, Bihar 812002, India",
      "reviews": [
        {
          "text": "Very calm and peaceful palace 😌. Only once you have to visit here at morning or evening. It's very beautiful 😍 palace to get peaceful minds. View of the temple 🛕 is also beautiful as there is many different types of plants are there. There is also option of sitting is available for the people.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Shri Bhoot Nath Mandir in Bhagalpur is a revered Hindu temple dedicated to Lord Bhoot Nath. The temple is known for its peaceful atmosphere and spiritual significance, attracting many devotees and tourists from far and wide. The temple grounds are well-maintained, and the staff is friendly and helpful. Visitors can offer prayers, perform puja rituals, and seek blessings from Lord Bhoot Nath. The temple is also known for its beautiful architecture and intricate carvings, which add to its overall appeal. Overall, Shri Bhoot Nath Mandir in Bhagalpur is a must-visit destination for those interested in Hindu religion and spirituality",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is  very beautiful temple of Lord Shiva and gets a lot of peace by coming here!\nॐ नमः शिवाय",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ancient temple of Lord Shiva, Goddess Parvati and Goddess Kali. Thousands of devotees come to worship Lord Shiva.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lovable Environment Shiv Shambhu I Gone their in maha Shivratri. Everything done in so disciplined and manner wy. I think in bhagalpur this is the 2nd most best Temple 1st One Is Baba Budhanath..... both are too much Osmmmm❤❤❤❤",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Maharshi Mehi Ashram",
      "rating": 4.6,
      "address": "7295+39Q, Kuppaghat, Bhagalpur, Bihar 812003, India",
      "reviews": [
        {
          "text": "One of the old Ashrams in Bhagalpur famous for the cave inside the campus. Beautiful lawns and gardens attract photographers. Peaceful environment and great sunrise - sunset sceneries and greenery on the banks of the Ganges. Usually remains less crowded with locals and monks being the only visitors during Satsang, meetings and New-year picnics. However children get bored here. Proper maintenance required.\n\nSpiritual place well organized near the river banks. Children park also available here. We went as group and had nice time here . Kids will enjoy this place. Parking will be little difficult if you come with your car. We have taken local auto to reach this place from hotel.\n\nThanks.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Spiritual place well organized near the river banks. Children park also available here. We went as group and had nice time here . Kids will enjoy this place. Parking will be little difficult if you come with your car. We have taken local auto to reach this place from hotel.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Maharshi Mehi Paramhans is a saint in the tradition of Sant Mat. He was usually known as 'Gurumaharaj'. He was the guru of 'Akhil Bhartiye Santmat Satsang'. He studied Vedas, main Upanishads, the Bhagavad Gita, the Bible, different sutras of Buddhism, the Quran, saint's literature and from this assessed that the essential teaching contained in all of these is one and the same. He gave one and easiest method to get 'Moksha'. They are 'Satsang' and 'Dhyan'(Meditation). Mehi was a direct disciple of Baba Devi Sahab of Muradabad, Uttar Pradesh. 😊🙏🏻🙏🏻",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the old Ashrams in Bhagalpur famous for the cave inside the campus. Beautiful lawns and gardens attract photographers. Peaceful environment and great sunrise - sunset sceneries and greenery on the banks of the Ganges. Usually remains less crowded with locals and monks being the only visitors during Satsang, meetings and New-year picnics. However children get bored here. Proper maintenance required.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Situated at the bank of holy river ganga. Its a treat to watch such a beautiful ashram with lots and lots of greenery around . I believe everyone should must visit once .",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Manaskamana Nath Mandir",
      "rating": 4.5,
      "address": "Manaskamna Nath Chowk, near Hanuman Mandir, Nathnagar, Bhagalpur, Bihar 812006, India",
      "reviews": [
        {
          "text": "The temple visit was a truly enriching experience, evoking a sense of tranquility and spiritual connection. The architectural marvel, coupled with the serene ambiance, created a profound atmosphere for reflection and cultural appreciation. Highly recommend this sacred sanctuary.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A must visit Hindu temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit for morning aarti, it will give u goose bumps... totally worth it ... Visit early in morning during aarti",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I was go to yoga classes sibir in Munger, and we are people go to manokamna mandir, and enjoy your song and dance. We were very happy.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "There are many such temples in Nathnagar and Bhagalpur where Lord Shiva and many other deities reside....🔱🔱  But here is a place where almost all the people of Bhagalpur come to worship on every Monday of Shravan.....  And here many people along with their whole family also come to get married.👰👰👰👰‍♂️ and this temple is very beautiful ......❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kuppaghat",
      "rating": 4.4,
      "address": "7295+2P7, Kuppaghat, Bhagalpur, Bihar 812003, India",
      "reviews": [
        {
          "text": "It's a great place for healing the mind, a very calm area with a great temple. Green parks are there, for children it is also a good place to visit. There is also car parking. It is a historical place, after a full day of working i found peace in this place in visiting time.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kuppa Ghat is a place located on the banks of the holy river Ganges at Bhagalpur, Bihar, India. According to legends and mythology the great maharishi mehi paramhans spent nearly 18 months in the caves. People who follow Maharshi Mehi Paramhans visits this place on his birth anniversary.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place to visit you will feel relaxed here🙂\nParking are available",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kuppa Ghat (Hindi: कुप्पाघाट) which signifies \" A large number of Tunnels \" is a place located on the banks of the holy river Ganges at Bhagalpur, Bihar, India. According to legends and mythology the great maharshi spent nearly ten years in the caves . The beautiful garden located near the bank of the ganga is known for its reference in Ramayana .",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kuppa Ghat in Bhagalpur, Bihar, holds historical and cultural significance. Situated along the banks of the holy river Ganges, it's a revered spot for both locals and tourists. The name \"Kuppa\" is derived from a Sanskrit word meaning \"a place of spiritual cleansing,\" reflecting its importance in Hindu mythology.\n\nThe ghat bustles with activity during festivals and religious occasions, with devotees flocking to perform rituals and take holy dips in the sacred waters of the Ganges. The serene atmosphere, coupled with the mesmerizing view of the river, makes it a tranquil retreat for spiritual seekers and nature enthusiasts alike.\n\nAside from its religious significance, Kuppa Ghat also serves as a popular recreational spot for locals, offering picturesque views for leisurely walks and boat rides along the river. The nearby temples and shrines add to the spiritual aura of the place, attracting pilgrims from far and wide.\n\nOver the years, efforts have been made to preserve and beautify Kuppa Ghat, ensuring its continued importance as a cultural and religious landmark in Bhagalpur. Its timeless charm and spiritual ambiance continue to draw visitors, making it an integral part of Bihar's cultural heritage.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Jai Prakash Udyan (Sandy's Compound)",
      "rating": 4.1,
      "address": "Khanjarpur, 7X4R+6RX, Katahalbari, Khanjarpur, Bhagalpur, Bihar 812002, India",
      "reviews": [
        {
          "text": "A calm place. Go and sit for an hour and connect with nature. Especially on a windy day😂. Overall a beautiful place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place, greenery everywhere 🌳🌳🌳\nA place where  you can see various species of birds, butterflies, moths, insects. One thing need to be done is proper arrangement of water supply and urinal facility. Much need of it. Overall good.\nA butterfly park is also there where you can visit and enjoy watching butterflies 🦋🦋🦋🦋",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A good place for morning and evening walk. Dogs friendly. There are lot of child activity equipments. Very calm place. You can go and study here also. A wide age range of people are visiting there. You can go and enjoy with your family and friends. There is playground for crickets, badminton, kho-kho, kabaddi etc. Wide variety of plants.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Sandy's Compound is a 30-year-old sports complex located in, Bhagalpur City, Bihar, opposite of police line Bhagalpur. Nature\nthe best time videos",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place to visit for morning and evening walks",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Dolphin Observatory",
      "rating": 4,
      "address": "7X5J+6QC, Bhagalpur, Shanker Pur, Bihar 812001, India",
      "reviews": [
        {
          "text": "Nice place to watch the sunset and sunrise and dolphins during monsoon.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "You Can't see Dolphins Regularly but there are lots of dolphins in the Holy River Ganga I shown Some Times But Not Regularly... I suggest government to Improve the observatory and add mores dolphins and aware their locals about JAL HI JIWAN HAI. ",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very peaceful place",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "One of the best places i visited in India to observe rare Gangetic Dolphins,it lies in Vikramshila gangetic dolphin sanctuary area ,because it is a side channel of River ganges ,in wet season from mid June to mid october ,one can be assured of best Dolphin observations in India from mid june to mid september.I visited this site for three days and observed and spent great time with Gangetic Dolphin.A must visit for anyone interested in Observing Ganga's Biodiversity. Ganga paraharis are doing a great job in conservation and awareness of Ganga's Dolphins on that site❤️",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A place where you can watch our National Aquatic Animal Gangetic Dolphin so close. It is Vikramsheela Gangetic Dolphin Sanctuary area.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "ISKCON Temple Bhagalpur",
      "rating": 4.8,
      "address": "Girija Mukteshwar Colony, Surkhikal, Bhagalpur, Bihar 812001, India",
      "reviews": [
        {
          "text": "Good place as always inside iskcon temples.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "iskon bhagalpur unimaginable because when you see God . you just forget every thing and start praising God",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I Went There But There Is No Temple Means To Say Now Temple Is In Progress Radhe Radhe 🙌🏻❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Loved it",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best place for attaining inner peace.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}