{
  "places_with_reviews": [
    {
      "name": "Bhadranag Temple",
      "rating": 4.5,
      "address": "34W7+Q4C, Main Rd, Shivaji Nagar, Ramnagar, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "Feeling blessed in the presence of divine architecture at Bhadranaag mandir @Bhadravati",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Worship place for Shiva. Old persons from this area says, There was big Snake which always stays there, and people worship him also. Good worship place with ample parking. Now a days Mahaprasad also started there and timings are from 12:30 PM everyday.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple situated in Bhadravati in Maharashtra. It's takes 2:30 hrs from Nagpur which is of 130 km roughly. Temple has Strong history..but not satisfactory review from people because of modernization of temples. Old is gold 🥇🪙",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Gram devata of Bhandak, peaceful and auspicious",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very religious and power place\n\nCleanliness was above high\n\nGood area for parking",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Vijasan Caves",
      "rating": 4.4,
      "address": "Vijasan, Road, Vinjasan, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "One of the best ancient rock cut caves. Situated very nere to nagpur chandrapur highway in Bhadravati  town. The historical place has grate value. Very admirable work of our ancestors. It is one of the best buddhist Leni in Vidarbha region. You don't need too much time to stop here. Parking has no issues. You must have your food with you. Kids have no problem.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Similar type of cave you will find in the Barabar Hills at Rajgir,Bihar.That cave was built by Asoka the Great very well polished from inside and has Pali inscriptions too....",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "If you are around Bhadravati you can visit this place, there are few interesting places here to visit  and  this is one amongst it. Its a buddhist cave and i understand it must be meditation center for buddist as you have small seats built inside the cave where they must have used to meditate or practice there spiritual journey. The place is very peaceful. lord Buddha and lord Mahavir's statue has been carved on the rocks its beautiful but have gone little old. You asked not to wear shoes inside and not to click photos.  We did meditate for sometime to feel the positive energy around us in the cave. Once you are done you can climb the cave from outside its just like 10-15 mins simple trekking where once u reach top you get a good view of the city plus cool breeze.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A good place to visit, more of its a small hill with some caves inside, a great place to watch a sunset from the top.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very best place i ever seen before that place was very cool,and cleaness is most wondering, everyone should go there it's a buddhist cave where lord buddha sitting in meditation posture,it was very peaceful .",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bhadravati Fort",
      "rating": 4,
      "address": "vitthal mandir, near killa, Bazar Ward, Ekta Nagar, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "This old fort is rather small and has lost a lot of its original structures. There is a well, and a staircase that leads to it, which the caretaker told us was the snan grah (bathing place) of Rani Bhadravati. There are a lot of sculptures, which seem to have been defaced or else have broken down due to old age. There is a gate structure remaining to the main compound of the fort.\n\nThe paths leading to the fort are rather narrow and can be difficult for a car. There are no entry fees and no facilities at this place.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "This fort is situated in the heart of the city. Getting there is a bit difficult by car but not impossible. Roads are too narrow. A must see place if you like historical monuments.\nFor many years this was unattended and most of it's structure has been demolished. There remains a gate, deep well, some few demolished room structures and huge boundary wall on all 4 sides.\nThis fort has some caretakers who can guide you about the remains. It is open to visitors from 8.30 am to 5.30 pm all days.\nNow the local authorities have cleared up this place and looks better.\nRecommend to go there with your shoes as there are large stairs and slippery on a rainy day.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice place having cultural background...\nEnjoyed to visit..",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good historical fort, but you won't find any guide there only the board putup by the ASI",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Brilliant piece of monument, should be taken care of. Looks like it has less attention from the government. These moments should be preserved.\nThe ambiance is amazing. You will find peace here amidst the chaos",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Shree Varad Vinayak Ganesh Temple Gaurala",
      "rating": 4.6,
      "address": "34Q5+JP2, Gaurala, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "Good temple to visit in bhadrawati it has good scenic view and location. The idol of the shree ganesh is very attactive and big.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Atmost place of peace.\nMostly silent.\nParty n picnic place for families.\nMostly people from other town visit here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful place, wonderful environment, neat and clean places.\n\nLove it, every one should come here with family friends and theri children",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very peaceful place to visit with family. A place called adasa in nagpur like look where a ganpati murti is tall and large . The place consist a lake of singhada , also the place have garden . You can have a picknic on this spot also can park largest vehicle.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful place, but requires more attention, huge lord ganesha idol , beautiful view from hill , evening time is suitable, entrance gate is nice , but not well maintained , lack of awareness for cleanliness,Ganesha Idol is beautiful",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "DATT MANDIR SANE GURUJI SOCIETY TEACHER COLONY",
      "rating": 3.7,
      "address": "34W6+J48, Gaurala, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "Very good temple",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Tikle niwas",
          "languageCode": "en-US",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Gawarala Ganpati Mandir",
      "rating": 4.8,
      "address": "34Q5+MP6, Gaurala, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "Best near place to bhadrawati\nBest for picnic also",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Temple built by Hemadpanthi....\nVery happy atmosphere....",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "Ganpati Bappa Morya...!",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Balaji krushi पर्यटन",
      "rating": "Unknown",
      "address": "4427+4RP, Gaurala, Bhadravati, Maharashtra 442902, India",
      "reviews": []
    },
    {
      "name": "Bhawani Mata Mandir",
      "rating": 4.6,
      "address": "4426+7G8, Main Rd, Ramnagar, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "I felt blessed when I went bhavani mata mandir.this Temple is swayambhu and centuries old.this place is manged  by group of people including priest.In navratra and aashtami this place is full of crowd.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Place with Bhawani Mata Temple.\nHuge gathering during Navratri.\nParking place available. Sitting arrangement with shade.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Old Temple​ ma bhawani",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great and peacefull",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Chandika Temple, Bhadrawati",
      "rating": 3.5,
      "address": "4438+MQF, Main Rd, Zade Plots, Panchashil Nagar, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "It's an ancient Hindu temple with a small pond situated next to it. Architecture is great.  Can be used as an tourist attraction if maintained properly by officials.\nA must see place if you like to see historical places.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Goddess chandika temple...made from ancient stones and have art work on them work",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Chandika mandir is very beautiful and historical temple in bhadravati",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Very old and historical temple of mata chandika",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Very old beautiful temple.",
          "languageCode": "en",
          "rating": 3.5
        }
      ]
    },
    {
      "name": "shri Gajanan Mandir",
      "rating": 4.6,
      "address": "34X6+92C, Suraksha Nagar Rd, Pandav Ward, Bhadravati, Maharashtra 442902, India",
      "reviews": [
        {
          "text": "God place and prayers for peace",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Abhay Dhumne  Home",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Hah",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ganesha temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}