{
  "places_with_reviews": [
    {
      "name": "BhagsuNag waterfall",
      "rating": 4.5,
      "address": "68WM+J26 to waterfall, Bhagsu Nag, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "This 30 feet high falls is 3km away from Mcleodganj, this distance offers a perfect trekking route. It is best to go for a trek on this route during the summer seasons as monsoons can be slippery and winters extremely cold. Start your trek at the Bhagsunag Temple and follow the rocky trails toward the waterfalls. This trek takes you through gorgeous captivating sceneries of the surrounding hills.\nBeing located in a highly commercialized area, there are several eateries nearby.\n\nAltitude:152 m\nDistance: 2.1 km\nDifficulty Level: Easy-Moderate\nAverage Time Required: 1 hour\nTimings: Monday to Sunday; 7:00 AM - 9:00 PM",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Waterfall itself is not that amazing, however the views from around and further up are beautiful especially by sunrise/sunset. There are plenty of shops for refreshments however the waterfall area is smaller than expected- worth stopping off if you are starting the Triund trail from here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "BhagsuNag Waterfall is a mesmerizing natural wonder, cascading gracefully amidst the scenic beauty of Dharamshala. The journey to the falls is an adventurous trek that rewards with breathtaking views of the surrounding mountains. The refreshing mist from the waterfall adds to the enchanting atmosphere, making it a perfect spot for nature lovers and photographers alike.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place for a short trek. One of the outstanding factor is the cleanliness of this place and it is very well maintained. I went there in December and the amount of water was very less so that it was not even flowing after the falls. It is better to go there when there is good amount of water. There are various small shops on the way which will provide you refreshments. Also if you are interested in doing a zipline or skycycle, it is a place for you. Overall a good experience",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "BhagsuNag waterfall, nestled in Dharamshala, captivates with its serene beauty and refreshing aura. The cascading waters amid lush greenery offer a tranquil escape. However, due to its popularity, it can get crowded, affecting the peacefulness. Yet, the scenic hike and surrounding cafes enhance the overall experience, making it a must-visit natural wonder in the area.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Naddi View Point",
      "rating": 4.5,
      "address": "Naddi, Dharamshala, Himachal Pradesh 176216, India",
      "reviews": [
        {
          "text": "This mountain viewpoint offers a mesmerizing sunset experience, providing a soothing escape from the hustle and bustle of daily life. The panoramic vista is breathtaking, with the sun painting the sky in vibrant hues as it dips below the horizon.  Whether you're a nature enthusiast or seeking a peaceful retreat, this viewpoint promises a memorable and rejuvenating experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "very scenic.\n\nNaddi Viewpoint in Himachal Pradesh is a breathtaking escape into nature's grandeur. Perched on the hills, it offers a mesmerizing panoramic view that captivates the soul. The serenity of the surroundings and the crisp mountain air create a tranquil atmosphere, making it an ideal spot for those seeking solace. Naddi Viewpoint is a photographic marvel, capturing the essence of the majestic Himalayas. A visit here guarantees not just a view but an experience that etches itself into your memory.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Mesmerizing view of breathtaking natural beauty in Naddi, Mccleodganj. Sky transforms into a canvas of vibrant hues with snow-peaked ranges of Dhauladhar adorned with dense forest.Mind immerse in the tranquility of nature.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Naddi Viewpoint in Himachal Pradesh is a breathtaking escape into nature's grandeur. Perched on the hills, it offers a mesmerizing panoramic view that captivates the soul. The serenity of the surroundings and the crisp mountain air create a tranquil atmosphere, making it an ideal spot for those seeking solace. Naddi Viewpoint is a photographic marvel, capturing the essence of the majestic Himalayas. A visit here guarantees not just a view but an experience that etches itself into your memory.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the must visit places if you're in Dharamshala.\n\nThe beauty of the hills will mesmerize you.\n\nIf you are looking forward to a soothing experience and wish to see clouds floating in front of you right between the hills, visit Naddi Hill Point.\n\nBeauty at its best. Mountains are the best ways to rejuvenate and bring clarity into your life.\n\nUntil next time.\nGod bless 🙌",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Church of St. John in the Wilderness",
      "rating": 4.4,
      "address": "Road to Naddi Village from McLeod Ganj, McLeod Ganj, Dharamshala, Himachal Pradesh 176215, India",
      "reviews": [
        {
          "text": "Visited the church and found it very peaceful. Definitely worth a visit regardless of the religion you believe in. The church itself isn’t one of the biggest but one of the oldest in North India. The only reason for not giving it full 5 stars is lack of parking. Vehicles need to be parked on the road itself",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Its a beautiful church in the middle of forest. A must visit place and take a long breath with a peaceful mind. Your mind is going to feel relaxed and your wishes may come true.\nGood maintained church.\nThere was a warning sign 'Not to click' pictures inside the chuch however the guard seems busy in watching video on a mobile and people were taking photograph. Though people enjoy taking picture inside but this is surely not good for such a heritage place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a very gorgeous old style gothic church⛪ in Mcleodganj. Very peaceful and beautiful vibes you get here. The interiors are very lovely. It is surrounded by very dense forest🌲. Must visit attraction.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nestled amidst the enchanting landscapes of McLeod Ganj, the Church of St. John in the Wilderness stands as a testament to the region's colonial history. Constructed in 1852, this Anglican church is surrounded by deodar trees, creating an idyllic setting for reflection and prayer.\n\nThe church owes its name to St. John the Baptist and was built in neo-Gothic architectural style. Its grey stone structure and stained glass windows evoke a sense of historical charm. Visitors are drawn to the peaceful atmosphere, as the church stands as a solitary guardian amidst the natural beauty of the Dhauladhar Range.\n\nInside, the church features beautiful Belgian stained glass windows depicting biblical scenes. The old graveyard adjacent to the church adds a touch of mystique, with weathered tombstones marking the final resting place of British soldiers from the 19th century.\n\nThe Church of St. John in the Wilderness serves not only as a place of worship but also as a historical landmark that allows visitors to connect with the colonial past of McLeod Ganj. It remains a serene retreat for those seeking solace and a glimpse into the region's rich cultural heritage.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful colonial cathedral, surrounded by big park and 19th century cemetry. Outstanding monument of Victorian era. The building of church itself saved its original neogothic architecture, except the modernized roof, which doesn't suit the composition at all.\nThumb of viceroy of India behind the church appears a sculptural masterpiece.\nCemety is placed on the east side of church in the shade of 200-year old himalayan deodars. The area has flowering, stone pathways and WC, but definately needs better maintenance, including more benches, dustbins and information boards. The gravestones are not taken care of as well.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bhagsu Naag Temple",
      "rating": 4.5,
      "address": "68VM+PQF, Manisha Rd, Bhagsu Nag, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "Bhagsu Temple, nestled in the serene hills of Dharamshala, India, offers a tranquil retreat for spiritual seekers and tourists alike. The temple, dedicated to Lord Shiva, exudes an aura of ancient mysticism, with its intricate architecture and peaceful surroundings. Visitors can immerse themselves in the soothing ambiance, meditate, or participate in religious ceremonies.\n\nAdjacent to the temple lies the Bhagsu Swimming Pool, a refreshing oasis amidst the Himalayan landscape. Surrounded by lush greenery, the pool provides a rejuvenating escape from the summer heat. Its crystal-clear waters beckon travelers to take a leisurely swim or simply relax by the poolside, basking in the beauty of the natural surroundings.\n\nWhile the temple offers a spiritual sanctuary, the swimming pool adds a recreational dimension to the Bhagsu experience, making it an ideal destination for both spiritual retreats and family vacations. Whether seeking inner peace or simply seeking respite from the hustle and bustle of daily life, Bhagsu Temple and Swimming Pool offer a harmonious blend of spirituality and leisure, leaving visitors refreshed and rejuvenated.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A Shiv Temple with an amazing ancient history is really felt when you visit this awesome Shiv Mandir.\nBeautiful mountains, Holy Kund,  nearby market ,cafe and the waterfall are major attractions which fill your heart again to the fullest.\nThe backside of temple has a good view.\nThe overall experience of temple is very soothing and satiates from within.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nestled amidst the serene mountains of Dharamshala, the temple exudes an aura of tranquility and devotion. As I approached the temple, I was captivated by its architectural beauty and the picturesque surroundings.\n\nUpon entering the temple premises, I was greeted by the soothing chants and prayers, which instantly filled me with a sense of peace and reverence. The atmosphere inside the temple was serene, with devotees offering their prayers and seeking blessings from the deity.\n\nThe main deity, Lord Shiva, presides over the temple, and the sanctum sanctorum exudes a divine energy that is palpable to all who visit. The intricate carvings and vibrant paintings adorning the walls add to the temple's allure, showcasing the rich heritage and cultural significance of the region.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The waterfalls are a wonderful trek. The temple is okay. We loved the trek to Shiva Cafe. The market here is much better than the actual market yard. You may find stuff slightly cheaper than the Mall Road or Markety road.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Awesome experience. Dip your hands and legs immersed. Chilled water. Did not see anybody jumping into the pool. Accumulated water at the other end had moss and could be dangerous. The temple itself has a very serene atmosphere dedicated to Lord Shiva, Snake God's, Shani Dev, Devi Maa, Lord Ganesh and Bhakt Shiromani Hanuman! From here there is an uphill trek towards Bhagsu Waterfall. Not much water now though due to reduced rains. Check before you venture. Lot of eateries nearby... You can spend 1-2 hours here.\nAn auto from Mcleodganj rickshaw stand costs 70 bucks, Return you can easily walk down. Not more than 20 minutes.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Namgyal Monastery",
      "rating": 4.6,
      "address": "68MF+2X2, Temple Rd, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "A beautiful, peaceful place to spend time and offer prayers to almighty. This place gives so much relaxing vibes that you do not want to leave the place early. Mornings and evenings are the best times to visit here. There are a lot of souvenirs shops around the temple where you can buy beautiful artworks related to Buddhism and tibet culture.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The monastery offers breathtaking views of the surrounding mountains and valleys, making it a perfect place for quiet contemplation and meditation.\n\nOverall, my visit to Namgyal Monastery was a memorable and spiritually uplifting experience. Whether you're seeking solace or simply want to immerse yourself in Tibetan culture, this monastery is definitely worth a visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit place, this has some special vibes.\nBest\n- Very peaceful\n- Beautiful location\n- Mcleodganj is place to try out good food",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a place of profound tranquility and spiritual resonance. As you step onto the temple premises, a sense of calm envelops you. The majestic Himalayan backdrop create an ideal setting for introspection and meditation.\nThe monastery, also known as Dalai Lama Temple, holds immense significance. Apart from its religious role, it serves as an institute, an administration office, and even the residence His Holiness the 14th Dalai Lama. The library within the walls houses ancient text and wisdom. The architecture follows the Tibetan style, and the interior features polished wood and brass elements. However, the true marvel lies in the giant prayer drum adorned with sacred mantras. Spinning it is believed to bring blessings to all sentient beings.\nWhether you’re a seeker of inner peace or a curious traveler, the Namgyal Monastery leaves an indelible mark on your heart.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I love Himachal because I belong to also Himachal Pradesh district kangra... But I live in New Delhi... A place worth visiting.....\nNot just a monument but an experience....\nThe culture, the beauty, the vibes and mind calming peace.\nThe path to monastery has an market alley where you can buy various cultural items and souvenirs...\nAs you arrive to first floor, you witness natural beauty at its best, a direct peek to the snow ladden mountains surrounding the spot, forests, blue skys as clear as you could imagine. Himachal is very very nice and beautiful place to visit... Or yahan ke log bhi bahut bahut bahut helpful and kind h.....",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Dharamshala Skyway - McLeod Ganj Station",
      "rating": 4.7,
      "address": "Temple Rd, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "The ticket cost per person is Rs 450/- one way. The duration is about 10 minutes. It’s well maintained, a good ride both ways as you get town, mountain and valley views. There is usually a wait time but we were there around 4PM and it was empty.\n\nI would recommend doing this, it was quite fun and the views are worth it. It depends on what you’re comparing this with, if you’re here and looking for something low effort but fun I would suggest this.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the highlight of mcleodganj, the skywalk services provided by the Tatas is a boon for this place. It's really sturdy and is really very safe for the travellers, it cuts down the travel of 30-35 mins to just 10 mins. Just that I found the price to be a bit steep, but it's worth the price and the experience. Highly recommended !",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We visited Dharamshala in the month of Feb 2024 We had stayed at McLeodGanj. On our last day for our day tour at Dharamshala, we chose to travel to Dharamshala via Skyway. Located in the middle of Mall Road, after simple security check in, they provide 2 options - One way ticket for Rs 450 while two way ticket costs 675 Rs. We reached around 11 am and had to wait for approx 10 mins. In a single cabin, around 6 to 8 ppl can sit. Since there were not many ppl around, we got a chance to have the cabin to ourselves (2 ppl). The views are amazing. Ride takes around 10 mins and we get to see the mountain, valley and city views. Nice experience overall. Once we reached Dharamshala, you need to walk slope to reach at top where all cars are parked in.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very scenic, worth the money. Enjoyed travelling in a separate cable car. You'd have breathtaking view of the mountains.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Dharamshala Skyway offers breathtaking views of the surrounding landscape, making the journey itself a memorable experience. I personally was able to see the HPCA Cricket Stadium and the Kangra Airport.\n\nAdditionally, purchasing tickets in advance saves valuable time, allowing visitors to skip the lines and maximize their exploration of the area. Overall, it's a fantastic option for those seeking both convenience and stunning scenery.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "The Tibet Museum",
      "rating": 4.6,
      "address": "2nd Floor, T building, CTA, Gangchen Kyishong, Upmuhal, Dharamshala, Himachal Pradesh 176215, India",
      "reviews": [
        {
          "text": "Excellent - a super modern and engaging museum about Tibet. A must-see while you’re in Dharamshala. Spent about 2 hours here. Have your phone charged, bring headphones (and a powerbank), use the museum wi-fi to open the app or website, and you can simultaneously listen to the audio tour while reading the many descriptions and watching the videos.\n\nI had done some reading and tours about Tibetan refugee settlements in Nepal and India, but this museum visually brings all the history together with stories, timelines, maps, and images to create a comprehensive understanding about Tibet and its people. The website is great for referencing later, as well.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "During my visit to Dharmshala visited the museum. And it was a great and very good experience for me as I got to know much about the Tibet and Tibet government in exile. The museum is inside the Tibetan administration area. And is nicely managed and the place and the surrounding is very neat and clean. So a must visit if you are in Dharmshala Or planning to be there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Historical place,full of culture and it gives spiritual feeling.\nVery well maintained temple.\nMountains,lakes and sunset points make it extraordinary.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place\nMust visit when at Dharamshala.\nYou will.understand all history about Tibetians and their fight with China F r their own land.\nYou need atleast 4 to 5 hrs to see the museum in details.\nThey have lunch time between 1 to 2 pm.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very good place to know more about Tibet.   A  place to relax without anyone's disturbance. Loved the ambience . I definitely recommend it to anyone who loves to know about historical places.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Gallu Temple",
      "rating": 4.6,
      "address": "783G+Q89, near Gallu Devi temple Upper, Dharamkot, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "Excelent place, starting point for many treks to Triund. Great views, clean air, serene ambient.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Religious temple at Dharmakot\nWe went for TRIUND trek from this point",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Triund trek starts from here only. And hostel/hotel near this place is amazingggg., out of crowded mcleodganj, dharamkot, just amazing view n nothing else",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A small hike from Zostel Dharamkot and you will love this place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very fruitful and rewarding trek up to the temple where you can seek blessings and then enjoy a delicious serving of Maggi alongside stories of the local residents who will delight you with their tales.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tsuglagkhang Complex Dalai Lama Temple",
      "rating": 4.6,
      "address": "Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "Visiting this serene place offers a profound sense of peace and tranquility. Watching the monks engage in their daily prayers fills the atmosphere with a calming energy. Taking a leisurely walk around the exterior of the complex is a truly enchanting experience. The beauty of the surroundings, adorned with prayer wheels along the path, adds to the spiritual ambiance. Each turn of the prayer wheel symbolizes a devout wish or prayer, creating a rhythmic harmony with the surroundings. Amidst the quietude, one can't help but feel a deep connection to the spirituality and history of the place. It's a sanctuary where time seems to slow down, allowing visitors to immerse themselves fully in the moment and find solace in the presence of ancient traditions.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Dalai Lama Temple in Dharamshala is a truly peaceful and special place. It's where the current Dalai Lama resides.\n\nThe temple has stunning paintings and artworks, adding to its beauty. Visitors can immerse themselves in the tranquil atmosphere and admire the details of the art.\n\nAdditionally, the temple offers an environment for meditation and reflection, allowing visitors to find inner peace.\n\nOverall, a visit to the Dalai Lama Temple is a unique and enriching experience, offering Buddhist cultural insights.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The complex is huge, but does not represent anything vernacular about the Tibetan architecture. Most of the construction is so raw and concrete that it is in stark contrast to the Tibetan ambience seen in typical monasteries",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is the holy temple which describes the budhism & their worship.this is also the home of Dalai Lama.many Buddhist monk we can see there.worth visit once in a lifetime to take blessings & vibes of divine.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I had visited during morning time. The area of the temple is huge. Namgyal Monastery also called Dalailama Temple. There are Institute, admistration office and residence of Dalai lama, library adjacent of temple. This place is very calm. There is no entry fees. This temple is just one minute walking distance from Dharamsala skyway/ropeway.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tushita Meditation Centre",
      "rating": 4.7,
      "address": "McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India",
      "reviews": [
        {
          "text": "It's a meditation center hidden from the bustling McLeodganj town. It's got a steep 700 m climb to reach from city centre. Place is natural and peaceful. Visit during morning 9-10 for their morning meditation. They've residential courses as well - details on their website. Most attendees were from outside India last time I visited.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The 9am free guided meditation is an excellent introduction to Buddhist meditation practices, and it is a suitable class for both new and more experienced meditation. The main hall is stunning, peaceful atmosphere and lovely walk in the woods to reach there. Aum🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Silence is the mantra there. Speak to yourself! Place is perfect for someone seeking inner peace. There is meditation session from 9-10AM. But unfortunately on the day we went the session was cancelled. So do confirm before going. One can individually meditate any where in that place.\nWe booked taxi from McLeod Ganj to reach there who charged ₹300. Return we came by walk. There is walkway on backside for those who want to walk down. It’s safe.\nI knew they have 10 day sessions also. Do explore",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Attending a 10-day retreat at Tushita Meditation Centre was truly life-changing. The teachings and introduction to Buddhism were illuminating.\n\nThe teachers and staff emanated such love, compassion and kindness that it created a peaceful haven for self-reflection.\n\nThe beautiful forest surroundings, with stunning morning views of the misty hills, added to the serene atmosphere. I emerged with a profound sense of inner peace, mindfulness and spiritual connection that I continue to carry with me.\n\nIt was one of the most meaningful experiences of my life.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I took the Intro to Buddhism course here and Becoming your own therapist.  The teachers, food, and space were lovely.  I wish I could have stayed longer.  It has been the best part of my trip in the Dharamshala area.  Thank you Tushita!",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}