{
  "places_with_reviews": [
    {
      "name": "Jam Gate",
      "rating": 4.5,
      "address": "9P4P+V59, Mhow - Mandaleshwar Rd, Bhagdara, Madhya Pradesh 453441, India",
      "reviews": [
        {
          "text": "Beautiful place where one gets the view of the valley floor below. The gate is just a gate and adds to the scenic beauty though! Nice place to spend time with family or friends and witness the Sunrise and the sunset here. Some stalls are placed by localities for refreshment. Taking one star away due to lack of cleanliness and no washrooms for the tourists.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Terrific place to fun, or go to long drive with friends and family it also has a very beautiful sunset or sunrise view. In rains, there are too much of clouds. Awesome place to enjoy you. But take care of traffic and drive carefully.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a nice place. beautiful valleys for taking photographs. The sky & view is amazing. Crowded at weekends. You can see monkeys birds & some indori chapri's.\n\nIt is a toll tax/ toll naka of old times. There is a temple of vindhyavasini Devi.\n\nOnce must visit it is worthy to go.\nAlso try super spicy Maggie it is also worthy at Rs50.\nTicket price Rs10 Each person.\n\nWe had a visit when we are returning from maheshwar\n\nFollow me😊",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jam gate is located in maheshwar about 50 km from Indore on mhow-mandaleshwar road. It's a popular picnic or tourist place. This arched gate has a roof with a platform on it. The view of the surroundings from its top is just amazing, especially in the rainy season.\nNote - Be careful at the top of the gate, one should not step on the perrapet walls for selfies and all.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Excellent place to visit on weekends, you will love to eat Maggi there while sitting on khaat and viewing the beauty of nature at its best... It is on the way between Mhow-Khargone road, the road is well maintained and you will not have any issues in day time, but avoid driving at night because the turns are very sharp and dangerous and also you will be severely stuck there if your vehicle fails or punctures.... You are not going to get any help at the time of night because people also do not stop there.... Although your overall experience will be very good and also the Patalpaani Waterfalls are not very far from there, you must visit there also to utilise your whole day.... I visited there when I was going to Khargone from Dewas, it is greatly recommended to view the sunrise or sunset from the hill which will give you an auspicious experience and you will try to visit there every weekend.... Just follow some precautions and your trip will be very good, you should maintain the fuel in your car because you are not going to find any fuel station there and more problems come when you have a CNG vehicle.. overall experience was good, have a nice journey....",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mahadev Khodra ( Chota Amarnath) Cave",
      "rating": 4.6,
      "address": "9Q89+RXP, Buraliya, Madhya Pradesh 453441, India",
      "reviews": [
        {
          "text": "I have visited this place with my colleagues. So peaceful place. Really amazing facts in Mahadev cave. Keep your water bottle with yourself. There is no shop nearby this area",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Perfect place to visit in winter and monsoon. Bring your snacks and water with you",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awesome place easily you can reach there, small waterfalls is also available.\nTotally natural place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A mesmerizing view there and also some natural beauty on the way there .... At last there is a \"Shiv- Linga\" inside the cave after a downward trekking.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place ever nearby indore but keep your things together.\nThere is no shop for anything.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Wanchoo point",
      "rating": 4.2,
      "address": "8MXH+V58, SH1, Madhya Pradesh 451221, India",
      "reviews": [
        {
          "text": "A beautiful place surrounded by nature's beauty at its very best.\n\nWe visited this place during our Monsoon Motorcycle Ride to Mhow and had a wonderful time.\n\nIt was drizzling while riding to this location and the weather was perfect.\n\nEven though the access road especially through the villages is in a bad condition but the beauty of this place made up for it.\n\n100% recommended while visiting this area.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A beautiful beautiful place to be if you love nature.\nNice to have a long drive with all your mates.\nAmazing experience.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice place. You can come here, relax, spend time with family and play games. There's a forest guest house too. Nice view of the Ghat. Just 51 kms from Indore. Roads are very good. Even buses can come. The environment is best to just relax and get relieved from all the tensions of life. There's a big Garden in front of the forest guest house. A must visit place for Family and Friends.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "They say the journey is more beautiful than destination, they would have said it looking at this point….\nWe went in there while it was raining…roads are awesome.. there wasn’t anything as such for site seeing at Vanchu point apart from the indicative board that it is Vanchu point..\nBut overall great experience….",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place to spend time with family and friend.A place where you can really close to mother nature. A good spot to admire the nature and experience the sun set. The journey to this location is exciting in itself. You can visit this place with family and friends. There is no food or water service available here so bring that along with you. The place is peaceful and relaxing.Situated on edge of ghat having a very mesmerizing view. The road to this point is from ghats through lush greenery. A lot of Army and NCC camps are organized at this point for various activitiesas this place is very isolated and away from city and less crowded.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Vachu point",
      "rating": 4.2,
      "address": "8MXH+V58, SH1, Kapar Kheda, Madhya Pradesh 451221, India",
      "reviews": [
        {
          "text": "It's a good place to visit during winter and mansoon season. Jam gate is 18 km away from this place. You can see memorable views during sunrise and sunset. For safety , please go via car and in a group 4 to 6 people.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful place nice atmosphere very quite place to visit and the best part is sunset view. Pin drop silence attract you the most and the sound of flowing water throwing the hills looks like a flow of air coming to you. At least every one has to visit once for this place. The best time of visit this place is between 10 am to 6 pm. Because this place have only few people's near by so before sunset you have to leave this place. Take your own risk to visit hear and keep this all security in your mind before go here.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "If you love hills must go nices views",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "What to say about this place. It's just a calm relaxing eco-friendly place . Just visit this place early morning or at evening time. You will get a ossaammm experience and a great site to watch out.\n\nIt's famous for sunrise and sunset and there is a lot of space for playing and having fun.\n\nCarry your necessary items because no availability of material is there.\n\nWhat a site what a view what a experience. Sunrise was a moment to watch for. Just loved it",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice panoramic view of valley",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Maa Parvati Mataji Temple",
      "rating": 4.6,
      "address": "9P5P+3GF, Mhow - Mandaleshwar Rd, Bhagdara, Madhya Pradesh 453441, India",
      "reviews": [
        {
          "text": "Maa Parvati Mataji Temple is good and it is under construction but here you can have nice click of beautiful surroundings . Nearby you have  Jam Hate.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful temple near Jam gate, If you are visiting jam gate this is also a must visit place to add little bit of spirituality to your trip",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean, peaceful, religious and good place for worship of goddess Parvati Mata ji.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mata mandir with a very nice scenic view. This is a place weekend getaway into the wild. Loce this place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Maa Parvati Mataji Temple is good and it is under construction but here you can nice click from your camera. Near there is jam gate.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ahilya Fort Gadi",
      "rating": 4.7,
      "address": "7PH6+GC7, Somakhedi, Madhya Pradesh 451221, India",
      "reviews": [
        {
          "text": "Wonderful, beautiful, awesome",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sitaram Awas Soma Khedi",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Constructed by Ahilya Bai Holkar",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "beautiful",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "वांचु पॉइंट झरना",
      "rating": 3.8,
      "address": "8MQH+G74, Kapar Kheda, Madhya Pradesh 451221, India",
      "reviews": [
        {
          "text": "You can enjoy the beauty of nature",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Beautiful place",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Mast",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "🏞️ Adorable 🌊",
          "languageCode": "en-US",
          "rating": 3.8
        },
        {
          "text": "nice place",
          "languageCode": "en-US",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Green Valley viewpoint",
      "rating": 5,
      "address": "9P5P+3GF, Bhagdara, Madhya Pradesh 453441, India",
      "reviews": [
        {
          "text": "Jam gate",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Best",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Shanti dham Jaam gate picnic spot",
      "rating": 3.9,
      "address": "9P8V+V5Q, Mhow - Mandaleshwar Rd, Jam Khurd, Madhya Pradesh 453441, India",
      "reviews": [
        {
          "text": "Nice place. Wonderful in monsoons. Not much to do around but scenic and mesmerising. Also, food stalls have cropped up in few years for little munching.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very silienty and attractive place in nature and kile is very good",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Super all photos and kila are very nice 👌🙂",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Nice place for picnik, but a quiet far from jam gate...",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Chota Amarnath mandir indore",
      "rating": "Unknown",
      "address": "9Q89+RXP, Buraliya, Madhya Pradesh 453441, India",
      "reviews": []
    }
  ]
}