{
  "places_with_reviews": [
    {
      "name": "Bhandardara Dam",
      "rating": 4.5,
      "address": "Near Ghoti Tal Akole, Dist. Ahamednagar, GQW4+XWP, Shendi, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "The dam site is very serene. There one can do boating  at ₹100 per person. If you want to visit the dam (back waters )then they'll charge ₹200 per person. Dawn and dusk are the best times for scenic views. If you are taking a late evening ride, then the prices for both lake ride and back waters are negotiable because it's their packup time so one can negotiate the rate.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "## Bhandardara Dam: A Scenic Escape into Tranquility\n\nNestled amidst the lush Sahyadri hills, Bhandardara Dam offers a welcome respite from the bustle of city life. Whether you're seeking natural beauty, thrilling adventures, or peaceful relaxation, this picturesque getaway has something for everyone.\n\n**Breathtaking Scenery:**\n\nThe highlight of Bhandardara is undoubtedly the magnificent dam, a majestic stone structure spanning the Pravara River. Witnessing the cascading water during monsoon is a spectacle, sending rainbows dancing across the mist. Lush green valleys, cascading waterfalls, and tranquil lakes paint a stunning landscape, perfect for photographers and nature lovers.\n\n**Adventure Activities:**\n\nFor the thrill-seekers, Bhandardara offers an array of exhilarating experiences. Embark on a scenic boat ride on Arthur Lake, kayak through serene waters, or test your nerves on a thrilling ropeway ride. Explore ancient caves, trek through rugged hills, or challenge yourself with rock climbing – the possibilities are endless.\n\n**Quiet Delights:**\n\nBeyond the adrenaline rush, Bhandardara also offers tranquil pleasures. Spend a quiet afternoon by the lake, soak in the serenity of Amritaeshwar Temple, or enjoy a picnic amidst the whispering trees. The gentle breeze and calming atmosphere are perfect for rejuvenating your soul.\n\n**Things to Consider:**\n\n* **Seasonal variations:**  Monsoon is the season of cascading waterfalls and lush greenery, but also brings crowds and potential travel disruptions. Summers offer pleasant weather and fewer crowds, while winters can be chilly.\n* **Accommodation options:** Choose from cozy cottages and campsites to luxurious resorts catering to various budgets.\n* **Food and dining:** Local restaurants offer delicious Maharashtrian fare, while resorts have multi-cuisine options.\n\n**Overall Experience:**\n\nBhandardara Dam is more than just a dam; it's a complete package for a rejuvenating getaway. With its stunning scenery, thrilling activities, and peaceful retreats, it caters to diverse interests and leaves you feeling refreshed and fulfilled.\n\n**Recommendations:**\n\n* Book your accommodation in advance, especially during peak seasons.\n* Carry rain gear and comfortable footwear for exploration.\n* Try local Maharashtrian cuisine for a unique culinary experience.\n* Respect the natural environment and leave no trace behind.\n\nBhandardara Dam is a hidden gem waiting to be discovered. Whether you're an adventure enthusiast, a nature lover, or simply seeking a serene escape, this scenic haven offers an unforgettable experience for all.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Always a good place to visit. If you are looking for a quiet isolated place away from the city with peace of mind then this is the destination. You can enjoy it here with your family and friends. The ngs to do Camping, boating and Sunset view. You might not find the brands here but the locals provide the required things as per their capacity.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place defines \"Serenity\".\nThere's an insanely huge Lake where you can enjoy a boat ride or just observe the breathtaking views of mountains and valleys surrounding it... Most enjoyable at Sunrise or at the Sunset...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice Place to visit in All season Gd atmosphere Around Dam U can Spend Quality time with your Friends and Family Couple Friendly place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Randha Waterfall",
      "rating": 4.5,
      "address": "Randha fall, Randha, Ranad Bk., Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Randha Waterfall is a breathtaking natural wonder nestled in the heart of nature. The cascading waters create a mesmerizing spectacle, surrounded by lush greenery and rocky landscapes. The accessibility and well-maintained trails enhance the overall experience. It's an ideal spot for nature lovers and photographers. However, do check the water flow seasonally for the most captivating views. A serene escape into the beauty of Maharashtra's landscapes.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Seasonable place must visit in rainy days\nThis waterfall is formed by the river Pravara and is a popular tourist attraction. This waterfall is the third largest waterfall in Maharashtra state. Near the waterfall, there are some newly built wooden structures for sitting and footover bridges for viewing the falls as well as the river Pravara.\nMaharashtra\nBhandardara Dam also known as Wilson Dam has its existence on Pravara River and is situated 150 metres above ground level. This dam is located in holiday resort village of Bhandardara on the western coast of India. This lies in Ahmednagar district of Maharashtra.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Randha fall is one of major tourists attractions around near bhandardara region, this fall is formed from Pravara river. This place is picturesque where we can see temple on yhe banks of river fall this place gets crowded lot during Mansoon season. We had visit last week which is winter season, we enjoyed our stay and morning at this place with nice fog around lastly no rush around 😊\n\nKeep area and surrounding neat and clean 🙏🏻",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lovely sight, especially in the Monsoon season. When we visited, the quantity of water was not much. Still the view is amazing.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful ....Nice place to visit with family specially in mansoon. Amazing view of waterfall",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Umbrella Fall, Bhandardara",
      "rating": 4.5,
      "address": "Ratangad to Rajur Rd, Shendi, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Great place for weekend ride just need to prepare for off road.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": ". It's a nice place with greenery.\n\n. We visited after rainy season. So we didn't get a chance to see the waterfall. But I can imagine how beautiful it would be.\n\n. Must visit when the Damm is full.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place has been the best field visit so far. It was a successful stress reliever as i was able to connect myself to nature and experience the beauty at its fullest.\n\nThe main waterfall is quite far from the entrance. We all went hiking on the mountain not expecting to get such an outcome at the end. The hard work was worth it at the end of the day.\n\nThe main dam was closed due to some issues, but we were lucky to get a view of it from afar. Once we continued walking over the table top land, we reached the lake where the waters are completely blue in colour.\n\nCan't believe that our nature is unexpectedly so beautiful and untouched by pollution here.\n\nIt's really worth visiting here.\n\n❤️❤️❤️❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is excellent view point at Bhandardara. When water is discharged from dam valves it flows from rocky area and water takes shape of umbrella ☂️. Hence called as umbrella falls. You can observe this falls from many locations. As road gose in spiral ghat way in front of dam. You can see it from front. From top near dam wall and from bottom garden below the dam wall. All these three view points have its own beauty. Enjoy this in rainy season.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The place is good. But the real attraction is around the Arthur lake like sandhan valley and falls which come in route to the sandhan valley taking the forest route. Also look for the Arthur lake  which is the nice place to do camping and sit around to enjoy the beauty of the place. You can enjoy a lot in the rainy season and can also stay as the place provides some good resorts but the best option would be to camp and for that you can get camping tents from the local guides or shops which provide it",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shree Amruteshwar Temple",
      "rating": 4.7,
      "address": "@-Ratanwadi near Bhandardara, Amruteshwr temple, Ratanwadi, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "This is a temple situated in the mountains near bhandardara lake and the environment there is very peaceful. The toad for the temple is not good but also adventurous. This is a must visit place. During rainy season there is much crowd and it is recommended to visit here during September- November or May-June. During monsoon, so many beautiful waterfalls are formed and the place looks just like heaven.\nI visited in may.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amruteshwar Shiva Temple in Bhandardara is an awe-inspiring gem nestled amidst the serene beauty of nature. The temple's ancient architecture and intricate carvings add to its spiritual charm. Surrounded by lush greenery and the tranquil waters of Lake Arthur, it offers a peaceful and serene atmosphere for devotees and visitors alike. The location itself enhances the overall experience, making it a perfect retreat for those seeking solace and spiritual rejuvenation. A visit to this temple is a journey back in time, connecting with history, culture, and the divine presence of Lord Shiva. Highly recommended for anyone seeking a soul-stirring experience amidst nature's splendor..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its very beautiful ancient temple of lord shiva. The shivling in the temple is half submerged in the water. This site is declared as national heritage by GOI. The temperature inside temple is very cool even at day time when temperature outside is very high.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peacefull holy place. The stone carving are delightful to watch. Carving design and detailed work are just unreal. Temple is not huge but the aura around is which makes you calm and quite. Should visit is monsoons specially, the atmosphere is amazing.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is very beautiful, and this is an ancient structure.  Beautiful carved stones with statue of gods. Less crowded place to visit.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bhandardara Hill Station",
      "rating": 4.6,
      "address": "GQP8+687, Bhandardara, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Visited in 2013! Was the perfect getaway spot from Mumbai, 4 hours away and completely untouched by pollution. Small waterfalls everywhere, a big lake and lush greenery all around. Get all the fresh air you can!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place, must visit. Me and my friends went during the monsoon and had the best experience, you won’t be talking about waterfalls anymore after visiting, pictures don’t do it justice!\n\nIf you are going from Mumbai, I would suggest you complete it in a day by travelling on weekdays and hiring a guide, without a guide the locations are tough to find in the fog.\n\nAnother reason to do it in one day would be the food, there are not many good hygienic restaurants on the highway or the hill station, your best bet is lunch while exiting Thane and dinner in Igatpuri.\n\nAll the locations of the hill station have life guards near the waterfalls and the places were clean.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bhandardara lake is situated amid Shayardi range of western ghats in Maharashtra. Camping at lake side is available. This can be a weekend getaway from Mumbai and Pune.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the most beautiful drives that we've been on. The scenery is just beautiful esp if you are driving from Mumbai avoid the Ghoti road instead take the Bhavli dam road, amazing views and smooth drive(we went in July 2023). Stayed at Wildroots Resort in Bhandardara, beautiful location and good food too. While the rooms are small and basic its ok for a 2 nights stay. Must do is a drive thru the Bhandardara Kalsubai Harishchandragad Wildlife Sanctuary, just mesmerizing views of the Sahyadri's. Also visit the Randha falls, in peak rains its absolutely beautiful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "During the monsoons, this location is a visual treat. Beautiful scenery, magnificent grasslands, stunning waterfalls, and exceptional animals. I'm speechless at how gorgeous this place is!\n\nFrom Mumbai, we hired a zoom car and reached Bandhardhara through Igatpuri. Apart from a section of road that was clogged with bad traffic and was damaged by rain, most roads were in fair condition.\n\nIt is undoubtedly a must visit location during the monsoon. Numerous waterfalls, lakes, and forts can be found across the 100–150 km loop. As we were traveling with children, we decided against going on a trek in the rain, therefore we missed seeing the reverse waterfalls. Additionally, we skipped Ratangarh fort, which was on the top of my list. Maybe the next time!\n\nTo enter the area, we paid 100/- for our car and 30/- per person. We were also given a map as phone network won’t work throughout the way (we realised that later). We wasted around 45 mins to track the path as there were no signages to reach the reverse waterfall. It takes about 15-20 mins trek to reach this waterfall, however we decided to skip as we were travelling with kids.\n\nDo carry umbrella, rain shoes and rain coats if you are visiting this area during monsoon! Also, carry food items in your vehicle. There are small tapris here and there which serve tea, bhajiya, Maggi etc.\n\nPeople are good and helpful. Local food items are a must try if you like to try different cuisines.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Reverse waterfall",
      "rating": 4.6,
      "address": "GQ89+3MJ, Unnamed Road, Muthkhel, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Nice view point but only visit in rainy season.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "July, August and September is best time to visit this place to witness it's magical view.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a beautiful place\nReverse waterfall pabargad\n\nBest time to visit this place\n25, July -August- September..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I just Love the waterfalls…!!❤️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Vasundhara waterfall",
      "rating": 4.6,
      "address": "GQQ9+2Q9, Bhandardara, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "This is not the original vasundhara falls. This is the water flowing from the bandardhara dam. But this is great place. You will not witness this much water with such force in the form of waterfall anywhere else",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit a waterfall in Maharashtra , just small hiking required to reach this beautiful waterfall from the main road.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Most beautiful waterfall",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "best",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "There is an amazing view here and it is necessary to buy a 200rs 🎟️ ticket from here before coming.",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Umbrella Waterfall view point",
      "rating": 4.3,
      "address": "GQX6+M3, Shendi, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Umbrella Waterfall is a hidden gem nestled in nature's embrace. The cascading water, resembling a delicate umbrella, creates a tranquil haven. A perfect spot for serenity seekers and nature enthusiasts, offering a picturesque escape from the hustle and bustle. 🌿🌊 #UmbrellaWaterfall #NatureRetreat",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We missed the umbrella waterfall. Yes place is awesome",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a beautiful waterfall\nLooks like a umbrella ☔\n\nMany people visit this place in August month\nIt's situated at bhandardara dam\n\nBeat time to visit this place\nEnd of July to August .\nMainly it's open to 10 August to 17 August\nOnce in a month... So whenever you visit this place this time period .\n\nThank you so much .\n\nKalsubai harishchandra gad wildlife sanctuary\n\n@hill range of sahyadri.\n\n#Rahul dhage\nYoutube - sahyadri hill station bhandardara.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "No water when we visited",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "They doesn't opened the dam so that we can't see's the umbrella fall",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Ghorpada Devi Temple",
      "rating": 4.6,
      "address": "GRR3+4MP, Ranad Bk., Maharashtra 422604, India",
      "reviews": [
        {
          "text": "Located 64kms from kasara(I travelled from mumbai by train) , you will get cabs for 120 each in sharing one trip and 1600-2000 special cab for return for just u / ur group . These cabs are easily available outside railway station. Now the route to the temple is very beautiful with waterfalls view, greenery, paddy farm so all and all amazing vibe to reach there. But due to 1.45 hrs cab ride to temple its gonna be super tiring but once u reach temple and see devi ki murti and randa falls its just going to be sooooo refreshing . Visit the place at evening time and stay there in a nearby resort for day for a not so hectic and fun trip.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Built on the bank of Pravara River... Not much famous but get crowded when people comes to visit Randha waterfall.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nashik is my native place i always love yo go there.. and the temple 'Ghorpada Devi'🙏🏻is the closest to my heart😌..... I have been going there since my childhood and it has changed a lot better than before. I love that place and that place so much. That waterfall and the lustful nature.. I just love it🥰💌💕",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful and peaceful place for visit and spend wonderful time with nature and to enjoy with the flow of water and air too as  it is holy place the atmosphere suits it the best",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Do Ghorpada Devi Temple before visiting to Randha Fall. Both the Temple & Fall adjacent to each other & situated at Pravara River. Both the place woorth visiting with family.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Bhandardara Tourism",
      "rating": 4.8,
      "address": "At-Bhandardara, Post-Shendi,Tal-Akole, dist-ahmednagar, Maharashtra, india post, Maharashtra 422604, India",
      "reviews": [
        {
          "text": "This place should be visited in rainy seasons . The roads now are very approachable.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great place ,so many falls available\nHuge lake bhandardar, 5 to 6 trek available",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "While on our way, we saw so many camp sites, I would recommend traveling with Travers India.\n\nThis is a scenic drive to the camp site, the stream, dam are beautiful along the way.\n\nOne tip - before you enter the camp site, you need to pay for the vehicle and an adult passenger, consider this like a tourism toll entry fees to visit or stay here.\n\nThe camps, the tents and the local villagers assist in home cooked meals, stay, setting up the tents.\n\nOf course the whole idea to witness the fireflies is breathtaking. There is still no camera that can capture the illumination of the fireflies. There is an optional night trek, too.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful place to visit in monsoon. Waterfalls and the cool weather is awesome.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "No need to explain how beautiful scenes are in Bhandara as you can see it from these pics.\nI was lucky as I got permission to enter in the dam view area because I have relatives who are well known in this place.\n\nI also did swimming and roamed all around. People say that the best time to visit this place is in rainy season. The greenery and fresh water makes a fantastic environment.\nAnyhow I enjoyed every time I visited here.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}