{
  "places_with_reviews": [
    {
      "name": "Mehndipur balaji",
      "rating": 4.7,
      "address": "6G83+35H, Patpara Mohalla, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "That is good palace mehndipur Balaji temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Everyone knows about this place...u love the amazing experience of mehndipur Balaji",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai shri Ram\nExcellent place but precaution to be taken",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "There are many mobile phone thieves here. Simply avoid. People loosing expensive phones",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Choose Sunday Monday Wednesday Thursday and Friday in between 9am to 10 am for darshan if u want to avoid crowd..if u r with kids and old person avoid aarati..Jai shree Ram",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Lohagarh Fort",
      "rating": 4.4,
      "address": "6FCV+QPV, Lohagarh Fort, Gopalgarh, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "So the actual fort itself is a society with markets, schools and everything. There is a particular museum which is not a heritage site but a great replica of the actual fort with a huge collection of artifacts. Had fun.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lohagarh Fort (or Iron Fort) is situated at Bharatpur in Rajasthan, India. It was built by Maharaja Suraj Mal in 1732 on an artificial island and took eight years to complete. It needed large number of manpower and significant amount of wealth to build such impregnable fort, as the name of the fort itself says-- “Lohagarh”, which means, Iron fort (Loha means Iron and Garh means fort).The inaccessible Lohagarh fort could withstand repeated attacks of British forces led by Lord Lake during The Siege of Bharatpur in 1805 when they laid siege for over six weeks yet failed in all four attempts to storm the fortress.\n\nOf the two gates in the fort, the one in the north is known as Ashtadhatu (eight metaled) gate while the one facing the south is called Chowburja (four-pillared) gate. Monuments in the fort include are Kishori Mahal, Mahal Khas, and Kothi Khas.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lohagarh Fort, located in Bharatpur, India, is a formidable structure known for its robust architecture and historical significance. Constructed in the 18th century by Maharaja Suraj Mal, the fort translates to \"Iron Fort,\" a name befitting its sturdy design.\n\nThe fort is surrounded by a deep moat that was filled with water to thwart enemy advances. Its massive gates, including the Ashtadhatu Gate and the Chowburja Gate, showcase intricate craftsmanship. The Kishori Mahal within the fort, once a palace for queens, exemplifies Rajput architecture with its exquisite frescoes and carvings.\n\nLohagarh Fort played a crucial role in the history of Bharatpur, resisting multiple attacks by the British, including the famous Siege of Bharatpur in 1805. The resilient structure earned its reputation as an impregnable fortress.\n\nToday, the fort stands as a testimony to the valor and strategic acumen of the Rajput rulers. Visitors can explore its various sections, including the towers, palaces, and museums, to delve into the rich history of the region. The conservation efforts have preserved its historical charm, making it a compelling destination for history enthusiasts.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place with some interesting history. The fort museum was well maintained and a must visit if you are in Bharatpur.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice palace to seen history of bharatpur.\nNice tourist place.\nLost of sculpture...of  history\nMany things to see\nAccording to 2/3 hr Max for this palace",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Laxman Mandir",
      "rating": 4.3,
      "address": "New Sanatan Dharm Market, Tara Mahendra Colony, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "As of my last knowledge update in January 2022, I don't have specific information about a \"Laxman Temple\" in Bharatpur. However, I can provide you with a general template for writing a detailed review based on common features of temples.\n\n---\n\n**Laxman Temple, Bharatpur - Review**\n\nThe Laxman Temple in Bharatpur is a site of historical and cultural significance, drawing visitors with its architectural splendor and religious importance. Here's a detailed review based on a hypothetical understanding:\n\n**1. Architectural Elegance:**\nThe Laxman Temple is a testament to architectural prowess. Delve into the intricacies of its design, noting the craftsmanship, intricate carvings, and unique architectural elements that showcase the temple's historical and artistic significance.\n\n**2. Historical Context:**\nExplore the historical background of the temple, especially any events or stories associated with its construction. Understanding the historical context adds depth to the visitor's experience and appreciation of the temple.\n\n**3. Spiritual Ambiance:**\nEvaluate the spiritual ambiance of the temple. How does the atmosphere contribute to a sense of reverence and tranquility? Consider any rituals or prayers that are conducted, enhancing the overall spiritual experience for devotees.\n\n**4. Preservation and Maintenance:**\nAssess the preservation efforts and maintenance of the temple. A well-kept environment reflects the commitment to conserving the historical and cultural heritage embodied by the temple.\n\n**5. Accessibility and Facilities:**\nConsider the accessibility of the temple for visitors. Assess factors such as parking facilities, pathways, and amenities like restrooms. Accessibility ensures a comfortable visit for individuals of all ages.\n\n**6. Cultural Significance:**\nUnderstand the cultural significance of the Laxman Temple within the local context. How does it contribute to the cultural identity of Bharatpur, and what role does it play in the community's traditions?\n\n**7. Interpretative Information:**\nLook for interpretative information such as plaques, signs, or brochures that provide insights into the temple's history, architectural features, and religious importance. Educational resources enhance the visitor's understanding and appreciation.\n\n**8. Community Engagement:**\nExplore any community initiatives or events organized by the temple. Temples often serve as community hubs, hosting cultural events or social programs that foster a sense of belonging among local residents.\n\n**9. Photography Policies:**\nUnderstand the temple's policies regarding photography. Clear guidelines on photography contribute to a respectful and harmonious experience for all visitors while preserving the sanctity of the religious site.\n\n**10. Overall Impression:**\nSummarize your overall impression of the Laxman Temple. Reflect on the emotional and cultural impact, considering both its historical significance and the general visitor experience.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The temple is dedicated to Lord Laxman.\nThe temple is known for its beautiful architecture and intricate carvings, which are typical of the Rajasthani style of temple construction.\nApart from the main shrine dedicated to Lord Laxman, the temple complex also houses several other smaller shrines dedicated to other deities.\nSri Laxman Mandir is a significant spiritual and cultural landmark in Bharatpur and is a must-visit for anyone interested in exploring the rich religious and cultural heritage of Rajasthan.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Sh. Laxman, Shri Ram's Brother, a temple one of its kind dedicated to the Laxman Avatar of Shri Sheeshnaag... the craftsmenship in the temple carving reveals the multiple heads of sheeshnaag.. A must visit....",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Laxman Mandir is a prominent shrine in the city of Bharatpur in Rajasthan and is believed to be around 400 years old. The temple is situated in the middle of the city and is a tribute to Laxman.\nIdols are made of asth daathu. You easily reached here by auto rickshaw.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Bharatpur has a tradition of worshipping Lakshmanji alongwith his consort Sumitraji. The Kings used to invoke the blessings of Lakshman ji before embarking on a war. This beautiful temple with intricately carved pillars is dedicated to Lakshman ji and Sumitraji.\n\nVisit this temple as it is probably the only place with a temple dedicated to Lakshman ji.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Khatu shyam baba mandir",
      "rating": 4.8,
      "address": "6FFV+PH3, Lohagarh Fort, Gopalgarh, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "A very famous and grate Hindu tempal. Minimum 10,000 of people came here daily from all over country and also some people from out of country.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A place outside of the lohaghar fort this is a very clean and beautiful place khatushayam baba ki jay",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A place of real peace, where your wishes come true. Just need to give an honest call",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Heart touching place.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Vishwapriya Shastri Park",
      "rating": 4.3,
      "address": "E Block, Jawahar Nagar, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "Nice park bustling with activities. Has children play station and Mini Train too.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You come and enjoy\n💙💙 Picnic 🧺\n\n💚💚 Playing 🏏🏸🌭\n\n💛💛 Lohagarh caffe 🌭🌮🌯\n\n🧡🧡 Children train 🚂🚂\n\n❤️❤️ Various selfie points 🤳🏽🤳🏽\n\nand many other enjoyable things to do also.\nNearby you will be glad to find\n\n🐦 THE KEOLADEO NATIONAL BIRD SANCTUARY 🕊️",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Vishwapriya Shastri Park is probably the best and biggest park in Bharatpur city. Most of town's attention is on this park and it finely maintained by the authorities. But the only problem is that it is too much crowded sometimes. Although it is sufficiently huge park but authorities should also focus on developing new parks and maintaining other parks. So that crowd can be equally devided in all of them. Also one major problem with this park that it is not safe if you come here with two wheeler. Bikes and bycycles of many of my known people have been stolen from this place. Even after being so crowded its not safe with the security perspective.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is a nice park where all the facilities are available for the entertainment of children and youth. There is an open gym, toy train and a very large area where people walk. Here Lord Shri Krishna's incomparable form of rising Govardhan mountain is shown.  It looks even more amazing at night.  Overall it is very natural. Where people can spend a good moment with the whole family.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Park is huge and green. It has a great scope to be developed as a great tourist place but as usual it is not well maintained.  Most of the fountains doesn't work,  pond is filled with filth and no proper facilities for drinking water and sanitation.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Bankey Bihari Ji Temple, Bharatpur",
      "rating": 4.7,
      "address": "6F9W+P35, Lohagarh Fort, Gopalgarh, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "As of my last knowledge update in January 2022, I don't have specific details about a \"Shri Banke Bihari Ji Temple\" in Bharatpur. However, I can provide you with a general template for writing a detailed review based on common features of temples.\n\n---\n\n**Shri Banke Bihari Ji Temple Review**\n\nThe Shri Banke Bihari Ji Temple in Bharatpur stands as a revered site of devotion, combining spiritual significance with cultural richness. Here's a detailed review based on a hypothetical understanding:\n\n**1. Spiritual Aura:**\nThe temple exudes a serene and spiritually charged atmosphere. The ambiance is conducive to prayer and reflection, providing devotees and visitors alike with a sense of tranquility.\n\n**2. Architectural Grandeur:**\nExplore the architectural marvels of the temple. Pay attention to the intricate details, design elements, and any unique features that showcase the craftsmanship and artistic expression of the structure.\n\n**3. Deity and Devotion:**\nLearn about the deity, in this case, Banke Bihari Ji, and the devotional practices associated with the temple. Observe any rituals or ceremonies that deepen the connection between devotees and the divine.\n\n**4. Cultural and Historical Significance:**\nDelve into the historical and cultural background of the temple. Understand any stories or legends associated with the deity, and how these narratives contribute to the cultural tapestry of Bharatpur.\n\n**5. Pilgrimage Experience:**\nIf applicable, describe the experience of being on a pilgrimage to the temple. Consider factors like the journey to the temple, the presence of other pilgrimage sites nearby, and the overall pilgrimage atmosphere.\n\n**6. Cleanliness and Maintenance:**\nAssess the cleanliness and maintenance of the temple premises. A well-kept environment enhances the overall experience, reflecting the dedication of those responsible for its upkeep.\n\n**7. Rituals and Worship Practices:**\nObserve the rituals and worship practices conducted at the temple. Note the authenticity and vibrancy of these practices, as they contribute to the spiritual vibrancy of the temple.\n\n**8. Accessibility and Facilities:**\nEvaluate the accessibility of the temple, including factors such as parking facilities, pathways, and amenities like restrooms or places for devotees to sit and rest. Accessibility ensures a smooth and enjoyable visit for everyone.\n\n**9. Community Engagement:**\nExplore any community initiatives or events organized by the temple. Temples often play a vital role in community building, and events or outreach programs contribute to the temple's impact beyond its religious function.\n\n**10. Overall Impression:**\nSummarize your overall impression of the Shri Banke Bihari Ji Temple. Reflect on the emotional and spiritual impact, considering both the religious aspects and the general visitor experience.\n\nIn conclusion, the Shri Banke Bihari Ji Temple, with its spiritual aura, architectural grandeur, and cultural richness, offers a meaningful and enriching experience for devotees and visitors alike.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple of Banke Bihari ji is situated in the fort of Bharatpur which is very ancient, it has just been renovated, it is a very beautiful temple in which Banke Bihari ji is seated, there is a very beautiful statue, the environment here is very good, he lives in devotion.  it is a very beautiful temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple reminds of a single temple in a village where all the residents spend their leisure time and socialize. They have a small kids playground, elderly people sit and chat near the tree, overall just peaceful and crowd free place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is believed to have been established by Swami Haridas, a 16th-century saint and musician who was a devotee of Lord Krishna. Legend has it that Swami Haridas was visited by Lord Krishna in his dreams and was instructed to install an idol of Bankey Bihari in the temple. The temple was constructed in the year 1864 and has since become a popular pilgrimage site for devotees of Lord Krishna.\n\nThe temple is famous for its beautiful architecture and intricate carvings. The idol of Bankey Bihari, which is made of black stone, is believed to have been discovered in the Nidhivan area of Vrindavan, a holy city associated with Lord Krishna's life. The idol is considered to be very auspicious, and it is believed that those who visit the temple and offer prayers to Lord Krishna can attain blessings and fulfillment of their wishes.\n\nThe temple is open to visitors throughout the year, and it is especially crowded during festivals such as Holi, Janmashtami, and Radha Ashtami. The atmosphere inside the temple is very peaceful, and the devotees sing hymns and offer prayers to Lord Krishna. The temple is also surrounded by a bustling market area, where visitors can shop for souvenirs and traditional Rajasthani handicrafts.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "What an incredible building.\nFew temples are located in this complex.\nThe temple is the main one.\nIf you want to attend arti, go in the morning; otherwise, you won't be seen.\na good location to unwind",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bijli Ghar Chouraha",
      "rating": 4.2,
      "address": "6G83+366, Circular Rd, near power house, Patpara Mohalla, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "Bijli Ghar Chouraha is near Raja Man Singh circle and this place is entrace to main market of city Bharatpur and Nagar Nigam Bharatpur",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Bijli ghar chauraha is one of the gateway of market in bharatpur. It is central point of bharatpur where one side of it is the coat and opposite side is market .and another way is going  to government hospital RBM\n.the opposition of it is going to bird century bharatpur and Shashti park",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "You will find here  the buses for Mathura,Alwar, Aligarh, Deeng, Jaipur etc. But this bus stand is very dirty. Toilets and water facilities are very poor.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Just like all journeys have some starting point... similarly this is the starting point of the main market of Bharatpur city and this market keep on going at a stretch of 4-6 kms and where in you will find all kinds of shops fulfilling your needs and taste. Hope you have a great time visiting it.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nothing else it's just a circle",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Government Museum, Bharatpur",
      "rating": 4.2,
      "address": "6FCV+QM7, Lohagarh Fort, Gopalgarh, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "The Government Museum in Bharatpur is a cultural gem that offers visitors a captivating journey through the region's rich history and heritage. Here's a detailed review of my experience:\n\n1. Exhibits and Collections:\nThe museum boasts an impressive array of exhibits, showcasing artifacts from various periods. From ancient sculptures to intricate artworks, the collections provide a comprehensive overview of Bharatpur's cultural evolution. The well-curated displays offer insights into the art, lifestyle, and traditions of the region.\n\n2. Historical Significance:\nMany items in the museum hold significant historical value, allowing visitors to connect with the past. Whether it's artifacts from local rulers or archaeological discoveries, the museum effectively communicates the historical narrative of Bharatpur.\n\n3. Interpretation and Information:\nOne of the strengths of the museum is its commitment to education. Informational panels and multimedia presentations accompany exhibits, providing context and enriching the visitor's understanding. The clear and concise interpretation enhances the overall experience.\n\n4. Architecture and Ambiance:\nThe museum's physical space deserves commendation. Architectural nuances and thematic arrangements contribute to a pleasing and immersive environment. The layout is intuitive, guiding visitors through different eras and themes seamlessly.\n\n5. Maintenance and Conservation:\nPreservation efforts are evident throughout the museum. Proper lighting, temperature control, and conservation techniques ensure the longevity of the artifacts. This commitment to maintaining the collection's integrity is commendable.\n\n6. Visitor Experience:\nThe museum caters to a diverse audience, from history enthusiasts to casual visitors. Interactive elements, if available, enhance the engagement for all age groups. Visitor amenities such as seating areas, guided tours, and a souvenir shop further contribute to a positive experience.\n\n7. Accessibility and Facilities:\nThe museum's location and accessibility, including parking and public transportation options, significantly impact the overall convenience for visitors. Adequate facilities like restrooms and refreshment areas enhance the overall visit.\n\n8. Community Engagement:\nMuseums often play a crucial role in community engagement. It would be beneficial to explore any outreach programs, educational initiatives, or events organized by the museum to involve the local community.\n\nIn conclusion, the Government Museum in Bharatpur stands as a testament to the region's cultural richness. Its well-curated exhibits, educational approach, and commitment to conservation make it a must-visit for anyone interested in unraveling the historical tapestry of Bharatpur.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A museum is worth visiting, always and this one won't disappoint you too! Setup in the '40s and minutely being taken care of by the authorities. You can find the 19th Century artefacts, weapons etc and the details would take you back to history. The best part is each section is separated nicely, chisel work, miniature painting, weapons, pottery, lights etc.. stop by and read things for yourself as there is no guide better than that. Take a moment to admire what the king built and the influences..right from Persia to Western touch. I recommend you visit. There's parking outside and managed by the authorities here. There's an entry fee and this place is open till 8PM",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Only and Best place to visit in Bharatpur.\nMust visit this place with young kids and history lover's.\nA very well maintained and you know the history abt the local kings.. there weapons, life style, many more information you get on your visit.\nFew part of the museum is under renovation, it's really a worthy place for photography and for visit too.\nThere are one gallery which is divided into different sections and they kept history very well maintained.\n\"Only one thing is very bad not maintained i.e.washroom/restroom its in very poor condition.. no water, itss yakkk\"..",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "🎉 Welcome, adventure seekers!\nIf you happen to find yourself in the vibrant city of Bharatpur, hold onto your hats because I've got a gem of a recommendation for you! 🎩✨\n\n🏛️ Picture this: You stroll into a museum that's not just any museum; it's a treasure trove of royal wonders! As you step inside, you're greeted by the majestic sight of heroic cannons standing guard, ready to dazzle you with tales of yore. 💂‍♂️🏰\n\n🔍 Prepare to be whisked away on a journey through time as you feast your eyes on ancient utensils, statues from ages past, and artifacts fit for kings and queens! 🕰️🍴\n\n🌟 But wait, there's more! Head to the top of the building for a bird's-eye view of the entire city. And yes, you guessed it – selfie time! 📸 Don't forget to strike a pose and capture those priceless moments. Some areas are not allowed for Photography and Videography 🤳🌆\n\n💦 Oh, and let's not forget about the Hamam area – the bathing quarters fit for royalty! Get ready to immerse yourself in the opulence of yesteryears as you explore this majestic space. 🛁👑\n\n🏰 Located within the fortress walls (or as the locals say, \"kile ke andar\"), this museum is a must-visit destination for history buffs and selfie enthusiasts alike! 🗺️📸\n\n🚗 Now, let's talk logistics! If you're coming from the railway station, brace yourself for a mini-adventure. 🚂 Hold onto your rupees because finding a direct ride might be a bit tricky. But fear not! E-rickshaws to the rescue, whisking you away for a mere 20-30 rupees per person! 🛺💸\n\n🚌 And for all you bus stand explorers, fear not! An Auto Rickshaw 20-rupee ride to the Gol Chakkar, and you're halfway there! 🚌➡️🎯 Just hop onto another rickshaw or e-rickshaw for a smooth 10-rupee ride straight to the museum's doorstep! 🚲💨\n\nSo there you have it, folks! An adventure-packed day awaits at this royal marvel in Bharatpur. Get ready to make memories, snap selfies, and soak in the grandeur of days gone by! 🌟🏰✨",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The museum was quite good.\nIt is being renovated by the government.\nThey are preserving the heritage.\nThis museum showcase very old Sculptures & Statues.\n\nOld cloths & Swords are also present.\nThe Hamam of 15-16 century is also present.\n\nThe place is quite beautiful & Mesmerizing.\n\nYou can clearly think that how the king & queen of that time used to live here.\n\nIt was superb.\nThe museum is also maintained in perfect condition by the authorities.\n\nWe liked it.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Jaharveer Baba Ka Mandir",
      "rating": 4.2,
      "address": "Jaharveer Baba Mandir, Near, Kumher Gate Cir, Bajrangnagar Colony, U.I.T Colony, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "Its a temple good place situated near kumhar gate many devotees come and do their rituals go through pooja and get blessings from baba its a u importent mile stone in the history of lohaghad",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good temple.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Jahaveer Baba Mandir Is One Of The Rarest Tample In Town..",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Too old temple with no parking, easily approachable",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Balaji mandir",
      "rating": 5,
      "address": "6F8P+QP5, behind kotwali, Tara Mahendra Colony, Bharatpur, Rajasthan 321001, India",
      "reviews": [
        {
          "text": "Sonu",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "God",
          "languageCode": "en",
          "rating": 5
        }
      ]
    }
  ]
}