{
  "places_with_reviews": [
    {
      "name": "Chaurasi Temple",
      "rating": 4.8,
      "address": "CGVQ+232, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "Very calm atmosphere here. Must visit this temple. The Shivling in this temple is from ancient time.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most beautiful and oldest temple complex.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Recently, I had the opportunity to visit a magnificent temple during my travels, and it proved to be an enlightening experience. As I approached the temple grounds, a sense of peace and serenity enveloped me, setting the tone for what was to come.\n\nThe temple's architecture was a testament to the skill and devotion of the craftsmen who had built it. Intricate carvings adorned the walls, depicting tales of ancient mythology and spiritual significance. The grandeur of the temple was awe-inspiring, leaving me in awe of its beauty and historical significance.\n\nInside, I found myself immersed in a spiritual ambiance, as the scent of incense filled the air and soft chants reverberated through the halls. The tranquility was palpable, and I couldn't help but feel a deep sense of reverence and connectedness to something greater than myself.\n\nThe meticulously maintained surroundings provided a peaceful retreat, allowing visitors to meditate or simply soak in the spiritual energy that permeated the air.\n\nThe spiritual atmosphere, stunning architecture, and interactions with devotees created a memorable experience. I would highly recommend visiting this temple to anyone seeking solace, cultural immersion, and a deeper connection to spirituality.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I found the place almost randomly while doing All India Ride on my Himalayan.\nA beautiful place to ride for.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Chaurasi is a spacious level ground in center of Bharmour where the galaxy of temples mostly in the form of Shivlingas exists. The Chaurasi Temple Complex offers a delightful, clean and a scenic view. Another temple built in the same style is that of Lord Vishnu cast in his Narsimha avatar.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Bharmani Mata Temple",
      "rating": 4.8,
      "address": "CGHJ+3MP, Malkauta, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "First track of my life at Bharmani Mata temple. Got a leg pain,back pain but when i went in cold water after some time my body totally relaxed. Please visit at least one time in your life at Mata g Temple and Kailash peak too",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Bharmani Mata Temple is 6kms from bharmour. This temple is considered to be overlooking and guarding city of Bharmour. If you are going on Manimahesh yatra you should visit Bharmani Mata temple without visiting your journey will not be successful.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This temple is situated at 3 km from Bharmour, Distt Chamba, Himachal Pradesh. Taxi services are available from Bharmour to Bharmani Mata temple. Religious place. Highly recommended for all age people.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Bharmani temple top of the hill. We can go on local Jeep they will charge 50rs.pool bathing is nice experience. Cool weather. Before manimahesh yatra we have definatly bharmani Mata temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's an temple dedicated to goddess bharmani whom hindus celebrate on 2nd navratra located roughly 6.5km from bus stand bharmour (motorable road) and other route which is a 2.5km trek goes from villages malkouta and baari. As per locals without going to this temple if you go directly to manimahesh (kailash parvat) your pilgrimage is not considered successful . A must visit 👍",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Bharmour",
      "rating": 4.6,
      "address": "CGRP+94W, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "It's good, area covered with snow almost in  all directions, see apple 🍎🍏  and apricot trees fully loaded with fruit everywhere. Trekking experience is also good, but not gone far from hadsar waterfall. Overall one can spend 4  days here .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Osm place lord of shiva",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bharmour, nestled in the heart of Himachal Pradesh, is a place of enchanting beauty and cultural richness. My review of Bharmour would undoubtedly be filled with admiration for this offbeat gem in the Himalayas.\n\nFirst and foremost, Bharmour's natural surroundings are breathtaking. Surrounded by lush green valleys, snow-capped peaks, and pristine rivers, it's a paradise for nature enthusiasts and trekkers. The scenic beauty here is unparalleled, and every turn reveals a postcard-worthy view.\n\nOne of the standout features of Bharmour is its cultural significance. It's home to the famous Chaurasi Temple Complex, consisting of 84 ancient temples dedicated to various deities. This complex is not only a testament to the region's rich religious heritage but also an architectural marvel, with intricate stone carvings and sculptures.\n\nThe local culture and traditions in Bharmour are well-preserved and provide a unique glimpse into Himachal's indigenous way of life. The warm hospitality of the locals adds to the charm of this place, making visitors feel right at home.\n\nBharmour is also a gateway to some fantastic trekking routes, including the famous Manimahesh Yatra. The trek to Manimahesh Lake is not only a spiritual journey but also a thrilling adventure through pristine landscapes.\n\nWhile Bharmour may not have the commercial hustle and bustle of more touristy destinations, it offers something even more valuable – a tranquil escape into nature and spirituality. It's a place where time seems to slow down, allowing visitors to connect with both themselves and the breathtaking Himalayan environment.\n\nIn conclusion, Bharmour is a hidden treasure in Himachal Pradesh that promises an unforgettable experience for nature lovers, trekkers, and those seeking a deeper spiritual connection. If you're looking to escape the crowds and immerse yourself in the natural and cultural wonders of the Himalayas, Bharmour should be at the top of your list.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great place , devotional place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Roads are damage and it is challenging to be here. But views and landscape are awesome.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Gaurikund",
      "rating": 4.5,
      "address": "CHXJ+H82, Manimahesh Rd, Paranghala, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "Great place to take a breathe on the way to hadsar",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful and peaceful place.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "धर्मराज मंदिर",
      "rating": 4.7,
      "address": "CGVP+4XX, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "Like there is only one Temple of God Bharmha ji similarly this the only Temple of „Dharmraj“",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "84 temple 🛕 bharmour chamba district\nVery butifull place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dharmraj or Yamraj Temple also known as A Dharmeshwar Mahadev in Chourasi Temple Complex Bharmour. One room inside this temple is dedicated to Chitragupta, who  is considered the secretary of Yamraj . Every soul is first brought to this place before proceeding it's journey further. Many people not entered in the temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "According to the Vishnu Purana, Yama is the son of sun-god Surya[4] and Sandhya, the daughter of Vishvakarma. Yama is the brother of Sraddhadeva Manu and of his older sister Yami, which Horace Hayman Wilson indicates to mean the Yamuna.[5] According to the Vedas, Yama is said to have been the first mortal who died. By virtue of precedence, he became the ruler of the departed,[6] and is called \"Lord of the Pitrs\".[7]\n\nMentioned in the Pāli Canon of Theravada Buddhism, Yama subsequently entered Buddhist mythology in East Asia, Southeast Asia and Sri Lanka as a Dharmapala under various transliterations. He is otherwise also called as \"Dharmaraja\".",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "only one temple in All world",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bharmour Shri Lakshana Devi Temple (Oldest Wooden Temple In India) - Chamba District, Himachal Pradesh, India",
      "rating": 4.5,
      "address": "CGRP+WXC, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "The Lakshana Devi Temple in Bharmour is a post-Gupta era Hindu temple in Himachal Pradesh dedicated to Durga in her Mahishasura-mardini form. It is dated to the second half of the 7th-century, and is in part one of the oldest surviving wooden temples in India",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful carving wooden work in Temple. Temple located in 84 Temple campus Bharmour District Chamba.Temple very oldest and well Maintained.Must visit with your family and friends.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Osm",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lakhna Devi Temple also known as Lakhna Devi Temple, Chaurasi Temple is the oldest temple of Bharmour. It retains many of the old architectural features of the wooden temples. It was built by King Maru Varman (650 AD). The other temples of Chaurasi are of later date. The temple is built on a rectangular plan. As seen from the outside, it looks like a modest hut with walls of rubble and mud. The roof of this temple is sloping from the central ridge and is clad with slates. However, the main entrance of the temple, the square pillar (Shakti Stambha) and the roof are old.\n\nLakshana devi temple also called Lakhna Devi temple is the oldest temple at Chaurasi Temple Bharmour. It retains many of the old architectural features of wooden temples. It is said to be constructed by Raja Maru Varman (650 AD). Other temples of Chaurasi are of later date. The temple is built on the rectangular plan. As seen from outside it looks like a modest hut having shabby and mud walls. The roof of this temple slides sideways from the central ridge and is thatched with slates. However the main gateway of the temple, square columns (Shakti Stambha) and ceiling are old.",
          "languageCode": "en-US",
          "rating": 4.5
        },
        {
          "text": "Jai maa lakhna",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "शिव मंदिर भारमौर",
      "rating": 4.8,
      "address": "CGVQ+22R, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "Beautiful tallest and oldest Temple in 84 temple campus Bharmour district Chamba Himachal Pradesh India. Temple dedicated to Lord Shiva built by Raja Sahil  Varman in Shikhara style. . Shiv Mandir also known Mani Mahesh Mandir Bharmour.Must visit with your family and friends.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful temple of Lord Shiva",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Har Har mahadev.. Darshan of Shiva Linga",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "My innocent citizens can be found here",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Hidden Falls Bharmour",
      "rating": 4.7,
      "address": "CHR6+WJM, R.F.Khund, Himachal Pradesh 176315, India",
      "reviews": []
    },
    {
      "name": "Bharmour Himachal Pradesh",
      "rating": 5,
      "address": "CGRM+653, Bharmour, Himachal Pradesh 176315, India",
      "reviews": [
        {
          "text": "Good 👍 👍",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Galu mata mandir rajor",
      "rating": "Unknown",
      "address": "CHP5+QGJ, Rajaur, Himachal Pradesh 176315, India",
      "reviews": []
    }
  ]
}