{
  "places_with_reviews": [
    {
      "name": "BAPS Shri Swaminarayan Mandir",
      "rating": 4.6,
      "address": "NH 8, Satyam Twp, Zadeshwar, Bharuch, Gujarat 392011, India",
      "reviews": [
        {
          "text": "Swaminarayan Baps temple in Bharuch was a calming place, surrounded by peaceful scenery and spacious gardens that brought immense calmness. The architecture was truly remarkable, and the uplifting atmosphere made the visit truly unforgettable. It was definitely a highlight of my time in Bharuch.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple is located right beside the highway. Very calm and peaceful. Not that crowded when compared to other temples. Beautiful architecture like all other temples. Closes at 8pm. There is also a dining room inside.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a nice place to pray and a peaceful place The mood is automatically changed when you visit this place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is very beautiful temple with beautiful architecture.The temple have with some stunning carved pillars, magificent architecture and delightful idols. It is one of the significant attraction for visitors to Bharuch.There's lot of space available for parking to all type of vehicles.Very well maintained and beautiful garden.You enter the temple and you can feel the positive vibes.A complete temple where you can pray,stay,learn,pratice all the teachings.The area cool air and pleasant atmosphere.Best place to demonstrate your stress.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "beutiful and divine place with larger outer garden area where you can sit and enjoy the evening while taking blessings",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shirdi Sai Baba Temple",
      "rating": 4.6,
      "address": "P29H+3XG, Ramvatika Society, Zadeshwar, Bharuch, Gujarat 392012, India",
      "reviews": [
        {
          "text": "Divine place. Do make online booking\nFor Darshan and rooms. We stayed in Sai Bhakta Niwas. The rooms were neat and clean. Also the rooms are available from any time you  choose up-to 11 am and also the cost is very affordable.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A really good and peaceful place for worshipping God. The track around the dried lake is amazing for walking and jogging in the morning and the evening. I go there everyday and thought I could review it. Even if you are not going there to worship but you can walk around the lake. Peace and spiritual and beautiful!!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sitting arrangement made around temple is in very large numbers...  Also have round track nearby to walk, run...\nBut need to improve lighting in walk area..  Location is best to spend time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A devine place for sai baba followers. Sradha saburi. A nearby walk round available for morning and evening walk. A very peacefull place for spare your free hours. Benches available for sitting.   In the evening time is best for group meeting and share your thoughts. A near by library available for reading books.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Hi Guys,\nI love the vibe of temple. This temple is so beautiful and we'll maintained.this place is so peaceful. There is seating arrangement outside side the temple. People do gossips there. One  more thing,There is a running track besides the temple, people usually go for a walk and run there. Only thing that I don't like is there isn't a Prasad's Shop.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Nilkantheshwar Temple",
      "rating": 4.6,
      "address": "P29W+R76, Zadeshwar Rd, Ganesh Shrishti, Vadadla, Bharuch, Gujarat 392011, India",
      "reviews": [
        {
          "text": "A nice calm place. An ancient temple on the banks of river Narmada. Surrounded by lushness, there are 3 temples, the central temple of Nilkanteshwar Mahadev, a Hanuman temple right opposite that. And another Shiva temple a few steps ahead from there. And one can go to the banks of the river.\n\nEvenings are beautiful and scenic with nice views of sunset and the new cable stayed bridge.\n\nA nice place for some quality calm family time.\n\nArti time is must visit. Premises Close at 8:30. Post arti",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neelkanth Mahadev Mandir in Bharuch is a revered Hindu temple dedicated to Lord Shiva, attracting devotees and tourists alike with its spiritual ambiance and architectural grandeur. The temple's location on the banks of the Narmada River adds to its scenic beauty, providing a serene and tranquil environment for visitors seeking solace and divine blessings.\n\nThe temple's architecture is a blend of traditional Gujarati and Rajasthani styles, characterized by intricate carvings, colorful motifs, and majestic domes. The sanctum sanctorum houses a magnificent idol of Lord Shiva, attracting devotees who come to offer prayers and seek blessings. The temple complex also includes other shrines dedicated to various deities, contributing to its religious significance.\n\nApart from its religious importance, Neelkanth Mahadev Mandir is also a popular tourist attraction due to its historical and cultural significance. Visitors can explore the temple complex, witness traditional rituals and ceremonies, and soak in the spiritual atmosphere that pervades the surroundings. Overall, Neelkanth Mahadev Mandir in Bharuch is a must-visit destination for those interested in spirituality, history, and architectural marvels.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neelkantheshwar Mahadev’s temple situated on the banks of river Narmada is center of attraction (devotion ) for people living in Bharuch. All wall of temple is decorated with small shivling which is very nice. Many monkeys in the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very scenic temple at Narmada river bank.\n100 people can sit easily at a nearby temple. The river bank is very near.\nTemple walls have hundreds of shivlingas.\nYou can witness evening Aarti at 6Pm.\nThere are many rooms near the Temple for People doing Narmada Parikrama.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nilkanth Mahadev temple is the heart of Bharuch city. One of the oldest temples. Narmada river is next to the mandir.\n\nA very calm and clear atmosphere is around. Hanuman temple is also in the mandir area.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Narmada bridge",
      "rating": 4.6,
      "address": "Narmada River Rd, P27V+QW5, NH 48, Gujarat 392011, India",
      "reviews": [
        {
          "text": "Very nice moments during sunrise at Narmada bridge.... Proud feel..... Just cleaning required..... At walking path.... I requested to all citizens that try to avoid throw unwanted material like polythene etc. i suggested that 4 and 5 dustbin drum kept at the walking path area.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🌉  A Majestic Marvel Connecting Cultures! 🌉\n\nSituated in the heart of Ankleshwar, the Narmada Bridge is a symbol of architectural grandeur and a vital link uniting communities. 🌐\n\n🚗 Ease of Commute:\nThe bridge serves as a crucial transportation route, facilitating smooth connectivity between the regions on either side of the Narmada River. Its strategic location makes it a lifeline for commuters, ensuring efficient travel. 🚗🌁\n\n🌊 River Panorama:\nAs you traverse the bridge, you're treated to a breathtaking panorama of the Narmada River. The flowing waters beneath create a serene and picturesque view, especially during sunrise and sunset. 🌅🌊\n\n🌆 Cityscape Views:\nFrom the vantage point of the bridge, the cityscape unfolds in all its glory. The bustling city of Ankleshwar, with its blend of modernity and tradition, stretches out on both sides, offering a dynamic visual spectacle. 🏙️🌆\n\n🌉 Architectural Charm:\nThe architecture of the Narmada Bridge is both functional and aesthetically pleasing. The sturdy design ensures the seamless flow of vehicular traffic, while the graceful arches and railings add an element of elegance to the structure. 🏗️🌈\n\n🌳 Scenic Surroundings:\nSurrounded by lush greenery on the banks, the bridge provides a refreshing and calming environment. The well-maintained flora enhances the overall ambiance, making it an inviting space for a leisurely stroll or a peaceful moment of reflection. 🍃🌳\n\n🌇 Sunset Spectacle:\nThe Narmada Bridge transforms into a canvas of colors during sunset. The hues of orange, pink, and purple paint the sky, creating a mesmerizing backdrop against the silhouette of the bridge. It's a sight that captivates locals and visitors alike. 🌅🎨\n\n👣 Pedestrian Path:\nFor those seeking a closer experience with the surroundings, the bridge offers a pedestrian path. Walking across allows individuals to absorb the beauty at a leisurely pace, fostering a deeper connection with the scenic expanse. 🚶‍♂️🚶‍♀️\n\n🌟 Night Illumination:\nAs night falls, the Narmada Bridge is gracefully illuminated, casting a radiant glow. The play of lights not only enhances its visual appeal but also contributes to the city's vibrant nightscape. 💫✨\n\nIn essence, the Narmada Bridge is more than a means of transport; it's a cultural conduit and a visual delight that harmoniously blends functionality with aesthetics. Whether for a daily commute or a leisurely evening stroll, the bridge stands as a testament to Ankleshwar's progress and unity. 🌉🤝🌍\n\n#NarmadaBridge #Ankleshwar #CulturalHeritage #ArchitecturalMarvel #CityscapeView",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beutiful view visit at 7:34 pm under the cable bridge and enjoy the sound of Narmada river and capturing pictures",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a very good view' of bridge on Bank of narmda river",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bridge is newly built up for one way connecting Bharuch Toll Tax to Bharuch city.\nMany years expensed behind its built up.\nBefore there was too much traffic\nAnd it was believed as the highest traffic area on Bombay-Ahmedabad national highway\nDue to this bridge traffic problem has been rectified automatically upto maxmum level.\nAnd therefore one can cross this way easily within less time.\nIts road is very nice because no bumpy at all.\nAt night whole bridge is lightened with colorful lights.\nIt has become the place of attraction and visit for public.\nBridge is too much clean.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Narmada Park",
      "rating": 4.1,
      "address": "P29V+QMQ, Sardar Bridge, Ganesh Shrishti, Vadadla, Bharuch, Gujarat 392011, India",
      "reviews": [
        {
          "text": "This park is now closed from 1st Feb, 2024.\nDon't know until when.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good park for kidz, In monsoon full park cover with greeney looking more osm.\nYou can see the beauty of Narmada River. Park having one small play area for kidz up to 10year. Sliders are their may be taken from some old Water Park.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nothing special here for now. As the way to river is blocked currently. A lot of couples were there. Sometimes its a little uncomfortable. Other than that it was okay. Good for kids. Playground is also good. Ample parking space. Entry fee is currently 10 per person. Parking is free",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good Park to go with children\nFree parking\nEntry fees 10 rs for 7years above all\nTiming until 8 in the evening\nNeeds public awareness for housekeeping and cleanliness\nPlay area is good but many rides needs maintenance\nThere is one small waste water trench going , needs proper safety on that bridge.\nSecurity is keeping an eye on everything.\nPark needs proper maintenance.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Narmada Park is a good place to visit during early morning or during sunset. Park is situated on the bank of river Narmada. Garden also have small adventure section for kids. You can visit this place with family or friends. You will get to see a mesmerizing view of wire bridge. Besides park there is also Nilkantheshwar Temple. Boating facilities are available on river bank with nominal charges. Only thing I felt bothered was safety at the bank, as it is completely open to river. Overall I had a good experience, hope same for others.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Somnath Mahadev Mandir",
      "rating": 4.5,
      "address": "P2F8+878, Narayan Kunj Vihar Society, Bholav, Bharuch, Gujarat 392012, India",
      "reviews": [
        {
          "text": "Awesome place 🔱💗🤟",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice 🙂",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Most special moments of my life",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good direction and nice please and shiv ji temple best in bharta",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Dehgam chowkdi",
      "rating": 4.3,
      "address": "Dehgam chowkdi, MXR3+XVM, nr. M. P. S, bhajjuwala society, Bharuch, Gujarat 392012, India",
      "reviews": [
        {
          "text": "It is a stop for more then dahej company's worker and employees to take a bus but there is a need to one standing station for a waiting are vehicle",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Busy area during morning 7 to 9 am and evening 6 to 7 pm",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place to connect Bharuch with other Side of State.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Road very  poor condition big digs on road",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Candy Beach bharuch",
      "rating": 4.2,
      "address": "MXFG+GWV, Borbhatha, Gujarat 393002, India",
      "reviews": [
        {
          "text": "Are you nature lover???\nIf yes then must go.....\nIf no go once...you will become nature lover surely.\n\nThe view of maa narmada...amazing🙏",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Spectacular place for dusk and dawn to enjoy sunrise and sunset.\nGood destination for fitness lovers as from Bharuchi Naka it is approximately 5 km so after long walk you are rewarded with great scenarios.\nMust visit place for peace lovers and nature lovers as there is almost no crowd.\nFor short walk you can park your vehicle at SVEM school and can walk up to beach.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Best place i have ever been to  👍\nPeaceful place, cleanliness 👍\nIt feels like small marine drive of mumbai",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Did a cycling ride early in the morning, had an wonderful experience",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "You can say..it is \"Dhokha\" Beach... nothing is there...might be recent flood has washed out every thing... extremely disappointed after driving more than 100+ km.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Kabir vad",
      "rating": 4.1,
      "address": "PX4W+385, Moficer Jin Compound, Bharuch, Gujarat 392001, India",
      "reviews": [
        {
          "text": "Waiting for boat is too much.. otherwise good.. don't go at afternoon.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Not Good Experience Boat rate Is High",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Malikarjun mahadev Shiv Mandir",
      "rating": 4.7,
      "address": "near mangal teerth society gate, PXCM+GC9, Dahej Bypass Rd, Bharuch, Gujarat 392001, India",
      "reviews": [
        {
          "text": "The ambience of the temple is very spiritual. There is a lot of open space available inside the temple wall.\nI would personally recommend to visit this place everyday without fail.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Malikarjun mahadev temple\nOn main road\nSiva temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Mallikarjun Mahadev good temple near to road. Har... Har... Mahadev.",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    }
  ]
}