{
  "places_with_reviews": [
    {
      "name": "Alvekodi Sea Walk ಅಳ್ವೆ ದಂಡೇ",
      "rating": 4.8,
      "address": "2FGW+WF, Bhatkal, Karnataka 581354, India",
      "reviews": [
        {
          "text": "Amazing place to watch sunset. Calm and Beautiful surroundings, I love this place ❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Breathtaking !!\n\nAwesome especially when high tides 😁\nThere's one more similar sea walk in Malpe but that is more crowded and almost there were none when I visit ted except local few small kids.\n\nOff beat place across the Karnataka costal line, We can witness the might sea streght and anything man made is just a pack of cards in front of the dreadness of sea 😅 definitely faint hearted people will dare to go till end with heavy wind.\n\nBest suited for travellers who evjoys thrilling.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's a nice beach to sit and relax and enjoy sound and dance of tides. Not for getting into water.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Loved the place, not too far from Murudeshwar. It's a calm place where you probably wouldn't find any other tourists. You can see the river merging in the Arabian Sea (Indian Ocean) which is a spectacular sight. The place is kept clean and as there are barricades at the start of the sea walk, no vehicle can enter so you have to walk to the end.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the best points to witness the sunset...\nNear by murdehswar around 7.5 Km.\n\nThe best time to walk in is around 5 pm..enjoy a pleasant sunset, waves sound and birds whisper.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sri Chitrapur Math",
      "rating": 4.7,
      "address": "near chitrapur railway station, 2GJP+F27, Edapally - Panvel Hwy, Karnataka 581354, India",
      "reviews": [
        {
          "text": "The Gaud Sarswat math at Chitrapur is very old at about 400 years . This Brahmin community first was at Kashmir , then shifted to Goa then to Maharastra and lately at Karnataka.\nWell maintained and peaceful math. All traditional Puja are performed daily . They are descendants of seven Rishis. Entrance mainly for those families of descendants.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very welcome people... although they dont have facility to stay... But you can visit for darshan ❤️✨its calm and beautiful",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amgelo Mathu...\n\nThis math belongs to Chitrapur Saraswat Brahmins.. Lord Bhavani Shankar is the chief deity ..\n\nThe current building of the Math was constructed during the times of Param Shrīmat Pandurangashram Swamiji. Aptly named as \"Krishnashram Prasad\" as a dedication to His Guru.\n\nShrimad Sadyojat Shankarashram Swamiji is the Present Peethadhipati of Math",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It seems more famous as a local marriage hall rather than any historical importance.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We belong to Shri Chitrapur Math. It is our holy place cum home.  If you go there one feel like going his own house. Our swamiji stays there. HE is very learned and has done lot of sadhana. He guides us in all spheres of our life and helps us attaining spirituality. He is spiritual head and welcomes all with love and affection. The main point is HE never indulges in any others activity like politics or anything like other so called Swamiji's who are trying to influence their own candidates in political fields. Our swamiji who belongs to this Math is a guiding force behind our Sanatan dharma and teaches us to respect all dharmas with equal note. Shri Chitrapur Math has a rich heritage and history of more than 350 years.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kannegundi Falls",
      "rating": 4.5,
      "address": "2H6C+QP5 Belalkhanda Rood, Kadasalagadde Rood, Bhatkal, Karnataka 581320, India",
      "reviews": [
        {
          "text": "This waterfalls is small but very beautiful. Located inside a farm. Need to trek for 5 mins to reach the falls. Once you are about to reach can see the small parking spot, right beside the trekking path can be visible.\nVisit on weekdays.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Little risk to go as it is slippery anyways the falls is amazing and their u can experience a natural pedicure it's amazing feeling.. there is no ticket to visit this waterfall",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful location and there is a free fish spawn 😁❤️ I request to all you guys pls don't spoil this place 🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The waterfall is small but very beautiful, but it is very difficult to find the road to get inside the forest.  The traffic of snakes around the waterfall is high, the distance of this waterfall from Bhatkal bus depot is seven kilometers, an auto will take 150 rupees.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Calm and peaceful place. Good place to enjoy for a group of people. Note that this is a small waterfall, with no entry tickets, no washrooms and no changing rooms around. Water is clean, not that deep, good for a swim. Easily reachable by walk - like 5 minutes. No Trek needed.\nNo alloted parking space, 4 wheelers can park near the school I guess(we did that - it was Sunday), 2 wheelers can go a little ahead.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kadavinakatte Dam",
      "rating": 4.5,
      "address": "Kadavinakatte Cross, Sagar Road, Kargedde, Bhatkal, Karnataka 581354, India",
      "reviews": [
        {
          "text": "One of the coolest place in bhatkal.. there is a beautiful fishing spot near  the dam where we can sit and enjoy the peaceful nature..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a very quiet place.  Some tourists come and deposit plastic here.  How can you waste such a beautiful place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The is an awesome place to visit.\nLocated 3kms away from Bhatkal.\nIt's a dam where you can have a walk on the borders of the dam from end to end when the water is low.\nThe nature and greenery is at it's best.\nThe place is quite inner but the road is quite good but small but a car can easily reach till the dam.\nThe place is calm silent and a bit clean.\nThere is no ticket to visit it's free.\nThere is no shops of any kind.\nYou can have a feel of the fresh water of the dam and enjoy the nature and it's beauty.\nDon't miss to visit if you are anywhere near the place.\nBecause you will miss to see the heaven.\n*Do carry water bottles because you won't get anything there.\n*Swimming is strictly prohibited.\n*Be careful and self aware.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "My first visit to this place after the first rain. Great place to see, very dangerous during rains to walk on the dam. There is no security and safety grills.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place for visiting with family and friends and beautiful scenery surrounded by lush greenary and cool environment",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Sodigadde Mahasati temple Belke",
      "rating": 4.8,
      "address": "XH28+R9W, Hadin, Karnataka 581320, India",
      "reviews": [
        {
          "text": "Very good place to visit powerful temple in uttar kannada every year visited on this place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Such a powerful place .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A shakthi temple. Annual festival every year January 23 to 31.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best place .you can see how Amma is going to give prasada.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Never suppress Suppressing  My Birth\nShaktidekathaaaaaaa our wish sure come true,,,,,,,   Bedkolooo,,,,,,,,,. ...",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sri Maha Ganapathy Mahamaya Temple",
      "rating": 4.9,
      "address": "2GJF+P77, D.T. Rd, Shirali, Karnataka 581354, India",
      "reviews": [
        {
          "text": "My visit was during Chauti palki utsav.. had divine darshan of god.. blessed..\n\non Astami and navami there will be teru followed by Palki utsav in night...\n\nKulavis from everywhere gather for this special occasion and get blessings.. they organise functions in great way.. Totally great experience...",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This place of Hindu worship is a beautiful ancient temple promoted by certain families of the Gaud Saraswat Bhraman community & the Chitrapur Shirali residents. We had the privilege of visiting this place to attend a pooja with our family friend P. Kamath who's kuldev is the Ganapati & Mahamayi devi. Legend has it that the original idols of the temple were from Marcel in Goa, however during the Portuguese conquest & conversions 400 years ago, a group of the konkani speaking GSB community fled with their clan diety across the borders & settled in the Chitrapur Shirali belt placing their Gods & faith in this land.\nThe temple is located just few metres right off the National Highway heading towards Mangalore from Honnavar.\nThe architecture of the temple is similar to the Dravidian temples in the coastal belt. The wall art is filled with Kaavi art (red & cream drawings) unique to GSB temples, motifs from Hindu mythology.\nSome priest families live around the temple sanctorum. The idols are heavily decorated with flowers of various colours & lamps. It is a vision to watch by.\nPost a Pooja, there is always a prasadam naivedya vegetarian lunch cooked in the temple kitchen, served on banana leaf. We had the good fortune of partaking the meal during our visit & it was extremely delicious.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "🙏🏻Jai Shri Mahaganapati Mahamaya Namaha🙏🏻\nMy most favourite temple and divine place.\nMiddle of shirali Town, bhatakal tq Uttar kannada District. Surrounded by beautiful nature.\nThis is The Hindu temple, Kuladevata of Goud Saraswat Bramhin(GSB) there is Trikal Pooja held everyday, There is Anna santarpana also provided to Devotees.\nThere is Car festival grandly celebrate  Every year.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Cool, calm, clean, serene and laid back Shirali town temple, just off the highway with the twin deities of Mahamaya ( Parvati) and Lord Ganesha. Poojas can be performed as per your wish. People also use this location for auspicious ocassions like Brahmupadesha ( Thread ceremony) and weddings .",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Old beautiful temple. Devotional place .do visit u get peace of mind",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Shri Durgaa Parameshwari Temple (Alvekodi)",
      "rating": 4.8,
      "address": "2GH3+P4J, Alvekodi, Bhatkal, Karnataka 581354, India",
      "reviews": [
        {
          "text": "The spiritual ambiance, coupled with the intricate architecture, created a serene environment that instilled a sense of peace. The rituals were conducted with devotion, adding a cultural richness to the visit. The well-maintained premises and the friendly community enhanced the overall positive atmosphere, making it a spiritually enriching journey",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "serene atmosphere..\nP.S. Visited on auspicious day of Akshaya trutiya for divine blessings..\nYakshagana will be performed during special occasions..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice  nature and good  culture 🙏🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very beautiful temple. Happy to see Durga devi.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's Nice place and near by sea walk is there, It's awesome experience...",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Bhatkala Lighthouse",
      "rating": 4.6,
      "address": "Near Port, XG8M+G65, Mavakurve, Bhatkal, Karnataka 581320, India",
      "reviews": [
        {
          "text": "Lovely place to visit for education purposes. Nominal entry fees of rs 10 per head.\nThe steep and narrow concretized road of small lenght only of around 150 metres leads to the gate of the light house compound. It should be driven carefully or better leave the vehicle at the bottom and climb the hill by foot.\nThe view from the top of the lighthouse is mesmerizing and memorable.\nSlides and seesaws for children are being installed in the lighthouse compound.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Besides being a functional light house complex, the views are phenomenal. The lighthouse is located at the end of the hillock and offers a panoramic view of the fishing port of Bhatkal  and beyond.  The ocean front is right at the edge of the lighthouse and is a perfect spot to spend some quite time enjoying the sound of the sea, the lashing waves and just natural vegetation.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bhatkal Lighthouse is Located near Bhatkal Port from 5 kilometres away from the local market place, entrusted to provide Navigation Aids to Mariners in the coastal Karnataka and also a major establishment for coastal security. The Lighthouse Situated on a hilltop provides a beautiful panoramic view of surrounding beaches and fishing port. The mesmerizing scenic beauty is something people will not forget easily.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place , you get a beautiful view of the beach on two sides , and the binder on the other side, the small place has a temple on one side of the lighthouse and a small memorial cross commemorating the arrival of St Francis Xavier at Bhatkal port in the fifteenth century. Though people have littered the place , it’s a worthy place to visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful scenic spot that gives a view of the bays/estuaries surrounding Bhatkal. There seems to be water bodies from three sides and the landmass - Port in between. You can see colourful boats lined up, big container boxes stacked, and some boats going to and fro from the port here. The view is breathtaking, and the climb to the lighthouse is as well. Must do activity if you're in Bhatkal",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tiger Falls",
      "rating": 4.5,
      "address": "XH52+Q7P, Bastigalamigte, Karnataka 581320, India",
      "reviews": [
        {
          "text": "I have visited this place 3-4 times and enjoyed each and every visit. Best place to spend time with friends. The scenery and greenery is awesome. The road till the Mundalli church is good but after that the road is not in good condition up to the falls. The road after Mundalli church is not suitable for cars. Travelling to falls after the halfway you will get off raid biking experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "There is no falls. The falls get created temporarily when there is heavy rainfall that's all. But the landscape is nice.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Never visit this Waterfalls in unseason! There are just few drops of water when I visited. Go there if there were heavy rains in past 2 or 3 days before your plan.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its not actually falls...in the rainy season water will flow from rock and falls from height. It's good  but only in the rainy season",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the hidden water falls of the monsoon",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Nastaar Beach",
      "rating": 4.3,
      "address": "XG6R+V65, Bhatkal, Karnataka 581320, India",
      "reviews": [
        {
          "text": "The best beach Side for evening outing\nDelicious homemade foods available at local canteen with reasonable price # Habeeb & Taj Cafeteria",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "They’ve put tiny food stalls which makes the visit better. They should bring more such pop ups or activities to make it more enjoyable as fun.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I regularly visit this place for relaxing on Sundays at beach side with my family.... We also have beach side dinner in night. Without any fear...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful view at nastar beach bhatkal\nVisit there with your Family and enjoy sun set♥️",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "No public. I couldn't even see a single sea shell. Guess they too know it's a wasteland rather a beach",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}