{
  "places_with_reviews": [
    {
      "name": "Palani Aandavar Temple, Bhavani",
      "rating": 4.5,
      "address": "CMVM+636, Palanipuram, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "Great place to enlighten and get inspired by lord Muruga is Palani . Lot of Murugan temple is located in Tamil Nadu . Place near to Coimbatore, Salam, Erode , Darapuram, Thirupoor , Pollachi and Udumalai is sure Palani temple .\n\nMust visit for Lord Murugan devotees. Om Muruga , Om Muruga 🙏🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Always a mind relaxing experience. Pure bliss to stay at Palani and take an evening walk to the Temple through its crowd. It might be difficult to take the hundreds of steps and reach atop, but the view, the lord, and spiritual enlightenment the peak holds is an out of words experience. Better reach the place by afternoon and start the climb at 3pm itself, so even if it is a crowded day, within the same day one can reach the top in less than 2 hours. For elderly or physical challenged people the temple offers rope car as well as winch train services. There will be two queues starting from the footwear storage room for the winch train. Less expensive queue will take more time only because every next train will not board people from this line, but the other queue will move fast taking people on all consecutive trains. Palani crowd is lovely, but watch your surroundings and be safe, keep alert about your belongings and especially keep an eye on your children.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The real mystery is here on the Idol. The powerful ancient Navapashanam Murugan Statue. Nine Poisonous proportions is giving the medicinal and positive vibes and more and more energy to the world.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple on top ofna hill which is having a view. We have multiple queue options like dharma darsan whichbis free queue and 10 Rupees queue 100 Rupees queue etc. The very first queue on the front of the temple is the 10 Rupees queue. Most ofnthe people get into this queue without knowing ans this makesnthis queue a long one. Its always best to chedk how long is the free queue first and select the queue. Free queue will be on the right side of the temple or from the back. It depends on the rush. Info: Thanka Radham will be happening at 7 pm.\nNo hotels or restaurents on top. But has toilets on top and on the way.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Is there any review needed for this !!!!!\nNever ever — One of famous temple in TamilNadu and World famous Murugan Temple which is located in Palani. We can only reach the temple via Rope car, Winch or by Walk. There is no road facility to uphill.\nBy Walk is having 2 routes one is normal steps and another is yaanai thadam which Wil be kind of easy one compared to steps.\nIt Wil take max 20 mins by this way.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Bhavani Sangameshvarar Temple",
      "rating": 4.7,
      "address": "CMPM+25F, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "Been there during the early hours to worship Lord Shiva who resides majestically on peaceful shores of the riverbanks of 3 rivers. The sculptures tells great stores of the craftsmanship and tales of a British collector who had a divine encounter with the goddess. I hope people flocking to this place for various rituals keep this place clean and temple management ensures they preserve this wonderful place of worship with utmost cleanliness especially on the banks of the river.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "What an experience one can have at this magnificent temple . The huge Gopuram welcoming you , the Perumal residing inside a shiva temple, three rivers coming together at this place clear water flowing amidst huge stones and boulders. Temple must be very old one. Here shiva abd oaravathi are named as Sangameswarar and Thayar is called Vedanayagi. Perumal is named as Adikesava Perumal and Thayar soundaravalli. Sculpturer have done an astonishing job on white stones and granites . Three rivers coming together here are Cauvery, Bhavani and invisible Amritanadhi. Sitting in tree shade and watching the river water flowing by is a serene experience . Don’t buy food packets to give to beggars as they say it is doing good, but once you turn back the same packet comes to the shop & money exchanged. I got duped .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The beautiful temple, the main deity is lord Shiva as Sangameshwarar and Vedhanayagi amman. We also see a lord Narayanan and goddesses Lakshmi in this temple. The birds sounds are natural treat to your ears in the evening time on this river side temple... You can meditate and cultivate your inner peace here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Bhavani Sangameshwara Swamy Temple is not merely a place for darshan; it provides a sacred space for Saradha Karmas, fostering a deeper spiritual connection. The temple stands as a significant site where numerous devotees find solace and fulfillment of their desires. The belief in attaining moksha at this divine location adds a profound dimension to the spiritual experience.\n\nThe temple's atmosphere resonates with a sense of devotion, making it a destination where visitors can not only witness the divine but actively participate in sacred rituals. It serves as a spiritual haven, allowing devotees to seek both worldly blessings and the ultimate goal of moksha. Overall, Bhavani Sangameshwara Swamy Temple holds a unique and revered place for those on a spiritual journey.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Om namah shivaya 🙏. One of the Paadal Petra Sthalam (Praised by Nayanmars). Located at Bank of Kaveri River and Bhavani River (Both rivers are confluence in this location). Located very near to temple bus stop (Walkable distance only). Main deity of this temple is Lord Shiva. Frequent city and Mofussil buses available from Erode which is nearest city from the temple. You can reach from Bhavani Byepass Stop to this temple through city buses whic is available at the same location.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kalingarayan Anicut, Erode",
      "rating": 4.3,
      "address": "Kalingarayanpalayam, Bhavani, Tamil Nadu 638316, India",
      "reviews": [
        {
          "text": "Good Place to Visit & Spends time with family",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Must visit its a beautifull waterfalls\n📍Visited in January 2023\n⛔️But entry through main gate is prohibited\nBut still we can reach in another way\n\n👉Search nearest temple uthandarayan and follow the maps to reach the place.\n⛔️preferred for bike only\n\nSuch a beautifull view of Dam",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is one of my best spot in bhavani",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best place to visit. Water flow is very good when rainy season. Must visit. Hidden gem in erode(bhavani).",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "There are so many plastics. Since it is a tourist place, it should have been kept cleaner",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "T N R & Company",
      "rating": 4.4,
      "address": "47, koodudurai main road, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "I visited here as for tour and had good views of seeing the river flow, as you can see I posted two pics of alternate days, so can't expect when the flow will be high or low but careful. You can even visit temples of shiva, Ganapati, and many are there......",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Auspicious place to pray for beloved ones after life. Bhavani and cauvery river exact place of joining, so it became auspicious for all poojas and other activities.\n\nPeople usually go there and do bath and leave clothes in river itself. Because of that, I am seeing lot of pollution. Government or temple management can take decision to control it by collecting clothes in one place instead of throwing in river.\n\nMost I important thing, ladies can comfortably take bath in river, there is a government provided dressing rooms available. So they can comfortably change clothes there.\n\nHeavy crowd so can't take pictures in phone. Car and bike parking there with reasonable price. Park maintain is okay.\n\nLast time I visited here for my dad thithiy it's payable and we need to take tickets worth rs70 but the person asking 100rs with out any reason, Last time I had fight for 30rs. Iyer charge is separately.\n\nToo much of waste dress are in the river actually it's have dress collection bin near river but no one follow.\n\nBathing river is awesome, no boating available.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a Eswaran temple situated near bavani bye pass. It's one of the best temples for parikaram. It's another name is kooduthurai sangameswarar temple. Because river cauvery and river bhavani are met here. So this sivan temple is in between these two rivers. Ammavasai is the correct day to visit this temple for parikaram.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very spacious, calm, refreshing cauvery river bath, ancient siva vishnu temple, ideal for a picnic",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is a place where bhavani river and Kaveri river meets. People believes that a third clean water stream is flowing from Arulmigu Sangameshwara Shiva temple, named Amutha Nadhi. Hence it is often called as Triveni too.\n\nPeople from far distances visit this place to perform funeral/yearly rituals here.\n\nPlace is not that clean as you can see lot of plastic wastes here and there, even in the river.\n\nAlso, auto/cab facility is not available here.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Bhavani kooduthurai erode",
      "rating": 4.2,
      "address": "47, koodudurai main road, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "Holy place. Spritual vibration felt here. The devotees of Lord Sri Ayyappan come here often. Sangameshwarer and Vedanayagi Ambal bless all the devotees. Adhi Kesavaperumal and other Gods temple situated here. This is one of the Pariharasthalam for Hindu people.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place to give thithi to ancestors. Because of the crowd the water stays always dirty.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Not maintaining! And too cost for doing “THITHI” asking 800 for Pindam and 200 for Ellu water … Perur is better than here !",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place to give thithi for ancestors",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice place.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Uthandrayan Temple",
      "rating": 4.5,
      "address": "CMVG+CQ5, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "The Uthandrayan Temple in Bhavani is a serene and spiritually enriching destination. The temple's architecture is a blend of traditional South Indian style with intricate carvings and vibrant paintings. Dedicated to Lord Shiva, it attracts devotees seeking blessings and solace. The peaceful ambiance and the surrounding natural beauty make it a perfect place for meditation and introspection. The temple's management ensures cleanliness and order, enhancing the overall experience. A visit to Uthandrayan Temple promises a fulfilling spiritual journey and a glimpse into the rich cultural heritage of India.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to spend time with family.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good environment you can spend your time your family and friends 😉🙂\nRight time to visit this place September to February",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This week have no water to enjoy... So sad but beautiful place...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "29th March 24. Weekend visit water Level too low.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kooduthurai Sangameswarar Temple",
      "rating": 4.8,
      "address": "47, koodudurai main road, Bhavani, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "Lord Shiva and Parvati temple which is at two river Kaveri and Bhavani merging spot that's the reason why it's is called as KOODUTHURAI\n\nFresh drinking water, free slippers room, good parking space, free toilet all makes it very friendly environment\n\nGood temple prasadham are served in here",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great place as the temple is located in the place Kaveri and Bhavani river meets. Must visit for peace and will be a spiritual person's favourite. Most devotees of Sabarimala visit here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice la arranged for visiting temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The temple is so divine and special!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Vedhagiri hill URACHIKOTTAI",
      "rating": 4.7,
      "address": "Urachikottai, FMGR+P69, Perumal Kovil Steps, Tamil Nadu 638301, India",
      "reviews": [
        {
          "text": "Very devotional place. Not so far from bhavani. You have parking facilities. Try to start walking by morning because it will be too hot during afternoon. It takes roughly 1 hr to ascend and 45 mins I to descend. So peaceful and calm. Beautiful panoramic view of kaveri river. Om namo narayana!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "You can see a wonderful view from the top which gives a good experience while climbing the place. Here you have to walk only to reach the top .  There is a drinking water facility at the top of the hill and prasadam provide  every Saturday morning.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Urachikottai is a small Village/hamlet in Bhavani Block in Erode District of Tamil Nadu State, India. It comes under Urachikottai Panchayath. It is located 31 KM towards North from District head quarters Erode. 13 KM from Bhavani. 392 KM from State capital Chennai\n\nUrachikottai Pin code is 638301 and postal head office is Bhavani .\n\nVellaiyampalayam ( 2 KM ) , Chinnathambipalayam ( 3 KM ) , Pazhaiya Mettur ( 3 KM ) , Annamaduvu ( 3 KM ) , Andiyur ( 4 KM ) are the nearby Villages to Urachikottai. Urachikottai is surrounded by Bhavani Block towards South , Ammapet Block towards East , Gopichettipalaiyam Block towards west , Thoockanaickenpalaiyam Block towards west .\n\nBhavani , Suriyampalayam , Periyasemur , Erode are the near by Cities to Urachikottai.\n\nThis Place is in the border of the Erode District and Namakkal District. Namakkal District Pallipalayam is East towards this place .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful hill. Takes around 40 mins to climb and it is an easy one. The path is levelled stone path coupled with steps. Not much people but it was so nice.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Urachikottai is one of the tallest hill temple in erode region. There is no vehicle facilities while climbing. We wanna walk above the hill which will give an fantastic trek as it is covered with trees and the scenery will be awe..😍 we cannot feel the warmth as we reach up the hill. The passage for walking has well maintained. Different age groups can climb the hill for a wonderful experience...🤟🏽",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Perumalmalai Mangalagiri Perumal Temple",
      "rating": 4.3,
      "address": "CM4J+755, Perumal Malai Kovil Road, Suriyampalayam, Tamil Nadu 638102, India",
      "reviews": [
        {
          "text": "I go to every year from my childhood.. only Purattasi month saturday is crowd and open.. Medium size hill, can reach with in 15 to 30 mins as per your stamina.. you can see kaveri river, vedhagiri malai, NH, Irtt, vasavi, bhavani, thiruchengode temple from here.. very nice..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good spot for early morning or evening small trekking in Salem city. It will take 30 to 45 mins to climb the hill. Beware of monkeys (don't feed monkeys and spoil their lifecycle)",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "No crowd all days, but puratasi Saturday full crowd, very calm place, super view. But only two rest place in steps steps roof capacity not enough.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of Blessed and Divined place.. Usually Every Saturday , and Puratasi Saturdays also New moon day only the temple is opened at 7am to 1pm.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Perumal malai..Bhavani ..devotional..climb through steps..",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Vattamalai Murugan Temple",
      "rating": 4.7,
      "address": "CPXG+XXQ, Komarapalayam, Tamil Nadu 638183, India",
      "reviews": [
        {
          "text": "Nice temple well maintained. Must visit murugan temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🌹🙏🌹",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}