{
  "places_with_reviews": [
    {
      "name": "Khodiyar mata temple",
      "rating": 4.8,
      "address": "2/e, Shakti tenament 2, Vidhyanagar, Bhavnagar, Gujarat 364002, India",
      "reviews": [
        {
          "text": "Great experience at the temple... Cool weather, holy feelings, many people go for the praying and do some kind of their promise to godess khodiyar maa.\nThe temple is Dedicated to godess khodiyar ma",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good, but wash rooms are in less numbers in the surrounding area.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I am mesmerising with all beautiful places , khodiyar tample was fabulous journey",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice Temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is biggest temple of khodiyar maa in bhavnagar. Here people come and take the Prasad of lapshi. The ropeway system is also Available here. Many celebrities have visited this place. Recently Mr Mayabhai Ahir had come here for his program. Here you can donate here whatever you want to donate. Here is the lake in which there are many fishes and some turtle are also in this lake. You will enjoy so much after coming here. A huge parking facility is available here. You will get here any public transportation at very cheaper price.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shree Takhteshwar Temple",
      "rating": 4.7,
      "address": "Q48W+884, Takhteshwar, Kalanala, Panwadi, Bhavnagar, Gujarat 364002, India",
      "reviews": [
        {
          "text": "A beautiful religious and peaceful place.\nIt's located at some higher altitude and you can have a magnificent view of the city.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place in the center of the city, to visit early morning and evening.  Aarti done in morning was simple and good. Few people were there in the early morning hours. Good place to go walking too",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "\"Visiting Shree Takhteshwar Temple was a truly divine experience. The serene atmosphere and the majestic presence of Lord Shiva create a sense of peace and tranquility. The architecture is breathtaking, and the intricate carvings on the walls add to the temple's charm. The devotees' devotion and the priests' dedication further enhance the spiritual ambiance. A must-visit destination for anyone seeking solace and spiritual enlightenment.\"",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Takhteswar Mahadev is one of the oldest and best hilltop temple of Lord Shiva, the landmark of city in center of Bhavnagar at Takhteshwar Taleti Road. This temple was built by King of Bhavnagar Maharaja Takhatsinhji in 1893 with unique architecture supported on 18 carved pillars with huge hall, magnificent courtyard and three-eyed Lord Shiva idol.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Wonderful place, a very old Hindu temple from where you can have a beautiful view of Bhavnagar City.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "TALAJA JAKATNAKA CIRCLE",
      "rating": 4.3,
      "address": "P5R2+V44, Jakatnaka, Kaminiyanagar, Talaja, Bhavnagar, Gujarat 364001, India",
      "reviews": [
        {
          "text": "This circle connect with Leela Circle, Ram Mantra Circle, Shivaji Circle and Top 3 circle. one can find ST bus, Private bus and 4 wheeler like echo and auto to reach nearby locations and Remote Location easily. There is no proper bus stop here, public face inconvenience due to non-availability of bus stop. This circle is also known as Sant Shri DukhiShyam Bapa Circle.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "ONE OF THE OLD CIRCLE OF OUR BHAVNAGAR AND ALSO FAMOUS FOR NATIONAL HIGHWAY LINK WITH ALANG",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "No st-bus stand available for waiting/ sitting for bus  🚌 , prrivet vehicles available for any time",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent work n good work quality",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This circle situated in south area of bhavnagar city. Near by road of this area is very poor. There is one petrol pump available for vehicle fuel, Here Lot's of students are stayed for Govt. Exam preparation and College study. Here good facility of Breakfast, Lunch, Dinner for peoples.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "BAPS Shri Swaminarayan Mandir, Bhavnagar",
      "rating": 4.6,
      "address": "Waghawadi Rd., Aksharwadi, Bhavnagar, Gujarat 364750, India",
      "reviews": [
        {
          "text": "The Swaminarayan Mandir on Aksharwadi Waghawadi Road in Bhavnagar is a magnificent temple known for its intricate architecture, spiritual ambiance, and cultural significance.\n\nDevotees and visitors praise its grandeur, meticulously carved marble pillars, and the serene atmosphere that fosters devotion and meditation.\n\nThe temple's management is often commended for its cleanliness, organization, and hospitality towards visitors.\n\nOverall, it's considered a must-visit landmark in Bhavnagar for those seeking spiritual solace and cultural immersion.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The BAPS Swaminarayan Temple in Bhavnagar is an architectural marvel that reflects the rich cultural and spiritual heritage of the Swaminarayan tradition. The temple's intricate design, featuring ornate carvings and detailed craftsmanship, exemplifies the commitment to artistic excellence.\n\nThe spiritual ambiance within the temple is palpable, providing visitors with a serene and contemplative atmosphere. Devotees and tourists alike appreciate the temple's commitment to maintaining a clean and well-maintained environment, contributing to a sense of reverence.\n\nThe temple's staff and volunteers are known for their hospitality, offering guidance and assistance to visitors. The religious rituals and ceremonies conducted in the temple follow traditional practices, providing an authentic spiritual experience.\n\nVisitors also admire the temple's surrounding gardens and landscaping, contributing to the overall aesthetic appeal. The maintenance of the premises reflects a dedication to creating a holistic and peaceful environment for worship.\n\nIn summary, the BAPS Swaminarayan Temple in Bhavnagar stands as a testament to architectural brilliance and spiritual devotion. Its meticulous design, serene atmosphere, and commitment to traditional practices make it a significant cultural and religious landmark in the region.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Don't get mistaken it's not Akshardham..  it's another panth... Here female are restricted at many points ... Kindly read n then roam inside .. atmosphere was good , lot of parking available, inside premvati is eat joint... Must visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Swaminarayan Temple Bhavnagar is a very good and peaceful place and temple and hence people visit it more and more to get rid of Lay Mantra.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Perfect place to meditate. Visitors would admire the grandeur of the sculptures of the historical monuments that have been inspired from mythical creatures",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mastram Bapa Mandir - Bhavnagar",
      "rating": 4.5,
      "address": "Q34X+2G5, SH 6, Chitra, Bhavnagar, Gujarat 364004, India",
      "reviews": [
        {
          "text": "Annakshetra and dhuno of mastram bapa is here. Sitting area is big and specious. Small temple is also here. Do visit its on other side of road",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Historical Place of Mastaram Bapa at Bhavnagar must to visit with family members.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Excellent temple Cum Ashram of Param Pujya Shree Mastram Bapu / Guruji. This is a religious place. Very pious and fruitful.\nIt is located in Chitra, we may call it an entrance to Bhavnagar while we come from Rajkot or  Ahmedabad. Bhavnagar is a cultural city and people are devoted.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shree mastram mandir in bhavnagar taluka proper, chitra area , located in 6 km to bus stand , available hotel, dhaba near by temple. Historical temple in chitra. Highway touch .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Historical Place of Sant Shree Mastaram Bapa. 🙏🏽🙏🏽",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mini Kedarnath",
      "rating": 4.6,
      "address": "Mini Kedarnath Anjali, opp. Ladies Hostel, Yogeshwar Society, Devbagh, Bhavnagar, Gujarat 364002, India",
      "reviews": [
        {
          "text": "It is lord shiva place where complete all your wish. Beautiful place with sound atmosphere. Totally replica of shree kedarnath temple. According to my knowledge here you ask lord shiva to fulfill your wish shivaji definate complete your good wish. Visit once",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful devotional place… and also it’s located in Bhavnagar 😍",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is similar to the vivid Kedarnath Mahadev temple in Uttarakhand, but in a smaller form. So it is known as Mini Kedarnath. This place is very good. This place is still developing. But this place is worth going to. At night the temple looks amazing in lights.🤩",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best Place to visit in Bhavnagar. Replica of kedarnath known as Devnath Mahadev Mandir (Mini kedarnath), Devbaug Society, Common Plot, Bhavnagar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "\"I attand a evening aarti at 6:30pm ❤️ It was very peaceful and positive vibes 💖\n\nBest Design Of the TEMPLE👌🏻🔱\n\nMini Kedarnath Anjali, opp. Ladies Hostel, Yogeshwar Society, Devbagh, Bhavnagar, Gujarat 364002, India",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Iskcon Mandir",
      "rating": 4.6,
      "address": "Besides Chaitanya Villa Society, Bhavnagar - Sidsar Rd, Kailash Dham Society, B.A.D.A. Vikash Path, Bhavnagar, Gujarat 364002, India",
      "reviews": [
        {
          "text": "A wonderful and a beautiful place to visit.A person can visit it any time to relieve from stress and also can join the devotees in all the rituals of fhe temple to establish peace within inner soul and fulfill the needs of eternal entity which we call as Aatma.It also has a wonderful garden outside where you can sit and try to concentrate mind within the god by chanting holy name of Krishna available in the form of mahamanta - \" Hare Krishna Hare Krishna Krishna Krishna Hare Hare | Hare Rama Hare Rama Rama Rama Hare Hare \".\nCHANT THE HOLY NAME OF KRISHNA AND BE HAPPY",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A wonderful and a beautiful place to visit.A person can visit it any time to relieve from stress and also can join the devotees in all the rituals of fhe temple to establish peace within inner soul and fulfill the needs of eternal entity which we call as Aatma.It also has a wonderful garden outside where you can sit and try to concentrate mind within the god by chanting holy name of Krishna available in the form of mahamanta - \" Hare Krishna Hare Krishna Krishna Krishna Hare Hare | Hare Rama Hare Rama Rama Rama Hare Hare \".\nCHANT THE HOLY NAME OF KRISHNA AND BE HAPPY.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is Iscon Temple Lord Shree Krishna Temple. This is Very New Temple Build Just Recent Time. Located At Sidsar Road Near Leela Circle Road. This is Really Divine Place People Visiting Here Each Day And Specially At Sunday. The Huge Crowd At Sunday. Every Sunday Perform Here Katha (કથા) And Joins So Many People Here. This Temple Spread Big Area.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "located near Leela circle in Bhavnagar, it's very spritual and Peaceful place.\nHARE KRISHNA HARE KRISHNA",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its very devine place and have beautiful atmosphere . Every sunday there is special bhajan and kirtan in evening and provide food as prasad to everyone who came",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ruvapari Mandir",
      "rating": 4.6,
      "address": "Q5QC+56X, Juna Bandar, Bhavnagar, Ruva Part, Gujarat 364001, India",
      "reviews": [
        {
          "text": "Pious temple on the shore which has seen lots of upgradation over the last decade. The road is a bit difficult to reach especially as you have to cross the city to reach it. Lots of parking in the temple premise. The evening time here is very peaceful. Overall a must visit for spiritual cleansing.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The place has been improved and now looks like this",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ruvapari mandir is very clean place in Bhavnagar....\nAtmosphere was so spiritual...\nMandir was very nice developed...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A spiritual place for Hinduism. A temple of ruvapari ma  at ruvapari road\nSo peaceful place. Blessings of Ruvapari goddess. Nice view of whole temple. Too good atmosphere and grounds.\ntemple it's called \"derani jethani na dungar\" When we walk on it we fill like walking on water mattress surface is very sponge\nit's located near excel industry and one of the best thing near this.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very clam palce for 🙏 pray for God in bhavnagar , also the palce is very beautiful,\nAnd the temple is very holistic.\nAnd the parking area is very big.\nThe ocen is very near from here.\nJAY RUVAPARI MA 🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Zanzariya Hanumanji Temple",
      "rating": 4.8,
      "address": "P592+36M, Mahuva - Bhavnagar Hwy, Adhewada, Gujarat 364002, India",
      "reviews": [
        {
          "text": "Zanzariya Hanumanji Mandir is located at Adhewada village belongs to Bhavnagar taluka comes under Bhavnagar district in Saurashtra region of Gujarat state, India.\n\nIt is situated roughly 6 kms from the district head quarters Bhavnagar. Zanzariya temple marks the birth place of Sant Shiromani Bajrangdas Bapa is sacred place to visit.\n\nVery ancient and known temple of Bhavnagar. Around 6 km away. U can find crowd on Tuesday and Saturday. Have to arrange ur own vehicle. Public transport not available.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Less crowded and famous Hanuman Temple... Can spend some time besides river and have sunset clicks...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice place, Hindu Religious temple Hanumaji Temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice pilgrimage place in bhavnagar. Many devotees visit this temple on Saturday. Calm atmosphere and very good location out of the city. More parking facility available there. Very good temple in the bhavnagar.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice place not too crowded I enjoyed my stay here its very peaceful place must visit its outside yhe city area",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Khodiyar Maa Temple",
      "rating": 4.6,
      "address": "Q49G+95P, Gujarat Industrial Development Corporation, Shastrinagar, Bhavnagar, Gujarat 364001, India",
      "reviews": [
        {
          "text": "So good temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing Place and very Nice neat and clean as per the level",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful temple dedicated to Maa Khodiyar. A very peaceful and tranquil place and attract positive energies. There are food outlets, restaurants, stalls for Prasad and gardens to enjoy with family. Lapsi is the main prasad offered to Maa Khodiyar. A great temple to visit with family.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I m very happy",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good 🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}