{
  "places_with_reviews": [
    {
      "name": "Maitri Bagh Zoo, bhilai, Chattisgarh",
      "rating": 4,
      "address": "Maroda Sector, Durg Water Treatment Plant Near to Maroda, Maroda Sector, Bhilai, Chhattisgarh 490006, India",
      "reviews": [
        {
          "text": "Maitri Garden is awesome, you see their white tiger, lion , Python , bear and so many animals.  Location is easily accesible. Entry ticket is 20 rs. Per person only.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "There are only seven white tigers in India's sanctuaries.. Out of which three white tigers are in Maitri Bagh.\nBoat ride and toy train ride is a beautiful experience. Shame there are no toilet facilities inside. A rental bicycle can be arranged for quick sightseeing. Boat ride and toy train ride were charged less.\nAnyway Zoo is a prison of animals. Some of the animals were pitiful to see. A lion was roaring as we went. I thought It was searching the forest. I have seen peacocks playing on house roofs in our villages. The peacocks were also caged here. We should also consider the welfare of animals and birds in the coming times. This world is definitely not just for humans. Everyone should visit this Zoo to develop these thoughts. Must visit place for everyone.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "**Maitri Bagh Zoo, Bhilai: A Delightful Oasis of Wildlife and Serenity**\n\nNestled in the heart of Bhilai, Maitri Bagh Zoo emerges as a haven for nature lovers and wildlife enthusiasts alike. This sprawling sanctuary not only houses a diverse array of flora and fauna but also offers a serene escape from the hustle and bustle of city life. A visit to Maitri Bagh promises an immersive experience, blending education, conservation, and tranquility in a picturesque setting.\n\n**A Tapestry of Biodiversity:**\n\nMaitri Bagh Zoo unfolds as a living tapestry of biodiversity, featuring a captivating variety of animal and plant species. From majestic lions and playful monkeys to vibrant avian residents, the zoo presents a wonderful opportunity to witness the wonders of the natural world. Thoughtfully designed enclosures mirror the native habitats of the animals, providing both a visually appealing and educational experience for visitors.\n\n**Conservation Initiatives:**\n\nOne of Maitri Bagh's commendable aspects is its commitment to conservation and education. The zoo actively engages in conservation programs, creating awareness about endangered species and the importance of preserving their habitats. Informational displays and interactive exhibits offer visitors valuable insights into the challenges faced by wildlife and the role each person can play in fostering conservation efforts.\n\n**Lush Landscapes and Tranquil Settings:**\n\nBeyond the captivating wildlife, Maitri Bagh embraces visitors with lush greenery, manicured gardens, and tranquil water bodies. The well-maintained pathways provide a leisurely stroll amidst nature's bounty. The overall ambiance creates a serene atmosphere, inviting families, couples, and solo travelers alike to unwind and connect with the natural world.\n\n**Engaging Activities for All Ages:**\n\nMaitri Bagh Zoo goes beyond conventional zoo experiences by offering engaging activities for visitors of all ages. Educational programs, wildlife talks, and interactive sessions add an enriching layer to the visit, making it an ideal destination for families, students, and curious minds eager to learn more about the animal kingdom.\n\n**Accessibility and Amenities:**\n\nThe zoo is conveniently located, with well-marked pathways and ample signage ensuring easy navigation. Adequate seating areas, refreshment stalls, and restroom facilities contribute to a comfortable and enjoyable visit. The friendly and knowledgeable staff further enhance the overall experience, ready to assist and share interesting tidbits about the zoo's residents.\n\n**Community Engagement and Events:**\n\nMaitri Bagh Zoo extends its impact beyond its gates through community engagement initiatives and special events. Whether it's hosting wildlife awareness programs or celebrating environmental milestones, the zoo actively involves the local community, fostering a sense of shared responsibility for the planet's well-being.\n\n**Best Time to Visit:**\n\nWhile Maitri Bagh welcomes visitors throughout the year, the milder months, typically from October to March, offer pleasant weather for exploring the outdoor exhibits and enjoying the lush surroundings.\n\nIn conclusion, Maitri Bagh Zoo in Bhilai stands as a testament to the harmonious coexistence of wildlife and humanity. It seamlessly blends education, conservation, and recreation, making it a must-visit destination for those seeking a meaningful and delightful encounter with nature. A day at Maitri Bagh is not just a zoo visit; it's a journey into the heart of biodiversity and a celebration of the enduring bond between humans and the animal kingdom.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Small enjoyable ZOO for all the ages. Entry fee rs.20 per head and there will be no long queue so no need to booking advance. Parking area is too big and small food counter chat, ice cream, biscuits are available.Apart from zoo there are plenty of garden space. Flowers are really treat for eyes. All the gardens are well maintained. Outside foods are allowed. Only one food stall available but limited menu options are there. Zoo is the main attraction of the place. Zoo is well maintained and enjoyable. You will see Tiger, royal Bengal tiger, white tiger, lion, Asiatic lion, samber, barking deer, antilope, crocodile, leopard, blue bull, python, rabbit, lezard, rhesus monkey, hawk, parrot, dark eyes owl, rosy pelican, white pelican, deer, black deer, peacock, Indian porcupine, turtle, star turtle, emu bird, jackal, striped hayna and many more. The maitri bagh is maintained by Bhilai Steel Authority. The area is too big. In the winter season this is the perfect picnic spot.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Lovely place for kids many animal live here we like mostly white tiger.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Jagannath Temple",
      "rating": 4.5,
      "address": "59R8+PX7, Sector 4, Bhilai, Chhattisgarh 490001, India",
      "reviews": [
        {
          "text": "Nice and peaceful environment. Well maintained Hindu temple with such a beautiful entrance.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Every Jagannath temple feels nice. Must visit this place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best places to visit at bhilai . parking slots are not enough... toilet and wash facilities provided outside.\n\nSoooo tasty prasad....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a very big Temple of lord Jagannatha.also have Shiva Templeœ",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the bhilai's must visit places with a legacy of over 50 years. Exquisite and opulent puja of lord Jagannath is carried out with deep Devotion. A replica of Jagannath temple puri. Bhilai's first Rath Yatra is held here.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Hare Krishna Movement, Bhilai",
      "rating": 4.9,
      "address": "Akshaya Patra Campus, Sector - 6, Bhilai, Chhattisgarh Ph no :, State Bank Colony, Sector 6, Bhilai, Chhattisgarh 0788 - 2284699, India",
      "reviews": [
        {
          "text": "This is a nice place to gain krishna consciousness. Here temples provide vedic science classes to the devotees or younger and you can enjoy kirtan, Prasad, Do bhakti. At all, best place ♥️",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Apart from deity worship, this temple offers regular spiritual classes for everyone, along with Mhaprasadm, which is filled with delightful dishes, to help the students become conscious of Lord Krishna🦚",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "So peaceful environment, Jai jai shree krishna 🙏 I loved temple alot Tq lord krishna ji",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "I am in love with this place",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Everything is nice - gau Shala, Prasad and etc, please visit",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Hanuman Mandir sector 9",
      "rating": 4.7,
      "address": "58Q7+PV7, Manav Seva Parisar Road, Sector 9, Bhilai, Chhattisgarh 490009, India",
      "reviews": [
        {
          "text": "One of the most visited Hanuman Mandir in Bhilai-Durg due its historical recognition.\nUsually crowded on Tuesdays.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place is famous for its hanuman lord. It might be temple with own birth hanuman ji. It is located near sector 9 javahar lal nehru hospital. so can be visited with that only.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Many people believe in making a wish for themselves and succeeding in whatever they ask for themselves ✨️ जय श्री राम\nजय हनुमान",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the oldest temple located at Bhilai sector 9. It's comes under Jawahar Lal hospital sector 9. This is Hanuman Mandir.  The statue of Hanuman ji was not even removed from the crane\nBhilai. The Hanuman temple of Amadi village is still the center of the faith of the people. At the time of BSP's construction, this temple used to be in Amadi village. Now it is located near Operation Theater within Sector 9 Hospital. Behind this temple, it is believed that during the construction of the hospital, the statue of Hanuman and tree below the peepal tree was being removed from the crane. The statue of Hanuman and the statue of Hanuman got mixed up. After this, the plant management has made the operation theater near by assuming God's pleasure and the temple for the statue. Today, the most famous Hanuman temple of Steel City is Sector-9.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This Hanuman mandir is one of the best and holy place for people's of bhilai , who are spiritual.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Jubilee Park",
      "rating": 3.8,
      "address": "719, C Market, Sector 6, Bhilai, Chhattisgarh 490006, India",
      "reviews": [
        {
          "text": "Jubilee Park in Durg, Chhattisgarh 📍, is an enchanting haven that seamlessly blends nature and recreation. Nestled in the heart of the city, this park provides a refreshing escape from the urban hustle. As you step in, the lush greenery and well-manicured lawns immediately captivate, creating a soothing ambiance.\n\nWandering through the park's winding pathways, one can appreciate the diverse flora that adorns the landscape. From vibrant flowerbeds to towering trees, Jubilee Park 🏞️ showcases the region's rich biodiversity. The thoughtful design of the pathways ensures a pleasant stroll, allowing visitors to connect with nature at their own pace.\n\nA highlight of Jubilee Park is its family-friendly amenities. The play area is a vibrant space where children can unleash their energy, and the park benches scattered strategically offer perfect spots for relaxation and observation. Families often gather here for picnics, creating a warm and communal atmosphere.\n\nMaintained with evident care, Jubilee Park stands as a testament to the city's commitment to green 💚 spaces. The cleanliness and order contribute to a positive visitor experience. Whether you seek solitude for reflection, a family outing, or a leisurely walk, Jubilee Park in Durg fulfills these desires, making it a cherished gem in the cityscape.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "The Park is quite good. One can spend peaceful time here. A bit poor maintenance of the park especially the cleaning.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "If you want to enjoy the Greenery and avoid crowd, this will be good place to consider. Visit during Morning time only.\n\nGarden paths are good to have walk and covers the complete radius of the garden.\n\nGarden is covered with trees and plants, small pond in the middle which has lotus flowers planted.(image attached).\n\nOnly problem is that there is no security and or any maintenance.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Good place to relax and soothe your mind Good for jogging and yoga..\nYou can take walk in morning and evening but only before 6pm or before sun goes down to stay safe form troubling people.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Nice place for couples. Very peaceful park. It was made by the BSP [ Bhilai steel corporation] in the celebration of 25 years of BHILAI STEEL PLANT. It has got lots of greens ,, trees & flowers . Few years back it has a working swimming pool & a fountain but now its just an structure. The locality near the park is demolishing by the authorities. Its a photographer friendly park , the one can explore some nice stuff over there. Good for morning as well as evening walk. Located besides the central avenue.",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Gada Chowk (Dr Rajendra Prasad Chock)",
      "rating": 4.1,
      "address": "688X+C6W, Purani Basti, Supela, Laxmi Nagar, Bhilai, Chhattisgarh 490023, India",
      "reviews": [
        {
          "text": "Gada Chowk offers an authentic slice of Bhilai life, with its bustling street food and lively atmosphere. However, the presence of a wine shop and occasional rowdy behavior can be off-putting for some.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Place is well known for English Wine shop. Nothing exceptional here.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Feels like it's Always under construction very crowded with drunk people as there is a alcohol shop right there, it meke this very dangerous to cross by.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's public place, basically connection or streets,it connects awanti Bai chowk and vaishali nagar to supela ghadi chowk",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It is a chowk. I do not find convenient for stuffs to buy. There is no traffic control. The people are not wearing helmet, not following rules. They were driving so rush. No such places to buy things like other places.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Baikunth Dham",
      "rating": 4.5,
      "address": "H.168 Baikunt dham, mannu moblie k pass, Durgpara, Camp 2, Bhilai, Chhattisgarh 490001, India",
      "reviews": [
        {
          "text": "Very Nice Place In This Area Of Bhilai\nThere is a big idol of Shankar and Bajarangbali and there is a temple of Sai Baba",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place for worship\nAttractive statue of lord shiva and lord hanuman.\nIn front of it pond for celebrating different festivals.\nPeaceful environment.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best turist place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Priyanka",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place..and lord shiva temple , Hanuman temple,ram ji temple 🙏🚩",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Panthi Chowk",
      "rating": 4.1,
      "address": "58HF+9PF, Sector 9 Rd, Sector 9, Bhilai, Chhattisgarh 490006, India",
      "reviews": [
        {
          "text": "Nice chowk, because from here, each corner of bhilai & durg are closer, so you can reach anywhere in the meantime.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This is well made round about. There are breakfast and tea vending Shops run from morning to night all the days. Ko",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A glimpse of traditional folk dance of Chattisgarh. It's a traffic junction",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good place for pan masala and chai. Often you get vegetable vendors there.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice work art look at one's panthi is dance fome of satnam samaj\nIt's a rode",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Shree Shirdi Saibaba Mandir - Bhilai City, Chhattisgarh, India",
      "rating": 4.7,
      "address": "34, sai mandir road, Sector 6, Bhilai, Chhattisgarh 490001, India",
      "reviews": [
        {
          "text": "Mind soothing experience and must remember,\n1.specialaarti on Thursday  with rose offering is treated as sacred.\n2.bhandara serving is treated for blessing to poors and others.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very holy place to visit and solve all your problems with the blessings of lord Sai 🙏🙏💞  Always feel like blessed by baba 🙏❣️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place .... My aunt passed away six months back and she had very much belief in this place ...visiting this in her memory",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very Peace full place...... Om sai ram🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful mandir\nThe god Sai baba🤩🤘❤️🤩❤️🤩🥰🥰",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Balaji Mandir",
      "rating": 4.7,
      "address": "Balaji Temple, Sector 5, Bhilai, Chhattisgarh 490006, India",
      "reviews": [
        {
          "text": "Lord Vishnu is the principal deities of Hindu trinity and protector of the world, Vaishnavism is one of the traditions followed within Hinduism. Balaji temple is situated in bhilai sector 5\n(35km from capital raipur )\nBest place for hindu devotees 🚩🙏\nThere is also a Ganesh temple here .🚩🙏\n\nTemple timings:-\n5 AM to 11 AM and\n5 PM to 9PM on week days",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I have been to this place many times n it reminds me of tirumala. Can i get any contact number for organising a pooja … ?",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a South Indian temple it's called a Balaji temple as well as Sri Venkateswara temple it is very famous temple in Bhilai so many people come here and pray for God this is the the like a branch of of Tirupati tirumala Venkateswara Swami Mandir Andhra Pradesh",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "My childhood memory place,Balaji temple or Sri Venkateswara temple is a very very well known temple in the sector areas of Bhilai so many people come here and pray for God this is the the like a miniature branch of of Tirupati tirumala Venkateswara Swami Mandir Andhra Pradesh.Mental and spiritual Peace. If you want any spiritual prayer (Pooja), they are performing at an economical price.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful South Indian temple 🌸🙏😇\nIt brings positivity ,grace and happiness in your life",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}