{
  "places_with_reviews": [
    {
      "name": "Sanwariya Seth Temple",
      "rating": 4.7,
      "address": "Azad Nagar, Pratap Nagar, 8JQG+R2P, Pratap Nagar, Bhilwara, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "\"Visited the Sanwariya Seth Temple and it was an incredibly divine experience! The temple exudes a sense of peace and tranquility that is truly unmatched. The intricate architecture and beautiful idols create a sacred atmosphere that touches the soul. The devotees' devotion and the soothing chants filled my heart with immense joy and positivity. It's a must-visit for anyone seeking spiritual solace. Feeling blessed and grateful for this incredible experience at Sanwariya Seth Temple! 🙏✨\"",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I had a wonderful experience at Sanwariya Seth Temple. The serene ambiance and spiritual energy made my visit truly special. The temple’s architecture and well-maintained surroundings added to the overall charm. The devotees and staff were welcoming, creating a sense of peace and devotion. I highly recommend a visit to this sacred place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great place to visit, refreshing breeze and soothing nature and great spiritual vibes 🎉🙏🏻",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best temples in chittorgarh rajasthan 😍. Must visit for every Pilgrim 😊 Parking slot is quite good and you can find food around there easily.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice palace anf TAMPLE, prasd likr mathdi is not available at all time, distance of parking and tample is more then 1 km",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Harni Mahadev Temple",
      "rating": 4.6,
      "address": "8M53+J5V, Bhilwara, Rajasthan 311011, India",
      "reviews": [
        {
          "text": "It's an excellent temple for lord Shiv devotees. The core temple is situated under a rock and there are some legends regarding that rock. It is a one piece rock. The surroundings are very calm and  there is a forest reserve area nearby. Please visit this place, it's one of the best places in Bhilwara district.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Harni Mahadev temple is a prominent religious site located in Bhilwara, Rajasthan. This ancient temple is dedicated to Lord Shiva and holds immense significance among the devotees in the region. The architecture of Harni Mahadev temple is truly awe-inspiring, with intricate carvings and beautiful sculptures adorning its walls. The temple is situated atop a hill, providing breathtaking views of the surrounding landscape. Pilgrims from far and wide visit Harni Mahadev temple to seek blessings and offer prayers to Lord Shiva. The serene ambiance of the temple complex makes it a peaceful retreat for spiritual seekers. The annual Maha Shivaratri festival is celebrated with great fervor at Harni Mahadev temple, attracting a large number of devotees who participate in religious rituals and prayers. Visiting Harni Mahadev temple is not only a religious experience but also an opportunity to marvel at the rich cultural heritage of Rajasthan. Plan a trip to this sacred site in Bhilwara to immerse yourself in divinity and architectural splendor.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place to visit for man ki shanti.\nYou will get good vibes.\nDrinking water,\nToilet\nDharamshala\nFastfood\nRestaurant\nAll facility available it's close to Bhilwara.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Harni mahadev temple is big temple.\nThere are 12 jyotirlinga darshan also. Small temples are also there. Outside the temple Prasad and garland, flowers are also available.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Om Namah Shivay, a beautiful temple dedicated to lord Shiva. Located near to city.    If you are in Bhilwara then must visit this temple.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shivaji Park",
      "rating": 4.3,
      "address": "5-D-2, Rishabh, Sector 5, R C Vyas Colony, Bhilwara, Palri, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "Park is really beautiful. Lot of people comes for jog, walk and running eveyday morning and evening. A small temple is there for worship. You can find fruit and vegitable juice early morning and fast food in the evening..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is a very huge garden and a more than sufficient walking space for all ages. People come here for walking, running, morning exercises and children also used to come here for playing and riding in swings. Here you can also do boating in a descent size of a fountain centred pool type. Also this place is also known for the chowpati nearby where you can have different cuisines of food which is very delicious in taste. You can also have street food here. All over its a good place to hangout on a weekend or a regular day.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a huge garden in RCVyas Colony and a good place to hang out with your friends and family.\n\nThere are three entrances on the north, east and west side. The one on the west side always remains closed. On the north sides there are many food outlets and cafes serving food of all kind.\n\nThe garden is in okay shape but in rainy seasons the admin just gives up, the grass is overgrown, the walkways don't remain walkable due to water. A portion of the garden is getting littered. And it is difficult to understand but not sure why does it take so long to address of the aforementioned points.\n\nThe garden remains open in the morning and the evening.\n\nThere is a play area for kids but there is an entry fee of 5 rupees. In this day and age when kids aren't involved in outdoor sports, this entry fee is discouraging them further. Kids train ride is also available in a different zone.\n\nThe fountain in the middle of the garden looks good  from far and also has boating service for 20 rupees per person. However the water is dirty and stinks.\n\nGarden had two water coolers, one near the fountain and the other at the north side entrance point.\n\nThere is an open gym and the garden has lots of benches.\n\nThe condition of the restroom near the north side entrance is not in good condition.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent place near to Bhilwara's famous Azad Market. Good for kids and senior citizens. Incase any of your friends like shopping you can drop them near Azad Market and spend some quality time at this park.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is a very good place to spend time with your cousins, relatives and friends.\nIt have many types of facility suggest toy train, boating under the fountain neat and clean Garden play zone where you have lot of swings and other rides and fun rides for your children's yes but these are rights are paid rights and b o a t i n g is also paid 20 rupees per person.\nIt was I do good Gardens you can bring eating stuff and eat it have stall outside to have many types of street food and overall is a very good place. 😊😊😊",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "hinglajhandicrafts Udaipur",
      "rating": 4.6,
      "address": "Dashin vistar om bana mandir ke pass balicha, Udaipur, Rajasthan 313001, India",
      "reviews": [
        {
          "text": "It's a spiritual place to visit.\nI've visited here while traveling from Jaisalmer to Udaipur.\nThe story behind this temple is interesting.\nAfter all here is a temple for Bannaji and Bullet.. Bike enthusiasts will find it more amazing. Because every bike lovers worship their bulls very much..😊",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice and spiritual place to visit, even foreigner come to give a visit.\nThe facilities are fine.\nBut I request for a level of facility considering the visits.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good and very beliable place.  Here people do worship of famous person of Rajput family Shri om singh rathore ( om banna )   . He was from the , accident on jodhpur highway when he was to baba ramdev on his bullet .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice  Farmversity family",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Om banna ki jai.Nice place for every person.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Gayatri Ashram",
      "rating": 4.3,
      "address": "गायत्री आश्रम, R K कॉलोनी, भीलवाड़ा, राजस्थान 311001, India",
      "reviews": [
        {
          "text": "Gayatri Ashram temple at subhash Nagar area is devoted to lord Hanuman ji.\n\nTemple is located on main road. Shiv pariwar temple is also there.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A temple, A Reliance Shopping Mart, Small fast food vendors, a 3 star hotel, Tea shops, Mishthan, local general merchants. Well summing up, the place has everything you may ask for except for decent regular home like food place. Otherwise a very good spot to reside in Bhilwara city.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is a connecting road for internal and external Bhilwara. Reliance smart also present there. Usevally having moderate traffic but heavy traffic at night.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This area situated near ajmer chouraha and it is open area also. We can go very easily here. From here we can take bus for ajmer and jaipur very easily.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautyfull place. Peacefull place, they also distribute khada to all the people with very affordable prices...",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Ram Dham",
      "rating": 4.5,
      "address": "8JJG+FRM, S 79, Ramdham Rd, Transport Nagar, Azad Nagar, Bhilwara, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "This is a temple which is known as ram dham in bhilwara as well as there is an public circle which is know as ram dhan circles the best thing about that circle the construction of the circle because There is shape like this 🙏 on circle so it look so attractive and nice,  personaly I like it",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place and a big gaushala.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a good place to be. Saints come and stay here. There is good place to bring young kids. Gaushala is there and they keep cows nicely. Green grass is made available for gaumata. Raam dham sarkar vigraha is lovely. Pujari there is good mannered and does the job well. Saints come and stay there, good place for saints . Sometimes saints do pravachan also which guides people towards inner self.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a good temple situated at Chittorgarh road. It's a Hindu temple and many activities like bhajan keertan kathaa n all use to held here. Also many of monks are living here and many children who wish to be a monk use to live here. It is a very calm and peaceful place. There is a very big goushala where there are more than 300 cows are being placed",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is one of the oldest temples in Bhilwara with huge area. It holds many functions like satsang, Bhajan sandhya etc. It has the largest Gau Shala of the city with over 200 cows. It has large parking space. One can experience peace there.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Panchmukhi Darbar Mandir",
      "rating": 4.8,
      "address": "8MR2+Q3H, Sangria, Bhilwara, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "It is among one of the famous temple situated in Bhilwara city. Lord Hanuman ji idol with five faces is worshiped here. The temple is calm and peaceful from both the inside and outside. In the temple on one side lord Hanuman ji idol and opposite to it on other side Lord  Shree Ram idol is present, as Hanuman ji is a Supreme devotee of Lord Ram. Spacious parking area available within the temple premises.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The vibe of this temple always hits different .. Amazing temple.. I bet make a wish in darbar and it'll be fulfill by hanuman ji 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I recently had the opportunity to visit Shri Panchmukhi Darbar, and I must say it was a truly enlightening experience. Located in a serene setting, this sacred place holds great spiritual significance and offers a unique blend of religious and cultural elements.\n\nFirst and foremost, the architecture of Shri Panchmukhi Darbar is simply breathtaking. The intricate carvings, vibrant colors, and meticulous attention to detail showcase the rich heritage and craftsmanship of the region. Every nook and corner of the temple exudes a sense of divinity and devotion, creating an atmosphere that is conducive to prayer and introspection.\n\nThe highlight of the Darbar is the magnificent deity of Lord Shiva, depicted with five faces or \"Panchmukhi.\" Each face represents a different aspect of the divine, symbolizing the omnipotence and all-encompassing nature of the Supreme Being. The idol is adorned with exquisite ornaments and offerings, adding to its grandeur.\n\nThe temple complex also encompasses several other shrines dedicated to various deities, allowing visitors to immerse themselves in a multi-dimensional spiritual experience. The atmosphere is filled with melodious chants, devotional songs, and the fragrance of incense, creating a serene ambiance that calms the mind and uplifts the soul.\n\nMoreover, the priests and staff at Shri Panchmukhi Darbar are warm, welcoming, and knowledgeable. They readily offer guidance and information to visitors, enhancing their understanding of the rituals and traditions associated with the temple. Their dedication and devotion to the service of the divine are truly commendable.\n\nAnother aspect worth mentioning is the community engagement and social welfare initiatives undertaken by Shri Panchmukhi Darbar. The temple actively participates in various charitable activities, supporting the underprivileged and marginalized sections of society. This inclusive approach resonates with the true spirit of spirituality, emphasizing the importance of compassion and service to humanity",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful environment. Beautiful stunning lord Hanuman idol, temple architecture is also stunning",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The famous Panchmukhi Balaji temple in Bhilwara is dedicated to the Panchmukhi avatar of Hanumanji. The temple premises is huge and accommodated large crowd but especially on Tuesday it feels very busy. The idol of Panchmukhi Darbar is very attractive and the shrungar of the idol enhance it's beauty. Offering prayers and visiting here gives you a great spiritual experience.\nApart from the Panchmukhi avatar prabhu shree Ram and Seeta mata also there in front of the Panchmukhi Darbar idol.\nShiv temple is also there to offer shiv pujan inside the temple premises.\nPrasad can be purchased outside the temple itself. Spacious parking area is there outside the temple area.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Tanki Ke Balaji",
      "rating": 4.7,
      "address": "9JCP+37P, Rajasthan State Highway 12, Palri, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "This is a popular Balaji temple of Bhilwara. Its also famous as Tanki ke balaji as there was a water tank near this temple earlier. Mostly, devottees visits this temple during tuesdays and saturdays.\n\nIf you are a devottee of Lord Hanuman, then this is must to visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple. 24 hours kirtan on going. Very peaceful.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful place have garden near by this mandir, Hanuman ji mandir, easy to go there also with no traffic.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very calm and peaceful. You can worship lord Krishna and Lord Hanuman here. There's a 24*7 hymn of Ramayana going live which makes the places even more lively and godly. Jai shree krishna 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Holly and peaceful place of lord Hanuman ji .my soul get new energy during worship . their are you can listings shree ràm bhajan and Sunderkand . that's very old temple.\nJ ram ji ki.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Aawri Mata Temple",
      "rating": 4.5,
      "address": "8HJW+X7X, Krishna Nagar, Pansal, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "A temple on the main choraha of bapu nagar and ricco 4th face .\nAnd this chauraha identified as the sawari mata chauraha and\nNear places of here are\nPetrol pump , Vicky egg center so many street food stores are here.\nI don't have photo of this place now but I'll update all of you very soon.\nFrom gaurav shah\nInstagram @bhilwara_exclusive",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "So nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a choraha of Bapu Nagar and near place s",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This mandir is hindu religum mandir...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hospital is very beautiful and clean",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Suchna kendra",
      "rating": 4.7,
      "address": "8JWQ+799, Azad Chowk, Bhopal Ganj, Bhilwara, Rajasthan 311001, India",
      "reviews": [
        {
          "text": "Ultimate edition",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great place",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}