{
  "places_with_reviews": [
    {
      "name": "Mohta Devi Mandir (Temple)",
      "rating": 4.6,
      "address": "B.no.23/183, pipeline hadaco, Pipeline Rd, Savedi, Ahmednagar, Maharashtra 414003, India",
      "reviews": [
        {
          "text": "It's a really nice place to visit if you're in that state  do remember to take whatever you need before you drive up to the temple there is nothing up except for the parking and the temple\nThey do have drinking water up there",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "mohtadevi is Maharashtra's one of the most loved goddess. The temple is so beautiful and huge . The goddess is so beautiful when ever you watch mohtadevi you feel like goddess is looking at you and smile. In temple we feel so pleasent and warm with goodness . We just got so much involved with that environment around . Everyone must visited this place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I was just visiting the place yesterday. When i reached near pooja shops. Shopkeepers aggressively came in front of my bike and made me stop. And started arguing when i was refusing to buy their triple the original price pooja.they were not letting me through without buying stuff from them. Shopkeepers have made this place a horrible experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful and well maintained temple of Shree Mohta Devi , about 9-10 kms from Pathardi in A.Nagar dist.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good to visit but only in weekdays to avoid rush",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Nepti Naka near Amardham",
      "rating": 4.1,
      "address": "Nepti naka chouk or new garud chouk, Delhi Gate Rd, Sudke Mala, Ahmednagar, Maharashtra 414001, India",
      "reviews": [
        {
          "text": "Too much crowd.\nKalyan bus stops here. You can get private vehicle also for kalyan. Or you can catch Aale phata vehicle. From Aalephata you can get Kalyan bus or private vehicle",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Every early morning there is vegetable market is there. People will get the fresh vegetables in wholesale rate. Recommended to visit here for early morning vegetable marketing. Farmers are genuine I will request don't bargain with them. They have lots of investment in aspect of money,time, labour, transportation etc for providing such a fresh vegetables. 🙏🙏🙏 Parking is available street side. Park your vehicle on your risk and neatly because there is so many vehicles passing through this road.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very crowded place, lots of vegetable vendors out side amardham.so causes traffic havvoc, ample parking imside amar dham",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Place is good but traffic rules are not being followed here also cleaning needs to be improved",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This naka basically circle..One road to kalyan, another road to Ahmednagar city. You can get bus from here to kalyan, alephata.Even the Sharing auto's are available to travel to rest of city.In the morning you will get fresh vegetable here..",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Ahmednagar Fort",
      "rating": 4.4,
      "address": "3QW3+J8F, M.I.R.C Ahmednagar, Ahmednagar, Maharashtra 414002, India",
      "reviews": [
        {
          "text": "The Ahmednagar Fort (Ahmadnagar Qilaa) is a fort located close to the Bhingar Nala near Ahmednagar in Maharashtra state western India. It was the headquarters of the Ahmednagar Sultanate. In 1803, it was taken by the British during the Second Anglo-Maratha War. It was used as a prison during the British Raj. Currently, the fort is under the administration of the Armoured Corps of the Indian Army",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ahmednagar Fort also known as Kot Bagh Nizam is one of the oldest forts of India. Built in the 16th century, the fort standing for over 400 years now, is having the most enticing history of all times. It was the Royal residence and Administrative Centre of Nizam Shahi Dynasty from 1490 AD. It was initially built-in 1490 AD by Ahmed Nizam Shah and rebuilt with the present stone masonry with the moat around in 1553 to 1565 by Hussein Nizam Shah.\n\nThis fort is oval in form, 1.70 km in circumference and is strengthened by 24 bastions. Originally it had two entrances, one on the West side for wheeled traffic and other on the East side for foot passengers in the form of sally port and suspension bridge. These were closed and the present entrance was constructed by British during 1943 by breaking the Fort wall and filling the portion of the moat. It is peculiarly well planned and strong built fort with stone walls rising about 30 feet from the bottom of the moat. Although lying on comparatively low ground yet it cannot be spotted within a large distance. Portuguese are said to have helped to build this fort. First Prime Minister of free India, Pandit Nehru wrote Discovery of India when he was imprisoned in this fort here in 1944. Leaders rooms are still alive inside the fort, where leaders of freedom struggle were imprisoned from 1942 45. Although, the Indian army occupies the fort, entry into the fort is allowed by signing at the gate.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Ahmednagar fort is a small fort occupied by military. Military allows visit of fort free. The structures inside fort are in dilapidated condition in absence of maintenance. The wall of fort is strong and one can walk on the wall of fort. It takes maximum one hour to complete tour of fort",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Must visit the place where our freedom fighters stayed for more than 3 years. This fort is under control of Indian Army. Fort is still in its original physical structure. Good to visit once here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One of the oldest first in India but still in good condition as maintained by Indian Army. One can They allow to visit outer wall of the fort only and museum is open in special occasion like 15th August, 26th January. The fort is in circular shape and one can walk the entire outer wall on the walkway made on the top of the wall.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Vishal Ganpati Mandir",
      "rating": 4.7,
      "address": "Shop No. 1, Vishal Ganpati, near Maliwada, Maliwada, Ahmednagar, Maharashtra 414001, India",
      "reviews": [
        {
          "text": "\"The divine and charming Lord Ganesha is seated here. I make it a point to seek His blessings in the morning and evening whenever I'm in Nagar district. It's difficult to resist the urge to visit this sacred place – definitely a must-see.\"",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Vishal Ganpati temple radiates tranquility, resonating with spiritual energy. You can attend the Morning and Evening Aarti to experience a powerful n strong spiritual energy within you.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A very calm and pleasing place.. You get inner peace, very huge (vishal in marathi) Ganesh idol (around 10 feet approximately)  .  It's very beautiful to watch.\n\nNo need to queue to enter in temple.\n\nIt is near to old bus stand of ahmednagar..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very old temple nice to see way to Meharbaba and Dattatreya worlds biggest",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple is in between city just near to city bus stop. It is closed during afternoon. There are no eateries around. Temple is beautiful granatie structure.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mirawali Baba Dargah",
      "rating": 4.6,
      "address": "4QXP+JXQ, Kapurwadi, Maharashtra 414601, India",
      "reviews": [
        {
          "text": "Dargha of hazrat Meera wali (R.A) this dargha is famous for removing bad souls and is visited by all for peace of mind and soul. located at top of mountain and can be easily travelled by car or bike must visit dargha when came to Ahmednagar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "On the top of hill towards north-west of Ahmednagar near Warulwadi village. There's a religious shrine of Hazrat Sayyad Meera Ishaq Shah Quadri (Rahmatullahi Alaih) Popular as {MEERA WALI BABA}. According to custodians this shrine is about 5-600 years old. Two beautiful mausoleums and Mosque is Built on the top. People come here to get rid of their sorrows and pain.  Everyone's wishes are fulfilled at this place. Meera Wali Sarkar came here to Ahmednagar from Baghdad Giving the message of Islam and peace. Your lineage goes back to the great Sufi saint Hazrat Sheikh Abdul Qadir al-Gilani and after him Prophet Muhammad (peace be upon him).",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The dargah is peaceful and you will fill pleasant .\n\nDargah is located on a mountain . Car bike can go there but I would suggest you to go early in morning like 6.00 o clock or 5.30 AM . You should park your bike car at bottom of mountain and go by walking . You can have a beautiful sunrise view from the ghats of the mountain . It will take 6500 steps total going up and coming down.\n\nOne more suggestion is try going in evening after 7.00 pm . I would not say it's too safe . But you can have a beautiful view of CITYLIGHTS of Ahmednagar city . Camera cannot capture That so I didn't post phoTos . but you should go for a view . Don't go walking at evening as at some places street lights are not there as on date of my review .\n\nEnjoy 😊",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Qutub of Ahmednagar city As soon as u reach there u feel relaxed.\nSukoon hai vaha Nice place to fullfill your legal Dreams (Har jayaz tammana Puri hogi) sirf Aao to Dil se Aao nice place for health lovers park ur vehicle down n go walking or trecking through vehicle can reach at the top but u can visit there by walking n enjoying the view",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "ISKCON TEMPLE AHMEDNAGAR",
      "rating": 4.5,
      "address": "3, Kadambari Nagari Phase 4, Bhistabag, Ahmednagar, Maharashtra 414003, India",
      "reviews": [
        {
          "text": "Hare Krishn\nISKCON is the shorten form for International Society for Krihna CONsciousnes.\nISKCON devotees worship god Krishna.\n\nFour of us visited ISKCON temple in Ahilyanagar on 30 Sep 2023.Although there were not many visitors at that time, arrangements are in place to accommodate a long queue. There is a place to keep your footwear before entry . There is no fee for entry.\nThe temple is orderly, very clean and well maintained. The architecture is striking and is a combination of modern and traditional aesthetics.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hare Krishna hare Krishna Krishna Krishna hare hare ❤️🙏🙏🚩 beautiful place 🫶",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A nice holy place. With a good darden pepole come there in garden for roaming and to chill. All the main hindu festival are celebrated there",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This was my favorite place in ahmadnagar...\nI always spent my time their..\nBy devotion, service that i really like it..\n\nHare krishna hare krishna krishna krishna hare hare..\nhare ram hare ram ram ram hare hare🙇‍♂️❤",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Steeped in timeless spirituality.  Its ambiance invites contemplation, fostering a deep connection with the divine. The solitude experience while chanting Hare Krishna is Indescribable. You can sit in peace and get lost in the Spiritual Divine. This place helps  you to connect with your inner soul.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Cavalry Tank Museum",
      "rating": 4.7,
      "address": "3PCX+PMW, Iwale Nagar, Ahmednagar, Maharashtra 414001, India",
      "reviews": [
        {
          "text": "Amazing display of cavalry tanks. Tanks from war front displayed in full glory. Amazing numbers of tanks, nicely stored and maintained. Clean and green. Area maintained by army. Great place to visit. Worth taking your kids. Some tanks from WW II are also on display. Must visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit place for Army lovers  in Ahmednagar Asia's first Cavalry Tank Museum. There is spacious parking lot, well maintained garden and ample open space. Ideal for families, kids and school trips.The museum is large & require 2-3hours as it boasts various tanks from World War 1, World War 2. Other than battle tanks, there are special purpose tanks ammunition carts, VIP entourage,  armored cars, minefield sweeper, bridge builders and amphibian tanks. It also have three halls showing exhibits like tank model, cavalry history, lot of photographs, maps and war stories. It also have a souvenir shop with affordable prices Selfie points are set up at couple of places. Entry fee is ₹50 for adults and ₹25 for kids. At the entrance garden have bird cage, rabbit holes, duck and tortoise",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "\"A Fascinating Experience at Cavalry Tank Museum !\"\n\nI recently had the pleasure of visiting Cavalry Tank Museum Which is called \"Asia's first tank museum\" which is located in the heart of Ahmednagar city Inside Military Camp. It exceeded my expectations in every way. The extensive collection of tanks from various eras provided a captivating journey through Indian military history. The museum's informative displays and well-maintained exhibits made the experience both educational and enjoyable. The knowledgeable staff added an extra layer of insight, offering interesting facts and stories behind the showcased tanks. Whether you're a history enthusiast or just looking for a unique outing, Cavalry Tank Museum is a must-visit destination. My visit left me with a newfound appreciation for the evolution of armored vehicles, and I highly recommend this museum to anyone interested in Indian military history.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great Experience. Very well maintained and i formative. If you really like to know more about Tanks and armoured vehicles - this is the place. It would have been even more interesting if they had a sovenier shop.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is an open museum not far from Ahmednagar city where tanks from various counties including Pakistan have been displayed. This is open to public and there are nominal entry charges. Some of the tanks are the captured ones by our nation. Some of the tanks are from WW1 and WW2 as well. The place is very well maintained. There is also a guide available who is quite useful. There are a couple of hallways as well. One should not miss visiting this museum.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Datta Devasthan Trust",
      "rating": 4.8,
      "address": "Shree Dattatreya Niwas, Manmad Road, Adarsha Colony, Vedant Nagar, Ahmednagar, Maharashtra 414003, India",
      "reviews": [
        {
          "text": "A very beautiful and an amazing temple to visit. The peaceful environment can help one reconnect with their inner self. If you love witnessing magnificient architecture then this place should definetly be in your \"to visit\" list for spending lovely time in the mesmerizing aura of this place !!!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good place.\n\nBut car parking not available here.\n\nWe have to remove wallet,  belt, shoe's, socks  etc.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Must visit places... Peaceful and very calm",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful place.. whenever i visit nagar I come here for some peace... This place gives all the positive vibes 💝 I have a special place in my heart for this place❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai Shri Gurudev Datta.\n\nIt offers a very devine experience.\n\nFilled with peace and holiness.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "श्रीमंत सद् गुरु शंकरशेठ महाराज",
      "rating": 4.8,
      "address": "3PC3+MCG, Kotkar Nagar, Kedgaon, Ahmednagar, Maharashtra 414005, India",
      "reviews": [
        {
          "text": "Good for pray and make mind quite/peace.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Unlimited problems one solution\nOne and only Shankar Sheth Maharaj\nJai Shankar",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It’s math of Shri Shankar Maharaj. Where on every Sunday a baithak is arranged for devotees of Shankar Baba. All devotees can ask their problems and gets solutions by Baba follower.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very beautiful and lovely place jay shankar🙏❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "❤️❤️",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "BOLHEGAON PHATA",
      "rating": 4.1,
      "address": "4PV7+5FP, Bolhegaon Suburban, PHATA, Ahmednagar, Maharashtra 414111, India",
      "reviews": [
        {
          "text": "Road is not good don't have a public toilet don't have proper city bus stop",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Mostly crowded in the morning and evening as the road is full of bad patches.\nAnd the MIDC crowd contributes to it.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Roads conditions very poor.\nI have been observing since last 11 years, no any improvement in roads",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Local authorities should work on big pot holes on road, just near Ganesh chowk area is still crying from concrete road. In rainy season it becomes so tough to walk on road. Extremely bad condition.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Simple village but developing. Best place for students .in bolhegaon present school, college and senior college",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    }
  ]
}