{
  "places_with_reviews": [
    {
      "name": "Ranthi Fall",
      "rating": 4.6,
      "address": "Suwa, Uttarakhand 262545, India",
      "reviews": [
        {
          "text": "According to Census 2011 information the location code or village code of Ranthi village is 049133. Ranthi village is located in Dharchula Tehsil of Pithoragarh district in Uttarakhand, India. It is situated 15km away from sub-district headquarter Dharchula and 110km away from district headquarter Pithoragarh. As per 2009 stats, Ranthi village is also a gram panchayat.\nThe total geographical area of village is 1334.49 hectares. Ranthi has a total population of 4,932 peoples. There are about 1,043 houses in Ranthi village. As per 2019 stats, Ranthi villages comes under Dharchula assembly & Almora parliamentary constituency. Dharchula is nearest town to Ranthi which is approximately 15km away.\nThe last tehsil of district Pithoragarh, Dharchula, a valley is situated on the banks of the river Kali is nearly 95Km from district headquarter Pithoragarh. The river Kali serves as a natural border between India and Nepal. Bordering Nepal on the east and Tibet on its north, Dharchula is a mix of 3 cultures viz. Indian, Nepalese and Tibetan. Along with Hindus, one can easily find great numbers of Buddhists in this area. It is one of the halting places for the pilgrims of Mansarovar Yatra and the route consists of spectacular natural views of river Kali, waterfalls, streams and the cuisine which is specific to this particular place. You can find several camps of Army, ITBP, and SSB in Dharchula serving the nation and securing the border area from the neighboring Nepal and China. A large number of youths here is employed in defense services.\n\nDharchula is the only marketplace for the villages situated against the stream of river Kali. For banking, financial and social services the villagers have to travel a day or two to reach Dharchula. Dharchula is connected with Nepal with a foot-over bridge and people enjoy free trade and movement across the two friendly neighboring nations.\n\nOne can enjoy the mighty river Kali on the way to Tawaghat, 20Km from Dharchula. About 10Km from Dharchula there is small village Elagaad, here you can enjoy the waterfall and crystal clear stream flowing into the river Kali while having the taste of local food. A little off route towards village Ranthi will take you to a mighty waterfall which is generally seasonal, making remarkable during monsoon. While traveling to Tawaghat, one can easily see people of Nepal across the river Kali working in their fields. At Tawaghat, the confluence of river Dhouli Ganga and Kali Ganga is breathtaking. Further ahead, about 5 Km from Tawaghat, in Chirkila you can have a view of Dholiganga Dam and the lake thus created, which looks beautiful with its green waters. Nature at the best is the USP for this place and when all are worried about pollution, it is the best lap of nature for nature lovers.🌲🌿💕",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a beautiful place..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing waterfall in the world just imagine road behind the fall must visit. You'll get different kind of experience and also do local tour of ranthi.\n** it's a monsoon fall so visit between june last to September for best experience",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best tourist attraction during monsoon near Dharchula town",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful location on the way to Munisyari....Small trek and so many shops to eat Maggie and rajma chawal nearby .\n\nWe should always support those local shopkeepers as it helps the state and economy to grow.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Galati Waterfall",
      "rating": 5,
      "address": "VF6V+CF, Suwa, Uttarakhand 262545, India",
      "reviews": [
        {
          "text": "Perfect summer offbeat location .",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Gothi",
      "rating": 5,
      "address": "RF5V+H8F, Kalika, Uttarakhand 10100, India",
      "reviews": []
    },
    {
      "name": "Thapla Dharchula Dehat",
      "rating": 2,
      "address": "GIC ROAD DHARCHULA DEHAT, Thapla, Dharchula, Suwa, Uttarakhand 262545, India",
      "reviews": []
    },
    {
      "name": "Ghatkhola waterfall",
      "rating": 5,
      "address": "VG2W+RH, Suwa, Uttarakhand 10100, India",
      "reviews": []
    },
    {
      "name": "Rung Museum",
      "rating": 4.1,
      "address": "No. 1, beside Gramin Bank, Dharchula, Uttarakhand 262545, India",
      "reviews": [
        {
          "text": "The great ultimate Rung Museum is situated just opposite to the Teshil Office of dharchula\nambiance is good and well built with solid structure and solid rcc roof with all basic facilities\nIn this place you will get all the important and amazing information here\na will see and feel the cultural heritage gallery and dressing traditions and their history\na must visit place if you are in dharchula",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "You will get to know about Kumaon culture. It's just opposite to office of Deputy collector.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Behold the instruments that unfolds the story of time, patience and harmony with nature",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's a museum in the hill town of Dharchula. It is a place that houses the history and culture of the indegenous people of the area known as the 'Rung'.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's a place in Dharchula where culture of rung community is preserved",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Dobat Dharchula",
      "rating": 5,
      "address": "VHC4+745, Dharchula, Uttarakhand 10100, India",
      "reviews": []
    },
    {
      "name": "Gwalgaon Shiva Temple",
      "rating": 4.3,
      "address": "RGWP+V8J, Dharchula, Uttarakhand 262545, India",
      "reviews": [
        {
          "text": "Nice one",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Chhipla kedar dharchula",
      "rating": 5,
      "address": "RGWP+WQJ, Dharchula, Uttarakhand 262545, India",
      "reviews": []
    },
    {
      "name": "Dharchula kote view point",
      "rating": 3.8,
      "address": "VG29+XGR, Kailash Mansarovar Road, Dharchula, Suwa, Uttarakhand 262545, India",
      "reviews": [
        {
          "text": "One of the best small treks under Dharchula town .a 4km trek but took more than 3hrs. Simply wonderful❣️ must visit once",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "GooD",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    }
  ]
}