{
  "places_with_reviews": [
    {
      "name": "Shri Gopinath Mandir",
      "rating": 4.8,
      "address": "C878+8J4, Gopinath Mandir Marg, Gopeshwar, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "Gopinath Temple is an ancient Hindu temple dedicated to Shiva in Gopeshwar, Chamoli District, Uttarakhand, India. It is situated in Gopeshwar village now part of Gopeshwar town. The temple stands out in its architectural proficiency; it is topped by a magnificent dome and the 30 sq ft (2.8 m2) sanctum sanctorum, which is aessible by 24 doors.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Shri Gopi Nath Temple is situated at Gopeshwar Chamoli. It's constructed by Pandava as per archeological survey in katyuri style. It's a beautiful temple of lord Shiva in hindu religion. Whenever you visit Chardham yatra you must have to visit here when you are comming from Kendar nath. It's a winter stay place of lord Rudranath.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Not to be missed in this Dev Bhumi Area. The Shivji Murthi is very serene. Lots of historical facts related to this temple.\nHar Har Mahadev.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is one of Pancha Kedar. Face part of Vrishabha form Lord Siva is here. A local woman explained all the surroundings to us very well. This Gopinath or Rudranath temple in Gopeswar can be seen in the route via Ukhimath from Kedarnath to Badrinath. Easily accessible. Here the Government hotel is available for lodging in the meantime. Lord Siva wished to join rasalila with Krishna and the other Gopikas. That is why Siva was called Gopinath. Krishna is in the form of tree which we can see and take leaves or flowers.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best temple in Chamoli district and situated in gopeswar city.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Mata vaishno devi mandir",
      "rating": 3,
      "address": "C86C+GQX, Gopeshwar, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "This temple are located in gopeshwar , uttarakhand, india, This is lord Devi Durga temple.",
          "languageCode": "en",
          "rating": 3
        },
        {
          "text": "40 years",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    },
    {
      "name": "Phulari House - Heart in Hills",
      "rating": 5,
      "address": "Bhandari Niwas, Chamoli, Uttarakhand 246424, India",
      "reviews": [
        {
          "text": "Pleasant stay with amazing view and homely host! Really convenient for a night stay before visiting Auli and Chopta. Also perfect to spend a tranquil night in the hills! ❤️",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "One of the best property in Chamoli with various facilities. This place is very peaceful with beautiful mountain views. Kudos to Satyam for taking care of all our needs.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "The stay was just marvellous. Rooms were spacious and clean. Amazing services, ambience with all basic amenities. Would recommend to stay a night here.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Such a beautiful place, created with a lot of love and passion❤️ It's quiet, peaceful & well amidst nature and it has all the necessary services you would ask for.\nGive all your love and support to this amazing initiative :)",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "This place will always have my heart. Awesome view, had a very pleasant stay.",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Shree Rudranath Temple Gopeshwar (Sheetkalin Pujasthal)",
      "rating": 5,
      "address": "C878+F7P, Gopeshwar, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "Fourth Kedar Shri Rudranath Temple is a winter worship place located in Shri Gopinath Temple of Gopeshwar.",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Tungnath",
      "rating": 5,
      "address": "C859+RW7, Gopeshwar, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "Tungnath is another beautiful destination lying close to the mesmerizing hill station of Chopta. Situated at a height of 3680 meters above sea level, Tungnath is the highest temple in the world dedicated to Lord Shiva.\n\nThe unprecedented Himalayan view from the meadows at Tungnath temple is leave anyone is awe. The natural beauty comes to its full glory at Tungnath temple, which is also one of the famous five Panch Kedar shrines of Uttarakhand.\n\nFor someone travelling to Chopta, a visit to Lord Shiva’s abode at Tungnath is highly recommended. Generally, the pilgrimage to Tunganath is undertaken as part of the Panch Kedar trekking covering all five temples over a 170 km route (road cum trek length) starting from Rishikesh in the order of: Kedarnath, Tungnath, Rudranath, Madhyamaheswar and Kalpeshwar.",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "चतुर्थ केदार बाबा रूद्रनाथ पैदल मार्ग द्वार",
      "rating": 5,
      "address": "C8R9+MWR, NH 107A, Khalla, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "The gate is very subtle but after entering through this gate, you cannot imagine the world you will find inside it after reaching the temple of Baba Rudranath, hence do not judge the track by looking at the size of the gate. Thank you.",
          "languageCode": "en-US",
          "rating": 5
        },
        {
          "text": "Rudranath has covered a lot of road on foot but the track is very long and has not been tested yet.",
          "languageCode": "en-US",
          "rating": 5
        },
        {
          "text": "Hihh hihh",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "चंद्राकोटी",
      "rating": "Unknown",
      "address": "C8VH+P44, Unnamed Road, Khalla, Chamoli Gopeshwar, Uttarakhand 246401, India",
      "reviews": []
    },
    {
      "name": "Brahma Kamal ब्रह्म कमल",
      "rating": 4.9,
      "address": "C96C+WH, Gopeshwar, Chamoli Gopeshwar, Uttarakhand 246424, India",
      "reviews": [
        {
          "text": "Hang out\nRelaxing\nMind refresh\nRest area in lap of Himalayas\n\nSpace to stop on the way to Badrinath\n\nRest and refreshing area for groups stay their\n\nCook & eat\n\nGovt . Park on the way",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It's an artificial flower but beautiful",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "nice place",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "💓",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice place good atmosphere",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Shiv Mandir",
      "rating": 4.1,
      "address": "C84F+RGJ, Gopeshwar Chamoli Rd, Ghursal, Gopeshwar, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "Shiv mandir near by haldapani in Gopeshwar city",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Shiv mandir of Patiyala har is actually also a  Hanuman Mandir (Temple) Named Kalpeshwar Mahadev.  It was first a hanuman temple under pipal tree but local villagers collected money and built a proper temple and also a rest and waiting house behind the temple. It is very peaceful and holy place. In special occasion and festivals , local villagers organise Katha vachan (story telling of God) with Puja and aarti.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "❣️",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It is very peaceful place stablish between trees. But there is nogood parking in surrounding",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Vaitarni Mandir Samuh, Gopeshwar",
      "rating": 3.7,
      "address": "C887+9J4, Gopeshwar, Kathur, Uttarakhand 246401, India",
      "reviews": [
        {
          "text": "Good place..☺",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Soulful",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Nadda",
          "languageCode": "en-US",
          "rating": 3.7
        }
      ]
    }
  ]
}