{
  "places_with_reviews": [
    {
      "name": "Solomon's Temple, Aizawl",
      "rating": 4.4,
      "address": "Chawlhhmun, Aizawl, Mizoram 796009, India",
      "reviews": [
        {
          "text": "I visited Solomon's Temple in Aizawl last week and I was amazed by its beauty and grandeur. The temple is built on a hilltop and offers a panoramic view of the city and the surrounding hills. The architecture is inspired by the biblical Solomon's Temple and features a large hall, a sanctuary, and a courtyard.\nThe temple is open to people of all faiths and backgrounds, and there is a peaceful atmosphere inside.\nThe temple also has a museum, a library, and a cafeteria where you can learn more about the temple and its culture. I spent a few hours there and felt very refreshed.\nI highly recommend visiting Solomon's Temple if you are in Aizawl. It is a unique and memorable experience that you won't regret.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "According to Jewish tradition, the Temple of Solomon, also known as \"the First Temple\", was built by King Solomon (circa 990-931BCE) long ago on the spot where God created Adam, the first man. But the building was destroyed four hundred years later. According to the Tanakh, the Temple housed the Ark of the covenant. It says the Ark  contained the Ten Commandments and was moved from Kiriath Jearim to Jerusalem by David before being moved into Solomon's temple.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very peaceful place\nA beautiful and serene place of worship.\"\n\"The architecture of the temple is stunning.\"",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Solomon's Temple stands as one of the top attractions in Aizawl. Notably, there are no entry fees, making it accessible to all. This temple holds a rich blend of historical and religious importance, making it a must-visit site.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Solomon's Temple, Aizawl. Well architecture, peaceful ambience and large seating capacity.\nSolomon's Temple church located at hill area, fron here you can watch beautiful views. One of the main tourist  spot in Aizawl.\nVery calm and quiet place. Parking spaces available two wheelers and car normally park on building top/ roof.\nVisit hours: 10:00am to 04:30pm.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Mizoram State Museum",
      "rating": 4.1,
      "address": "PPQ8+68R, MacDonald Hill, Zarkawt, Aizawl, Mizoram 796001, India",
      "reviews": [
        {
          "text": "The museum is located at walkable distance from Chanmari and Zarkawt.This is the place where we can know about Mizoram's history and culture. The museum opening time is not uniform during the 6 working days.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "If you want to know about mizoram culture then visit this place and you can know the details of mizoram culture\n\nNice place\nBring some local person so they can explain the things\n\nMuseum 3rd floor view is very nice.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The Mizoram State museum is a good starting point for those who want to know about the local culture and history. Spread over 3 floors, numerous displays highlight the lifestyle of the local population as well as the associated history.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Every parent must send their children to Museums to understand their history and heritage.\nBecause it is far better to see things in real instead of reading in Books.\nThis is a very small museum as compared the other state museums but still it is full of interesting things.\nFrom the heritage of different tribes of Mizoram to all the bamboo and cane made things.\n\nMy favourite part is the baskets section.\nWhere I have seen that almost every type of container or a utility basket was made of bamboo or cane in tribal culture.\n\nAs it is very small so it won’t take more than 1.5 hrs if you read most the labels on the artifacts.\n\nStaff is good and helping.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice place.we will observe tradition of mizo people and how they survived and unique items used swords, rice made beer storage pots and dresses. Everything is soooo good.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Khawhpawp Falls",
      "rating": 4,
      "address": "PMFC+M9W, Lawipu Veng Rd, Aizawl, Mizoram 796005, India",
      "reviews": [
        {
          "text": "It is a nice place, once you reach the falls otherwise the surroundings are not so well maintained.\n\nUnless you reach before noon, you will not get good shots as in the late afternoon, it starts getting dark, and you do not feel so safe. Maybe it is a trait for big city dwellers, but it is a fact.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice place to visit but the water was not very clean. You'll have to trek for around 15 min. to reach the waterfall. The structure of waterfall, specially the water coming down between the two Rocks looks really beautiful. The best part is...the place is a bit isolated so you'll not find a lot of people there.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It's very beautiful place in Aizawl.\nA large amount of water comes by this way of falls. But the rote way is little bit confusing, after reaching the place you need to go by walk around 500m which is little risky in raily days or monsoon time. Otherwise the natural beauty is very beautiful & enjoyable.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A lot of plastic waste in the waterfall\n\nMost beautiful beautiful place\nSilent\n\nThe Way is not suitable for small children , old age and overweight person\n\nVery very steepy narrow way down",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A must go place if you are travelling to Aizawl! 10+ kms.\nI can go by bike and taxi.\nMust take bathing cloths.\nThere is a small (moderate) traking to the waterfall.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Lalat Park",
      "rating": 3.9,
      "address": "Republic Vengthlang, Aizawl, Mizoram 796001, India",
      "reviews": [
        {
          "text": "Best water park in Aizawl\n\n3 swimming pools available for different ages.\nWaterslide is good enough.\n\nGreat place for kids to enjoy holiday and have fun.\n\nThere are different kind of fun stuff in here.\n\nRs. 300 per person.\n\nOpen for Tuesday to Sunday.\nClose for Monday.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Amazing experience and having fun all of items,, especially for children..",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Nice place to spend time with family. The area was enlarge recently and now it is better than before",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Lalat park the only amusement park within aizawl city\nRecently open water park and entry is reasonable 300 per head.\nGreat for family\nIt's open on Sundays",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "The only legit waterpark in aizawl. Could be better in many ways. Overall a good experience.",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "KV Paradise",
      "rating": 4.1,
      "address": "QPFG+MVM, Durtlang Rd, mel-5, Zion Veng, Aizawl, Mizoram 796025, India",
      "reviews": [
        {
          "text": "The place is actually a tomb, of a beloved wife and a loving son: KV is their family name. But I felt good that they were allowing people to visit here, maybe with some fee. Though it was not properly maintained, then too worth visiting 👍🏽",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "KV Paradise is the modern day Taj Mahal of Aizawl. It is a monument that speaks of a man's love for his wife, who died in a car accident. When Khawlhring's wife Varte died in an accident in 2001, he decided to build a memorial for his wife near his house. The memorial is around 45 minutes' drive from the main city and a few minutes away from Durtlang Hills. Incidentally, it also happens to be on a beautiful slope facing Aizawl city.\n\nIt is a must-see place in Aizawl.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "As a tourist I simply can say disappointing place. There is nothing to see or to do. Still one can get a very good view of aizawl from the height. Paying Entry fee of Rs.30 is not worth. Avoid if u can.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It is located at Dartlang hills at Zion Veng, Aizawl.Excellent natural view, very pleasant environment Excellent scenic structure in a pollution free zone under a clear and blue sky full of white clouds. Surrounding is lush green hilly landscape full of birds but less habitat of humans",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "As the place was built in the memory of Mrs Rosangpuii by her husband and here you can find several of her clothes and other accessories like shoes and photos of her and their children.\nAlthough the place was built to stand for a long time, due to lack of proper maintenance the place have worsened significantly. The fountain is no longer functioning and looks like septic water for mosquitoes, some windows have cracked and the structures have their pieces missing. There's not much to see here especially with the fountain being broken.\nThe road leading to the memorial is extremely bad and rough. One also needs to pay 30 rupees just to get inside. I wouldn't recommend this place if you want to be amazed but the view is nice and the photos, clothes and shoes are quite interesting.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Leitan South Presbyterian Church",
      "rating": 4.5,
      "address": "ATC - Doordarshan Road, QP9Q+8FR, Durtlang Leitan, Aizawl, Mizoram 796025, India",
      "reviews": [
        {
          "text": "Beautiful church, airy with good natural lighting.. The courtyard in front is spacious and easily accessible with plenty of room to hold a fairly good crowd, as in a wedding!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A church situated at a quite and convenient place for worship and spiritual edification.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place! Build my Spirit,my Soul and my Body. Teach me to be one with Christ",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the Best church environment in Mizoram",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Medium size church with seating capacity of about 800",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Rangvamual Presbyterian Church",
      "rating": 3.9,
      "address": "QM4W+652, Aizawl, Mizoram 796009, India",
      "reviews": [
        {
          "text": "May god bless the church 🙏",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "SUPER Aizawl",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "the place is so holy",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Lovely place",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "may god bless",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Tuikual North Presbyterian Church",
      "rating": 4.2,
      "address": "PPJ7+GM7, Aizawl, Mizoram 796001, India",
      "reviews": [
        {
          "text": "One of the most unique design Church here in Aizawl",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Approaching is enable for wheelchair",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This place is for the love of God",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I am Presbyterian too",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Ramhlun Presbyterian Church",
      "rating": 4.3,
      "address": "Ramhlun South, Aizawl, Mizoram 796012, India",
      "reviews": [
        {
          "text": "I love being in that church I can worship God all day",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Many people incorrectly called the church as Ramhlun South Presbyterian Church. However, since it is the original one, there was no north or south when it was established. Thus the name is simply Ramhlun South Presbyterian Church.\nThe location is at the heart of the neighborhood and it is large enough to hold pastorate conferences, presbytery and even the Synod. However, parking facilities is not available which is the deciding limitation.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ramhlun Venglai Presbyterian Church & Vestry...sorry I don't know much about Ramhlun Veng...Peoples are good & the location as well",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "still buliding but i have the old picture of this magnificent Strucrure.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A holy place yet very fine building. Many other church programs were held and yes it is a blessed place.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Upper Republic Presbyterian Church",
      "rating": 4.3,
      "address": "Upper, PPC9+GXP, Republic Rd, Republic Veng, Aizawl, Mizoram 796005, India",
      "reviews": [
        {
          "text": "This a church where people of religious interest visit in Sunday.This place is amazing.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of a greatest church in Aizawl.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Feeling Devine",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Under construction",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A hmun a rem, parking pawh a nuam👍🏻",
          "languageCode": "und",
          "rating": 4.3
        }
      ]
    }
  ]
}