{
  "places_with_reviews": [
    {
      "name": "Ajanta Caves",
      "rating": 4.6,
      "address": "Maharashtra 431117, India",
      "reviews": [
        {
          "text": "Ajanta Caves are a set of 30 Buddhist caves, some of them dating a few centuries BC, and the site is an awesome historical place to visit; and if you are not tired after going up and down stairs by the time you visit most of the caves, you can still hike up more stairs on the other side of the river to have a panoramic view of them, and also of the river and waterfall, that are active during the wet season. I got there at opening time (9AM) and didn’t have to wait, except for the shuttle bus taking you 5km to the restaurant and caves.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lovely place, with rich history. Everything is very conveniently located within walking distance of each other. There are steps to climb up and down, elderly please be mindful. The caves with paintings are exquisite. Take a guide to know the details. The guide charges are higher than any other place I’ve been to, so if you don’t take a guide listen to the descriptions in YouTube before coming to see the caves",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A wonderful place to visit. 27 Caves. Some are incomplete. The complete caves have excellent statues, paintings, carvings on pillars, doorways ...\nThe caves are in a semicircle on a range of hills. A stream flows at the base of the hills. It would be very nice to spend an evening during the monsoon here,",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Explored Ajanta Caves, mesmerized by ancient Buddhist artistry. The intricate carvings and vibrant murals transported me to a bygone era, capturing the spiritual essence of the site. Truly awe-inspiring!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Worth visiting this Marvel from 8th century AD. Try taking the right trail from 1-16 caves and then if you have energy, go for the left wing. Visiting in the morning is better as there would be a smaller crowd. It is very hot during summer. Do carry water, fruits or anything less to keep you hydrated.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ajantha Caves Reflection",
      "rating": 4.5,
      "address": "Ajanta Ajanta, Bus Stand, Thana, Maharashtra 431118, India",
      "reviews": [
        {
          "text": "Must visit this place with your family and friends. It is very important to know our culture and history. I prefer wearing shoes and caps as there is lots of walking but you have to remove shoes before entering each cave so it can be troublesome. I would recommend wear footwear in which you can walk easily and can remove it easily too. There are people who carry Senior citizens ( paid) on a chair where 4 men lift it from all four sides. There are monkeys so don't eat while roaming. Washrooms are available. Almost 2-3 hours are required to visit all the caves. Ample parking is also available. There are restaurants, shops for souvenirs, eatables, etc. You have to travel from main entrance from the provided bus (4km) to reach caves. ₹25 for non ac and ₹30 for ac buses per head for every ride. Entrance ticket, cave entrance tickets and bus tickets are all different. Best feeling is that after walking for so long during exit you find vendors selling fresh fruits eating those give you a heavenly feeling.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good management by ASI. Entry Fee is only Rs 40 per person. All the caves are well maintained. There is provision of drinking water opposite Cave No. 12 and also Cave No. 30. There is Battery operated car for a payment of Rs 30 per person. The gardens are good. Overall ambience is excellent.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The visit to the Ajanta Caves was a mesmerizing journey through India's rich cultural history. The intricate rock-cut architecture and vibrant ancient paintings were beautiful. The knowledgeable guides enhanced the experience, providing fascinating insights into the significance of each cave.\n\nPrice particulars at the venue:\n1) Vehicle parking charge: ₹50\n2) Amenities charge: ₹ 15 per person.\n3) Bus charge: ₹ 30 for AC and ₹ 25 for regular bus. It is a 4 km distance to the caves.\n4) Cave entry charge: ₹ 40 per head.\n\nFacilities:\n* Cafeteria and clean restrooms at the start of the caves\n* Steps and ramp to the caves and even a Dholi (chair lift) is available (at extra charge) for those who can not climb.\n* Camera is permitted, but cannot use flash on certain caves.\n\nIf you want meaningful visit with blend of art, history, and spirituality, then the Ajanta Caves should be on top of ur bucket list...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a very good place for students and teachers to get knowledge of the old era.\n\nThe starting point is only a few steps away from the main road. But from that starting point caves are almost 5km away and you can take your own vehicle to that place.\n\nThe service of MSTRC is too bad while taking you back to the starting point, as you have to wait for 45 mins to 1.5 hours in the line.\n\nThe government has kept a way to the bus station from the market, which is too narrow.\n\nApart from the above it is too good, and you should visit this place to get a good adventure of old days.\nFew caves do not have anything. But few are too good.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ajanta Caves are one of the greatest achievements in ancient Buddhist rock-cut architecture. Ajanta represent an important of art, architecture, painting & socio-cultural, religious history of society in India. If you visit with Family please carry water bottle & go with shoes. You need climb so many steps. It is very good place for kids to know our history.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Upper View Point Ajanta Caves",
      "rating": 4.6,
      "address": "GPX3+4CW, View Point, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "Excellent view point to watch entire Ajanta Caves and also adjacent waterfall marks (should be an excellent view point foe waterfalls during monsoon!!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice view , can walk down near to caves through steps going down , experience like expedition.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "From here you can photograph the whole canvas, with the surrounding terrain of the cave. The whole cave trail looks kind of horse shoe shaped. You can get the feeling of how that cave has been made from the ajanta hills. An arc shaped view point with metal railing offers you to get photograph of yourself with the whole cave trail. From here you can also observe the bus point and can realize that these caves is above that point.\n\nYou can climb down from here to the bridge and enter the caves. We had already booked online ticket from the govt website. Though the trail has numerous steps but its easy to climb down as its steps are of low height. You can get guide also but not required.  Through thus path you can get a glimpse of a path near to the middle view point. Have courage, carry water bottle and climb down. It took us around 20mins to climb down. But never try to climb up from cave to the upper view point. Thats impossible, which  will left you panting.\nFrom the main road, you need to take left to reach this view point. Though roads are okay, and wide enough for four wheeler but its single road. We hired car from aurangabad.  We left the car with belongings at this point and asked him to reach the car parking area of ajanta caves, which is nearly 22km from this point. We climb down.\nIf you just visit this as view point and reach main car parking of the cave.  Then you need to travel in their green bus through forest, from car parking to bus stand of the cave. Then climb up a little slope to reach cave 1.\nIf you climb down you will enter at tge middle of the caves after crossing the bridge.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place ro view the Ajanta caves from a vantage point from top. This viewpoint can be accessed by travelling from Ajanta village. I was staying at Aashiyana homestay near Balapur on Jalgaon- Aurangabad highway. From this place it is 7 kms. The road was good and i reached in 12 minutes. There is ample parking space and the area is quiet. There is no arrangement for any canteen Or food stall so carry your foodstuffs and water.\nFrom this view point you can walk down to the caves ( cemented steps) in 20 minutes. The view becomes even more beautiful when you reach the waterfall view point. This is an adventurous route and suggested for younger persons or fitter persons. Coming back same route usually takes 30 minutes. The viewpoint access opens early at 8 am and  closes at 5 pm for going'down. Mondays the viewpoint is open but you cannot go down as caves are closed on Mondays.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Eagle eye view of Ajanta Caves. Spectacular and soothing experience. Nearly 400 stairs to step down to reach waterfall. Best in rainy season. Carry your food and water.  3 hours enough. No entry fees. Better to reach at 9 am to avoid crowd.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ajanta Cave",
      "rating": 4.7,
      "address": "HP22+XVX, caves, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "Cave 1 was built on the eastern end of the horseshoe-shaped scarp and is now the first cave the visitor encounters. This cave, when first made, would have been in a less prominent position, right at the end of the row. According to Spink, it is one of the last caves to have been excavated, when the best sites had been taken, and was never fully inaugurated for worship by the dedication of the Buddha image in the central shrine. This is shown by the absence of sooty deposits from butter lamps on the base of the shrine image, and the lack of damage to the paintings that would have happened if the garland-hooks around the shrine had been in use for any period of time. Spink states that the Vākāṭaka Emperor Harishena was the benefactor of the work, and this is reflected in the emphasis on imagery of royalty in the cave, with those Jataka tales being selected that tell of those previous lives of the Buddha in which he was royal.\n\nThe cliff has a steeper slope here than at other caves, so to achieve a tall grand facade it was necessary to cut far back into the slope, giving a large courtyard in front of the facade. There was originally a columned portico in front of the present facade, which can be seen \"half-intact in the 1880s\" in pictures of the site, but this fell down completely and the remains, despite containing fine carvings, were carelessly thrown down the slope into the river and lost.\n\nThis cave (35.7 m × 27.6 m)[115] has one of the most elaborate carved facades, with relief sculptures on entablature and ridges, and most surfaces embellished with decorative carving. There are scenes carved from the life of the Buddha as well as a number of decorative motifs. A two-pillared portico, visible in the 19th-century photographs, has since perished. The cave has a forecourt with cells fronted by pillared vestibules on either side.These have a high plinth level. The cave has a porch with simple cells at both ends. The absence of pillared vestibules on the ends suggests that the porch was not excavated in the latest phase of Ajanta when pillared vestibules had become customary. Most areas of the porch were once covered with murals, of which many fragments remain, especially on the ceiling. There are three doorways: a central doorway and two side doorways. Two square windows were carved between the doorways to brighten the interiors.\n\nEach wall of the hall inside is nearly 40 feet (12 m) long and 20 feet (6.1 m) high. Twelve pillars make a square colonnade inside, supporting the ceiling and creating spacious aisles along the walls. There is a shrine carved on the rear wall to house an impressive seated image of the Buddha, his hands being in the dharmachakrapravartana mudra. There are four cells on each of the left, rear, and the right walls, though due to rock fault there are none at the ends of the rear aisle.\n\nThe paintings of Cave 1 cover the walls and the ceilings. They are in a fair state of preservation, although the full scheme was never completed. The scenes depicted are mostly didactic, devotional, and ornamental, with scenes from the chalukya corutstories about Persian ambasidar in pulikeshin 2nd corut tells the relationship btw chalukya empire and Persian Empire Jataka stories of the Buddha's former lives as a bodhisattva, the life of the Gautama Buddha, and those of his veneration. The two most famous individual painted images at Ajanta are the two over-lifesize figures of the protective bodhisattvas Padmapani and Vajrapani on either side of the entrance to the Buddha shrine on the wall of the rear aisle (see illustrations above). Other significant frescoes in Cave 1 include the Sibi, Sankhapala, Mahajanaka, Mahaummagga, and Champeyya Jataka tales. The cave-paintings also show the Temptation of Mara, the miracle of Sravasti where the Buddha simultaneously manifests in many forms, the story of Nanda, and the story of Siddhartha and Yasodhara.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Special Attraction - Has two masterpieces of the world of painting - Padmapani and Vajrapani.\n\nCave No. 1 is one of the finest monasteries (35.7 X 27.6m) of its kind and no other monastery at Ajanta has been so handsomely ornamented.\n\nThe Mahayana monastery consists of an open courtyard, verandah, a hypostylar hall, sanctum with an antechamber and cells. The sanctum houses Lord Buddha in preaching posture with Bodhisattvas on either side and five disciples and a wheel flanked by deers at the base of the pedestal suggests symbolically Buddha's first sermon at Sarnath.\n\nThe doorframe and pillars were beautifully carved. Every inch of this cave was originally painted, even the pillars and the sculptures being no exceptions. The ceiling painted with geometrical, floral and faunal depictions, creats an impression of a decorative shamiyana held above. The walls painted mostly with the Jataka tales and scenes related to Lord Buddha's life.\n\nThe cave contains some of the masterpieces of the world of painting namely Padmapani and Vajrapani.\n\n(Source - Archaeological Survey of India. Aurangabad Circle)\n\nFootwear is not allowed inside the caves and it will be a good idea to wear sandals which can easily be worn /removed outside each cave. Flash photography not allowed inside.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visited July 2018.\nThis is one of the 'better' caves at Ajanta and is the first cave - it therefore gets a bit crowded, the number of people allowed in at a time is limited. Also no flash photography. Really nice paintings. See the attached pics, one pic worth a thousand words as they say.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ajanta caves are around 110km away from Aurangabad and you may need to take either a government bus or a private vehicle to reach the caves. There is a govt volvo bus which starts around 9am in the morning which is dedicated to only the Ajanta tours. If you miss this bus then you ll have to take any bus which goes bhusawal or Jalgaon. All buses in these routes halts at Ajanta leni. The route from aurangabad to Ajanta is very bad and be ready to cover 110km in at least 3 hours in worst case 4.5 hours. The place is big enough and you may have to walk alot. The important caves we have is 1,2,10,16,17 and 26th. Rest of the caves are not so beautiful so if you r running out of time you can go to these specific caves and skip the rest.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "All the synonyms of amazing are not enough to describe the place honestly!!!! Plz plz do take a guide and visit all caves... without a guide u would not understand what this has within it!!!!!! Those detailing are not comparable",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ajanta Caves Waterfall",
      "rating": 4.5,
      "address": "HP22+349, Aurangabad, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "It's just beside caves. You need to go for a little bit hiking. Be prepared, wear good quality shoes.\nDon't buy anything from local sellers. Sellers try to loot you.\nView is amazing. I guess waterfall is only available in rainy season. So at bottom first confirm that there is water in waterfall or not visit only if there is water.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best places to visit as tourist destinations for outing with family and friends. Best time to visit here is during monsoon season, when there is free flow of water from waterfall due to rain. There you can listen to the silent music of waterfall. If you came here to explore the Ajanta caves, don't skip this place thereafter. Loved the place and natural beauty. ❤️❤️ Satisfying experience. 👍🏼👍🏼",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great spectacle of nature. Must visit if you're visiting the Caves. A short walk up the hill through well made stairs and trails will take you to the waterfall. Waterfall Not accessible directly. Do not go into the water. Dangerous, fall hazard.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Visited 2018.\nWish I could rate it more than 5 stars. Of all the caves I've seen this is the one I like the best. Almost perfect - the size, so well-proportioned, carvings, paintings, Buddha carved into the stupa, the stone ribs of the ceiling. I can't put what I felt in words; see the attached pics. A must visit - more than once. Just after the monsoons would be the right time, this place is so green. And maintained well. Photography might be better in the pm, the cave is a bit dark.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Official place to loot money from people,\nIf you are planning to visit Ajanta caves please carry 150rs per person because the charger are as follows\n\n10rs/person gate entry\n30rs car parking\n20rs/person Non AC Bus\n30rs/person AC Bus\n40rs/person Caves entry\n20rs/person Non AC Bus(return charges)\n30rs/person AC Bus(return charges)\n\nAbove are the basic and fixed charges you have to pay at Ajanta.\n\nCaves are awesome are wonderful to watch",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Ajanta Waterfall",
      "rating": 4.4,
      "address": "GPGW+RFG, Ajanta, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "A beautiful waterfall, with areas further upstream which you can swim in. Nearby to the Ajanta Caves.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It’s a epic of ancient time engineering",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Leading Agree solution 👌 👍🏼",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Its a good water fall",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Ajanta Cave 16",
      "rating": 4.6,
      "address": "HM3X+9XR, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "Cave 16 occupies a prime position near the middle of site, and was sponsored by Varahadeva, minister of Vakataka king Harishena (r. c. 475 – c. 500 CE). He was a follower of Buddhism.[182] He devoted it to the community of monks, with an inscription that expresses his wish, may \"the entire world (...) enter that peaceful and noble state free from sorrow and disease\" and affirming his devotion to the Buddhist faith: \"regarding the sacred law as his only companion, (he was) extremely devoted to the Buddha, the teacher of the world\". He was, states , probably someone who revered both the Buddha and the Hindu gods, as he proclaims his Hindu heritage in an inscription in the nearby Ghatotkacha Cave. The 7th-century Chinese traveler Xuan Zang described the cave as the entrance to the site.\n\nCave 16 (19.5 m × 22.25 m × 4.6 m) influenced the architecture of the entire site. Spink and other scholars call it the \"crucial cave\" that helps trace the chronology of the second and closing stages of the entire cave's complex construction. Cave 16 is a Mahayana monastery and has the standard arrangement of a main doorway, two windows, and two aisle doorways. The veranda of this monastery is 19.5 m × 3 m, while the main hall is almost a perfect square with 19.5 m side.\n\nThe paintings in Cave 16 are numerous. Narratives include various Jataka tales such as Hasti, Mahaummagga and the Sutasoma fables. Other frescos depict the conversion of Nanda, miracle of Sravasti, Sujata's offering, Asita's visit, the dream of Maya, the Trapusha and Bhallika story, and the ploughing festival. The Hasti Jataka frescos tell the story of a Bodhisattva elephant who learns of a large group of people starving, then tells them to go below a cliff where they could find food. The elephant proceeds to sacrifice himself by jumping off that cliff thereby becoming food so that the people can survive.These frescos are found immediately to the left of entrance, in the front corridor and the narrative follows a clockwise direction.\n\nThe Mahaummagga Jataka frescos are found on the left wall of the corridor, which narrates the story of a child Bodhisattva. Thereafter, in the left corridor is the legend surrounding the conversion of Nanda – the half brother of the Buddha. The story depicted is one of the two major versions of the Nanda legend in the Buddhist tradition, one where Nanda wants to lead a sensuous life with the girl he had just wed and the Buddha takes him to heaven and later hell to show the spiritual dangers of a sensual life. After the Nanda-related frescos, the cave presents Manushi Buddhas, followed by flying votaries with offerings to worship the Buddha and the Buddha seated in teaching asana and dharma chakra mudra.\n\nThe right wall of the corridor show the scenes from the life of the Buddha. These include Sujata offering food to the Buddha with a begging bowl in white dress, Tapussa and Bhalluka next to the Buddha after they offering wheat and honey to the Buddha as monk, the future Buddha sitting alone under a tree, and the Buddha at a ploughing festival. One mural shows Buddha's parents trying to dissuade him from becoming a monk. Another shows the Buddha at the palace surrounded by men in dhoti and women in sari as his behavior presents the four signs that he is likely to renounce. On this side of the corridor are also paintings that show the future Buddha as a baby with sage Asita with rishi-like looks. According to Spink, some of the Cave 16 paintings were left incomplete.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited Jul 2018.\nRight in the center of the site, it probably influenced the architecture of the entire site. \"monastery and has the standard arrangement of a main doorway, two windows, and two aisle doorways\". Numerous paintings. Difficult to photograph, light is poor.  See attached pics, pano is a bit wonky.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "WORLD FAMOUS CAVES IN  LOCATES INDIA  AMAZING BUILT IT",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice column pillars and an unique dome structure can be seen in cave no 16.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Caves are in very bad and dark condition. The Ajanta Caves are generally agreed to have been made in two distinct phases, the first during the 2nd century BCE to 1st century CE, and a second several centuries later.\n\nThe caves consist of 36 identifiable foundations, some of them discovered after the original numbering of the caves from 1 through 29. The later-identified caves have been suffixed with the letters of the alphabet, such as 15A, identified between originally numbered caves 15 and 16. The cave numbering is a convention of convenience, and does not reflect the chronological order of their construction.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ajanta Caves View",
      "rating": 4.5,
      "address": "MTDC Caves view restaurant At. Pimpaldari, Post, Balapur, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "Special Attraction - Waghur river and shaded pathways.\nAfter completing the tour of the caves, you can cross the metal foot bridge on Waghur river.\n\nThe pathway is covered with trees and from between them, you can get good views of the caves.\n\nThe pathway will lead you to the ticket counter, after crossing one more metal bridge",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Most famous painting from Ajanta caves",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "At this point you can view all caves",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Non Ac bus fare is 20 per head and Ac bus fare is 30 per head to reach Ajanta caves from shopping  plazza. Ticket for Ajanta cave is 40 per head. There are total 26 caves.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I love this place...\nFeel the beauty of nature\nNarrow River and the caves\nAnd the Lord Budha ..\n\nBudham. Sharnam gachhami.. 🙏",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "अजंठा लेणी मुख्य प्रवेद्वार",
      "rating": 4.8,
      "address": "HP8G+R3, Thana, Maharashtra 431118, India",
      "reviews": [
        {
          "text": "Nice Place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Place to Study and Practice the Teachings of Shakyamuni Buddha. Right next to 2 Temples of Hinduism and Islam!",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "Has he come to the kitchen?",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Middle View Point ( Ajanta Caves )",
      "rating": 4.6,
      "address": "HP22+J7W, walk way from view point to Caves, Maharashtra 431117, India",
      "reviews": [
        {
          "text": "The Ajanta Caves are a group of rock-cut Buddhist caves that date from the 2nd century BC. It’s amongst the finest group of historically important ancient Indian and Buddhist art, sculptures and rock cut architecture. There are so many fascinating caves it’s hard to pinpoint exactly which is the best, but Caves 1 and caves 4 are two that should not be missed as they contain amazing pillared halls with stunning capitals on the pillars.\n\nIf you’re reasonably fit, then it’s worthwhile climbing all the way to the end to see all the caves. Once you climb up high enough, the views of the surrounding hills are stunning. Ajanta caves are truly worthy of being designated UNESCO sites.\n\nIf you’re not an Indian, then be prepared for a queue of the locals wanting photos with you.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing place for the cultural tourist. Would advise to carry a light bagpack and bottle along with slippers. Several caves require removal of footwear, one should also keep hydrated and definitely visit all the caves.The caves were carved out between second century to sixth century and still they are in very good condition. The basalt rock cut caves makes the visitor feel as if they are touching a piece of history. The paintings in the caves are damaged in many places but wherever they are visible, one can visualize the beauty and glory of the paintings in all its splendor. Our guide explained the fine nuances of the paintings and that helped us to make a deep connect with them. The colors are still vibrant as natural colors of gemstones were used. The brilliant technique of painting faces that turn in accordance with the angle of the viewer was absolutely mind blowing. The vivid sculptures are still in good condition and a delight to observe and appreciate. I loved my visit to Ajanta caves though the road from Aurangabad to the caves was dusty and in poor condition. If that is improved, then the tourist footfall to Ajanta will increase manifold.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sculpture, Painting, Beautiful Carvings all available at this place. You will appreciate their Patience, Hard work & Continuity of Work !\nCheck Photos & See My YT Channel- BPS Chauhan VLOGS",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Drove down to Aurangabad from Mumbai to experience the majestic world first hand. I stayed at Treebo Royal Kourt which is a 3 hrs drive from the Ajanta caves. I did not mind the 7 hours drive from Mumbai and 3 hours drive from the hotel  to the caves simply because when the company is good the journey becomes as beautiful as the destination itself. And the destination! My, oh, my! What craftsmanship, what a stunning view, what a marvel!! It has rightfully earned its place as a UNESCO Heritage site. It helps if you have read about the place beforehand so as to interpret the paintings and sculptures better.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ajanta Caves is located at Aurangabad Dist in Maharastra State in India.\nThis is place is famous for Sachi Stupa of Buddist .You can access twelve caves for Buddist Monk and peaceful opinions of Buddhism .\n\nYou can reach by public transport from Jalgaon Station taken near about 2.5 hrs journey or can reach by Aurangabad it will take 3 hrs journey by car.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}