{
  "places_with_reviews": [
    {
      "name": "Khwaja Gharib Nawaz Dargah Sharif",
      "rating": 4.6,
      "address": "111, Dargah Sharif, Khadim Mohalla, Diggi Bazaar, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Ajmer Dargah is a spiritual place and a very peaceful space. It is said that when the Sufi Saint Mohiddin Chishti Sahab turned 114 years old, he shut himself up for 6 days and gave up his life. Hazrat Khwaja Moin-Ud-Din Chishti is considered to be the propagator of the Islamic religion in India who has spread the religion of Islam. Ajmer Dargah is visited by thousands of people who believe in different religions. It is believed that every wish made with pure heart and intention at Dargah gets fulfilled.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visiting this dargah is a part of spiritual upliftment that brings you peace and tranquility. However,I am completely disappointed with the so called khadims of this dargah who only care about money and that's it. They will give you only the slightest of recognition only if you give money, buy chaadar or flowers. Right from the start of the entrance till the mazaar is all about money. Before you enter, you have to pay for footwear, as soon you enter, people will heckle you to buy chaadar and what not, when you visit the shrine, the khaadims will command ( not request, not before, nothing)you to offer money as though without money your prayers will remain unanswered. Deeply disappointed with the state of affairs and administration of the dargah",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ajmer Dargah is a place of deep spiritual significance. The atmosphere is filled with devotion and peace. The architectural beauty of the dargah and the serene ambiance create a profound experience.\nThe Sufi music adds to the soulful environment. Visiting Ajmer Dargah is not just a religious journey but a cultural and spiritual one too",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "\"Khwaja Gareeb Nawaz Dargah: A sacred site at Ajmer Sharif, exuding spirituality, peace, and divine energy. Highly recommended pilgrimage.\"",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My visit to Ajmer Sharif was a spiritually enriching experience. The aura of the shrine is undoubtedly divine, welcoming people of all religions. However, finding parking can be a challenge due to narrow lanes, and the market area can get quite crowded. The availability of private parking for a reasonable fee of Rs 100 was convenient. It's worth noting that while most priests seek donations, there's no obligation. The walk to the shrine adds to the pilgrimage feel. But considering the crowd be watchful of your belongings, kids etc.\n\nOne need to cover the head and place slippers randomly at some place (no proper arrangement). Please go with a free mind and don't get bogged down by priests asking for donations.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Seven Wonders Park, Ajmer",
      "rating": 4.3,
      "address": "Gaurav Path, Vaisali Nagar, Ajmer, Rajasthan 305004, India",
      "reviews": [
        {
          "text": "Average place. Can be visited once. Tickets of visits are very low but expensive to reach the place. Better to take a rest at the hotel if you are  visiting in summer.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "7 Wonders are very famous in the world, Everyone knows that for the people visiting Ajmer, this place represents their little love.\n\nThe park has been well maintained. This park is quite affordable for the people coming to ajmer to rest for a while.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ajmer Seven wonder Park it is a so beautiful Park and there are 7 wonder available in this park like Taj mahal. Paramid.\nEffiel Tiwer. Statue of libarty. Pisa minar. Colesium. Ishu Murti",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The park features stunning replicas of the Seven Wonders of the World, allowing visitors to marvel at these iconic structures without traveling across the globe. From the grandeur of the Taj Mahal to the mystique of the Great Pyramid, each replica is meticulously crafted to capture the essence and beauty of its original counterpart.\n\nThe replicas in the park are built with attention to detail that is truly awe-inspiring. Visitors are transported to different parts of the world as they stroll through the park, marveling at the intricate architecture, ornate carvings, and majestic structures.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice places for clicking photos. Please note all 7 wonders are in small size if you are expecting a full size replica you will be disappointed. But if you are ok with a small replica this is fine. A total of 7 wonders are included. Kids will definitely enjoy this place.\nThe park",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Adhai Din Ka Jhopra",
      "rating": 4.4,
      "address": "FJ4G+33J, Ander Kote Rd, Lakhan Kothri, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "My favorite spot in all Ajmer. The little part of the mosque that is still standing is really beautiful, with the inscriptions on the walls still very much visible. Each column is different, and the ceilings are eye catching. Also, the goats climbing the walls added a bit more to the total experience. And it is free. It is actually worth the walk through the bazaar",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Okie its very very beautiful architecture for our country i was mesmerizing by the fine craft work on walls that how could such prisizin can be done in that decades and 5 times namaz is aslo prayerd here... Nd there is a story that it was build in dhai din on that it was named adhai din ka jhopda  nd was built by jins so you can visit nd yes if its winter thAn don't forget ur sweaters nd water bottle also",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Place was great. According to local people this was built in two and half days by angels. The place have a different vibe. The only thing that is disturbing are the local photographers continuously poking you to get your picture clicked. There is no ticket to this monument.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beyond the Dargah of Khwaja Muin-ud-din Chishti, on the town outskirts, are the extraordinary ruins of the Adhai-din-ka-Jhonpra mosque. According to legend, construction in 1153 took only 2½ days. Others say it was named after a festival lasting 2½ days. It was originally built as a Sanskrit college, but in 1198 Mohammed of Ghori seized Ajmer and converted the building into a mosque by adding a seven-arched wall covered with Islamic calligraphy in front of the pillared hall.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "1200 ad masjid built by qutb ud din aibak .\nMake out of big rocks carved,big pillars and quran ayats are carved outside entry gates .\nNamaz are offered here again . It was captured by Hindu rulers back in time .after the built .\nAnd now it's the site under a s.i .\nBut its said by locals as , it was built by jinns . I don't know about this fact  but , the architecture here is very unique. And mysterious.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Taragarh Fort - Ajmer",
      "rating": 4.3,
      "address": "Taragarh Fort, Taragarh Rd, Taragarh, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Taragarh Fort is a fortress built upon a steep hillside in the city of Ajmer in the Indian state of Rajasthan. It was constructed in the 8th century by Ajayaraja Chauhan (721–734) and it was originally called Ajaymeru Durg.\n\nThis fort was known for its strength and strategic importance. First islamic attack on the fort was made in 724, during reign of Chauhan King Durlabhraj I, who bravely fought muslim armies under caliph Hisham ibn Abd al-Malik. In this war, King Durlabhraj I did not receive support from fellow rajput kings. This war witnessed India's second Jauhar conducted by queens of King Durlabhraj I, along with other females in Taragarh Fort. The war is also known for sacrifice of 7-year old Chauhan Prince Lot, who bravely fought muslim armies, and laid down his life.\n\nPrithviraj, son of Rana Raimal of Mewar and elder brother of Rana Sanga, captured Taragarh fort of Ajmer during the end of 15th century, after slaying Governor Mallu Khan. The fort is also called Taragarh, named after Prithviraj's wife Tarabai. It remained under control of Mewar, and later Rana Sanga granted it to Karamchand Panwar",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "There is nothing to see here. No structures and such. Only parts of the old walls. There is a Dargah which is more like a new one. We walked down and enjoyed it more than the fort itself.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "1-Location:\n\nTarahgarh Fort is situated in Ajmer, Rajasthan, India.\n\n2-Historical Origin:\n\nBuilt in the 8th century by Ajaypal Chauhan, the founder of Ajmer.\nHolds a significant place in history due to its age and strategic location.\n\n3-Architectural Style:\n\nReflects a blend of Mughal and Rajput architectural styles.\n\n4-Strategic Importance:\n\nPlayed a crucial role in historical battles, particularly during conflicts between the Marathas and the Mughals.\n\n6-Key Structures:\n\nBhim Burj: A prominent structure housing a massive cannon.\nRani Mahal: A palace with intricate artwork, showcasing the architectural grandeur of the fort.\n\n6-Panoramic Views:\n\nOffers breathtaking panoramic views of the city of Ajmer and the surrounding Aravalli Range.\n\n7-Tourist Attraction:\n\nA popular tourist destination due to its historical significance, architectural beauty, and scenic views.\n\n8-Cultural Heritage:\n\nContributes to the cultural heritage of Rajasthan, representing the rich history and architectural prowess of the region.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Taragarh fort is located rajisthan Ajmer taragarh fortress built upon a steep hill side in the city of Ajmer. It was construsted  in the 8 the century by ajay chauhan and it was originally called ajaymeru durg",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome place. You can view full city from above I was there for more about two hours and that was a very great feeling up there. I was amazed that how the king of that time built that big castle up there it was a great work of architecture.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Soni Ji Ki Nasiya Jain Temple",
      "rating": 4.5,
      "address": "Prithivi Raj Marg, Dumada, Dargah Bazar, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Wonder of a place which has a Jain temple and also a display of Jain epics crafted out of 1000's of kilos of gold! Never knew such places existed. This was a total surprise for me as I happened to visit Ajmer on my way to Jodhpur. Entry ticket of 10 rupees. You can walk around the depiction and take a very nice view if you arrive around the opening time, which was 10 AM when I visited. Totally worth the visit. Jain glory is shown in gold!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This little known Soniji Ki Nasiyan, a Jain temple dedicated to Rishabhadev, is the real Gem of Ajmer city. It is also known as Golden Temple and Red Temple. The main attraction here is a two-storied Swarna Nagari Hall behind the temple. It is a museum housing astonishing replicas of the life story of Rishabhdev. Entire collection here is gold plated. It took 25 years to build and 1000 KGs of gold is used in making. Its interior is adorned with mineral colour paintings, Belgian glass and stained glass work.\nThere is a replica of Ayodhya city where Rishabhdev was born and Prayag city where he renounced the world. There are also replicas of his life events like his birth, dance of Apsara, his penance, his Kesh Lochan, breaking a yearlong fast at Hastinapur, his preaching at \"Samovasaran\" etc. The museum is open for all and it is a must visit place in Ajmer.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Soniji Ki Nasiyan, also known as the Jain Temple in Ajmer, is a must-visit for anyone interested in Jainism, architecture, or intricate craftsmanship.\n\n**Pros:**\n\n* **Architectural Marvel:**  This late 19th-century temple stuns visitors with its red sandstone exterior and ornately carved interiors.\n* **Swarna Nagari (City of Gold):** The main chamber is a highlight, featuring intricate gold leaf work adorning wooden figures depicting important figures in Jainism.  Some accounts say over 1000 kg of gold were used!\n* **Jain Art and Depictions:**  See detailed carvings and paintings portraying stories and teachings from Jain scriptures.\n* **Peaceful Atmosphere:**  The temple complex offers a serene and spiritual environment.\n* **Photography Allowed (with Restrictions):** Capture the beauty of the temple's architecture and artwork (but be sure to follow any photography guidelines).\n\n**Cons:**\n\n* **Limited Hours:** The temple has specific visiting hours, so plan your trip accordingly.\n* **Dress Code:** As with most religious sites in India, there might be a dress code requiring modest clothing (covered shoulders and knees).\n* **Large Crowds:** The temple can be crowded, especially during festivals or weekends.\n\n**Overall:**\n\nSoniji Ki Nasiyan is an architectural gem and a significant pilgrimage site for Jains. Even for non-Jains, the intricate craftsmanship and peaceful atmosphere make it a worthwhile visit.\n\nHere are some additional tips for your visit:\n\n* **Check Timings:**  Confirm opening and closing hours before your visit.\n* **Respectful Clothing:**  Dress modestly to respect the religious significance of the site.\n* **Guided Tour (Optional):** Consider hiring a guide for a deeper understanding of Jainism and the temple's history.\n* **Photography:** Be mindful of any photography restrictions and avoid using flash.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful place. All the statues and sculptures are made with fine art. Because of this place we realised the value of are the past people respect.\nThe golden colour shows richness of this gallery.\nYou can able to observ the hole art from 1st & 2nd floor this is the special thing about this place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Only the museum is open to the public. Just a one time visit.\nNo cloak rooms available, we had to carry our luggage all the three floors.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Ajmer Fort",
      "rating": 4.3,
      "address": "Naya Bazar, Naya Bazaar, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "This ancient Akbar's Fort has now been converted into Government Museum. There are several sections in the museum displaying different exhibits. The collection here is limited and the entry fee is also cheap. The architecture of the palace is simple. Good place to visit when in Ajmer.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Not too much attractive place.\nTicket rates are little bit high.\nSome items of the museum are placed at different palace and there are different rates for that.\nYou can spend here half hour is enough.\nSome statues are maintained in very good condition.\nNot too much rush here.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Ajmer Government Museum, housed within the former Mughal era palace, offers a glimpse into Rajasthan's history and culture.\n\n**Pros:**\n\n* **Historical Significance:** The museum building itself has historical value, having been used by Mughal emperors.\n* **Diverse Collection:** Explore artifacts from various periods, including:\n* **Mughal Era:** Paintings, weaponry, and decorative items from the Mughal period.\n* **Rajputana Artifacts:** Explore items showcasing the Rajput era, including clothing, pottery, and sculptures.\n* **Archaeological Finds:** Discover artifacts related to Ajmer's ancient past.\n* **Affordable Entry Fee:** Enjoy a historical and cultural experience at a reasonable cost.\n\n**Cons:**\n\n* **Mixed Reviews on Collection:**  Some visitors find the collection good, while others might find it lacking extensive exhibits or detailed descriptions, especially compared to larger museums.\n* **Limited English Information:** Descriptions for exhibits might not be comprehensive in English.\n* **Varying Opinions on Upkeep:**  Reviews on the museum's upkeep can vary, with some mentioning well-maintained displays and others suggesting areas for improvement.\n\n**Overall:**\n\nThe Ajmer Museum can be a good option for history and culture enthusiasts, especially if you're interested in Rajasthan's past.  The historical building, diverse collection, and affordable entry fee make it a decent choice. However, be prepared for potentially limited English information and potentially mixed reviews on the comprehensiveness of the exhibits.\n\nHere are some additional things to consider:\n\n* **Manage Expectations:** Don't expect a massive museum with in-depth displays.\n* **For History Buffs:** If you have a keen interest in Rajasthan's history, you might find the collection more engaging.\n* **Combine with Adhai Din Ka Jhonpड़ा:** This historical monument is located near the museum and makes for a good combo visit.\n\nI hope this review helps you decide if the Ajmer Museum should be on your itinerary!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The fort is well maintained, the gallery has beautiful artifacts, the place is quiet and peaceful. It would add perks if they allow us to explore the top floor also",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ajmer fort or also known as Akbar's palace and Museum.it is good for knowing the history of King and their relation specially this place indicates the friendship of Akbar and Maan Singh",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sawariya Seth Mandir",
      "rating": 4.8,
      "address": "FJ3W+6G6, Vinay Nagar, Pal Bhichala, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Very nice place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Hindu temple",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "Amazing Unique Unique Scenic Temple has broken all records in temple income in Rajasthan",
          "languageCode": "en-US",
          "rating": 4.8
        },
        {
          "text": "Khatu Shyam",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Buland Darwaza",
      "rating": 4.6,
      "address": "73/20, Dargah Bazar Rd, nr. Choti Deg, Khadim Mohalla, Diggi Bazaar, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Its the main entrance gate to the famous Ajmer Sharif dargah.Its a strong and tall darwaza (door) serving as a monument in itself,a part of history. During my visit i found it very crowded as usual. If you are not comfortable in big crowded places then avoid visiting on weekends.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Buland darwaza entry gate of khwaja Garib Nawaz dargha it's a huge gate and very old it is showing the architecture of old Islamic culture of India",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Finally visited the place after a long long wait . Feeling blessed",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Akbari Masjid (Masjid/Religious place)\nDargah Ajmer Rajasthan India\n\nNear by...\n\nAkbari Masjid is the oldest mosque. It is a nice big mosque. It is close to the high door of the dargah. Jumma time is",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "India's most favorite Dargah of Khwaja Garib Nawaz to visit with family and friends.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Delhi Gate",
      "rating": 4.3,
      "address": "FJ6H+V24, Peer Mitha Gali, inside Delhi Gate Road, Dargah Bazar, Ajmer, Rajasthan 305001, India",
      "reviews": [
        {
          "text": "Sign of wealthy & prosperous history of indian subcontinent capital.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Over crowded, no police to handle crowd or traffic",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Fully traffic area in ajmer,",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sai Baba Temple Ajmer",
      "rating": 4.4,
      "address": "CJHH+6J4, Ajay Nagar, Ajmer, Rajasthan 305003, India",
      "reviews": [
        {
          "text": "One of the best temple in Ajmer. It is beautifully constructed with white marbles surrounding with Aravali Hills. The view from temple is just amazing. There is free Facility for keeping your luggage & shoes. Mobile photography is prohibited inside the temple. Temple is facilitated with others temple also. Lord Shiva temple is also there so one can get blessings of both. Gardening is also beautifully maintained. Night view is more promising. White marble in night view is just amazing. There is also not much of crowd though. One can have peaceful blessings. Overall a good visit to get blessed and have some peaceful moments.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Visit for a unique spiritual experience.\nBeautifully constructed, vast, spacious and clean.\nIn evenings or during less crowd, you might find birds walking or hopping instead of flying inside the main hall! I was amazed to see the pigeons walking with their bipedal gait traversing the entire hall!\n🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good temple of Shirdi saibaba",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice spritual and devotional place...Huge Respect for Sai Baba 🙏...But Pandit Ji has rude Behavior....Devotees who visited for sai baba darshan felt bad when pandit ji talked with them in arrogant way...Sorry if it hurts",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Sai Baba Temple in Ajmer provided a serene and peaceful atmosphere for devotees. The spiritual vibes were calming, and the temple itself was well-maintained. However, I found the crowd management to be a bit challenging, especially during peak times. It would have been helpful to have more organized queues and information about the temple's history. Overall, a decent place for those seeking spiritual solace, but some improvements could enhance the overall experience.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}