{
  "places_with_reviews": [
    {
      "name": "Jagatpita Shri Brahma Mandir",
      "rating": 4.6,
      "address": "Brahma Temple Rd, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "Rajasthan’s well-known religious city, Pushkar is the most amazing and prominent and is the home of the rare Brahma Temple in the world. It is one of the very few religious temples devoted to Lord Brahma all across the globe. Named the Jagatpita Brahma Mandir, this temple addresses the entire city and is the reason behind the rapid boost of Pushkar Tourism in Rajasthan. Construction of this temple dates back to the 14th century while Indian Mythology believes the origin of this temple took place 2000 years back. Settled close to the sacred Pushkar Lake, the temple is a highly prominent landmark of the city with a large no. of tourists flocking here, especially during the occasion of Kartik Purnima.\n\nBrahma Temple Pushkar as written in the sacred scriptures of the Hindu religion, Padma Purana, Lord Brahma once came across a demon named Vajranabha, killing and torturing people. Viewing such atrocities, the Lord slew the demon with a lotus flower (his special weapon). By doing so, some petals of the flower fell at three places on the ground. All those three spots have today turned into the three sacred lakes, which are today known as the Jyestha Pushkar, the Madhya Pushkar, and Kanishka Pushkar.\n\nLater when the Lord made his visit to earth, he started with the preparations of a Yajna (fire Sacrifice) at the Jyestha Pushkar Lake, to perform the Yajna undisturbed by the demons, Lord Brahma created a chain of hills surrounding it. However, his wife Savitri was not available for Yajna and was disruptive of the proceedings.\n\nOn this, Lord Brahma requested Lord Indra to send him a suitable consort to complete the Yajna. When Gujar’s daughter, named Gayatri was finally sent to take the seat next to Brahma as his wife, Savitri arrived. Feeling disturbed, she cursed Brahma that the lord would never be worshipped by anyone. Later on, she permitted his worship only in Pushkar. This entitled that there’s only Brahma Temple that is worshipped\n\nEntry timings in the temple:\nSummers: 5:30 am to 9 pm (*closed in the afternoon from 1 to 3 pm)\nWinters: 5:30 am to 9 pm (*closed in the afternoon from 1 to 3 pm)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I visited Brahma Temple in October, and the experience was absolutely divine. The serene ambiance, intricate architecture, and spiritual energy make it a must-visit destination. The temple staff was welcoming, and the priest's guidance added a profound touch to the visit. The well-maintained premises and the soothing rituals create an atmosphere of tranquility. Whether you're a spiritual seeker or an architecture enthusiast, Brahma Temple offers a soulful journey.\n\nThere is a good market area along with variety of food stalls, which can be explored for satisfying one's taste buds. Clothes, bags, hand-loom items for adults and kids are available.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One & the only famous Brahma temple in the world. This temple has a serene atmosphere. Devotees from all over the world visit this place. On the back drop is the lake.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The oldest Brahma temple in India makes the place even more interesting for visitors and worshippers alike. Peaceful and holy, the temple is a blessing for everyone who seeks Brahma’s presence around them.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Brahma Temple, Pushkar  situated at Pushkar in the Indian state of Rajasthan, close to the sacred Pushkar Lake to which its legend has an indelible link. The temple is one of very few existing temples dedicated to the Hindu Creator-God Brahma in India.. I visited Brahma Temple in March and the experience was absolutely divine.There is a good market area along with variety of food stalls, which can be explored for satisfying one's taste buds. Clothes, bags, hand-loom items for adults and kids are available.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pushkar Mandir",
      "rating": 4.6,
      "address": "FHQ5+J6M, Choti Basti, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "The Pushkar Temple, also known as the Brahma Temple, is a serene and spiritually rich sanctuary nestled in the heart of Pushkar, India. Its architectural simplicity harmonizes beautifully with the sacred aura it exudes. Dedicated to Lord Brahma, the creator in Hindu mythology, this temple holds immense significance and allure for pilgrims and tourists alike. The tranquil ambiance and the resonating chants create an atmosphere conducive to introspection and prayer. The temple's picturesque setting by the Pushkar Lake adds to its charm, providing a serene spot for reflection and devotion. Whether you're a devout pilgrim or a curious traveler, the Pushkar Temple offers an immersive experience into India's spiritual heritage.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lovely experience visiting the Pushkar Mandir. The ghats surrounding the Pushkar Sarovar at the centre are teeming with devotees most of time and we were lucky to catch the maha Aarti taking place there during the Pushkar Annual Fair during Nov 2023. Quite a soulful experience 🙏🌹",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the highly recommend  place  for visit..not require any introduction.\nwhat a mesmerizing spot for tourist attraction 👌 👏..this place is related to spirituality . lots of people come here ..take bath and do their own pooja .If we are walking few steps then go for Bramha temple 🛕.  world first and only last temple. no one forget of Bramha mandir Darshan.  if you want to go Savitri mata temple ..2.5 km away. There are so many temples surrounding the puskar lakes. One of the best pilgrims place. Weather during winter  is the best to visit. Hotels are available at affordable rates here. Transport facilities are also available through out the day. Must try sweet dish Malpuva...though it is sweeter but hotness will make you eat more and more.  Overall a complete journey to enjoy divine blessings with beautiful mountains surrounding the lakes.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One and only Lord Brahma’s temple in India.\nNeed government attention in keeping the area clean and should be well managed.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Brahma temple Pushker is the only temple of lord Brahma in India and it has an interesting story which will be told to you during your visit. A religious and spiritual place.\n\nVisit to Pushker is not complete without a visit and pooja at Pushker Sarover.\n\nLot of shops for purchasing souvenirs.\nDon’t miss to eat Rabri Malpua during your visit.\n\nAlso check for some rose gulkand and rose water as Pushker is also famous for it.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Savitri Mata Temple",
      "rating": 4.6,
      "address": "FGJW+C4J, Kharekhari Rd, Ganahera, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "It was a fun cable car ride experience. We were waiting in line for about 30 minutes. There is a beautiful view at the top. Lots of langur monkeys. But there was a lot of garbage. We walked down and it was an unpleasant experience because there were heaps of garbage everywhere on the hill. It’s sad, especially this knows as a sacred place for Hindus.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple of Mata Savitri is situated at the hill top around two km from Brahmaji temple. One can go to this temple by climbing stairs which are around 900 in number or one can go up by Ropeway. From top of the hill, one can see Pushkar and around areas and enjoy the place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple is on top of the hills with amazing view of Pushkar city and they provide ropeway facility with 165rs both ways..\nNote - Temple remains close from 12 noon to 2pm so plan accordingly..\nThe entry way and garden area are very well maintained.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must Visit Place in Puskar. Ropeway facility is available here.Rs. 165 for to and fro. Stairs are also there but not everybody can use those smoothly. Railings are not there. You will find many leaf monkeys also there , specially on top  near temple premises.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Located on top Ratnagiri hills of Aravalli range Puskar. Dedicated to Savitri or Saraswati maa. Can be reaçhed  by climbing 1100+ steps or by ropeway .\nRopeway charging ₹165/person  up/down.\nOn reaching the temple, the views are breathtaking Pushkar city can be seen with a bird eye view even ajmer city also visible from here.\nThose who want to burn some extra calories, try the steps..",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "पुष्कर मंदिर",
      "rating": 4.6,
      "address": "Under narsingh tample, FGPX+XG4, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "The only temple for the creator of the world as per Hinduism ie vishwa pita Brahma ji temple along with deity Gayatri mata...\nPhotography is restricted.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple of Brahma Ji is the most famous temple of India. Every one wanted to go Pushkar,and worship there. This is just near the Holy Savitri Sarovar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place While visiting this place it gave me happiness and internal peace. A must visit place.\nSuggestion:- If you want to really see this place than take 4-5 days so u can see every small things and places",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place to find inner peace and solution of problems related to life.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very famous temple for Lord Bhrama",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Brahma Ghat",
      "rating": 4.4,
      "address": "Main Market Rd, Badi Basti, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "My visit to Brahma Ghat was an enlightening experience, made truly exceptional by the profound insights shared by our knowledgeable guide. The spiritual and mythological significance of each ritual and the rich history of the Ghat came to life through their narrative. Without a doubt, having a guide enhanced the depth of my understanding, making the visit not just a sightseeing trip but a journey into the heart of Hindu philosophy. The peaceful ambiance of Brahma Ghat, combined with the wisdom shared by our guide, created a spiritual tapestry that left an indelible mark on our soul.\n\nThe guide may compel you to donate or do the puja rituals. If you are not aware of the rituals then I suggest not to go ahead. Regarding donation you can even obtain receipt for income tax exemption too.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Brahma Ghat by Pushkar Lake is a big deal for Hindus and a cool spot for tourists too. Lord Brahma made the lake, which adds to its charm. People come here to bathe in the sacred water, believing it purifies them spiritually. It's peaceful and pretty, especially at sunset. Tourists love it for the stories, colors, and peaceful vibes. Brahma Ghat is not just a place; it's like a magical sanctuary where you can feel India's spirituality and history all around you.\nAccording to the Padma Purana, Lord Brahma was in search of a suitable place to perform a Yagna when the lotus was fell from his hand on the Earth. Miraculously a lake sprang up at the place where the Lotus touched the earth and Brahma considering it a good omen decided to perform his Yagna and named the town Pushkar",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A very pious and religious place at Pushkar, the place associated with Lord Brahmaji. On this earth this is the only place where Lord Brahma’s temple is there and he is worshipped. The Brahmsrover is the lake which came up with the blessings of Bhrahmaji. The city of Pushkar is surrounded around this lake only.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a surreal experience to be here and enjoy the magic of Indian culture and tradition.\n\nThousands of people throng this religiously significant Ghat in Pushkar and its an amalgation of our entire beautiful country.\n\nA must visit place for every one.\n\n100% recommended.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The environment here is very serene surrounded by so many temples while taking a PARIKRAMA of The Pushkar river, The facility over here is well maintained secure rope lines for taking a dip of Pavitra Pushkar river and don’t forget to visit the only Brahma temple.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Rangji Temple",
      "rating": 4.6,
      "address": "FHR4+44Q, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "A big and beautiful temple.Favourite of south indian people.I love the way they keep the sand natural there.it was a beautiful experience to walk over there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Rangji temple is one of the best attractions of Pushkar. It's situated in the market at a walkable distance. The temple is big, spacious and old, around 170 years of age, built in south Indian style. This is dedicated to lord Viahnu or Vutthal. There are two temples with same name. This is old one, while new one is also beautiful and grand.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful old temple. Must visit. You can do Tulsi archana, the priest did it very well and it was divine.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Fantastic south indian style temple at pushkar with south pooja deities",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is a beautiful South Indian temple in Pushkar. Both the temple and the idol are nice.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Narsingh Ji Ka Mandir Pushkar",
      "rating": 4.1,
      "address": "FHQ2+23H, Choti Basti, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "Here is the temple of Brahma Ji in Pushkarji and the greenery in the valleys between Budha Pushkarji and the mountains and the environment here is very nice, Pushkar lake is also worth seeing.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This temple near on Phushar Sarovar and Famous temple Bharma temple and good temple on Shri Narsingh Mandir",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "A very beautiful temple dedicated to the Lion God Narasimha in Pushkar. As you climb up a small flight of stairs, the beautiful idols reveals itself and instantly you find peace in your heart. The play street below disappears and seems distant. The chaos of normal life recedes and a tranquility dawns.\n\nIt is well worth a visit and definitely worth it.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Climb a steep set of steps to enter this temple devoted to the fourth incarnation of Vishnu. Could have been cleaner.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice spiritual place. Beautiful temple.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Gau Ghat",
      "rating": 4.4,
      "address": "FHQ3+C6R, Main Market Rd, Badi Basti, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "Gau Ghat is One Of The 52 Ghats Around Pushkar Lake and Very Famous.\n\nyou'll Feel Peaceful Environment here\nAmazing place to sit alone.\n\nYou need to Take Off your Shoes and Dress Appropriately.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One of the Oldest ghat of Pushkar. A lot many people came here to have bath and perform other hindu rituals.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very calm place very beautiful place you can Take holy bath there of pure and holy river. There are so many pigeon,you can fed them also. There are almost 52 ghats and famous ghat is Gau Ghat Gau means Cow. You can see the fishes also into water.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The place is good and also referred as manasarovar(bramhasarovar).\n\nBe aware of the frauds called as bramhin pandits who offers you Puja by saying it's free and at the end it comes into picture saying the donations. they will also ask about ur grandparents and offer Puja to them at end they ask to donate food meals for bramhin. Which will loot your pockets.\n\nWhen they come to you offering prayers just say NO. Be careful and enjoy the time in the ghat. Visit at evening Aarti time",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Gau Ghat is one of the 52Ghats within Pushkar Lake, the Holiest Lake in India.\n\nWhen we visited it seemed to be one of the most popular Ghats for locals and tourists alike.\n\nWalking though the Ghats you can feel the energy of this incredible place.\n\nSome of Ghandi's ashes were spread here in Gau Ghat. Along with many Prime Minister's of India.\n\nThis is definitely a very special place.\n\n**Remember to take your shoes off and dress appropriately**",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Budha Pushkar mandir",
      "rating": 4.4,
      "address": "GH9P+78F, Pushkar Bypass Rd, Nedaliya, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "One of the very ancient lake where its believed that Shri Ram had performed the last rites of his father King Dasrath. A nice peaceful and relaxing place with peaceful atmosphere and several small temple of several Gods and Godess are constructed here by red sandstone.\nUnfortunately, its not well maintained and rarely anyone visits here. You'll see total silence around. Not even villagers or any nearby shops either.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Budha (old) Pushkar lake and temples in Pushkar, Rajasthan, India.\n\nSee attached videos of the lake to get an idea.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One of the very ancient lake it's is believed that Shri Ram had performed the last rites of his father King Dasrath here. A nice peaceful and relaxing place with divine atmosphere and several small temple of several Gods and Godess are constructed here by red sandstone.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place to see. The structure made looks great. Stairways with a big water body and the scenic beauty of mountains . You can sit there and relax and enjoy the beauty of the place. Good place for photography too. The place is also not much crowded.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Budha Pushkar is famous for offering to ancestors. Ajmer to Pushkar road with very nice and beautiful valleys",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Varaha Temple",
      "rating": 4.4,
      "address": "FHR4+8RH, in front of new bus stand, Choti Basti, Pushkar, Rajasthan 305022, India",
      "reviews": [
        {
          "text": "Ancient Varaha temple. A small one, without much crowd.\nMain deity is Varaha swamy, the incarnation of Lord Vishnu as Wild Boar. The main deity and Utsava vigrahas are very lively.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is one of the most rare temples, of the varaha (boar) incarnation which lord Vishnu adopted to bring back earth from the clutches of the demon Hiranyaksha, who had sent it down to hell. The idol is unique: You can see the snout of the boar, with a silver disk representing the earth on it, symbolizing gow lord Vishnu sniffed until he found earth and brought is back up. The temple is managed by a private family since generations, with no assistance from the government. Strange, given how rare this temple is, and such an interesting part of Indian mythology!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is one of the oldest temple. Local Authorities should, and must look after the surrounding areas of this temple as it is least maintained",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's an old and temple of Varah avatar of Vishnu, in the form of a wild boar. Varaha is generally listed as third in the Dashavatara, (the ten principal avatars).\n\nAccording to a legend, Lord Vishnu turned himself into a wild boar and came to earth, to kill the monstrous demon Hirnayaksh, who was going to destroy the whole universe. Varaha slew the demon and retrieved the Earth from the ocean, lifting it on his tusks and restored Bhudevi to her place in the universe.\n\nThis temple was initially built in the 12th century by King Anaji Chauhan but was destroyed by Aurangzeb. It was then rebuilt in the 18th century by Raja Sawai Jai Singh II of Jaipur.\n\nThis temple is considered to be the most ancient temple in the city. The temple has 2 feet white idol of Lord Varaha in the sanctum sanctorum. Various idols including Shiva, elegant carvings, life-size statues of door men and gold-styled pillars depicting Garuda, the bird are situated within the temple.\n\nThere is a family that lives inside, nice people.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Varaha temple is behind the new bus stand in Pushkar, Rajasthan, India",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}