{
  "places_with_reviews": [
    {
      "name": "Sawaliya Ji Temple",
      "rating": 4.7,
      "address": "JPRM+RFH, Bor Kheri, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Nice temple, very well managed and beautifully built! 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lucky to blessed with such devine places",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful and attractive temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai shree Sawliya",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🙏🏻🙏🏻",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Aawari Mata Mandir",
      "rating": 4.4,
      "address": "Adarsh Colony Park 2, Adarsh Colony, Raza Colony, Adarsh Nagar, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "It is believed that the temple is having special powers to heal people and the devotees visit this temple to heal themselves from many ailments which are chronic and became incurable for years.\nTraditionally, it has been visited by people seeking a cure for \"paralysis and polio\".\n\nThere's is a beautiful garden behind the temple For those seeking a moment of introspection or simply an escape from the hustle and bustle of daily life, the garden behind the Avari Mata Temple is a haven.✨\n\nThis temple is situated near the road where chairs are available for seating and for drinking 🚰 water there's water cooler which might be need maintenance time to time.\n\nThere's also an ancient tree is situated which is also worshipped by the locals during some festivals and they decorate the entire temple at that time.\nAnd I realised that there's some need of cleanliness around the temple as it is a holy place of Goddess.✨",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Avari Mata Temple is a religious place in Nimbahera Rajasthan located in Adarsh ​​Colony",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small but beautiful and nice temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A temple of good feeling and the place of Maa ❤️",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "JK Temple",
      "rating": 4.7,
      "address": "JMPJ+63M, Nimbahera - Chittorgarh Rd, Karamchari Colony, JK Colony, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Temple is so nice. Surrounded by a garden and fountains. Awesome and peaceful atmosphere to visit.\nThe main attraction of the temple is the festival of 'Janamashtami' the decoration of the area is so beautiful, so many cultural event and jhankis created on that day. Must visit for the great enjoyment.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful architecture. Visit this temple either in early morning or in the evening.\nClean and properly maintained.\nThe main attraction of the temple is the festival of Janamashtami the decoration of the area is so beautiful, so many cultural event and jhankis created on that day. Ample parking space for cars and bike.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Such a peaceful temple and beautiful murti of deities. It also has lawn, fountains and open sky around the temple area. Cleanliness is maintained.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice and peaceful temple with garden view Must visit atleast once. The place can be made more beautiful with more lights and water fountains working and running.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful temple located in Nimbahera City, the atmosphere here is very accessible, a beautiful place to visit in Nimbahera.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Amba Mata Mandir, NIMBAHERA",
      "rating": 4.8,
      "address": "JM4V+FH9, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "I visited the Amba Mata Temple in our town many times from my childhood, and the experience was truly serene and uplifting everytime. Nestled in a great soothing location, the temple is surrounded by lush green gardens that add to the overall tranquility of the atmosphere. The beautiful architecture of the temple itself is a testament to the rich cultural heritage and craftsmanship.\n\nAs for Mata ji's temple, the spiritual aura was palpable. The ambiance inside the temple was serene, providing a perfect setting for devotees to connect with their spiritual beliefs. The intricate details in the temple's interior design added to the overall sense of reverence.\n\nOne notable feature that stood out was the provision of free parking services. This made the visit hassle-free, allowing devotees and visitors to focus on the spiritual experience without worrying about parking concerns.\n\nAnother commendable feature at the Amba Mata Temple is the inclusion of a lift, providing accessibility for those who may face challenges navigating the stairs.\n\nThe water availability at the temple was commendable, ensuring that visitors had access to clean and refreshing water during their visit. This thoughtful provision is especially appreciated, considering the spiritual significance of the temple and the often warm weather.\n\nThe cleanliness of the temple premises was impressive. The well-maintained surroundings reflected the dedication of the temple authorities to create a hygienic and pleasant environment for worshippers and tourists alike.\n\nThe Amba Mata Temple goes beyond being a spiritual haven; it offers practical amenities for various occasions. In front of the temple, a garden provides a picturesque setting suitable for weddings and other functions. This versatile space allows visitors to book the area for special events Like wedding, adding a touch of sacred charm to celebrations.\n\nMoreover, the availability of well-maintained washrooms, including advanced facilities, enhances the overall experience for visitors. The temple's attention to practical details, such as providing event spaces and modern washroom facilities, demonstrates a commitment to catering to the diverse needs of worshippers and those seeking to celebrate significant moments in this sacred setting.\n\nIn conclusion, the Amba Mata Temple is a gem in our town, offering a perfect blend of natural beauty, architectural splendor, and spiritual sanctity. The free parking service, consistent water availability, and the commitment to cleanliness make it an ideal destination for devotees and tourists seeking a peaceful and enriching experience.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This Mandir has pretty good scenery. Nice place to hangout with friends and family. The place has greenery all around. Mandir committee is working hard to make the place more attractive and beautiful.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Famous temple in local area. Most visited on sunday by all local people. Surrounded by garden thats why the view is so awesome. Nowadays it is constructed  again with new architecture. It is a common picnic spot for student and other peoples. Fair is also held here in Navratri-days. Must visit place in those days.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Famous AmbaMata Mandir at Nimbahera.. Surrounded by Awesome Garden and Sculpture...😍😍😍",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nimbahera is a Hindu religious site situated on a small hill outside the city, located on the Neemuch Nimbahera road.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "SANWALIYA JI",
      "rating": 3,
      "address": "JP54+C7, Peepaliya Kalan, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Shandar Meep",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    },
    {
      "name": "Sawliya temple(सवालिया मंदिर)",
      "rating": 4.2,
      "address": "HMV6+8H6, Rani Khera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Shri Sauliya Ji Mandir Ranikhera",
          "languageCode": "en-US",
          "rating": 4.2
        },
        {
          "text": "Seth Sanwariya Seth among Seths 🙏",
          "languageCode": "en-US",
          "rating": 4.2
        },
        {
          "text": "Ranikhera",
          "languageCode": "en-US",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shree Kallaji Rathore Mandir",
      "rating": 4.5,
      "address": "JMGP+V3C, R K Colony Street No.1, Chhotisadri, Ahir Nagar, Kamdhaz Nagar, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "So good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Me",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is the temple of 1008 sheshavtar KALLAJI. I believe in him and thought to update the picture",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jay shree kalyan",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Spiritual and emotional temple. Famous in Rajasthan.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Gypsum reclaimer",
      "rating": 3.7,
      "address": "MM4C+MXP, Wonder Cement Plant Rd, Baroli Ghata, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "There is no reclaimer anywhere.",
          "languageCode": "en-US",
          "rating": 3.7
        },
        {
          "text": "Shoes",
          "languageCode": "en-US",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Radha Krishna Mandir, Nimabhera",
      "rating": 4.5,
      "address": "Radha Krishna Temple, kailash nagar 1, JK Colony, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Awesome temple of lord #radha_krishna\n#JK_Temple_nimbahera\nVery nice looking, well maintain park, beautiful view in night...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful mandir complete in white marble and the garden is also very beautifully maintained by JK Cement Nimbahera",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Radhe Radhe\nJai Shri krishna\nThis is a most beautiful, religious and Devotional temple. Nearby surrounding is too beautiful and nicely clean i.e. the garden created here is very large and too beautiful. I like this place very much and appreciate its beauties. At night this place is looking more fantastic. Best place to visit here with family and friends👭👬👫. Too wonderful place.\nRadhe Radhe... 🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shri Radha Krishna temple at JK Cement Works Nimbahera, Rajasthan is a spectacular sight with a majestic marble temple built amidst well-maintained lush green gardens, decorated by fountains and many varieties of flower. The temple in itself offers a very serene and peaceful experience with beautiful life-like idols of shiv ji, shri radha krishna and bajrang bali. Along with being a place of faith and worship, it is also a major tourist attraction in the cities of Nimbahera and Chittaurgarh and other neighboring areas in Rajasthan. Being situated in the residential colony of JK Cement Works, it offers a beautiful and peaceful place for residents (and others) to come and spend some peaceful time and pray to the almighty.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a very nice temple, made by JK cement, it is made from marble, it is very good artwork.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Ahinsa Circle Statue",
      "rating": 4,
      "address": "JM9G+89V, RSEB Colony, Nimbahera, Rajasthan 312601, India",
      "reviews": [
        {
          "text": "Ahinsha circle read limestone se bana he",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice circle",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Veri nice",
          "languageCode": "en-US",
          "rating": 4
        }
      ]
    }
  ]
}