{
  "places_with_reviews": [
    {
      "name": "Victoria Memorial",
      "rating": 4.6,
      "address": "Victoria Memorial Hall, 1, Queens Way, Maidan, Kolkata, West Bengal 700071, India",
      "reviews": [
        {
          "text": "Its a majestic landmark with impressive architecture and well-maintained gardens. The museum inside offers a fascinating glimpse into India's colonial history. However, some exhibits could benefit from more interactive elements. The audio guide enhances the experience, but a few areas lack proper signage. Overall, a splendid place for history enthusiasts and a picturesque spot for a leisurely stroll.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Victoria Memorial in Kolkata is a majestic ode to British rule's memory in India. Open from 10 am to 5 pm, its  architecture and gardens visitors. Constructed in memory of Queen Victoria, it reminds the city's colonial past and architectural prowess. Housing a museum showcasing India's history during the British era, it offers a captivating journey through time. A visit to this  landmark is a must for history enthusiasts and tourists.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place has my heart.The place is super hygienic and also the ambience is very soothing and good.Although there is a problem regarding the ticket counter. Only two counters are working and online payment is not available .If it is available too, the crowd is too much that we have to wait in a queue for the same.They provide different tickets for entering the garden and for the memorial.The garden is well maintained and it is good for having a good evening and for dates also.Inside the memorial we can see many things regarding British rule and also there is first floor showing the freedom fighters and the story of independence. Overall the place is very good and a must visit place in kolkata",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Greatest heritage of all time… amazing wonder… the architecture and the beauty of the sculptures are just amazing….also it has big museums inside…where you will be able to know and watch the ancient methods and weapons used in king times….\n\nAlso the surroundings are just superb and you can just sit and have a peace of mind.\n\nGarden area is big and also has a water reservoir beside and you can sit beside it for a calm atmosphere.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The place is one of the best historical monuments in Kolkata, SORRY say India.\n\nThe garden outside the hall is very beautiful.\nI especially want to take attention towards the cleanliness of the venue.\n\nThe spot is also a big contributer in economy as 'the spot of foreigners' we can call it.\n\nNo worry to say just looking like a wow.\n\nCome and give a visit for only 50/- rupees.\nThe place is worth it.\n\nThanks.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Dakshineswar Kali Temple",
      "rating": 4.7,
      "address": "Dakshineswar, Kolkata, West Bengal 700076, India",
      "reviews": [
        {
          "text": "A place of devotion and visited by thousands of devotees. The temple is well maintained and they even take security quite seriously. Many many years ago it was quite chaotic but now everything is orderly and systematic. Reaching there is easy too with the Metro going up to Dakshineswar.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful place. You can see Hooghly river from the backside of the temple. There are dedicated counters for keeping your bags, shoes and mobile phones before entering the temples.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I found this place very peaceful. The surroundings were very clean and tidy.\nTemple architecture is unique in itself.\nCameras were not allowed inside so don't take them with you whenever you visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is very well maintained. A little confusing around though.\nHere are some tips that can help:\n1. Visit with comfortable footwear that you can slip on easily. Upon arrival you have to deposit your footwear and phones at a desk.\nThe charges are minimal and they give you a receipt for the same.\n2. Carry your own water bottle. There’s a large area that you have walk around on barefoot. Helps to stay hydrated.\n3. Can get crowded so try to plan early mornings or early evenings.\n4. Must visit the Hooghly River bank situated on the left (once you step out of the main temple area).\nAsk for directions, you can get confused.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Dakshineswar Kali Temple in Kolkata is a beautiful and culturally rich place to visit. Situated by the Hooghly River, it offers a serene atmosphere perfect for a spiritual experience. Inside, you can feel a sense of peace in the presence of the idol of Goddess Kali, and the sound of prayers adds to the sacred ambiance.\n\nWhat's great is that the temple is easy to reach, with Dakshineswar Metro Station being the nearest metro stop. Plus, they offer locker facilities for visitors, so you can keep your belongings safe while you explore.\n\nAside from its religious significance, the temple has a fascinating history, making it a must-visit spot for anyone interested in spirituality and culture.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Science City - Kolkata",
      "rating": 4.4,
      "address": "JBS Haldane Ave, Mirania Gardens, East Topsia, Topsia, Kolkata, West Bengal 700046, India",
      "reviews": [
        {
          "text": "This complex offers the excitement of science and makes learning of science easy.\nThere are several museums showcasing the different aspects of science. The scientific theories and inventions are beautifully demonstrated through models, charts and photos.\nThe spacious garden is well maintained and has a wide variety of flowers.\nThere are also amusement facilities for those who seek fun.\nA visit to Science City is definitely a must specially for children.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Yesterday I went with my friends.\nThe place is fantastic.\nFirstly the entry ticket is very cheap (only 65/- per person) Which includes many things like science park,gym park, aquarium etc.\nIf you are coming by train, you will need to go to Park Circus station.From there, science city can be reached in just ten minutes by bus.\nWashrooms are fully higined and drinking water are available here.\nEveryone from kids to adults has a great time here.The whole day was spent very happily.\nHomemade food can also be taken inside.\nIn short, a wonderful place. I love love it.\n\nI would definitely say you must go with your kids and let them know what science has discovered and get more interested in science.🙏🏻",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "If you are a visitor in Kolkata I would highly recommend this place if you are interested in science and technology. There are so many things to know about science and you can also take pictures in so many locations. Some shows are also held by the team on a daily basis. You can enjoy this place with kids, friends and family 😄",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "What a mind-blowing 🤯 place to visit specially for kid's.\nYou can get to learn a lot of things about science here. A lot of models of science theorems are displayed here.\nThere is a big sphere which contain a large screen📺, where one can enjoy a 🎥🍿 movie in 7D about the origin of 🌎 earth. Separate sections are there for different things.\nAll the things for personal hygiene🪥 like washrooms and drinking 💦 water is available.\nA ropeway for entering the 🏙️ city is there or you can use it for exit which gives a breathtaking view of the science city and nearby buildings🏢 and hotels🏨 and areas.\nCafeteria is available so that you can enjoy eating your favourite 🥨 snack here.\nI personally recommend taking your kids once here, so that it will create a eagerness and excitement in your kids to learn 🔭 science.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A place well worth your time, if you love to learn, want to learn and wish to help others to learn. Well maintained facilities, with a full team of competent staff makes this a must visit, whether you're going for the first time, or returning after a long sabbatical.\n\nKudos to the management for the optimised program itinerary, allowing the visitor to attend all special attractions if they are willing to be a bit quick on their feet. Go as early as possible, and buy the all-day pass worth Rupees 300, and you WILL be able to enjoy everything.\n\nThe space theater is a true masterpiece with  wonderfully narrated documentary on a beloved adventurer, and yes, there is a proper narration in Bengali which sounds like someone who actually likes the topic being discussed. The truth tribute to \"The Missile Man\", is beautiful. The 3D show is fantastic, a bit less on science but a lot of fun.\n\nThe food stall is no longer the \"only place to eat\", but a decent outlet worth the money.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Howrah Bridge",
      "rating": 4.6,
      "address": "Kolkata, West Bengal 700001, India",
      "reviews": [
        {
          "text": "Amazing structure! A must-visit.\nHundreds walk on the bridge in the evening.\nFrom above, you see the river, the cruise, the vibrant markets, and vendors selling vegetables and whatnot.\nTruly incredible India!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Howrah Bridge, an iconic landmark in Kolkata, stands as a symbol of the city's rich history and vibrant culture. Stretching majestically across the Hooghly River, this architectural marvel is not just a bridge but a lifeline connecting the bustling metropolis of Kolkata with its bustling suburbs.The bridge's distinctive cantilever design, made entirely of riveted steel, is a testament to engineering ingenuity and craftsmanship of a bygone era. As one traverses the length of the bridge, the panoramic views of the river, dotted with bustling boats and ferries, offer a glimpse into Kolkata's maritime heritage.Beyond its structural significance, Howrah Bridge holds a special place in the hearts of Kolkatans. It serves as a bustling thoroughfare, teeming with pedestrians, cyclists, and vehicles, all weaving their way through the city's bustling streets.At night, the bridge comes alive with a dazzling display of lights, casting an enchanting glow over the river and the city skyline. It's a sight to behold, drawing visitors and locals alike to marvel at its beauty and grandeur.Whether you're crossing the bridge on foot, admiring it from afar, or simply soaking in the atmosphere of Kolkata's vibrant waterfront, Howrah Bridge offers an unforgettable experience that encapsulates the spirit of the city.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The bridge in itself is great architecture.\nIt's one of the trademarks of Calcutta.\nThe area surrounding is very crowded and a little dirty. There is a separate lane for walkers which is great. It feels good to walk during cool breeze.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is an Historical Bridge 🌉 A Pure Steel Super Structure Made during British Era...\nOne of the finest examples of Super Build up Structure Bridge...\nAt Evening u can walk and enjoy the view of Howard and Many Main Route 🚌 Buses r start from here Only...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The bridge itself is a magnificent architecture hence it is the most beautiful attraction of the city of Kolkata. It is an important bridge connecting the two vibrant parts of Kolkata and Howrah. The neighborhood is very crowded and a bit dirty. There are separate lanes for walking which is great.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Santosh Mitra Square",
      "rating": 4.4,
      "address": "Natabar Dutta Row, Lebutala, Bowbazar, Kolkata, West Bengal 700014, India",
      "reviews": [
        {
          "text": "Santosh Mitra Square is a gem amidst the bustling streets of Kolkata! Here's what I loved:\nPeaceful green space: Lush greenery and a refreshing pool create a tranquil escape from the urban chaos. Perfect for a morning jog, evening stroll, or simply relaxing with a book.\nLively Durga Puja celebrations: The annual Durga Puja pandal here is a must-see! ✨ Vibrant decorations, energetic crowds, and a true immersion into Bengali culture.\nFamily-friendly atmosphere:\nThe playground is a hit with kids, while benches offer seating for parents to relax and unwind.\nThe community vibe is warm and welcoming.\nConvenient location: Easily accessible by public transport, making it a great spot for a quick break or a longer exploration.\nOverall, Santosh Mitra Square is a delightful spot for both locals and visitors. If you're looking for a breath of fresh air, cultural immersion, or simply a relaxing time, this square ticks all the boxes!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a popular place at north kolkata..because of one of the famous Durga Puja pandel hoping place ..it's a park cum playground amd walking area ..modarare decoration..different amusement rides are there ..last 8 yr , food festival organised by tv9 bangla held here ..interesting fair for foody people..large variety of options are there  ...one can try different option from different outlet ..entry fee rs 20 per head ..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Santosh Mitra Square Durga Puja 2023 pandal at Lebutala Sealdah is one of the top 4  pandals in Kolkata. It is based on the theme of \"Ayodhya Ram Mandir\". We visited the pandal on the day of Shaptami. We got down near Sealdah station. There was a huge crowd. There was ample parking available for two wheelers and four wheelers. We had to wait in the line from 6 pm till 8 pm to reach the pandal. But it was worth the wait. The lights and theme of the pandal was a treat to the eyes 👀. It looked as beautiful as a Raj Mahal. It's a must visit during this season of Durga Puja. The Durga maa idol was very real and huge. May she bless all of us with love and happiness throughout the year.\n\nAfter the exit from the idol area there is a mela just outside the pandal where you can enjoy multiple rides. There are various street vendors offering food / snacks / ice-creams / paan / tea-coffee etc at higher than the normal price for the festive season.\n\nOverall the experience was very good and it took us almost 2 hrs to complete the entire visit from the entry to final exit.\n\nSince there will be a huge crowd so it's advisable to have patience for your turn and you can carry some small bottle of water.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "They make excellent themes every year, last year they did the theme on Red fort and this year they made Ram mandir . I would recommend you to visit this place during night time as you will encounter an excellent lighting show.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A must visit place during the Durga Puja time. In 2023 they made a Ram mandir themed pandal, spectacular lightings, artworks, musical environment made goosebumps.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Zoological Garden, Alipore",
      "rating": 4.3,
      "address": "2, Alipore Rd, Alipur Zoological Garden, Alipore, Kolkata, West Bengal 700027, India",
      "reviews": [
        {
          "text": "It's a great place for short time tour. If you love animals then you'll be just love it . Good place for children also it's a zoo so kids can really enjoy their holidays. Here you can see many animals, birds , reptiles etc . Many National and international species of animals, birds and reptiles are present here. You can learn so many things about these animals by reading the information board present in front of their cage . White and normal tiger , lions are present. Many birds and many water animals are present here .\nIn short word you can definitely give a try to this place. Have fun and enjoy.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This zoo is located in a huge area. There are many species of animals and birds to see here. It cannot be explained that, I love it so much every time when I enter this zoo. I really liked and enjoyed the tour. A whole day will be spent to see this zoo well.❤❤❤",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "𝙊𝙉𝙇𝙄𝙉𝙀 𝙏𝙄𝘾𝙆𝙀𝙏:- 𝘕𝘖𝘞 𝘠𝘖𝘜 𝘊𝘈𝘕 𝘉𝘜𝘠 𝘖𝘕𝘓𝘐𝘕𝘌 𝘛𝘐𝘊𝘒𝘌𝘛 𝘐𝘕 \"𝘠𝘈𝘛𝘙𝘐 𝘚𝘈𝘛𝘏𝘐\" 𝘈𝘗𝘗. 𝘈𝘷𝘢𝘪𝘭𝘢𝘣𝘭𝘦 𝘪𝘯 𝘎𝘰𝘰𝘨𝘭𝘦 𝘗𝘭𝘢𝘺 𝘚𝘵𝘰𝘳𝘦.\n𝙎𝘼𝙁𝙀𝙏𝙔:- 𝘝𝘪𝘴𝘪𝘵 𝘔𝘢𝘯𝘺 𝘡𝘰𝘰'𝘴 𝘉𝘶𝘵 𝘵𝘩𝘪𝘴 𝘡𝘰𝘰 𝘱𝘳𝘰𝘷𝘪𝘥𝘦𝘴 𝘌𝘹𝘵𝘳𝘢 𝘚𝘦𝘤𝘶𝘳𝘪𝘵𝘺 𝘧𝘰𝘳 𝘵𝘩𝘦 𝘷𝘪𝘴𝘪𝘵𝘰𝘳𝘴 & 𝘵𝘩𝘦 𝘈𝘯𝘪𝘮𝘢𝘭𝘴.\n𝘿𝙀𝘾𝙊𝙍𝘼𝙏𝙄𝙊𝙉𝙎:- 𝘖𝘷𝘦𝘳𝘢𝘭𝘭 𝘋𝘦𝘤𝘰𝘳𝘢𝘵𝘪𝘰𝘯𝘴 𝘢𝘳𝘦 𝘨𝘰𝘰𝘥. 𝘕𝘦𝘸 𝘤𝘢𝘨𝘦𝘴 𝘧𝘰𝘳 𝘵𝘩𝘦 𝘢𝘯𝘪𝘮𝘢𝘭𝘴 𝘢𝘯𝘥 𝘵𝘩𝘦 𝘣𝘪𝘳𝘥𝘴. 𝘕𝘦𝘸 𝘮𝘪𝘳𝘳𝘰𝘳 𝘴𝘦𝘵 𝘶𝘱 𝘱𝘳𝘰𝘷𝘪𝘥𝘦𝘴 𝘯𝘪𝘤𝘦 𝘷𝘪𝘦𝘸.\n𝘾𝙇𝙀𝘼𝙉𝙇𝙄𝙉𝙀𝙎𝙎:- 𝘖𝘷𝘦𝘳𝘢𝘭𝘭 𝘛𝘰𝘪𝘭𝘦𝘵𝘴 𝘢𝘳𝘦 𝘯𝘦𝘵 𝘢𝘯𝘥 𝘤𝘭𝘦𝘢𝘯. 𝘗𝘭𝘢𝘯𝘵𝘺 𝘰𝘧 𝘥𝘶𝘴𝘵𝘣𝘪𝘯𝘴 𝘢𝘷𝘢𝘪𝘭𝘢𝘣𝘭𝘦 𝘢𝘭𝘭 𝘰𝘷𝘦𝘳. 𝘊𝘰𝘭𝘥 𝘋𝘳𝘪𝘯𝘬𝘪𝘯𝘨 𝘸𝘢𝘵𝘦𝘳 𝘢𝘭𝘴𝘰 𝘢𝘷𝘢𝘪𝘭𝘢𝘣𝘭𝘦.\n𝘼𝘿𝙑𝙄𝘾𝙀:- 𝘝𝘪𝘴𝘪𝘵 𝘵𝘩𝘦 𝘡𝘰𝘰 𝘪𝘯 𝘞𝘪𝘯𝘵𝘦𝘳. 𝘗𝘳𝘪𝘤𝘦 𝘰𝘧 𝘧𝘰𝘰𝘥𝘴 𝘪𝘯 𝘵𝘩𝘦 𝘻𝘰𝘰 𝘳𝘦𝘴𝘵𝘶𝘳𝘢𝘯𝘵𝘴 𝘢𝘳𝘦 𝘷𝘦𝘳𝘺 𝘩𝘪𝘨𝘩, 𝘚𝘰 𝘵𝘳𝘺 𝘵𝘰 𝘣𝘳𝘪𝘯𝘨 𝘪𝘯 𝘺𝘰𝘶𝘳 𝘰𝘸𝘯 𝘧𝘰𝘰𝘥𝘴. 𝘗𝘭𝘢𝘴𝘵𝘪𝘤𝘴 𝘢𝘳𝘦 𝘯𝘰𝘵 𝘢𝘭𝘭𝘰𝘸𝘦𝘥 𝘪𝘯 𝘵𝘩𝘦 𝘻𝘰𝘰. 𝘚𝘰, 𝘥𝘰𝘯'𝘵 𝘣𝘳𝘪𝘯𝘨 𝘢𝘯𝘺 𝘱𝘭𝘢𝘴𝘵𝘪𝘤 𝘮𝘢𝘵𝘦𝘳𝘪𝘢𝘭𝘴.\n𝙑𝙞𝙎𝙞𝙏 𝙃𝙚𝙍𝙚 𝙖𝙉𝙙 𝙈𝙖𝙆𝙚 𝙗𝙀𝙖𝙐𝙩𝙄𝙛𝙐𝙇 𝙢𝙀𝙢𝙊𝙧𝙄𝙚𝙎 😊",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a good place for family time।। Various animals' activity, park, lakes present.. full of aesthetic spots, suitable for clicking photos.. kids can immensely enjoy... Outside food, drinks allowed.. inside round shuttle present for roaming ..restaurents, refreshment corners also present with reasonable price.. entry fee only rs 50. Fully worth it place.. highly recommended..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Almost all kinds of animals and so many types of birds are there.\nTicket fee is neither cheap nor expensive.\nZoo is well maintained but due to large number of public,it is not so cleaned.\nAnyway one time visit is good.\nIt is very good for children hence best place to visit your children.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Eden Gardens",
      "rating": 4.6,
      "address": "Maidan, B.B.D. Bagh, Kolkata, West Bengal 700021, India",
      "reviews": [
        {
          "text": "If it's a late evening match the only drawback is getting back home at midnight because the cabs u get are pretty low that time.\nEden Gardens is one of the most popular cricket stadiums in the world. The ground is beautifully maintained and other basic facilities like the washroom are also well maintained. You can get a great experience of watching great games with a great environment. But hopefully if you come here spending money then your money will not be misused. You can definitely enjoy the same amount of pleasure. Ensuring equitable ticket distribution is paramount for the authorities. Acquiring tickets online has become increasingly challenging. Despite enduring lengthy online queues within the designated booking\nAn international cricket stadium in Kolkata, India. Established in 1864, it is the oldest and second-largest cricket stadium in India.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Eden Gardens is one of the most popular cricket stadiums in the world. The ground is beautifully maintained and other basic facilities like washroom are also well maintained. You can get a great experience of watching great games with great environment. But hopefully if you come here spending money then your money will not be misused. You can definitely enjoy the same amount of pleasure. Ensuring equitable ticket distribution is paramount for the authorities. Acquiring tickets online has become increasingly challenging. Despite enduring lengthy online queues within the designated booking window, securing a seat remains a near-impossible feat.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The entry fee to Eden gardens is 20 per head. It is well maintained. The pond inside has beautiful lotus and fish...you can spend hours sitting by it. The pagoda has been restored and a beautiful illustration of Burmese architecture. The boating facility costs Rs 160 for 2 hrs. Overall a good place to spent a few hours with your loved ones",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Watched the KKR vs LSG from the Club House upper tier. The view is amazing from here , probably the best angle to enjoy a game of cricket. Sit on the extreme right to catch SRK. But one thing to point out- 200ML water for 10Rs which means 50 per Liter which is 2.5x the MRP. It’s disgusting that CAB is making profits something as basic as water. I have watched matches in Delhi as well and there they don’t charge for water it’s free. This point should be taken into consideration.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Every time you visit Eden gardens,you feel there's a distinct energy among thousands of cricket enthusiasts. I adore this place. I will never forget the joy of coming here to watch a game in my lifetime.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Belur Math",
      "rating": 4.7,
      "address": "Belur, Howrah, West Bengal 711202, India",
      "reviews": [
        {
          "text": "This is very spritual or peacefull place ... A different peace is felt here, .Beautiful environment, river Ganga at the same time, just wonderful view ! Entry is free, prasad is distributed at noon, gates close at 12 noon and open at 4 pm till 8 pm. I just love this place. Swamiji's room is here Ramakrishna, Maa Sharda and Swamiji stay inside the big temple, Here the monks and brahmacharis perform puja, namasankritan, aarti etc. Really very nice place , Photos are not allowed here but so I click only a few pictures.. overall greet place , you should visit once in your life 🧬",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Belur Math is a significant place in India, located near Kolkata. It's the headquarters of the Ramakrishna Math and Mission, a spiritual organization founded by Swami Vivekananda, a disciple of the Indian mystic Ramakrishna. The Math serves as a hub for spiritual activities, education, and humanitarian work. It's renowned for its serene ambiance and architectural beauty, blending Hindu, Christian, and Islamic motifs, reflecting the organization's inclusive philosophy.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Belur Math is a serene and sacred place that exudes a sense of peace and spirituality. The architecture of the main temple is breathtaking, with its intricate designs and vibrant colors. The atmosphere is filled with devotion and tranquility, making it a perfect place for meditation and reflection. The lush gardens surrounding the temple add to the overall sense of serenity. Visiting Belur Math is a truly enriching experience that allows one to connect with their inner self and appreciate the beauty of Hindu culture and philosophy.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Update for bikers...\n\nFeeling down? Need a ride?\n\nI Know there many places and the journey is more beautiful than the destination. But this is our history. You wont regret this 30 mins of your life believe me. Must visit",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the Beautiful place to visit. Very well maintained peaceful place, the only thing which is very disturbing is the timing. It should be more available for the people because so many peoples comes from at the great distance.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sreebhumi Durga Puja Pandal",
      "rating": 4.4,
      "address": "HCX3+J4F, Canal St, Sreebhumi, Lake Town, South Dumdum, West Bengal 700048, India",
      "reviews": [
        {
          "text": "Sreebhumi is one of the most talked about Pujo Pandals of Kolkata and has a rich connection with the community. This year they brough Walt Disney Castle to life and the execution was superb. If you are going there be prepared for decent wait time and there I always a rush. You will have to walk a fair distance to reach the pandal. The lighting and organisation is good through there is unnecessary pressure by the organisers to push the crowds out.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Sreebhumi Durga Puja Pandal of 2023 was considered one of the best pandals in West Bengal. The theme was Disney World and it was decorated quite well. I went there on Saptami and the crowd was huge.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The sreebhumi Durga Puja 2023 pandal is one of the best pandals in Kolkata. It is \"Disney Land\" theme based. We got down near the clock tower of Lake town area kolkata. There is ample parking available for two wheelers and four wheelers. We had to wait in the line from 7 pm till 9 pm to reach the pandal. But it was worth the wait. The lights and theme of the pandal was a treat to the eyes 👀. It looked as beautiful as a fairy tale. It's a must visit during this season of Durga Puja. The Durga maa idol was very real and huge. May she bless all of us with love and happiness throughout the year.\n\nAfter the exit from the idol area there are multiple street vendors offering food / snacks / ice-creams / paan / tea-coffee etc at higher than the normal price for the festive season.\n\nOverall the experience was very good and it took us almost 3-4 hrs to complete the entire visit from the entry to final exit.\n\nThere will be a huge crowd so it's advisable to have patience for your turn and you can carry some small bottle of water",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Most overhyped pandal in Kolkata\nThey always experience huge footfall though I found their theme and pandal , idol everything very ordinary\nMaa Durga is always special but the craze of this particular pandal is unworthy though\nVisited Disneyland, nicely made",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is tremendous. I think it is the biggest durga puja pandel in kolkata in terms of budget. It attracts trendy crowd so you have to stand in line for 1 or 2 hours. sujit bose is now backbone of this puja.\nyou can purchase water, food, cold drinks from here. West bengal police and kolkata police are cover who whole the area so no safety issues.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Indian Museum",
      "rating": 4.5,
      "address": "27, Jawaharlal Nehru Rd, Colootola, New Market Area, Dharmatala, Taltala, Kolkata, West Bengal 700016, India",
      "reviews": [
        {
          "text": "It was long overdue. It was a major disappointment for me as a Kolkata native. Children also wanted to be a part of this epic voyage through history. The sheer scale is so amazing. The Indian Museum is India's oldest museum and one of the most comprehensive in the Orient, with holdings that reflect India's cultural history from prehistoric to Muslim times. The current structure, which opened in 1875, has sections dedicated to geology, biology, industry, archaeology, art, and ethnology. The coin room houses the greatest collection of Indian coins in the world.Textiles, rugs, lacquerwork, glass, and pottery are among the highlights of the art department. The exhibition exhibits specimens of Persian and Indian paintings, and the geology portion is the largest in Asia,",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place but yes old.\n\nPlease put more signboard to give contexts of things more especially on the sculpture rooms. The human room the information boards are not clear at all. Can't refer information and get the connection.\n\nFood in canteen is awesome.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Surprised to see collections of display items. Very informative way of presentation and to know Indian history must visit this place. Buy go with lot of energy and time to cover most of places.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visiting Place. It is a very well maintained museum.. You need whole day to cover it properly.. No need to buy tickets in advance. Indian adults Entry fees 75Rs. For Children 20 Rs. Takes an extra charges for photography. For mobile camera 59 Rs. Still camera 118 Rs  However photography is not allowed in some restricted areas.\nIt has rare collection of fossils, coins, skeleton, ornaments, antiques, historical paintings etc.. The most beautiful thing is Egyptian history and real mummies.. Many rare and unique specimen are preserved here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best museums in India, from ticketing to inside museum, everything is lacking in maintenance. When you go there to buy tickets, even if you buy tickets for cameras with 3 people, you can't get retail. If you buy online, that process is also complicated. There is no scanner at the entrance. After that, everything inside is very dirty. There is no sign of modernizing them from time to time. Very disappointed that this is the case almost every day where so many people gather here. The souvenir counter does not have the most popular magnets. Overall disappointed.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}