{
  "places_with_reviews": [
    {
      "name": "Shivsrushti Killa ( Akluj Fort )",
      "rating": 4.5,
      "address": "V2VF+J4F, Solapur, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "Fort of Akluj\nThe name Akluj came from Shri Akalai Devi. Solapur to Akluj is approximately 118 km and 169 km from Pune.\nThis fort is located on the banks of the river Neera.\nThis fort was restored under the guidance of Babasaheb Purandare. It features army statues on the coast, mural sculptures of Shivaji Maharaj’s life, scenes of his coronation and birth as well as models of important forts. Totally nice project done.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best renovation of the fort done by Akluj Grampanchayat. It was opened for public since 2008. From Birth of the Shivaji Maharaj to Coronation pictures are depicted on the wall of Fort. Coronation scene was formed in a Big way and great way. Something extraordinary to see. Free ample parking in front of the fort.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Excellent development by dignitaries. Every statue looks like real. Beatiful garden landscape. Peaceful place in akluj. When we visited, only we are only the visitors. You can imagine how one can enjoy this place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Provides scenic views about shivaji maharaj's life history.\nInformative Models about different forts of Maharashtra.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place showing Hon.Shri Ch.Shivaji Maharaj 's  presence with spectacular statue.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Akluj",
      "rating": 4.6,
      "address": "V2MC+633, Savtamali Nagar, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "This place is a very very beautiful place in Maharashtra iam so wonderful when I look akluz because water falls are very nice and train riding on the metals that is very fearful and enjoy ment",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Water scarcity.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Akalaidevi Temple,Akluj",
      "rating": 4.7,
      "address": "V2VG+MJ8, Solapur, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "Spiritual, clean, peaceful place. Beautiful garden with slides and swings for kids.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Akalaidevi Temple in Akluj is a serene and spiritually uplifting destination. Nestled amidst lush greenery, this temple exudes tranquility and charm. The intricate architecture and vibrant colors of the temple are a visual delight. It's a place where you can find solace and immerse yourself in the divine aura. Whether you're a devotee or a traveler, Akalaidevi Temple offers a peaceful and enriching experience, making it a must-visit in Akluj. Don't miss the opportunity to explore this cultural gem.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Akalaidevi temple is one of most famous attraction in akluj. It is very beautiful, clean, greenery place with beautiful garden.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful, serene, well maintained Temple of Aai Akalaidevi, feels the holiness of the temple. The nearby Nira river adds the peace to the temple. Must visit while going through Akluj",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is gramdevi of Akluj town. This very old temple at bank of Nira river. Small dam built up on river created good backwater reservoir near temple. Though newly built temple is very nicely done & maintained properly it's not having charm of old heritage & architecture. Temple premises & garden around it is very beautiful. Very nice time to spend some time with family. If you visit here at time of sunset 🌅 it's worth watching. Enjoy visit to this auspicious temple & have completed your wishes.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shiv Parvati Temple",
      "rating": 4.7,
      "address": "V283+MF3, Geeta Colony, Akluj, Maharashtra 413118, India",
      "reviews": [
        {
          "text": "Shiv Parvati Temple in Akluj is a calm and lovely place.\nThe views are stunning, the architecture is impressive, and it's just perfect for a peaceful visit.\nIf you're looking for a serene spot with beautiful scenery, this is it!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A lovely temple surrounded by lush greenery. Beautifully designed temple with impeccable cleanliness and maintenance. Need to go to the temple. extremely lovely idols of Shiv Parvati.\nThe Shiv Parvati Temple is an incredible work of spirituality and art. Everyone who visits will experience a deep sense of serenity and connection because to its exquisite design and calm atmosphere. A must-see for anyone looking for worship that is serene and beautiful.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Shiv Parvati Temple is a stunning marvel of artistry and spirituality. Its intricate design and serene ambiance offer a profound sense of peace and connection for all who visit. A must-see for anyone seeking beauty and tranquility in worship.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful temple with lot of greeneries surrounding. Very clean & well maintained temple with beautiful architecture. Must visit temple. Very beautiful idols of Shiv Parvati.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Shiv Parvati temple in Shankar nagar Akluj.\nNeat and clean well structured temple.\nVery peaceful environment and plenty of space to seat on grass.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Gondawalekar Maharaj Temple",
      "rating": 5,
      "address": "Sai marg 2, Sangram Nagar, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "Every spiritual destination. Cool and energetic environment. Must visit once in year with family",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Divine",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "The temple is beautiful.",
          "languageCode": "en-US",
          "rating": 5
        },
        {
          "text": "very beautiful",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Ganesh Mandir",
      "rating": 4.7,
      "address": "BSNL Tower, Savta Mali Rd, Irrigation Colony, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "Very nice temple 👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "No need of caption",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "||Om Gan Ganapataye Namh:||",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "MallikaArjun Mahadev Temple, Deshmukh Galli",
      "rating": 5,
      "address": "Deshmukh Galli, V2RF+F8G, Ramayan Chowk Rd, Solapur, Akluj, Maharashtra 413101, India",
      "reviews": []
    },
    {
      "name": "Multimedia laser show",
      "rating": 4.3,
      "address": "V283+VVW, Geeta Colony, Akluj, Maharashtra 413118, India",
      "reviews": [
        {
          "text": "Noise level was to high & such shows were attraction before few years back but now there is nothing new or attractive, knowledge worthy is this show",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's good to visit this place after 7 pm.\nTickets for Adult Rs.25 and  for children Rs.Its around  20 min show.Its mixture of Bollywood and Marathi songs shown through laser show.Nice experience.Entire family cN enjoy  full show.Music and laser show really memorable.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome evening recreational spot. Tourist visiting first time will get wonderful experience. Comfortable sitting and beautiful light-fountain scenery with good quality music.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice hall",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Great sound and fountain show..Ticket rates adult 25 kids 20. Special concession for schóol trips. Time usually first show at 7.30 pm",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shriram Mandir",
      "rating": 4.3,
      "address": "V2W6+3RJ, Sangram Nagar, Akluj, Maharashtra 413101, India",
      "reviews": [
        {
          "text": "It's cool and fresh air place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best place 👍🏻👍🏻",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peaceful place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Hanuman Mandir",
      "rating": 4.6,
      "address": "Hanuman Mandir, Swarupnagar, Yashwantnagar, Akluj, Maharashtra 413118, India",
      "reviews": [
        {
          "text": "This is Hanuman Temple. Many Pilgrims visit this place mostly on Saturday for worshipping lord Hanuman . Very energetic and peaceful place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple very easy to visit and have lots of parking place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very energetic and peaceful place....\nEasy to search...\nClean..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}