{
  "places_with_reviews": [
    {
      "name": "Sri Jogulamba Ammavari Temple",
      "rating": 4.7,
      "address": "Temple Road, Alampur, V4GM+QVR, Gadwal, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Jogulamba is 5th shaktipeetham. Temple is very ancient and one can literally feel that vibe while in the temple. There are a lot of temples for Lord Shiva, it is said to be a 101 lingams. The architecture of the temples here is really amazing that anybody can feel mesmerising. However, all the temples are in a bad condition that most of the idols are broken 😞. Visit the museum also to find more ancient idols and structures.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Historical place. Must visit. This is one of the shaktipeeth in India. You will get free food as well, however it is little on the spicy side. Better Carry your own food. The temple is not maintained as it should be. From the structure it is evident that the temple was razed by invaders. It is a day tour and you will enjoy the drive.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the Asta Dasha Shakthi Peetam in India. 3rd one in Telugu states. Located on the banks of River Tungabhadra with calmy and peaceful environment. Though temples are little under maintained and need proper structural engineering to give the best look. The temple is big and peaceful with a lot of small temples around. Ample parking space, not soo crowded during our visit. Overall a good experience and lot of positive vibes.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice and powerful temple. 5th asta dasa sakti peetam one and only in telangana.upper teeth of sathi devi fell in this place.upper teeth warm condition thays why maata ugra swaroopini. Adishankara charya established sri chakra here. Bala brameswara temple and nava brahma temples are there. Main attraction on vasantha panchami day maara nija roopa darshana and abhishekam doing yearly once.remaing days maata face only we can sea. Sangameswara temple 1 km from temple. Papanasini temple 3 km from temple. Here present marakata lingam. Smashan narayana present in this temple. In India only 2 temples present one in kasi 2 nd alampur.lot of temples are damaged by bahmani sultans.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Oldest temple constructed in 6 BC. 5 th  Shakti peetham among 18 Shakti Peethams. Goddess Jogulamba Sits on a Corpse with Scorpion, Frog and Lizard on the Head. lord Shiva is known as Bala Brahmeswar. Has Totally 9 Shiva Lingas. Temple complex is very old and creates an Aura. Donot expect Accomodation here.\nBest place to stay is the nearest city Kurnool which is 12 Kms from Alampuram.\nUsually crowd is very Less except on Mondays\nTimings 7 am to 1 pm and 2 pm to 8.30 pm.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sangameshwara Temple",
      "rating": 4.7,
      "address": "Alampur, Jogulamba, gadwal, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Very peaceful and spacious. The architecture of the temple is very ancient.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing! Relocated from Sridailam reservoir!!! Unbelivable.\n\nAbu Simbel of Telangana!\n\nThe Sangameswara Temple was constructed by Pulakesi I ( 540 CE to 566 CE), in a similar style to the Navabrahma Temples. Based on inscriptional evidence such as the Tummayaneru grant, Sarma dates the temple to pre-Chalukya era when Navabrahma temples were built\n\nThe Sangameswara Temple has been moved to near the Navabrahma temples, as its original site built at Kudavelly, some 20 km away, is now flooded by the Srisailam Dam hydroelectric project. The Sangameswara temple transplantation was completed by January 1990.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is in a very big place,  with a  lot of parking, old temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This magnificent temple originally built at the confluence of Rivers Krishna and Godavari near Kudavalli,  has been shifted by Archeological Survey of India, in a feat considered as engineering marvel, by shifting brick by brick after numbering them and preserved from submerging after construction of Srisailam project.\nThis temple is known for amazing architecture.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Sangameshwara temple is very old and ancient temple......its just wonderful..\nThe temple is very huge and high...\nIts the Shiva temple....\nThe temple comes under the archeological department of India....\nThe temple has huge space which is clean and well maintained....\nThe place is very good and peacefully quite....\nThe temple is all about unity of religions...\nYou can c all kinds of religious sculptures here.....\nThe architect of the temple is just amazing...\nThere a particular sculpture behind the temple which shows the 3D view....for the three different angles....",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Papanaasni Temple",
      "rating": 4.8,
      "address": "V4CC+JXV, Mahbubnagar, Telangana 509152, India",
      "reviews": [
        {
          "text": "Peaceful and spacious. One of the rarest Marakatha Lingams is here in Papanaasi group of temples.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Wonderful temples of lord Shiva with excellent architecture in a peaceful place. Must visit place in Alampur.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful and a beautiful temple. People who come to visit jogulamba temple mostly visit’s this temple. It is very near to the jogulamba temple. The atmosphere is so cool in here . A worthy visit to this temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Papanassni group of temples it is situated  near alampur with about 1.5 km range. It has small temples inside the temple  you can see the different sizes of shiva lingas. This temples carved beautifully in and out of temples like ceiling and pillars. You Can positive environment for sure once you visit. I heard the members of village they said timings are mrng 10 to before 6pm.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "So good to see all these archaeological temples being restored and maintained so well. Smasana Narayana temple was one of its unique avatar of Narayana to be seen here.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Papanashi Siva Temple",
      "rating": 4.5,
      "address": "V4CC+JXV, Gundimalla, Telangana 509152, India",
      "reviews": [
        {
          "text": "Good to see government started maintaining.. but can do better.. but not all are functional yet.. I mean toilet etc.. no shades/ drinking water facilities available..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A must visit place in alampur. 2 kms far from main temple alampur jogulamba.who is having dosha's in their life.one should must visit this place. In India only two places for papa nivarini temples. One from alampur and another from Triambakeshwar.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its mainly a group of temples present at one place....\nThe temples architect is gud...\nIts located near the tungabadra river...\nBut now there is reconstruction is going on as they became old and due to rise in river water....\nThe temples are small in height and have different types of gods....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is lesser known place.. very near to jogulamba... This temple has 7th century sivalingam and other very unique and powerful temple is Smasana Narayana temple... This temple is there only in 2 places in India one at Kashi and other is here... They do pitrudosha poojas here... Apamrutyu dosha nivarana pooja is done  here to increase life span... Kerala tantra sastras specified about this temple and its Pooja.. you can contact poojari for more information on pooja.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The beautiful place I've ever seen.\nEntire place sends you positive energy.\n\nThee Temple been moved and restored from their ruins by the Archaeological Survey of India after 1980. They were threatened by the Srisailam hydroelectric project.\n\nA rare Marakatha Lingam (Emerald Lingam) is being placed here.\n\nThis place is equal to visiting Kashi Vishwanath Temple.\n\nOm Namah Shivaya.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "స్మశాన నారాయణ స్వామి వారి ఆలయం",
      "rating": 4.5,
      "address": "Papa Vinashana Swamy Temple, Unnamed Road, Telangana 509152, India",
      "reviews": [
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "👉 Shree Shamshana Narayana Swamy Temple\n\n💠 How do we get the right to inherit the properties acquired by our grandfathers and fathers...\nAlso... the sins committed by fathers and grandfathers are also applicable to that clan.\n\n💠 If our elders do good deeds, their clan will be happy and happy.\nAlso, if the same ancestors have committed sins, whether they know it or not, whatever they have done, the family members must experience the sins they have committed.\n\n💠 We have done no wrong knowingly or unknowingly but one thing is important to know especially those who are suffering that they are experiencing sufferings and karmas.\nThat's the fault of the father..\n\n💠 Those who have pitru dosha, even if they do not do any sinful deeds in this life, the family will be in trouble and suffer hardships.\nBecause the sins of our elders are the fruits.\nWhile sharing their assets, their sins should also be shared.\n\n💠 Some of the ill effects of Pitru Dosha are...\n\n👉 Young people die prematurely\n\n👉 Organs in the body fail and hospitalization.\n\n👉 Being in debt is becoming the milk of irreparable blame.\n\n👉 Experiencing life-long karmas that are prone to accidents without our involvement.\n\n👉 Before our eyes, our children are addicted to bad habits and spoiling their reputations\n\n💠 All this is due to Pitru Dosha.\nThe only solution to get rid of this is to please...\"Smashana Narayana\"...\n\n💠 But there are two temples of this cemetery Narayan in India.\n\n1. Kashi\n2. Papanashi (Alampuram 'Jogulamba Gadwala District)\n\n💠 This cremation temple in Alampuram is mentioned in Kerala Tantric Shastra.\n\n💠 The strange thing is that no one knows that this cemetery is in Narayana Temple Alampuram.\nBut now let us find out what to do to please this Smashana Narayan and get rid of our sufferings.\n\n💠 To please Smashana Narayana....\nPayasam made with milk and rice, rice, muddappapu, ghee and vada should be offered as offerings!\nIn this way only the descendants of their family name should receive the prasad that is offered to Smashana Narayan. Do not give to others.\n\n💠 A white scarf should be decorated for the lord.\nThese dishes should be cooked and reported by themselves or (those who are unable to go can pay the expenses and get it done by the local priest).\n\n💠 Go to Alampuram early in the morning and take a bath in Tungabhadra river and after having darshan of Ammavara Ayyavars, you should consume Narayan in this graveyard and reach home without going anywhere else.\n\n💠 The importance of this temple is that its importance is written in Kerala Tantra Shastra by Tantra Guru \"Venu Madhava Namboodri\" !\n\n💠 Another important point:\nThe main deity Sri Papanaseshwara in the Samsana Narayan temple groups is the oldest 'biggest emerald lingam' of the 7th century called Dakshina Kashi.\nIt is believed that the sins of those who visit this Lord will be destroyed!\n\n💠 How to reach:\nThere is a small road next to the \"Green Hotel\" of Alampur. On the left side of that small road, at a distance of 1.2 km, there is the Papanaseshwara temple complex.\nA special temple in the temple complex is \"Smashana Narayan Temple\".",
          "languageCode": "en-US",
          "rating": 4.5
        },
        {
          "text": "The temple is very clean. But the temple is not conducting Pitru Dosha Puja. The Debt Relief Department has stopped it. There is only vision",
          "languageCode": "en-US",
          "rating": 4.5
        },
        {
          "text": "Smasana narayana temple!",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Sri Bala Brahmeswara Swamy Temple",
      "rating": 4.7,
      "address": "V4GP+W7P, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Located inside the compound of temples. Clean and peaceful.\nGood architecture, similar to other jyotirligams like Nashik, Puri...\n\nParking fee: 50 Rs\nNo entry fee for darshan\nWheel chair accessible",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "There's a group of nine temples dedicated to Shiva called as Brahmeshwar, built during Chalukya dynasty period, each temple is similar to one another with Pagoda style gopurams, Except the Balanrahmeshwar temple where pooja is conducted all the other temples even though have lingam inside no pooja is offered. It's an archaeological protected monuments and some restoration works were also going on. The group of temples throw light on Chalukyan period sculptures and how it has influenced other periods",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Alampur Jogulamba Bala Brahmeswara Swamy Temple is an ancient temple, located in Alampur Town near Kurnool in Jogulamba Gadwal District, Telangana. The main dieties are Bala Brahmeswara Swamy (Lord Shiva) and Sri Jogulamba (Goddess Shakti).\nThe temple is located on the banks of River Tungabhadra in Alampur. Alampur Jogulamba is one of the\n\nJogulamba temple is one of the eighteen maha Shakti peethas which are the most significant shrines and pilgrimage destinations in Shaktism.\nAlampur is considered the western gateway of Srisailam which is one of the 12 jyotirlingas. The town is also known as the Southern Kasi.\n\nThe Jogulamba Bala Brahmeswara Temple combines with the Nava Brahma temples, a so called consortium of nine temples in its premises. Sati Devi’s upper teeth fell out here. The mythology of Daksha Yagna and the self-immolation of Sati is the origin story of Shakti Peethas.\nThe original temple was grounded by Muslim invaders in 1390 CE. The temple was rebuilt after 615 years.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "7th century stone temple built in Chalukyan style. The temple dedicated to Lore Shiva in the name of Balabrahmeshwara swamy.\n\nThe temple showcases the intrinsic stone carvings with high level of imagination. The temple along with other similarly structured temples form the complete nava brahma temples.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the most ancient temples,  the history runs for almost 1400 years.  This temple was submerged during the Kurnool floods in 2009.\nYet the place stands strong and powerful .\nIn less than half a kilometer stands another beautiful structure,  somalingeshwara swamy,  which was relocated From the banks of the river to alampur due Sagar hydro electric projects. Must visit papanasanam too",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Svarga Brahma Temple",
      "rating": 4.7,
      "address": "V4GP+W42, Road, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Really nice and very peaceful experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the oldest stone temples in this region built by Chalukyas. The carvings on the walls of the temple are extremely beautiful and you need to spend plenty of time to go through all the details of the carvings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "(Visited in June 2022) - It's a national protected monument and forms a part of Navabrahma Temple complex. Swarga Brahma Temple is impressive for the sculptures and carvings on the wall and the typical Chalukyan Vesara characterstics.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Architecture was super, every person must visit with family and friends",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit very energetic place\nAlampur Navabrahma Temples are a group of nine early Chalukyan Hindu temples dated between 7th-century and 9th-century that are located at Alampur in Telangana, near the meeting point of Tungabhadra River and Krishna River at the border of Andhra Pradesh.[1] They are called Nava-Brahma temples though they are dedicated to Shiva. They exemplify early North Indian Nagara style architecture with cut rock as the building block.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Jogulamba Auditorium",
      "rating": 4.8,
      "address": "V4GM+45F, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "A very powerful sakthi peet  Jogulamba devi  temple in Alampur, Telangana, KCR govt. and local ministers are neglecting in development of this temple , request Hindu sanatana & BJP govt. to take up further developments..... 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻Om namah shivay 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Alampur Jogulamba Krishna Pushkar Ghat",
      "rating": 4.5,
      "address": "V4GM+GX9, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Nice place to visit with family members and friends. View point is also superb. Temple is beside the river.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Full of water in tungabhadra river.very beautiful to see",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful pictures of nature 🙏💀🦂🦎🦉",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jogulamba Temple is a Hindu temple dedicated to Goddess Jogulamba, a form of Shakti located in Alampur, Telangana, India. The temple is one of the Maha Shakti Peethas, a group of eighteen (Ashtadasa) temples considered the most significant shrines and pilgrimage destinations in Shaktism.",
          "languageCode": "en-US",
          "rating": 4.5
        },
        {
          "text": "Tungabhadra River bed! Beautiful view.",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Dakshina Kashi Smasaana Narayana Swamy Temple",
      "rating": 4.3,
      "address": "V4M9+PQJ, Alampur (P), Telangana 509152, India",
      "reviews": [
        {
          "text": "Very very powerful temple near Jogulamba  temple, Alampur, Telangana, once a visit in your life time must, it's know as Dakshin kashi Smasaana narayana swamy temple..... 🙏",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}