{
  "places_with_reviews": [
    {
      "name": "Raj Rajeshwer Temple Akola",
      "rating": 4.8,
      "address": "PX4Q+VM3, Shivaji Nagar, Akola, Maharashtra 444002, India",
      "reviews": [
        {
          "text": "Good management of the temple is observed . We take Darshan of Shivling very easily, but there is a lot of rush on Mondays and Shravan months. For vehicle parking is available for two wheeler only. Advised to use local transport or auto to reach here. I'm very happy to visit here and I'll visit here again.\nJai Raj Rsjeshwar...Om Namah Shivay...🙏🏻💐💐",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very happy and positive environment.. Very old temple of Lord Shiva... Awesome.... Jay Shmbho.. Har har shambho... I visited here on 7th July 2022",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Pleasant atmosphere and having the lord shiva blessing and Maa Parvati blessing. Temple has it history of deities Parvati been submerged in the earth through the shiv Ling getting centre line  separation and the line still visible which has been repaired. Apart from devoted ke dev their are other lords are also available for worshiping.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The only place looks clean in Akola.\nI came to explore Akola from Shegaon by State Transport. As soon as I came out of bus stand, the paintings beneath the flyover looked good and I thought I made a good decision to explore Akola.\nBut it was just a matter of time, dirtyness and absolute unhyigene on the road made me feel like I should escape from there as soon as I can.\nVery very disappointed with Akola.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Raja Rajeswara Temple Is an heritage of akola. Rucola cars Rajarajeshwari Temple and Rajarajeshwari Maharaj which is Bhole Nath Ji matters a lot. In Akola you will find a lot of shops Named Rajarajeshwari because of their love for Rajesh Maharaj. I have grown up listening number of stories regarding Rajarajeshwari Temple and its history from my grandparents and I myself connect alot with this temple. Right now during the Shravan month everyone wants to visit Rajarajeshwari Temple especially on Mondays there is very crowd. The temple is very special for me it’s always peaceful to go there. The management manages the Mandir and its vicinity pretty good . Jai bholenath❤️",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Salasar Balaji Temple",
      "rating": 4.6,
      "address": "MXQH+V6H, Nafees Bagh, Dahigaon Gawande, Akola, Maharashtra 444002, India",
      "reviews": [
        {
          "text": "Best place to visit in akola. Very awesome environment. Must visit this temple.\nThe peaceful temple of balaji located in akola .\nIt was a great experience visiting the temple.\nYou can keep your phone with you, but photography is not allowed inside the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beat place in Akola to visit with family and friends. Temple structure is awesome.\nAmple space for parking. Mostly crowded on weekends.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very spiritual and peaceful and adorable place, I must recommend visiting if you are on akola.\nMoreover people came here to relax and go out.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Grand temple located in Akola city. Nice garden attached to the temple. Freshness around and piece within .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is a very beautiful temple in akola, its dedicated to salasar balaji and has beautiful idols of Radha Krishna and shivling. The temple is built beautifully and is well maintained. Garden is beautiful, they even have rooms for stay of devotees. Can spend good 2-3 hours here",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "12 jyotirlinga Mandir",
      "rating": 4.7,
      "address": "16, Bara Jotiling Mandir, Chhoti Umari, Akola, Maharashtra 444005, India",
      "reviews": [
        {
          "text": "If you want peace must go there and do meditration.\nThe vibes in that atmosphere is best.\nI love it, you would love it too.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Neat and clean. Management is also very good.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Busy Area\nBut holy place 🙏🌆",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lord Shiva's temple 🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Baba 🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Akola Fort",
      "rating": 3.9,
      "address": "PX4Q+9VC bes, Dagdi Pul, Shivaji Nagar, agar, Akola, Maharashtra 444002, India",
      "reviews": [
        {
          "text": "DO NOT VISIT\nIts a shame that this fort is situated along side the river still one of the worst places to visit.\nThe river is full of garbage and dirty water and you can see people spitting and pee-in all around the fort.\n\nFew of the pictures in the review are completely misleading.\n\nSee these pictures for the current situation.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "The fortress was built in 1697 by Asad Khan, during the reign of Aurangzeb by Asad Khan,[1] from whom the fort took its name (Asadgad). In 1803, Arthur Wellesley camped here before proceeding to win the Battle of Argaon in the Second Anglo-Maratha War.[3] The fortress was dismantled by the British Raj in about 1870. It was reported in 1910 in a district gazetteer that the central part of the fort (the hawakhana) was used as a school.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Only two walls of the fort remain now. Like most forts, this one is also built on elevated land, offering an expensive and breathtaking view of Akola City. One side offers a glimpse of the river where cows idly bathe, while on the other side you will see the majestic Raj Rajeshwar temple and the rest of the city. No charges to visit the fort but parking may be difficult to find.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "For a historical monument The place looked totally neglected . The view from the fort of Akola city and the Morna river was good but closer look revealed heaps of garbage and totally polluted waters of Morna river, full of filth .\nIt was big big disappointment . It reeked of total neglect and apathy of the administration . If ever there was an example of how NOT to maintain an historical monument Akola Fort or Asadgarh fort , as it is also called , is a classic example.\nLeft the place with a heavy and saddened heart .If you are the type to say \" I was there\" risk it .Otherwise a visit is not recommended it will only spoil your mood....",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "No proper care by Government or Public nearby 😕",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Shri Bara Jyotirling Temple",
      "rating": 4.8,
      "address": "12 jyotirling temple, Ranpise Nagar, Akola, Maharashtra 444001, India",
      "reviews": [
        {
          "text": "Shri Bara Jyotirling Temple is dedicated to Lord Shiva, who blesses all the devotees in Linga form. Shri Bara Jyotirling Temple is also one of Akola's most visited shiv temples. The Temple is famous and huge and provides a blessing of lord shiva. Shri Bara Jyotirling Temple houses all the Bara Jyotirlingas, which means 12 jyotirlingas.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Visiting this temple since 5 years.\nI found it very peaceful and best place for dhyan.\n\nMorning aarati is best\n\nIf you wish to dhyan then visit at noon or late evening after 8 PM\n\nVibes are really so amazing that you will feel calm",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "religious environment, good and peaceful place at 8, 9 o clock morning and Evening. All 12 jotirling We get darshan in a single temple. It is a clean and beautiful temple, everyone must visit it once..",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Feeling bless\nLove to visit whenever get time\nMust visit at bara jyotirlinga temples akola",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's famous and huge temple and Shiva's Avatar. It's mostly crowded and have many devotees visiting daily. No provision of parking.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Tape Hanuman Temple, Akola",
      "rating": 4.7,
      "address": "Mohta mill chal, PX9R+HVQ, Bhawani Peth, Akola, Maharashtra 444003, India",
      "reviews": [
        {
          "text": "Peaceful and calm environment of the temple helps to ease your mind. Recommend visiting in afternoon when rush is low. So that you can sit and pray there.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the most calm n serene places",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's the one and only a Hanuman Mandir where mother Anjane is there with Hanuman mahara",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A calm, spiritual and extremely positive vibrations Hanuman Mandir.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place is natural peace ♥️",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sundarabai Khandelwal Tower",
      "rating": 4.3,
      "address": "Mominpura, Akola, Maharashtra 444001, India",
      "reviews": [
        {
          "text": "Visit Date: 15th August 2023\nVisit Time: 10,PM\nPurpose: To capture the tower\nParking: Roadside\n\nEntry Ticket: No, entrance is not available for the general public.\n\nTaking pictures/video allowed: You can take pictures from the road or from the flyover.\n\nBest time to visit; Avoid traffic hours as you can't park the vehicle or stand and take pictures.\n\nSpecific Experience: It is a monument and historical pride of Akola. You can see it from roadside, entry is not allowed for general public. On particular occasions you can see it decorated with lights. It is mentioned that the tower is built in the year 1942.\nSituated in the middle of the city and next to bus stand.\nThe clock shows exact time and bell rings every hour.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I don't know about this historic landmark in detail but the place looks so nice at night! The architecture and buildup is so good! I was stunned seeing this at night and clicked a lot of pictures.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is the most famous and historical trademark of Akola city.Sundarabai khandelwal tower",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the famous places as landmark of Akola,\nHowever, many improvement needs to be done ✅ here.\nManagement must take necessary initiative for drinking water facilities and washroom toilet for females.\nApart from that more improvement can be done regarding it maintenance.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Sundarabai Khandelwal tower is a historical place built on 12th February, 1942. The foundation stone was lead by Member of Parliament Shri. Gopalrao Bajirao Khedkar on 2nd October, 1960 and was inaugurated by Former Late Prime Minister Shri. Pandit Jawaharalal Nehru.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Annapurna Mata Mandir",
      "rating": 4.5,
      "address": "PX28+W3J, MH SH 197, Akola, Akkalkot, Maharashtra 444002, India",
      "reviews": [
        {
          "text": "If you want to have darshan of Annapurna Mata in a peaceful environment in Akola,then you must visit Annarpurna Mata Temple. This is such a Hindu religious place that complete care is taken of cleanliness here.  And the temple is very beautifully built. The parking facility is also good.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Annapurna🍊🍉🍐🍏🥖🥞 Mata 👸🏻 mandir🏰 is Abode🏦 for the seekers😇 finding peace😶, calm😑, bliss😁, ecstasy😂 and euphoria😂🤣 against the offending🤺 anxiety😣, stress😥, tension😖, depression😓, and other ailments. Very calming😌 environment🏞️🏝️🏖️, spaciously build⛩️ temple🕍 building, a garden⛲🌄 to walk🚶, play🤸 or exercise🤹. It's truly a heavenly👼 experience being at temple. One should visit the temple and spend some time observing the plants, cows and birds in the vicinity of Mataji(माताजी/ kind goddess) and feel the bliss and abundance of #grace given by the #aura of temple.\n\nA must visit place in Akola 👌👌✌️✌️👍👍🙏🙏.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Devine Place. One and only annapurna Mata Mandir in Akola. Feel better in Evening Time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Holy place, only temple of Annapurna Mata in Akola",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a peaceful temple of Annapurna Mata, a swaroon of Parvati mata.\n\nIt's outside of the city.\nBest way to go is to choose own vehicle.\nParking available.\nRoad is also good.\n\nRecently updated that One can't donate money / ornaments to this temple.\n\nNo donation Box.\n\nIf you wish to donate, you can donate Sweet food items/ food items as per\nConcerned probably on Tuesday only.\n\nIf you are at Akola city , you must visit this temple",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Tower Chowk",
      "rating": 4.1,
      "address": "Railway Station Rd, New Radhakisan Plots, Mominpura, Akola, Maharashtra 444001, India",
      "reviews": [
        {
          "text": "Akola's Historic Places. Well maintained Mounamint in akola. Now you will get better view from the new flyover. Square is always crawled.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Akola city is incomplete without tower chowk",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice and easy viewing\nBus stand nearby",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Lights in night are great",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "One of the central square of city. Main road to railway station ,bus stand, all stadiums ,JATHARPETH road , and main market road pass through the square. But due to nigligenius of local authorities there was to much illegal accrochment besides of both sides of square. On one side of square there is historical tower name sundarabai khandelwal tower.sbi main branch on añother side.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Siddhivinayak Ganesh Temple",
      "rating": 4.7,
      "address": "P2C9+9V4, Jyoti Nagar, Jatharpeth, Akola, Umerkhed, Maharashtra 444005, India",
      "reviews": [
        {
          "text": "One of the BEST places in Akola.\nSo calm and peaceful.\nOne can spend hours meditating here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place is a great place and one of my favorite places in Akola. The atmosphere in this temple is peaceful and an auspicious which makes our mind positive. It also has a playground for kids and it's the best place for an artist to work.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice and peaceful place. This place is under CCTV surveillance. There is fountain in front of the temple. There are benches to sit. At the back side of temple, there is kids play zone with jhula and other games available. This place is located about 3 KM from Akola Railway Station and 3.4 KM from Akola Bus Stand.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice experience\nGood place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place to hangoit with family. There's a garden behind the temple where you can take a stroll in the morning or evening. Quite neighbourhood. Overall good.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}