{
  "places_with_reviews": [
    {
      "name": "Chand Baori Step Well (Abhaneri)",
      "rating": 4.5,
      "address": "Near Harshat Mata Temple, Abhaneri, Bandikui, Abhaneri, Rajasthan 303326, India",
      "reviews": [
        {
          "text": "Absolutely magnificent. The size and depth of this step well is an engineering and imagination marvel. Seeing this in person will make your jaw drop. I now understand why the “water vessel” structure in New York, USA was inspired by it. Also the many green parrots and other birds chirping around makes this place all the more awe inspiring.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It Represents Ancient History of India and the culture diversity..!! Even with today’s latest and greatest technology we still not been able to build such an Art of Work ..!! 🔥🔥",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is a must-visit place to go with your family/friends.\nThe stepwell is said to be the oldest, deepest in India.\n\nAnother interesting point, there is an ancient Devi temple - हरसिद्धि माता मंदिर, adjacent to the step well, which is said to be built in the same year as the stepwell. The architecture of this temple is very beautiful!\n\nTo visit stepwell:\n- One must buy a ticket from the ticket window\n25/- per head (Indian, ticket window)\n20/- per head(Indian, if you do it online)\n\n- car parking is available (50/-)\n\n- you have shops/eateries nearby\n\nTo visit temple:\nIt is free! (:",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Architecturally very rich place.\nChand Baori is said to be named after a local ruler of Nikumbh dynasty called Raja Chanda.\n\nChand Baori is a deep four-sided well with a large temple located in the back of the well. The basic architectural aspects of the monumental well consist of a long corridor of steps leading to five or six stories below ground level which can be seen at the site. Chand Baori consists of 3,500 narrow steps over 13 stories. The state of Rajasthan is extremely arid, and the design and final structure of Chand Baori were intended to conserve as much water as possible.\n\nAncient Indian scriptures made references to construction of wells, canals, tanks and dams and their efficient operation and maintenance. This site combined many of these operations to allow for easy access to local water. At the bottom of the well, the air remains 5-6 °C cooler than at the surface, and Chand Baori was used as a community gathering place for locals during periods of intense heat. One side of the well has a haveli pavilion and resting room for the royals.\n\nChand Baori is considered to be one of the oldest surviving step wells in the country. On three sides, it has 3500 steps cascading 13 stories deep into a massive tank at the bottom. The fourth side has pillared corridors at many levels.  Of interest here is its exquisite diamond-setting geometry of the cascading steps on three sides and the image of Sheshasayee Vishnu reclining on the serpent Ananta. This baori or stepwell has been constructed in an upside-down pyramid-style. The classical Indian texts on architecture (Vastu) like Aparajitapriccha or Vishvakarma's Vastushastra call this design a vijay vapi. The baori has double flights of steps on each of its ten landings on all three sides. On the fourth side, to the north, is a pillared corridor of many stories. This wall at the north contains two projected offsets to house a niche in each of them. These two niches serve as shrines, the right one houses the deity Ganesha while the left one has an image of Mahishasuramardini. The Ganesha shrine is crowned with chaitya having a female dancer and her attendant carved over it. There are many other dancing figures and attendants carved around this structure. On the upper section, carvings depicting Uma-Maheshwara and Simhavahini Durga can be seen in small nimodifications, repairs, reconstructions since its construction as it was in continuous use till late medieval period.The ancient stepwell underwent many changes for both beautification and better utitlity. A pillared verandah on all four sides seems to be a later addition. There is also a small room, Anderi Ujala, which was a spot to draw water with some traditional pulley-like equipment. Legend also says that a tunnel connected Abhaneri to Dausa.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place, located just 80kms from Jaipur, is the deepest step well in this region. It looks absolutely stunning. Sitting there and admiring the symmetry and the whole design is just hypnotising. Made the long journey from Jaipur worth it.\n\nTo know more about the history you can read up on Wikipedia or any other sources. I don't think a guide is necessary.\n\nA few points to note about this place -\n\n1. The guides were quoting different amounts - started with Rs 500 all the way down to Rs 200. Not aware what the official cost is but be aware else you might overpay.\n\n2. The wheelchair was broken, and we had a disabled person with us who could not enjoy the baori. We had put in an official complaint to replace the chair.\n\n3. There is a restaurant called Chand Baori Restaurant with a beautiful ambience and outdoor seating, and actually good food, but the prices are exorbitant (80Rs for a single small ghee roti) - avoid it unless you can afford those rates.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Harshad Mata Temple",
      "rating": 4.6,
      "address": "2J54+23H, Abhaneri, Rajasthan 303326, India",
      "reviews": [
        {
          "text": "I was there at noon so the temple was almost empty. The temple is located right next to the Chand Baori step well. At first, I didn't know it was the temple there. My curiosity took me to the temple. It was a small temple, yet it was old, quiet and beautiful. I had to say its architecture and design were super impressive. I spent some time there to pray and look around.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Harshat Mata Mandir, dedicated to the goddess of joy and \"Happiness,\" stands as a testament to ancient Indian craftsmanship and devotion. Constructed in the 9th century AD by King Chand of the Chahamana dynasty, this temple showcases the rich architectural heritage of the Solanki style.\n\nUpon entering the temple complex, visitors are greeted by the magnificent sanctuary, mandapa, and pradakshina path, each intricately adorned with intricate carvings and sculptures. One of the most remarkable features of the temple is its series of projecting balconies, embellished with sculptures depicting gods, goddesses, and mythical creatures, adding to its grandeur and charm.\n\nThe temple's interior is equally captivating, with its stunning ceiling adorned with exquisite frescoes depicting scenes from Hindu mythology. Despite the passage of time, these frescoes have been carefully restored, allowing visitors to marvel at their beauty and intricacy.\n\nSituated near the renowned Chand Baori stepwell, Harshat Mata Mandir attracts tourists and pilgrims alike. Its ancient architecture, coupled with its rich history, makes it a popular destination for those seeking to explore India's cultural and spiritual heritage.\n\nWhether you're drawn to its architectural splendor, its religious significance, or simply its serene ambiance, a visit to Harshat Mata Mandir promises an unforgettable experience steeped in history and tradition. It's a place where past and present converge, offering a glimpse into India's glorious past and its enduring cultural legacy.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Temple near Chand Baori Step Well. Must visit the place if you are visiting Step Well. The View from the temple is good. Mostly you will find this place empty at any time, This is a very old temple so you may find many stones or columns with old artwork. No tickets are required to visit this place. Neat and clean active temple made of black stones. Must visit for Architects and who are interested in Ancient structures.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "8th century temple with beautiful carvings ...some still intact after destruction by invaders.....appears to be renovated by ASI......\nMust visit for understanding our rich past.....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Intricate architecture characterised by ornate carvings and detailed sculptures welcomes you to witness the artistic prowess of ancient builders.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "balaji Mandir Bhagoti Ki Bagichi",
      "rating": 4.6,
      "address": "bhagoti ki bagichi, haripura, Haripura, Bandikui, Rajasthan 303313, India",
      "reviews": [
        {
          "text": "Good temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple in my hometown",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "good place and temple of balaji & mahdev",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My favourite temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Rameswaram TEMPLE ,रामेश्वरम् मंदिर",
      "rating": 3.8,
      "address": "2H2M+FH2, MAHANA, Sungari, KA 303326, India",
      "reviews": [
        {
          "text": "Mukerpura rod",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Good experience",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Jai Shri Ram",
          "languageCode": "en-US",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Balaji Temple, Jhoopdin",
      "rating": 4.4,
      "address": "2M52+XGH, Anantwara, Rajasthan 303313, India",
      "reviews": [
        {
          "text": "It's a very famous temple and natural environment in this place and all facilities are available in this place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lord Hanuman Ji (Bala Ji Baba Temple) situated at Jhupdeen Village...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful temple surrounded by fields",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "🙏🙏",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Dev Narayan Mandir Abhaneri",
      "rating": 4.7,
      "address": "2J45+FWX, Abhaneri, Jassapara, Rajasthan 303326, India",
      "reviews": [
        {
          "text": "Good and most satisfying temple of lord Dev Narayan & Bhona ji in Hindu religion, People also believe that he was the Avtar of Lord Vishnu.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dev Narayan Ji is one of the Lok Devta in Rajasthan. People also believe that he was the Avtar of Lord Vishnu.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple in abhaneri",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is the famous DEVNARAYAN TEMPLE.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shiv Mandir,somada",
      "rating": 4.2,
      "address": "XHV7+J4H, Somara, Rajasthan 303326, India",
      "reviews": [
        {
          "text": "Tample is so beautiful",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "So beautiful and nice",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good\nCity",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's make in 2012",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I don't know",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Ticket Counter - Stepwell",
      "rating": 5,
      "address": "Park, inside Chand Bawri, Step Well, Abhaneri, Rajasthan 303326, India",
      "reviews": [
        {
          "text": "Tickets for chand baori are available here\nIn July 2023 the ticket price is\n20-25 for Indians\n250-300 for foreigners",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good place and the step well restaurant was amazing . The step well restaurant is located infront of temple. Plz visit here 📍",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Temple was amazing.",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "कबूतर आश्रय स्थल(pigeon nesting place)",
      "rating": 4.1,
      "address": "Bhandeda, Bandikui, Haripura, Rajasthan 303313, India",
      "reviews": [
        {
          "text": "Small jungal swimming pool ♥️",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Sach a great place .......❤❤❤👌",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice initiative",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Fabulous 😍😍🥰🥰",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "🌹🌹🌹🌹🌹",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Ravli kothi anantwara",
      "rating": 3.7,
      "address": "Ravli kothi, Anantwara, Rampura, Rajasthan 303326, India",
      "reviews": []
    }
  ]
}