{
  "places_with_reviews": [
    {
      "name": "Alleppey Beach",
      "rating": 4.4,
      "address": "Civil Station Ward, Alappuzha, Kerala 688012, India",
      "reviews": [
        {
          "text": "Alleppey Beach, also known as Alappuzha Beach, is one of the most popular and picturesque beaches in Kerala, India. Located in the coastal city of Alappuzha, it stretches along the Arabian Sea coastline and is renowned for its golden sand.\n\nVisitors can enjoy activities like sunbathing, swimming, and beach volleyball. The beach offers stunning sunsets and features a historic pier for panoramic views. It's a hub for local fishermen and hosts the annual Alappuzha Beach Festival. Food stalls offer fresh seafood, and boat rides allow exploration of the nearby backwaters. Accessible by road, it's a popular stop for tourists exploring Kerala's coastal beauty.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beach was dirty because of all the shops on the beach. All sort of stuff was being cooked on the beach itself. Not the kind of beach i would like to visit again. Even though my host told me that it's safe to sit at beach during dark hours, I felt otherwise.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A huge beach with clean waters. Avoid coming in daytime as it’s too sunny. Also the beach has quite a good slope down so not for amateur swimmers.\nThere are good food options close to the beach as well.\nYou surely can get some good pictures clicked for yourself.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Something is special in your life and that won't fail you to amaze. Sea is one among them. Each beach has it own characteristics. Go near to it, it'll speak to you. If you want me to say something more, i would say \"keep place cleaner, don't litter\" (as well don't allow others to make place dirty)",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beach is large and has beautiful sunsets.\nThere was a lot happening when I visited. Horse rides, and an aquarium.\nUnfortunately the beach is a dirty dump of trash and leftovers from people. If you overlook the litter it is a beautiful location.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Alappuzha Light House",
      "rating": 4.4,
      "address": "CCSB Rd, Civil Station Ward, Alappuzha, Kerala 688012, India",
      "reviews": [
        {
          "text": "Must visit the lighthouse if you are in the Alleppey. You can see the city from the top and you just have to climb 100 steps to enjoy the nature.\nOne will not feel like getting down after you reach the top. It's such a nice view..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a wonderful place to visit. The view from the top is amazing. It offers stunning panoramic views of the beach. For elder people climbing the steps will be little difficult. The lighthouse museum is very good you can see the old technologies that how they run the lighthouse in old-times",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's not much, but I'd say it's a must visit for people coming here for the first time. It's busy during hols, but it's kinda cool.\n\nYou won't be able to get inside during the night, but it's a whole another vibe at dark.\n\nOr maybe I'm just too hyped up about a light house because I read too much Famous Five when I was a kid.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I didn't expect the views to be so good. As it's a light house, you have to climb stairs to reach the top but once you reach, you are welcomed by the cool breeze coming from the sea in front of you. I am sure it would be an amazing place for sunset but it gets closed at 5.30 PM. Still the sunset hues at around 5-5.30 are worth watching.\nThere is a small museum too which tells the history of instruments used in the light house from the beginning.\nWorth a visit!!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lovely historical place which is really well maintained! Have to walk up a lot of steps but the view is absolutely worth it! You can see the alappuzha beach as well as backwaters from here!\n\nDon't miss the small lighthouse museum at the entrance gate!",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Mullakkal Rajarajeswari Temple",
      "rating": 4.6,
      "address": "F8WV+Q8R, Mullackal Rd, Mullakkal, Alappuzha, Kerala 688011, India",
      "reviews": [
        {
          "text": "Mullakkal Rajarajeswari temple It's a beautiful temple located in the heart of Alappuzha. It's dedicated to Goddess Rajarajeswari and is known for its stunning architecture and serene atmosphere. It's definitely worth a visit if you're in the area! 🙏🏽",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the renowned temples in Alappuzha!\nSituated almost one kilometre away from the Alappuzha KSRTC bus stand.\nThe temple festival is very famous, many people visit here during the occasion!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very devotional temple and quiet area. The big area of temple and goddess rajarajeswari devi is so beautiful to pray and worship. Must visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Divine.\nBeautiful idol of Rajarajeshwari devi. Lord Hanuman, lord Krishna, Navagrahas and Naga idols are also present in the premise.\nMajestic Elephant is also present in the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good and peaceful temple. Inside the temple many gods are there. Before entering the main temple only men remove your shirt.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "St. Thomas church",
      "rating": 4.2,
      "address": "F977+7MC, Marvel Jetty Road, Pallathuruthy, Pazhaveedu, Alappuzha, Kainakary South, Kerala 688003, India",
      "reviews": [
        {
          "text": "All the boats says that they will start by 12pm but absolutely not they will start somewhere around 1pm or 2pm by saying boat parking reasons as exemptions always.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Perfect place to get the feel of boat house experience",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Calm and holy village place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's the starting point of many of the major  Alleppey houseboat cruises .....",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "♡♡♡\nLocated at coast of Pallathuruthy backwaters Down Pallathuruthy bridge\n\n♡\nPeaceful atmosphere\n\n♡\nMindblowing scenery of backwater house boats and the Pallathuruthy bridge\n\n♡\nIf you have time walk to west end of Pallathuruthy bridge then turn left you can see a small bridge over a canal and a paddy field.\nTake some fresh air and Photographs.\nEvening time is better\n\n♡♡♡\n\n♡♡♡\nപളളാത്തുരുത്തി പാലത്തിനടിയിൽ കായലിനു കിഴക്കേ കരയിൽ സ്ഥിതി ചെയ്യുന്നു\n\n♡\nഗ്രാമീണാന്തരീക്ഷത്തിൽ വഞ്ചി വീടുകളും മുകൾപാലവും കായലും നനുത്ത കാറ്റുമൊക്കെ ചേർന്ന ആഹ്ലാദകരമായ ഒരു കാഴ്ചയാണിവിടം\n\n♡\nപളളാതുരുത്തി പാലത്തിൻറ പടിഞ്ഞാറേ അറ്റത്തു നിന്നും  തെക്കുവശത്തേക്കുളള വഴിയിലൂടെ പോയി ആ ചെറിയ പാലത്തിലൊന്നു കയറി നോക്കു.\nഇതാണ് കുട്ടനാടിൻറ അതിര്.\n\n♡♡♡",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Revi Karunakaran Memorial Museum",
      "rating": 4.2,
      "address": "XVIII/990-A, VCSB Road, near Power House Bridge, Convent Square, Sea View Ward, Alappuzha, Kerala 688012, India",
      "reviews": [
        {
          "text": "A display of unimaginable wealth and opulence. It's just items they have bought nothing else. Presented as if they have done something extraordinary. More than a token of love this is a token of affluence.\n\nThey have kept a car, one of only two models ever made. The attendant was describing it as if the rich person himself has designed and engineered the car.\nIvory items obtained by killing elephants and the presenter was showing it as if it's a great achievement. So much ivory... cannot imagine how many elephants were killed. The art pieces themselves are great, beautiful and delicately crafted. But the credit goes to the artists who made it. Not to the people who just bought it and have put it on display. Everywhere you see you'll just think, wow this person was really rich.\n\nOh, also as if they don't have enough money the entry fee for the \"museum\", if you can call it that, is Rs 200.\nMy suggestion is to skip this and go somewhere else. We only went here because the church was closed and we had time to kill. Visit the coir museum instead.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is their private collection of Mr. Ravi Karunakaran later after their death their family converted into museum if you have around 2 hours you can visit this place. There is guide inside explain you regarding this collections. Ticket price is Rupees 200 I don't think it's that much worth actually, but its ok. Inside photography is prohibited.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Inside the museum it is not allowed to take pictures, the cost of the ticket is 200 rupees per head.\nA great visit if you are in alleppey.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is the superb collection of a single family. Ticket price of 200 will never disappoint you. Superb ivory collection and best beautiful things from all over the world. Please visit here with at least 2-3 hour time for best experience.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Visitors to the museum can explore various exhibits related to coir, including coir-making equipment, products made from coir, and the processes involved in coir production. It offers a unique opportunity to learn about the traditional industries of the region and the importance of coir and handloom in Kerala's cultural and economic heritage.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Udupi Sri Krishna Temple, Alappuzha",
      "rating": 4.6,
      "address": "SH40, Thondankulangara, Alappuzha, Aryad South, Kerala 688013, India",
      "reviews": [
        {
          "text": "Udupi Sri Krishna temple and Matha (Monastery) were set up by Sri Madhwacharya (popular Vaishnava Saint) during the 13th century. Kanakana Kindi: A small window through which Lord Krishna is believed to have given darshan to his ardent devotee, saint Kanakadasa.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful and tranquil temple of my favourite god lord Shree Krishna. Temple is very neat and clean and full of positive energy and spiritual.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Small and nice temple.\nNote that the photos that people have shared here are not from the actual temple in Alleppey, Kerala. They have shared photos of temple from Udupi, Karnataka. The temple in Alleppey is actually small. Please check the photos that I have shared.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good temple complex. Staff / Archakas are very helpful with devotees to perform their poojas. They are also very cooperative. Temple complex is an one Stop for all our pooja activity i.e. for pooja as well as refreshments after Pooja celebrations. Madi is essential for environment along with inner cleanliness.\nYou need to be part of the Mahamanglarati It just touches your soul.\nDo visit this place for peace and spirituality.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One who is going to udupi will surely go to udupi krishna temple as udupi is famous for krishna temple. Not only in udupi but famous in all over india. Many tourist come here to see the temple town.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Alleppey Houseboats | Alleppey Boat House - Waves and Dales Alleppey Houseboat",
      "rating": 4.7,
      "address": "Boat Jetty Rd, near Boat Jetty, Finishing Point, Alappuzha, Kerala 688006, India",
      "reviews": [
        {
          "text": "I had the opportunity to enjoy a boat service, and it truly was an incredible experience. Our journey began in the evening, precisely at 5 pm, and we opted for the package designed for 5 people, which cost us Rs 1600 for a duration of 2 hours. During our excursion, we explored the enchanting and peaceful interior areas of the backwaters, encountering breathtakingly beautiful locations. Without a doubt, this experience was highly valuable and worth every moment.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "1. The boat was exactly the same which was shared in WhatsApp while booking.\n2. We stopped at a place bought fresh prawns and fish for cooking.\n3. All the dishes were great.would. A 5 star for the cook.\n4. The boat ride was very good. Kids enjoyed it.\n5. Bedrooms and washrooms were neat.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We had booked a 4 bedroom luxury houseboat. We were so hungry by the time of checkin. Staff was so kind & the food tasted very delicious just like homemade. The rice paddy field views were awesome & the boat is docked by 6pm. Stay was comfy & the bed linens were kept fresh without any odour. Overall highly recommend. Trip was coordinated well by Mr Libin & Mr Sachin.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We had such an amazing time with our overnight stay! It was lovely touring of the backwaters and the food was incredible. The room was comfortable room with all amenities and the staff were very kind and helpful. Highly recommend!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We got an absolutely filthy, disgusting boat. The main area of the boat was decent enough and even though it was nothing luxurious we were prepared to spend the night there. Once the boat was out, we went into the room to take a look and this is where we were horrified by the filth and utter disregard to hygiene. The AC looked like it had NEVER been serviced before, the extra pillows in the cabinet had mold on them 🤢, our bedsheet was ripped and torn. The extra mattress upon which was my husband was meant to sleep had a hole in it. Needless to say, we immediately booked a hotel to spend the Night and asked the captain to return to dock. Prior to booking, they had sent us a video of the boat, and although the boat was the same as the video, it was obviously taken years ago when the boat was brand new. We didnt get any refund despite the obvious fault of management. I will let the pictures speak for themselves.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Our Lady Of Assumption Roman Catholic Church Poomkavu- Holy Week Pilgrimage Shrine",
      "rating": 4.7,
      "address": "G8H9+FQQ, Pathirappally, P.O, Poomkavu, Alappuzha, Aryad South, Kerala 688521, India",
      "reviews": [
        {
          "text": "* Old church well maintained\n* Maundy Thursday evening is best time to visit\n* very peaceful place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "God's own place for prayer 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "😇",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Poomkavu Our Lady of Assumption church is the greatest /Largest Holy Weekly pilgrimage center in south India. The church was established in 1860. During the 1860s, Thumpoly church, a famous mariyan pilgimage center, was separated and established as an independent parish. The main attraction of the  place is the statue of suffering lord. Many pilgrims come to see and pray to the statue during holy week and non -holy weeks. Holy week and rituals are celebrated here with tradition and rituals. This poomkavu church is a church in the Diocese of kochin. In 1952, something brought this statue to the church.\nIt is the one of the 6 largest pilgrimage center in Alappuzha District. 1. Arthunkal Basilica, 2. Edathwa church, 3. Thumpoly church, 4.poomkavu church, 5. Thankey church, 6.chambakulam kalloorkadu Basilica are the major pilgrimage centers in Alleppey.\nAnother festival celebrated here unnishos dharshana thirunal (child lord ) which falls on the first or second Sunday of January.From Unni Jesus and then from the image of the suffering of the Lord, blessings and miracles take place for those who come here and pray and seek the help of the drunkard.\nHolymass time\nSunday -morning 5.30Am, 7.00Am, 10. 00Am, 6.30Pm\nMonday to Friday -holy mass - 6.00Am,6.45Am\nFriday - 6.00Am 4.30pm holymass, novena and worship.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Another blessed Church in Alappuzha.Poomkavu is situated in the out-skirts of Alapuzha town. It belonged once to the parish Thumpoly.There is not much to see here but this church gives a +ve energy and good ambiance.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Southern Panorama Cruises",
      "rating": 4.6,
      "address": "Near HMCA Church Ward Avalookunnu, PO, Thathampally, Alappuzha, Aryad South, Kerala 688013, India",
      "reviews": [
        {
          "text": "Staying on this houseboat was an experience to cherish! The ambience struck a perfect chord between elegance and comfort, creating an inviting atmosphere that complemented the tranquil backwaters. My room was a haven of comfort, marrying functionality with aesthetic charm.\n\nThe food served was a delightful showcase of local cuisine, fresh, flavorful, and clearly prepared with care. The staff deserve a special mention for their impeccable service; they were not only efficient and professional but also exuded a warmth that made my stay exceptional.\n\nIn all, an excellent stay—highly recommend for the quality of service, the tranquil setting, and the sheer joy it brings.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was a nice experience with clean rooms, hygiene BF, lunch, dinner and supportive staff headed by Rajesh. Prefer AC super deluxe rooms always as it will be hot outside due to humidity. They even arrange a candle light dinner with background music and some lightning which is good for kids to enjoy. We even went to small boats(300 per person) to explore small villages through canals",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I was here with my family and we had a comfy stay. The staff is great and warm-tends to your requests promptly. Not a lot of variety in meals but the taste was satisfactory.\n\nOnly con- the rooms are way smaller than the pics shown and the AC functions only for super limited hours in the furnace like weather.\n\nOverall, a great stay!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Choosing this was one of the worst experiences of my life. They completely ruined my vacation. The service and facilities provided were abysmal, and the staff were unsupportive. I highly advise against wasting your money on this establishment. They don't even deserve a single star.\n\nRegarding the cruising time: Despite their claims, the actual cruising time is maximum 2 hours, including the return to the starting point.\n\nRooms: The rooms are incredibly small, and the air conditioners do not function properly. Even after running continuously for 5 to 6 hours, the rooms remain uncomfortably warm. Upon contacting them, I was informed that remotes were not available, and the temperature was already set up.\n\nDining hall: The air conditioning in the dining hall operates for a maximum of 2 hours during lunch and dinner.\n\nFood: Unless you are accustomed to Kerala cuisine, you will likely not enjoy the food. Despite being comfortable with both South and North Indian cuisine, I found the food unsatisfactory. Only the fish fry was decent.\n\nOverall: The boat is often parked in locations where the view is obstructed by other boats, limiting the enjoyment of the surroundings. During the daytime, the high temperatures inside the tiny rooms make them unbearable, while the upper deck is also uncomfortable due to the lack of air conditioning.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We had a lovely time on the Southern Panorama cruise! The staff was excellent, tended to all of our needs quickly, and with respect. Rajesh was the lead on our boat and he was very friendly and helpful. The room was extremely clean as well as the bathroom but since we had 3 people, the extra bed was quite small and was on the floor. Would recommend getting two rooms if you have more than 2 people given the size of the rooms. The food was very delicious and reminded us of classic home cooked South Indian Kerala food!! The chef was so sweet.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Vijay Park",
      "rating": 3.7,
      "address": "Alappuzha Bypass Rd, Vellappally, Sea View Ward, Alappuzha, Kerala 688007, India",
      "reviews": [
        {
          "text": "My grandma enjoyed visiting the park but it needs some maintenance.\n20/- bucks for adults, but mainly geared towards little kids and seniors for a relaxed time. Some things in the park are broken, and some attractions require extra payment. They have a small cafe and a gaming spot that attracts teens.\nKeep in mind that most rides come with an additional cost.\nOverall, it's a family-friendly place, perfect for a day out, but an upgrade is needed!",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Very enjoyable experience from this park.\nEntering fee 20 rupees of this park .\nCaiking is available only 60 rupees, 04 person in single boat .\nVideo gaming is available after pay 50 rupees per game . Mostly gaming machine not work only two to three work.\nOverall this park made for children enjoying.\nMaintenance of this park is not on time so condition of park is very pathetic.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "I don't recommend all the rides and items that are rusted all of the slides are broken if my child slides there accidentally her back would have scratched. While playing the slide ladder fell down and I went there and checked it. Its weld was rusted and they don't even change the ladder (step). The trampoline is torn. The see saw was rusted and not maintained. Swing is the only ok item there. They don't repair the rides because they want to promote the special ride which costs 40-100rs per ride. Please maintain the park and rebrand Vijay park once again. In my opinion It's ok to charge a little bit more. Maybe 30/adult and 20/child",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Vijay Park is a great place for kids and family outings. It's easily reachable by autos and local conveyance. Has a ticket counter to dispense tickets on entry. On a little walk from the park is the beach that bustles all day long. It's great for ice cream walks during sunset and the beach also has a marine show.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Entry fee is nominal. Each ride will cost you Rs50/-.  Visit during evening hours for better experience for kids.",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    }
  ]
}