{
  "places_with_reviews": [
    {
      "name": "Southern Panorama Cruises",
      "rating": 4.6,
      "address": "Near HMCA Church Ward Avalookunnu, PO, Thathampally, Alappuzha, Aryad South, Kerala 688013, India",
      "reviews": [
        {
          "text": "Staying on this houseboat was an experience to cherish! The ambience struck a perfect chord between elegance and comfort, creating an inviting atmosphere that complemented the tranquil backwaters. My room was a haven of comfort, marrying functionality with aesthetic charm.\n\nThe food served was a delightful showcase of local cuisine, fresh, flavorful, and clearly prepared with care. The staff deserve a special mention for their impeccable service; they were not only efficient and professional but also exuded a warmth that made my stay exceptional.\n\nIn all, an excellent stay—highly recommend for the quality of service, the tranquil setting, and the sheer joy it brings.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was a nice experience with clean rooms, hygiene BF, lunch, dinner and supportive staff headed by Rajesh. Prefer AC super deluxe rooms always as it will be hot outside due to humidity. They even arrange a candle light dinner with background music and some lightning which is good for kids to enjoy. We even went to small boats(300 per person) to explore small villages through canals",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I was here with my family and we had a comfy stay. The staff is great and warm-tends to your requests promptly. Not a lot of variety in meals but the taste was satisfactory.\n\nOnly con- the rooms are way smaller than the pics shown and the AC functions only for super limited hours in the furnace like weather.\n\nOverall, a great stay!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Choosing this was one of the worst experiences of my life. They completely ruined my vacation. The service and facilities provided were abysmal, and the staff were unsupportive. I highly advise against wasting your money on this establishment. They don't even deserve a single star.\n\nRegarding the cruising time: Despite their claims, the actual cruising time is maximum 2 hours, including the return to the starting point.\n\nRooms: The rooms are incredibly small, and the air conditioners do not function properly. Even after running continuously for 5 to 6 hours, the rooms remain uncomfortably warm. Upon contacting them, I was informed that remotes were not available, and the temperature was already set up.\n\nDining hall: The air conditioning in the dining hall operates for a maximum of 2 hours during lunch and dinner.\n\nFood: Unless you are accustomed to Kerala cuisine, you will likely not enjoy the food. Despite being comfortable with both South and North Indian cuisine, I found the food unsatisfactory. Only the fish fry was decent.\n\nOverall: The boat is often parked in locations where the view is obstructed by other boats, limiting the enjoyment of the surroundings. During the daytime, the high temperatures inside the tiny rooms make them unbearable, while the upper deck is also uncomfortable due to the lack of air conditioning.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We had a lovely time on the Southern Panorama cruise! The staff was excellent, tended to all of our needs quickly, and with respect. Rajesh was the lead on our boat and he was very friendly and helpful. The room was extremely clean as well as the bathroom but since we had 3 people, the extra bed was quite small and was on the floor. Would recommend getting two rooms if you have more than 2 people given the size of the rooms. The food was very delicious and reminded us of classic home cooked South Indian Kerala food!! The chef was so sweet.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Alleppey Backwaters",
      "rating": 4.5,
      "address": "G99J+2PF, Meenappally, Kuttamangalam, Kuppapuram, Kainakary North, Kerala 688501, India",
      "reviews": [
        {
          "text": "If you're wondering what's the best way to explore backwaters of Alleppey then I must tell you it depends upon your budget and the size of group you're travelling with.\n\nIf you are loaded with money, of course without no doubt you can go for houseboats. They costs ₹8k per night and upwards.\n\nIf you're a group and just want to explore the backwaters, then you can also hire Shikara boat. Costs around ₹500-600 per hour and can accomodate 6-8 people. You pay ₹500-600 per hour and entire boat is yours. If you want to see everything then minimum 3 hours are required. Rest is upto you.\n\nIf you're travelling solo and on a budget trip but still want to explore backwaters then jetty from STWD Alleppey to Kottayam is for you. It costs around ₹30 (₹60-70 in total) for each side and you get to spend nearly 6 hours in backwaters. Also, it takes the same route as other houseboats/shikara, so you will not be missing anything.\n\nP.S: I have added one of my reels also. :)",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I recently spend my weekend with my loved ones I must say. If you planning to visit Kerala this place must be in your itinerary. Here you see the Beauty of river, Scenery and greenery during the 4 hrs or sikara ride you just fell in love with the place and views, The long coconut trees in both the sides gives you goosebumps like you are living the scenes like you always seen in movies.\nNiw about the service as i booked for whole night so they served three times food as per your choice veg/nonveg. In nonveg their fresh pamphlet fish fry is like a wonder. The food was really good and tasty.\nAdd this place in your next trip. If you like my thoughts and experience. Share your love.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must experience once in a life & must experience village life of Alleppey also. They will take you to village in small boat . Narrow way in backwaters . It was beautiful. Large scale backwaters. Better to book penthouse boat house . We can see beautiful sun set in Boathouse. Food tase was good in boathouse. Better to stay whole day in Boathouse.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's lifetime experience but never gonna come back to this place.  After looking at lot of reviews and ads and posts on social media,  my expectations for this sky rocketed.\n1. It's a bad idea to visit this place  in house boat during summer. You'll become a barbecue.\n2. Lot of mosquitoes.\n3. They will let you operate ac only during night hours.\n4. Even fans don't operate during scorching summer.\n5. They charged 5000 inr for 5 hours for v3 people with welcome drink,  lunch and evening snacks.\nLunch wasn't that good except the single fish they provided us.\nThey gave some rasna kind of drink as welcome drink.  Evening , tea and pagoda.\n6. Felt totally scammed.\n7. You won't find anything beautiful or interesting or new after first 5 or 10 mins.\n8. Speed boat is somewhat good. It's like 300rs. Per person for 10 mins.\n9. If recommend to take small boat or kayak if possible.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Alleppey is famous for its backwaters cruises. There are various places from which the backwaters cruise starts. Also there is large variety of times of cruises and types of boats including houseboats.\n\nWe wanted to do a 1 hour cruise and were not keen on large boats nor with meals on board. We wanted something exclusive and take us off the beaten path.\n\nOur cruise was organised by Mahindra Resort Arrokooty where we were staying.\n\nIt was a one hour cruise on a small motarised boat in a narrow backwater alley. We were five adults and the small boat could easily fit aroung 10 giving us enough space to move around. We were wearing life jackets for safety.\n\nIt was a marvelous experience as were were surrounded by greens and the alleys were truly secluded with ours being the only boat. The waters too were filled with fallen leaves and weeds and at many places you just could not see the water and at times wonder where the boat would head.\n\nOn the way we passed many small hutments and small villages which gave the cruise a rustic feel. The surroundings being so quiet made us experience the lovely sounds of birds as also wind blowing through the trees. The boatman stopped at one particular spot and offered us fresh coconuts.\n\nBest to do this cruise early mornings or late evenings.\n\nOverall, we had a wonderful experience and were glad we stayed away from the crowds.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Nadodi Kayaking in Alleppey",
      "rating": 4.9,
      "address": "Punnamada, Starting Point, Alappuzha, Mullakkal, Kerala 688006, India",
      "reviews": [
        {
          "text": "We did the long route at sunset, was a wonderful experience! The guides are friendly and helpful. The kayaks were great, life jackets and a waterproof bag for valuables were provided. Witnessing the sunset from the water was a marvelous experience!\nBonus: you get to meet some furry friends at the boarding point!",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Sunrise kayaking.\nThe best experience you can have of kerela backwaters.\nWe were late and as per terms and conditions had to take a private guide but\nAkash our guide made this kayaking journey more beautiful.\nHe was so patient and humble.\nWe really enjoyed 3 hrs ride and beautiful company.\nAlso he took such beautiful videos and candid pictures.\nWould recommend this to anyone who is ready for adventure.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nadodi kayaking is located in the backwaters of Alleppey.\nThere was no hassle in booking or pickup and drop.\n\nSafety equipment included lifejackets with whistles. A briefing was done before getting into kayaks.\n\nWe were initially concerned about the duration of 3 hours. However, there was a tea break in between and it didn't feel much tiring. Kayaks helped us see breathtaking views around the island and was truly a once in a lifetime experience.\n\nOverall a wonderful experience. When in Alleppey, I would not miss this. Cheers to Amal!",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It was an amazing kayaking.I have done kayaking in lot of other places in India however this experience was something out of the world.The captain who guided was best in terms of training and guiding.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "best ever spot in allepey....if you guys are planning to go for a vacation to allepey, nadodi kayaking is one of the best spot that one has to experience..especially the guides are really good....and if you're an early bird you wouldn't like to miss the sunrise here....so guys go for it",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Backwaters",
      "rating": 4.7,
      "address": "G9F4+GXF, Punnamada, Alappuzha, Aryad South, Kerala 688006, India",
      "reviews": [
        {
          "text": "Mesmerizing and breathtaking view. As you glide through on a houseboat, surrounded by lush greenery and serene waters, you're immersed in a world of tranquility. The rustic charm of the traditional villages lining the banks adds to the experience, offering glimpses of local life and culture.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very famous backwaters and tourist attractions. There are various houseboats available in the area offering boat stays. There are also small boats which are offering rides for shorter time and speed boat activities are also available. The houseboat anchoring points have lots of mosquitos which should be controlled.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kerala owes a part of its beauty and popularity to the famous Alleppey backwaters, a brackish lagoon that runs parallel to the Arabian Sea. The backwater is beautiful with greenery all around, though the water isn’t very clean. There are many houseboats for tourists to stay overnight or spend a few hours.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Just perfect.\nHosts around 10k boats.\nOnce in a lifetime experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful property and very kind and attentive staff.\nIt was my familys first time to India and we were made to feel very welcome and well looked after.\nI would like a special mention to the F&B Manager Vishnu and his great team that work with him.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "The Great Backwaters",
      "rating": 4.5,
      "address": "G9G5+95J, Lake, Punnamada, Vembanad, Aryad South, Kerala 688521, India",
      "reviews": [
        {
          "text": "Alleppey's backwaters offer a serene and captivating experience. The network of canals, lakes, and lagoons creates a picturesque setting, perfect for a houseboat cruise. The lush greenery and traditional houseboat architecture enhance the charm. However, the popularity can result in crowded waterways during peak seasons.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Backwaters of Kerala - The backwaters of Kerala comprise a vast network of interconnected canals, rivers, lakes, and lagoons, stretching along the coast of the Arabian Sea. This serene and picturesque landscape offers a unique opportunity to experience the tranquil beauty of Kerala's countryside aboard traditional houseboats known as \"kettuvallams,\" providing an immersive journey through lush greenery, coconut groves, and quaint villages, making it a popular destination for nature lovers and travelers seeking relaxation and rejuvenation.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Alappuzha's backwaters offer a mesmerizing experience, with serene waterways surrounded by lush greenery. Navigating through the intricate network of canals on a houseboat provides a unique glimpse into Kerala's natural beauty. The tranquil setting, dotted with coconut trees and traditional villages, makes it a perfect escape. The friendly locals and their vibrant culture add to the charm. However, occasional waste floating in the water detracts from the otherwise pristine atmosphere. Overall, Alappuzha's backwaters are a must-visit for those seeking a tranquil and culturally rich experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is the place where we can experience natural beauty of Kerala state. We will get here houseboat ride which is popularly famous. We can also try surrounding villages located on river bank. The morning and evening scene of sunrise and sunset is ultimate.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to visit to spen 1-2 hrs of a day. There are many house boat and sikara available there. If you want to stay full day then its may not be worth. Now a days area is over polluted. local authority not concerned about that. As a nature lover is a very good place. Enjoy your trip.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "St. Mary's Syro Malabar Catholic Church Punnamada",
      "rating": 4.4,
      "address": "Punnamada Thondankulangara Road, Punnamada, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India",
      "reviews": [
        {
          "text": "Well maintained atmosphere",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good atmosphere. It's very spacious inside church and church premises. Enough parking space.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place..\nOnly Malayalam service",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Even though situated in a city but quite and calm for worship",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Temple like church.\nNearly located parish hall and graveyard.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Punnamada Lake",
      "rating": 4.6,
      "address": "near Bus stand, Punnamada, Finishing Point, Alappuzha, Mullakkal, Kerala 688013, India",
      "reviews": [
        {
          "text": "Enjoy the kerala's best backwaters here. The boat ride is very relaxing.\n\nDo not book boat in advance via travell agent they take hefty commission better to reach here at finishing point and search for the boats as per your preference you will get a very good deal plus you can go around the boat to get actual impression of the boat.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Embarking on the tranquil backwaters of Alappuzha, including the renowned Vembanad Lake and the intricate network of canals like Alleppey Canal and Punnamada Lake, unravels a sublime experience where every ripple narrates a tale of Kerala's unique water-centric culture. My journey into this aquatic wonderland was a sensory voyage, navigating the intricate network of canals and lakes that define the landscape.\n\nThe gentle sway of the houseboat, cruising through the Alleppey Canal and Punnamada Lake, mirrored the unhurried pace of life along the backwaters. Passing through emerald-green paddy fields and coconut-fringed shores, I felt like a silent observer of a timeless saga. The waterways serve as arteries connecting villages and communities, revealing a harmonious coexistence between man and nature.\n\nHouseboats, or 'kettuvallams,' became my floating abode, offering panoramic views of the verdant surroundings. The reflection of quaint villages like Kuttanad and Chavara on the water created a picturesque tableau. It was a living canvas painted with the hues of Kerala's rural life, where every stroke whispered tales of simplicity and resilience.\n\nAs the houseboat meandered through the labyrinthine canals, the tranquility was occasionally broken by the friendly greetings of locals in small canoes. Their lives unfolded against the backdrop of vibrant landscapes, a testament to the symbiotic relationship between the people and their watery surroundings. It was a sensory immersion into the pulse of Kerala's backwaters.\n\nNo exploration of Alappuzha is complete without a culinary adventure in its legendary toddy shops, such as the iconic Ramankari Toddy Shop. These rustic establishments, shaded by swaying palm trees, are not merely places to dine but cultural hubs pulsating with conviviality. Here, the camaraderie flows as freely as the toddy, a traditional palm wine tapped from the coconut trees that dot the region.\n\nThe menu at toddy shops is a gastronomic odyssey, especially for seafood enthusiasts. Freshly caught fish, marinated in an array of local spices, and grilled to perfection, is a symphony of flavors that captures the essence of coastal cuisine. Prawns, crabs, and mussels, accompanied by the quintessential Kerala parotta, offer a culinary journey through the rich bounty of the Arabian Sea.\n\nVenturing beyond the canals, Vembanad Lake stretches like a vast azure expanse. The sight of traditional houseboats gracefully navigating the waters adds a poetic charm to the scene. Cruising on Vembanad allows for a profound connection with the serene beauty that defines Alappuzha. The lake is not merely a body of water but a living testament to Kerala's natural abundance.\n\nExploring Alappuzha's vibrant markets, such as Mullackal Market and Canal Bazaar, reveals another facet of its cultural richness. The kaleidoscope of spices, textiles, and local handicrafts creates a visual feast. Wandering through these bustling bazaars, I felt the heartbeat of the community, each transaction a continuation of a legacy woven into the fabric of daily life.\n\nAs the sun sets over the backwaters, Alappuzha transforms into a dreamscape. The play of colors on the water's surface, the silhouettes of palm trees against the fading light – it's a visual poetry that leaves an indelible impression. The serene ambiance invites contemplation and an appreciation for the simplicity and profundity of the beauty that envelops this corner of Kerala.\n\nMy sojourn through Alappuzha's backwaters, including Alleppey Canal, Punnamada Lake, and Vembanad Lake, was more than a journey; it was an immersion into the soul of Kerala. From the gentle caress of the waters to the robust flavors of toddy shop delicacies, each moment was a brushstroke on the canvas of memories. Alappuzha, with its backwaters and cultural tapestry, is a destination where nature and tradition converge, creating an experience that resonates long after the journey concludes.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Punnamada lake is part of the Vembanad Lake. One of the best backwaters. Clean and neat. It’s slightly pricey. We booked a 4 bedroom houseboat for Rs.40K. We spent one whole day in the houseboat, it was a great experience. There were a couple of stops made, one in the fish market where you can pick up and sea food that is available and your chef on the boat will cook that for you. We had our second stop at a massage parlor, it was priced reasonably. Got to witness the beautiful sunset and sunrise",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Over Hyped back water and lake. Dirty and bad smell water in the lake. local authority not maintain this area. There are no environment consciousness to prevent this natural lake. many boat's black air and garbage make pollution. You can enjoy for 1-2 Hrs, but more than that not worthy. Boat price also over priced. House boat are not good options, you can take hourly boat and make a tour for 1-2 Hrs, that's enough.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Scenic beauty of Kerala Alappuzha. A must visit place in Kerala to have a great experience in boating and ofcourse the Food of Kuttanad. Every year boat race is conducted in remembrance of Jawaharlal Nehru. Karimeen pollichathu is my favourite dish I had from there. Toddy bars are another attraction of Alappuzha. Backwater tourism and coir industry is much flourished in the area. I highly recommend you people to visit there and enjoy your day with your family and friends.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kottamkulangara Sri Maha Vishnu Temple",
      "rating": 4.6,
      "address": "G9F2+HF4, Thalavady Punnamada Road, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India",
      "reviews": [
        {
          "text": "Very good temple. Very large idol. Peaceful place for worship. Our family temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of traditional and ancient temple in the ALAPPUZHA district.. so peace and calm",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Kottamkulangara is a small place within the town of Alappuzha and it got its name from the large temple pond known as \"kottamkulam\". The place is now renowned for its temple complex having two temples within a compound dedicated to two main deities with equal importance. Kottamkulangara Sree Maha Vishnu Temple dedicated to Lord Maha Vishnu and Devi Temple dedicated to Sree Bhadra Kali are situated adjacent to each other facing west with separate flag masts. These two temples are having separate festivals on  different occasions.\n\nThe Lord Maha Vishnu Temple is very ancient and it is the oldest of the temples in Alappuzha. The legends and history gets intermingled when considering the origin of the temple. It is believed that the temple was situated in the centre of the pond which is now covered with sand. From the very ancient days the deity was being worshipped but the state of affairs were  pathetic. The history goes back to the period of Villwa Mangalath Swamiyar who was great Hindu philosopher and the protagonist of Hindu Renaissance. He travelled far and wide and reaching here found out the Chathurbhahu idol of Lord Vishnu from the big pond. It is believed that the idol was consecrated by the great saint Villwamangalathu Swamiyar and started worshipping it.\n\nThe Devi temple dedicated to Goddess Bhadra Kali on the left side of Lord Maha Vishnu was established later in 1799 at the end of 18th century CE after a lapse of about 500 years.The idol of the Goddess which was kept in Avaloor Madom a nearby place was later brought here and installed in the temple. The devi is omnipotent and answers to the prayers of the devotees.\n\nThe main festival of Lord Maha Vishnu falls in the month of January and that of Devi Temple is in the month of March..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of my best peacefull place with coolest atmosphire",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "HMCA Chappel",
      "rating": 4.2,
      "address": "Finishing Point, Aryad South, Kerala 688013, India",
      "reviews": [
        {
          "text": "Super exprence from 2days and we enjoyed a lot .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good church",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice road",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "😊",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Brackish Lagoons Alleppey",
      "rating": 4.6,
      "address": "G9G4+3QP, Punnamada, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India",
      "reviews": [
        {
          "text": "Highly recommend. Very nice and helpful staff. The tour was interesting room very clean and comfortable.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must do. Shikara’s are much better for a hour and half ride. They take you to a small shops along the canal. And don’t forget to stop at the Toddy shops.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "No words to express the feeling and scenery.Its so calming.We started off from the Alleppy boat house.You can negotiate for a houseboat and there would be a lot of options to choose from.Day cruise is between 11 till 5 pm.Lunch is provided onboard.If you dont want a houseboat look for a shikhara boat for a 2-3 hr cruise.The cruise itself is very calm and serene.You can enjoy the vast expanse of the backwaters,the smaller channels,the birds,life along the banks and scenery.The best time is post lunch closer to evening when it becomes less hot.Most boats comeback at 5pm.An overnight stay is not necessary as the boats are parked for the stay.Post 5 pm no boats ply in the lake",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "V nice boats house.  V friendly n helpful staff.  Aishwarya was v helpful and. Courteous.  The bell boys were nice to. The overall experience was pleasant. Scenery for the cruise was nice albeit v close by. The chef eagerly cooked us Swaminarayan  veg food. ...all without any expectation",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent food and stay. Had a great time. Jobie and Ajit were very helpful.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}