{
  "places_with_reviews": [
    {
      "name": "St. Mary's Forane Church (Valiyapally) Pulinkunnu",
      "rating": 4.6,
      "address": "Alleppey , India, CCXR+X68, Pullinkunnu, Kerala 688504, India",
      "reviews": [
        {
          "text": "This church is located in a breathtaking location, and many movies (Vinnaithandi Varuvaya) were shot here. It is a very old church located on the banks of the Pamba River.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "What a beautiful piece of Architecture near backwater shores!!\nTook a Catamaran ride to reach the church.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful church on the banks of the river. The church is huge and interiors look great. The scenery through the roads to reach here is amazing. It's definitely god's own country vibe. The main door of the church will be closed but the side door is open and you can spend some time inside. Sit for some time and you can feel the peace of this place. Could just see two wheelers parking available, very limited for four wheelers parking. Visited on a Saturday so it was calm, Sunday would be crowded as regular prayers will be held.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace full church, situated in the shores of backwater. A must visit place if u plan for a trip to Kuttanad, Alappuzha",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "In the lap of the picturesque Kuttanad in Alappuzha district, situates the iconic St. Mary’s Forane Church, reflecting the Portuguese architectural style. The church dedicated to the Holy Mother was built in 1557 CE. The captivating beauty of the serene backwaters and rivers and the swaying coconut palms that adorn the banks adds to the charm of the place. Currently, the church is one of the most famous tourist attractions in Alappuzha. The church, besides its spiritual aura, also offers an enchanting environment.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "St. Joseph Church Punnakunnam",
      "rating": 4.5,
      "address": "St . Joseph Church, Punnakunnam, Kuttanad Taluk, Kerala 688504, India",
      "reviews": [
        {
          "text": "St. Joseph Church in Punnakunnam, Kerala, is a truly special place. Surrounded by serene lotus-filled water bodies, it's incredibly peaceful. What makes it unique is the chapel in the cemetery, which is below sea level. The beauty of this place, both natural and architectural, creates a serene and spiritual experience that's truly unforgettable.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Wonderful architecture,  peaceful and must appriciate Fr.Tony maniyanchira for the beautiful new church construction",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Really peaceful atmosphere and wonderful architecture. Surrounded by green fields😻 mind refreshing place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great experience and good ambiences and natural beauty of kuttanad",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very good looking and architectural church in kuttanad.. night ambiance is also amazing",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "St. Jeromes Church of Nazareth",
      "rating": 4.6,
      "address": "St. Jeromes Church of Nazareth, CCV7+X9H, Nedumudy, Kerala 688503, India",
      "reviews": [
        {
          "text": "My wife and I were invited to this Church today. There was a festival that evening. We were blown away by the festival, but also by the energy and enthusiasm of its congregation. These people really are filled with the Holy Spirit and seem to be living good and happy lives. I think many people in the West are really missing out on how transforming (in a positive way), Christian living and belonging to such a community can be. Our thanks to Rajeev, of the always wonderful Palma Heritage Villa, for his kind invite.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Small church but calm atmosphere. Near by   river. On the way with paddy fields of kuttanad. I reached here from ac road happy to visit rare church name of st. Jerome.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The church situated on the banks of manimala river. Beautiful scenario and atmosphere. A boat jetty also in front of the church. Can get a boating on booked call.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Syro Malabar catholic church situated on the shore Manimala river.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Kurishadi at road side near church",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Moncombu / Mankomb Devi Temple, Alleppy",
      "rating": 4.6,
      "address": "CCRC+QW3, Moncompu, Kerala 688502, India",
      "reviews": [
        {
          "text": "I recently had the opportunity to visit the Moncombu Bhagavati Temple, a serene and spiritual place located in Alappuzha ,Kerala. The temple is dedicated to the goddess Parvati and is known for its unique and traditional adoration ceremony called Chathushadham.\n\nThe Chathushadham adoration at Moncombu Bhagavati Temple is a truly mesmerizing experience. The elaborate rituals and offerings to the goddess create a sense of awe and reverence among the devotees. The atmosphere during the adoration is filled with devotion and positive energy, making it a truly uplifting and spiritual experience.\n\nOverall, my visit to the Moncombu Bhagavati Temple was a truly unforgettable experience. I would highly recommend this temple to anyone looking to immerse themselves in traditional Kerala culture and seek blessings from the divine goddess Bhagavati.\n\nIf you are offering Chathussatham, please bring the necessary large vessels( approx 4 ltr or above )for it and paper glasses to distribute the prasad to the devotees.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Deity is Devi Bhadra and the temple is West facing.  Close to Manimala river in the picturesque region of Kuttanad, Alapuzha district  in Kerala.\nThe annual festival is popular and celebrated in mid April (Malayalam month Medam 1-10th). The 8th day aaratu and 10th day Garudan are a life time experience. Must see.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Set between beautiful location, remotely   situated, religious place. Better not to venture in rainy season.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very divine. Visit it using the ferry from the Allapuzha Changnacherry road to make it more pleasurable.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple\nGood place to enjoy the nature",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pulinkunnu",
      "rating": 4.4,
      "address": "CCXQ+3H8, Village Office Rd, Pullinkunnu, Kerala 688504, India",
      "reviews": [
        {
          "text": "Pulinkunnu is a self governing body head office of pulinkunnu village In kuttanadu taluk in Alappuzha. It's surrounding villages are very beautiful and amazing landscape. Good to relax and evening boat ride to watch sunset in the river",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A beautiful and yet calm village",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful village with paddy fields, old Churches etc",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Serene Backwaters area of Alappuzha. Lush of greenery and backwaters. One of the unique places in Kerala. Pulinkunnu church is very famous among devotees as well as others through cinemas in different languages. Water connectivity is more preferable here. The traditionaly built old houses well maintained even after these long years adds to the beauty of Alappuzha particularly this area. Paddy & coconut are the most grown agricultural product here. Duck raising also very prominent here. Fishing is another major occupation in this area. We can rely these areas to get fresh, tasty backwater fishes and duck products here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a paradise for the people who just want see how a village life will be",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Moncompu Sri Bhagavathy Temple",
      "rating": 4.7,
      "address": "CCRC+QWF, Moncompu, Kerala 688502, India",
      "reviews": [
        {
          "text": "A Great temple of the Goddess, attracts hundreds of people. Annual 7 days festival begins on 14th of April every year. Followed by the Great Pathamudayam festival on 23rd April every year.💕",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is temporarily closed for renovation, aimed  at significantly raising its elevation to protect the temple from frequent inundation due to floods caused by rain  and high tides. The entire structure will be raised, in situ. The work is executed by an expert company in Ernakulam.\n\nPending renovation, the idols are being kept and rituals carried out in a sub-temple called \" Balaalayam. The work may take about two years for completion.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful place.. the temple is the main landmark of the area.. its surrounded by paddy fields. The area is rich with many historic values.. the temple is more than 200 yrs older",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is a major Temple under trivandrum devasam board. It is the oldest temple in Kuttanadu taluk. The temple contains rich sculpture works and wood works the goddess devi. It is situated near moncompu LP school , near ATVHS school moncompu. It is a tourist destination in Kuttanadu . During the 10 days ulsavam starting after vishu , many people from different areas reach here to receive the blessings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🍁",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Saint Teresa's Church",
      "rating": 4.6,
      "address": "FFC4+CP5, Kavalam, Kunnumma, Kerala 688504, India",
      "reviews": [
        {
          "text": "The church and it's surrounding are good.. but Road facility is poor. I hope to add the bell tower build at 1979..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This church is located facing the river. It is accessible by both road and water.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Church situated besides lake. Beautiful village of Alappuzha district.Dedicated to St.Teresa of Avila. Under Changanacherry Arch diocese.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nicely located church. Near to Lake. The road is little bit rough. Have a small parking space. The church has been renovated few years ago.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful area.. River side... Nature beauty... Peaceful area for praying...",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Krishnapuram Temple",
      "rating": 4.4,
      "address": "FF98+956, Kuttanad Taluk, Kerala 689590, India",
      "reviews": [
        {
          "text": "A place one must visit.Located at a distance of 18 km from Changnasherry Kerala State Road Transport.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice temple in the bank of #Pamba River, the main deity is #Sri. Subramanian Swami. This is also a location of movies based on #Kuttanadu........... There is a service boat jetty in front of this temple , the calm and quiet atmosphere make over selves refreshed..…...... Loved to spend some healthy time here...........",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Sree Balasubhramanya Swamy Temple ,Krishnapuram , Kavalam., ocated on the shore of Alappuzha- Veliyanadu Fery. Its getting renovated. This place has great views. S There is a boat Jetty nearby.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is beautiful temple with good and beautiful atmosphere, one of the Best temple in kuttanad, reached here by boats or bus, private and public transportation is available, take good photos, feel nice wind, The another heart of kuttanad,",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Water frontage temple with vast area. Beautiful scenery. Mega star Mammootty's  'Oru Kuttanadan Blog ' was shot there.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Thattassery Junction, Kunnumma Kavalam",
      "rating": 4.2,
      "address": "puthenveedu house, 123455, Kurichy - Eara - Kavalam Rd, Kavalam, Kunnumma, Kerala 688506, India",
      "reviews": [
        {
          "text": "Very nice place,with a lots of coconut trees, river,temples,church majority of the people there are good, there is no bridge to cross you should choose Jangar or boat for crossing the Pamba river the road from Thuruthi to Thattasserry is very bad the politicians are not taking any action it have been more than 5 months the road is full of Pothole it's very common their the politicians needs only money, The road is very very bad don't think about going their with your premium cars.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Ambience is just amazing",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Calm and quite place.😊",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Thattassery it's my nostalgia. Don't know what to say.. I will be happy very much if I go Kavalam. My family temple is there, my relatives are there.\nIt's so beautiful place❤",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Thiruvilagadu sree Mahadeva Temple",
      "rating": 4.6,
      "address": "FCHW+F7V, Kavalam, Kunnumma, Kerala 688504, India",
      "reviews": [
        {
          "text": "A place of calm and peace. Lord Mahadeva is the deity here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My own temple...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "😘",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pleasent",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}