{
  "places_with_reviews": [
    {
      "name": "Alibaug Beach",
      "rating": 4.2,
      "address": "Alibag Beach Rd, Main Beach, Limaye Wadi, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "It's a nice for a one day or 2 day trip. The place is very affordable as compared to other beaches. The beach in itself is a bit unclean and won't recommend for bathing but the fort that is there in the sea has a beautiful view and is really picturesque.\nWe booked a near by resort for a couple of hours and had a nice day. The sunset here was breathtakingly beautiful ❤️",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's a very neat and clean beach, with a lot of activities like cycle riding, horse riding, camel riding and ATB bike rides. You can also see the Kolaba fort from the shore and can access the fort on foot during low tide",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Alibag beach, is one of the  beach recommended for people seeking night beach stay and  water sports activities like parasailing, speed boat racing, and beach buggy racing can vary depending on several factors. Some of these factors include the quality of the equipment, the professionalism and skill of the instructors or guides, the safety measures in place, the cleanliness of the beach, and overall customer satisfaction.\n\nOverall, a 3.5 rating suggests that while Alibag Beach has its charms and offers enjoyable activities, there are areas where it could improve to provide a more consistent and satisfying experience for visitors.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Alibag beach is a picturesque haven that seamlessly blends tranquility and excitement. The pristine sands and crystal-clear waters create a captivating backdrop for endless enjoyment.Whether seeking thrilling rides, serene boating experiences, or simply basking in the sun, this beach has it all. Families, friends, or those seeking solitude can find their perfect spot here. The range of activities ensures there's something for everyone.The beach is a canvas painted with natural beauty. Sunset strolls or early morning dips offer moments of pure serenity, allowing one to connect with nature's soothing rhythm. You can even visit Kolaba Fort by boat from this beach. As of now it costs 200/- Rs per person (both sides).",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Alibaug Beach is well known public attraction. A very busy and happening place. Good water rides and food options available here.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Kulaba Fort",
      "rating": 4.2,
      "address": "JVM7+MQP, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "Strategically located in sea with proximity to alibaug Beach.\nOn days of low tide, one can take a walk of around 15 mins to fort from the beach. otherwise U will need a boat ride to reach the fort.\n25 Rs entry fee. one can also scan the bar code for online payment (Rs.20).\nSadly, it's poorly maintained fort which once used to be headquarters of Shivaji Maharaj's naval command.\nIf visiting alibaug, one should definitely visit the fort and pay homage to our greatest icon Chatrapati Shivaji maharaj.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice fort under control of archaeological Survey of India, need to maintain further cleanliness.. security can check for tobacco, Gutkha etc. To make fort more hygienic.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Best historical place to visit. Ganesh mandir, Hanuman mandir, Shiv mandir etc. on fort. Canons are also in the fort.\n1 hr enough to complete the tour.\nBoat service available from the beach to the fort(200 ₹PP).",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is a fort built by the great Maratha warrior Chhatrapati Shivaji Maharaj around the 18th century. If you are around the beach, do visit this fort.\nIt can take 30-45 min (or more based on your interest) to cover the whole fort.\nOne can reach there by walking or carriage during the low tide period. Mansoon would be a great time to see but take care as it may become slippery.\nThere is Rs. 25 entry fee. Usually the fort gets closed around 6 - 6:30PM so make sure you reach there by the latest 5 - 5:30PM so that you will get the entry.\n\nOne of the awesome times is to be there during sunset as we will get to see the beautiful sunset view.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The fort has definitely seen better days. In its current state nothing much is there and it's only for a good walk or a stroll from the beach",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Varsoli Beach",
      "rating": 4.3,
      "address": "Varsoli Rd, Tivarekar Wadi, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "This beach is around 45 mins away from the Mandwa Jetty and it's actually a nice clean beach with lots of activities to do. It has water sports for adults, small car and ATV bike rides for kids and nice double seat cycles for adults. The water is decent but not very clean. There are a lot of stalls outside the beach for snacks.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Small beach. But clean.\nLess crowded.\nQuiet place.\nHas few food stalls where local people make food as per order.\nWe have to be careful to select fish and prawns as it may not be fresh.\nHas activities like water scooters, camel rides, ATV rides.\nHas ample open parking which is free.\nBeach has black sand. Sea water was bit dirty.\nNo facility of washroom, no sitting arrangement.\nBeach is not that famous so limited crowds.\nDo not have good restaurants near by.\nDo not have near by hotel for stay.\nBeach is onetime visit list.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is less crowded beach. Fine black sand like alibag's other beaches. Not clean. Big area for walking. Water sports activities and horse, camel rides are there. Can enjoy with kids and family.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This beach is a sanctuary for those seeking a harmonious blend of natural beauty and thrilling activities. Whether alone or with loved ones, it promises a rejuvenating experience, making it a must-visit destination for anyone craving for a perfect beach view.This beach provides ample space for picnics, group activities, or even solitary introspection. The ambiance is both lively and serene, accommodating diverse preferences seamlessly.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent beach ever seen till date. Very clean ant neet. Very fine sand observed on the beach, due to which no uncomfortable feeling on skin is not experienced. Really it's worth a visit to this beach. I strongly recommend it for whom , who love less rush and need a clean  beach. Only experienced less water level in the shore when we visit.But it's good for safety for our family and children. Over all good experience.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Suruchi Restaurant",
      "rating": 4.2,
      "address": "MV4M+63J, Shri Swami Samartha Nagar, Alibag, Chendhare, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "A good experience for food but  service needs to improve. Location is good, it's almost road touch. Parking facility is also available here, but during peak hours it may not be available as space found smaller one.So good go early hours in dinner time. A small children's play area is there . Good washrooms are here. Desert/icecream dishes Not available , need to order from outside icecream parlour, on request you. Can sit n  enjoy this icecream there in the restaurant. Over all good experience.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Hotel Surichi is located at Pimplebhat Alibaug on Alibaug Pen Road.\nThe food quality in the hotel is ok ok and service is also ok ok....\nThe parking area here is very special and there is also a small garden for children so you are definitely perfect as a family restaurant.......",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Food was tasty\nQuantity of special items and starters is more then enough\nThey have normal and ac room sitting",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "So I'm Alibagkar, but stays in Pune so whenever I come to weekend at my home we visit to Suruchi, it's most favourite restaurant of all in Alibag\n\nA must go, they prepare very delicious food.Main course panner items are must try ,they are truly made delicious.\n\nBut recently this week, I visited it was Tuesday not even weekend so that it's rush.\nThe food was terrible\nThe staff specially waiters has an attitude issue, very arrogant.\nFood was served not that hot, almost cold\n\nTomato soup was plain , with no proper taste\n\nPaneer tikka starter was dry like hell no juicy paneer and no good marination\n\nRequesting not to degrade the quality\nLot of people have trust and they visit with guests to your hotel, so please maintain that quality and also the atmosphere.\n\nI will recommend to have paneer in main course like\n\nPaneer kaju roll masala\nPaneer lababdar\nPaneer pasanda\nPaneer lajawab",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I recently had the pleasure of dining at Suruchi Restaurant, and I must say it was an absolute delight from start to finish. The ambiance was charming, with tasteful decor and a cozy atmosphere that immediately put me at ease. Every dish was a masterpiece, bursting with authentic flavors and made with the freshest ingredients. From the appetizers to the desserts, each bite was a culinary journey that left me wanting more. The menu offers a wide variety of options, catering to every palate, and the presentation was impeccable. The service was top-notch, with attentive staff who were knowledgeable about the menu and offered great recommendations. They ensured that my dining experience was nothing short of perfection.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Thal Beach",
      "rating": 4.4,
      "address": "MVQ5+6R2, Thal, Maharashtra, India",
      "reviews": [
        {
          "text": "Good beach for sunset golden hours photography. Although be careful of the black oil slick mixed with sand . Parking is a problem as it's access is  through narrow lanes",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Thal beach is very good, clean,safe and peaceful. This is very close to Alibag city. No food stalls or no sports activities are there. You can enjoy or time spend with your family or loved ones. You can see white sand here except for other beaches of Alibag. In the evening you can enjoy the sunset here. Great spot for a picnic.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a relatively secluded beach on the Konkan coast, just 5 km before the famed Alibaug beach.\nIt is clean but swimming may not be advisable due to the rocky patches.\nSunset is a treat here.\nThere are no restaurants or cafés on the beach and no water sports too.\nThere are quite a few cottages close by and the rates are lesser than those at Alibaug.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Visit this beach to avoid spoiling your weekend plans by visiting crowded alibaug beach.\nMore clean and quiet than alibaug and varsoli beach.\nYou will have many options to stay nearby.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "thaal beach is a shaded spot between alibag and varsoli beach. The beach is relatively clean, with good access roads.and not much crowded",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Hirakot Old Fort",
      "rating": 5,
      "address": "JVX9+7JW, Police Line, Alibag, Maharashtra 402201, India",
      "reviews": []
    },
    {
      "name": "ALIBAG JETTY",
      "rating": 4.3,
      "address": "JVQJ+CW5, Koliwada, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "Sharpen your knowledge and negotiation skills before being here.. very fresh fish with variety available here.. just make sure you are visiting before sunrise",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Not big jetty but small boat ( तर) . Which will drop.you to the opposite side of khadi. Charges 10 rs per head",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Well maintained, organized and prompt staff",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Superb",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Thal Chalamala Beach",
      "rating": 4.6,
      "address": "Thal, chalamala Beach Alibag, Alibag, Maharashtra 402207, India",
      "reviews": [
        {
          "text": "Great beach, Clean water, minimum people, nice for sunset",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A much cleaner and less crowded beach...for enjoying the sunset this is the best beach..\nBut there is no food stall or anything on the beach... You just have to carry your own meal .\nThe beach is very clean and calm you can enjoy the sunset here !\nYou can visit this place any time. There are no charges to get to the beach.\nThe beach is less crowded than other beaches in alibag!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lovely, peaceful beach. It's west facing the Arabian Sea, so one can perfectly time their visit at sunset, they're really pretty. Atleast during low tide a wide stretch of sand is there to enjoy the sunset and cold breeze.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful Sunsets, calm and shallow water. Beach itself could be a little cleaner in my opinion, but it's flat enough to play cricket or football on if you are into that.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If you plan to visit Thal Chalmala . Then please do visit Sahajayoga Ashram.\nAsk for Self Realisation.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sarkhel Kanhoji Angre Samadhi - Alibag",
      "rating": 4.5,
      "address": "Thikrul Naka Mitra, Koliwada, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "Very good servicing My experience at Marks Motor's service center was very good,\nThe general manager there, Adil sir, is very down to earth, he himself comes and helps the customers\nMr kamble I don't know his designation, but yes, he is a very skilled and loyal employee who always helps the customers\nThere are some small things everywhere that we can ignore. The rest of my overall experience was very good.\nI would like to thank all the employees of Marks Motors, who are always ready to serve the customer",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A memorial in honour of Kanhoji Angre, the great maratha naval warrior. It is a small park with the burial site of Kanhoji Angre. Nothing much more than that. Can spend few minutes to maximum.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lot of scope for improvement though.\nThey should have more information displays and it is best transferred to either a foundation run by armed forces or a charity that or corporate entity that can take proper care of the same and make it more touristy.\nA nice place that memorialises Admiral Kanhoji Angre, a great Maratha soldier and admiral who ensured Maratha supremacy over the Konkan coast.\n.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit if you want to know more about the great warrior Kanhoji angre !!\nThe garden is well maintained by the government. Must visit !!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A nice place that memorialises Admiral Kanhoji Angre, a great Maratha soldier and admiral who ensured Maratha supremacy over the Konkan coast.\n\nLot of scope for improvement though.\n\nThey should have more information displays and it is best transferred to either a foundation run by armed forces or a charity that or corporate entity that can take proper care of the same and make it more touristy.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Orchid Anant Holidays.",
      "rating": 4.2,
      "address": "Omkar Naka,Near Rajendra kirana store, Varasoli, Alibag, Maharashtra 402201, India",
      "reviews": [
        {
          "text": "I went there with a group of 10 friends. The place is homely with clean rooms with AC. The food is awesome a treat for non veg lovers.But we were disappointed cause,The lady who was co-ordinating with us was arrogant, they dont stand by their commitments. They gave half and incomplete information.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is an amazing budget friendly stay place. My brother booked one room for 5 people. It was very spacious and clean. The bathroom was very hygienic & also had a bathtub. The swimming pool also was clean and big enough. Very quite place which is near to the versoli beach...the staff SAGAR is soooo cooperative and friendly. He is very approachable and always provides was has been asked for..that guy literally took my brother to the city on his own bike to buy a cake.. I'm really happy with the service and the room... highly recommended.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very much disappointed...\nThe Room had Cockroachs!\nhow will one stay if there are bugs in the Room.\nThe owner must take care of this issue.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place for staying with family. Cool and isolated , you get privacy for swimming. Good quality sea food as per demand. Rooms are clean and hygiene. WiFi available.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Enjoyed my stay at the property. The pool is very clean and food supplied by Ramesh is tasty..",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    }
  ]
}