{
  "places_with_reviews": [
    {
      "name": "Aligarh Fort",
      "rating": 4.1,
      "address": "W3G5+5W6, Masud Nagar, Qila, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "It is a matter of great pride that a  5 🌟 category hotel has come to our Aligarh.Hotel Name Fortune Park, Aligarh, ITC Group.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Aligarh Fort, also known as ‘Aligarh Quila’, ‘Baunasaur Quila’ or ‘Ramgarh Quila’, is amongst chief attractions of the destination.\n\nThe fort was built by Muhammad, son of Governor Umar in 1525 during the reign of Ibrahim Lodhi. It is located on a hill with steep ravines on all sides of about 32 feet.\n\nThe polygonal construction having bastions at each angle is the highlight of the ancient testimony",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Aligarh qila or bone chor ka qila was built in 1524-25 by ibrahim lodhi, however now only the ruined remains of the fort are present but alot of greenery, beautiful and colourful trees are present inside the fort area alongwith a botanical garden under control of aligarh muslim university.\nHere you can find birds and animals like peacocks, ferrets, koel birds, etc and the ambience is really calm and peaceful.\nReaching the main ruins of fort and on top of the fort area is not easy as the trails which leads to them are covered in thorns, bushes and steep inclines.\nThere is no entry ticket so anyone can visit it which makes it a weekend destination.\nA large parking area is also present here.\nSo if you are a nature lover then this is a must visit place.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The only place to visit in Aligarh, but due to negligence the fort is losing its charm...",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "If are looking for peace, just go there and take a deep breath.. you will find peace and satisfaction... Although it's one of the silent places I ever visited... But if you are planning go there kindly visit in afternoon and there is one dargah also for the devotional ones..\nYes it's far from Aligarh dense area but a nice place to visit...\nI remember that it's just located near faculty of law, Aligarh",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Centenary Gate, Aligarh Muslim University",
      "rating": 4.8,
      "address": "University Rd, Purani Chungi, AMU Campus, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "I am writing to express my sincere appreciation for the remarkable institution that is Aligarh Muslim University (AMU). It is not merely a university but a bastion of knowledge, diversity, and cultural richness. AMU's commitment to academic excellence is evident in its storied history and the countless success stories of its graduates. The university's emphasis on fostering critical thinking and research has not only shaped individuals but has contributed significantly to the intellectual landscape of our nation. One cannot overlook the unique environment that AMU provides a melting pot of cultures, where students from various backgrounds come together to learn and grow. This cultural diversity is not just a feature but a strength that prepares students for the globalized world, instilling in them values of tolerance and understanding.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The Centenary Gate at AMU is a beloved landmark that represents the university’s long history and academic success. Its beautiful design and historical importance make it a favorite spot for students and visitors. Walking through the gate fills you with pride and a sense of belonging to AMU’s community. It’s a reminder of the university’s dedication to excellence and welcoming atmosphere.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I visited AMU Campus for the entrance examination. All the students are so helpful and of friendly nature. They have offered rooms to sit & study as I have reached earlier. The vibes of the Campus are just amazing. Overall it's a very marvelous place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is a one of the gate to enter the university campus from purani chungi. This gate has built on the completion of 💯 years.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "So beautiful ❤️❤️🤩\nI went with my family and had a great time ☺️\nYou can also enjoy coffee or chai from the Dhaba ☺️🤩",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Naqvi Park",
      "rating": 4,
      "address": "W33F+29X, Civil Lines, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "The park is good but the security guards are very cheap. Only some of them are good at their behaviour.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Naqvi Park\nCharming neighborhood park boasting wide green expanses, playgrounds & walking paths.\n\nThere is lots of greenery.. people come here for walk.. enjoy their weekend.\nOne of the major tourist attraction for Aligarh tourism.\n\nWe can find place connected with nature.. young one playing games,old one walking.. adults also with family..etc\n\nIt feels good to be here..and find the comfort zone.\n\nSome school children also come here for picnic destination",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Best park and a lovely place to spend time\nOne can spend a full day under its beauty\nTheir u can get fresh oxygen because of the greenery that gives the best view for the photographs\nIt is a most loved place for photographers",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Famous Naqvi Park is also named Rajkeey Uddhan Jawahar Park. It’s a vast park with lush green vegetation and giant old trees, with Gulab Bari, fountains and many other attractions. Naqvi Park is popular among joggers and morning walkers. People also throng this park with families on their leisure time.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "One of the only best place for workout with exercise manual machines for better health and fitness.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Jama Masjid",
      "rating": 4.9,
      "address": "Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "A must visit mosque in Aligarh, such a soothing feeling.\nYou will be mesmerized by the view and architecture of the masjid.\nWidespread having capacity to occupy more than 1000 peoples .\nA large amount quran with other islamic book available there.\nVisited for maghrib prayer , Imam sahab have very beautiful voice .",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It's beautiful mosque of Aligarh Muslim University, India.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nestled within the vibrant campus of Aligarh Muslim University lies the majestic Sir Syed Mosque, a cherished landmark with deep historical roots. Situated within Sir Syed Hall, this mosque not only serves as a place of worship but also holds the revered tomb of Sir Syed Ahmed Khan, the visionary founder of the university. Construction commenced in 1879 under Sir Syed's guidance, culminating in its completion in January 1915. A visit here offers a serene blend of architectural beauty and homage to a pioneering figure in education.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very beautiful mosque. It is located in sir syed hall south hostel, in Aligarh Uttar pradesh",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Inside view Masterpiece of  grand mosque of AMU in terms are Art, peace, and a usual place of gathering for developing wisdom and sense of humbleness. Open to all,  Situated at Victoria gate and Sir Syed south hall, AMU.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "माता का मंदिर (शक्ति नगर, अलीगढ़।)",
      "rating": 4.6,
      "address": "Shakti Nagar, Nagla Masani, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "Very peaceful and divine...as if you are in the lap of Godess Durga. People in the nearby areas and pan India have deep  faith in this temple. Specially who visit Maa Vaishno Devi Temple Katra must visit this temple while returning home to get thier pilgrimage complete.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Really!!  AT Very large amount of pilgrims visits here for Darshan.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "holy place , jai belon mata Ji",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best experience",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very  nice  mander",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ghanta Ghar",
      "rating": 4.1,
      "address": "V3WF+6HG, Church Compound, Civil Lines, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "I recommend visiting during the day to fully appreciate its historical beauty. Daytime offers a clearer view and a safer environment, allowing visitors to enjoy the iconic structure without the limitations posed by inadequate lighting.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Aligarh ghanta ghar location is nearby kathpula flyover, church, Aligarh nagar Nigam office, tehseel kol , Railway station is 1 km away from it.\nAbout Aligarh\nIn 1194, Qutb-ud-din Aibak had mounted a successful invasion of the region and Hisam-ud-din Ulbak was installed as the first Muslim governor; court-historian Hasan Nizami noted Kol to be \"one of the most celebrated fortresses of Hind\". Beginning the 13th century, the place featured — as Kol or Koil — in multiple Persian (as well as non-Persian)  Sultanate  sources as a center of economic prominence esp. for production of distilled wine. By the mid-13th century, the town commanded enough importance for (would-be Sultan) Ghiyas ud din Balban to erect a minaret.\n\nUnder the Khiljis and Tughlaqs, the prominence continued unabated; it had become an  by the times of Alauddin Khalji.\n\nKol is mentioned in Ibn Battuta's Rihla, when Ibn Battuta, along with 15 ambassadors representing Ukhaantu Khan, emperor of the Mongol Chinese Yuan dynasty, travelled to Kol city en route to the coast at Cambay (in Gujarat) in 1341. According to Battuta, it would appear that the district was then in a very disturbed state since the escort of the Emperor's embassy had to assist in relieving Jalali from an attacking body of Hindus and lost an officer in the fight. Ibn Batuta calls Kol \"a fine town surrounded by mango groves\". From these same groves the environs of Kol would appear to have acquired the name Sabzabad or \"the green country\".\n\nIn the reign of Akbar, Kol was made a Sirkar and included the dasturs of Marahra, Kol ba Haveli, Thana Farida and Akbarabad.Akbar and Jahangir visited Kol on hunting expeditions. Jahangir clearly mentions the forest of Kol, where he killed wolves.\n\nDuring the time of Ibrahim Lodhi, Muhammad, son of Umar, was the governor of Kol. He built a fort at Kol and named the city Muhammadgarh, after himself, in 1524–25. Sabit Khan, who was then the governor of this region, rebuilt the old Lodhi fort and named the town Sabitgarh, after himself.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Its a good place for spending your evening either alone or with friends. there are some benches with grass flor that you can opt to sit on. the clock tower, indeed is the main point of this place stands firmly amid the honks of the surrounding running vehicles.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Lovely ambience in the center of crowded city.....\nA must place to visit...",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "It's a nice place for evening walks. This clock tower was erected in 1893 by the voluntary contribution of hindus and mohammedans of Aligarh district. It was named after the then revenue collector Harrison. It was built in victorian Gothic style.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "SAI Mandir Aligarh",
      "rating": 4.5,
      "address": "Sarsol, GT Rd, Bhima Nagar, Sarsol, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "One of the best experience ever had",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's  a beautiful temple om sai ram",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One most popular temple of Sai Baba. This is situated in sarsaul Area. Now here you can visit in Shani Temple and Durga Mata Temple also. One of the best place for pray and meditation. OM SAI RAM.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a good place for worship, however parking facilities are not available.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Mandir is so beautiful but some of the pandits i didn't like they snatched away my phool malaa and all .this should not be the behaviour and the mandir was all empty at that time then also they did this. It's a place or worship people go there for peace they must understand this thing. But if I talk about the interior of mandir it is good",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Khatu Shyam Mandir Aligarh",
      "rating": 4.9,
      "address": "Prince nagar colony, GT Rd, V2WX+9PQ, Melrose Bypass Road, near kamakhya mandir, Prince Nagar, Bannadevi, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "Jahangirpuri is the last metro station to go here, after that take an auto from there and tell them that we have to go to Khatu Shyam Mandir. Avoid to coming here on holidays There is a lot of crowd here, here you get food items at very reasonable prices and it is also very good to eat.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It's still under construction, only the main prangan has been opened for the Darshan.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Awesome 😎\nIt is one of divine and holy place of Rajasthan.\nIt gives lots of peace after worship there\nJai Shree Shyam",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Bhut aacha hai mandir jay shree khatu shyam",
          "languageCode": "en-US",
          "rating": 4.9
        },
        {
          "text": "More beautiful mandir jai shree khatu shyam 🙏🙏🏻🙏🏻❤️",
          "languageCode": "en-US",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Shri Purnagiri Mandir",
      "rating": 4.3,
      "address": "5/111, ITI Rd, Industrial Estate, Aligarh, Uttar Pradesh 202001, India",
      "reviews": [
        {
          "text": "I love my india",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "BEST mandir and place is good and give positive vibes every time so go for it",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the peaceful area of the Aligarh city... ... Called ITI road.👍",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Road ways are very adventures and near to nature\nLovely",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a Durga maa temple at iti road",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bhujpura Chauraha",
      "rating": 4.2,
      "address": "V3C6+CR5, Bhujpura, Chuaraha, Aligarh, Uttar Pradesh 200201, India",
      "reviews": [
        {
          "text": "if u have any emergency so dont go there...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "No wait",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice palace",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good 👍",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Public areas",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    }
  ]
}