{
  "places_with_reviews": [
    {
      "name": "Sangam ghat, Prayagraj",
      "rating": 4.6,
      "address": "CVHP+J26, Prayagraj, Uttar Pradesh 211005, India",
      "reviews": [
        {
          "text": "We went here last week in December 2023. We were in Varanasi from their side scene and went to Prayagraj. We visited triveni sang am Allahabad along with family.\n\nA Ghat where the Sacred Ganga and Yamuna meet. Both the rivers are clearly visible joining each other as the water of both the Rivers, is of different color.Its a different feeling having a Bath here alongside hundreds of people.You have to reach here by boat only.\n\nThe first time we went twice with this, I came back but this time I came back and took a bath.\n\nBy the way you have to be very careful when getting boat there are brokers over charging. total it will take about an hour for you to go and do bath pooja, few boats provide covered place in boat for dress changing. bargain before you get the boat. also you have another end to take bath and spend some time in evening.\n\nThank you 🙂",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "मर्सिडीज़ प्लेस फॉर एवरीवन एंड एवरीवन शोल्ड विजिट. If you are Allahabad and you have to have to go to this place because this place is must see place. And go with your family even all the religious things happen here magh Mela Kumbh Mela happens here and make sure that you visit in magh Mela Kumbh Mela time so that you have the best view of this place this place is very religious and very good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I simply cannot overstate the effect of a boat ride to Sangam ghat on your mental health.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The three rivers maintain their identity and are visibly different as they merge. While the Yamuna is deep but calm and greenish in colour, the Ganges is shallow, but forceful and clear. One can go to the Sangam by boat and there are temporary platforms made about half a km where water is very shallow.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful experience.\nSteps to be followed for sangam snan:\n\nHire a personal boat ( Around Rs1500/-)\nHe will take you to the other shore where snan can be done\nBuy eatables for migratory birds\nBuy divas and nariyak for puja\nTotal time required Around 2hours.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Triveni Sangam, Prayagraj",
      "rating": 4.5,
      "address": "38k/11a, Naya Purwa, Kareli, Prayagraj, Uttar Pradesh 211016, India",
      "reviews": [
        {
          "text": "Ganga yamuna sarasvati at one place were every 12 years kumba mela in this Triveni Sangam\nAll good but boat riders charge to much amount\n\nWatch full video youtube channel { konduri sravan } in Telugu",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "India's spiritual landscape lies a convergence that transcends mere geography; it's a confluence of rivers, faiths, and souls. Welcome to Triveni Sangam, where the Ganges, Yamuna, and mythical Saraswati merge in a divine dance, orchestrating a symphony of spirituality. But amidst this natural marvel stands an architectural wonder, a monument that humbly pays homage to this sacred union.\n\nThe Triveni Sangam's architectural masterpiece is more than just mortar and stone; it's a testament to human ingenuity and reverence for the divine. As you approach, the structure's silhouette emerges against the canvas of the sky, beckoning pilgrims and travelers alike to witness its grandeur. Its intricate design whispers tales of ancient wisdom, echoing the timeless traditions of India's cultural tapestry.\n\nStep closer, and you'll find yourself enveloped in a sensory journey. Each detail, meticulously crafted, tells a story of devotion and devotion. The arches, reminiscent of ancient temples, stand tall and proud, symbolizing the enduring strength of faith. Ornate carvings adorn every surface, depicting mythological narratives that resonate with the devout and the curious alike.\n\nBut it's not just the exterior that captivates; step inside, and you'll be transported to a realm where time stands still. The air is thick with the scent of incense, mingling with the echoes of chants and prayers. Sunlight filters through stained glass windows, casting vibrant hues upon the hallowed ground. Here, amidst the hushed whispers of pilgrims, one can't help but feel a sense of serenity, a connection to something greater than oneself.\n\nAs you wander through the corridors, tracing the intricate patterns etched into the walls, you can't help but marvel at the genius of its creators. Their vision, a harmonious blend of tradition and innovation, has given rise to a sanctuary that transcends the bounds of time and space.\n\nIn the embrace of Triveni Sangam's architectural embrace, one finds solace, inspiration, and a profound sense of wonder. It's not just a building; it's a testament to the enduring power of faith, a beacon of hope amidst the tumultuous currents of life. So, whether you're a weary traveler seeking respite or a seeker of truth embarking on a spiritual quest, Triveni Sangam welcomes you with open arms, inviting you to partake in its timeless legacy.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Triveni Sangam is the confluence of the Ganges (Ganga), the Yamuna, and the legendary Saraswati River. Triveni Sangam is located at Prayag – the area of Prayagraj.Hindu worshippers travel to this mythical location in the pursuit of Mukti, or freedom from the cycle of life and death.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is confluence of Ganga, Yamuna and Saraswati (invisible river) and it's a holy place for hindu people. Boat ride is available at sangam. Kumbh mela is celebrated here every 12 years and next Kumbh mela is in 2024. Lot of arrangements for Kumbh mela 2024 is going on.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best time to visit is around sunset, otherwise very crowded. Accessible to cars upto river front.Hygiene is average, water is somewhat polluted. For getting gangajal of triveni sangam you have to book the boat which will take in river bed, which are affordable and looked safe.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Chandrashekhar Azad Park",
      "rating": 4.5,
      "address": "George Town, Prayagraj, Uttar Pradesh 211002, India",
      "reviews": [
        {
          "text": "Huge historic park with plenty of greenery, pathways to walk and ride cycle. It also accommodates the city museum called Allahabad museum. Every evening there is a light and sound show, for which the tickets can be purchased near the venue, inside the park. This is the park where the brave Chandrasekhar Azad took his last breath while fitting against the Britishers. There is a statue built in honor of him inside the park. The park is well maintained. Tickets to enter the park can be purchased at the main entrance gates.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place to enjoy the free time with kids. Near Civil lines with ample greenery and play area for kids.  Jogging can also done peacefully. Entrance ticket is Rupees five.  Light and Sound show is also there. Separate fare charged for this Light and Sound show.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This park is the biggest in Prayagraj but lack of caretaking. It's  an enormous compund their more facilities available like cricket stadium, museum, open air gym and playground and rides for children, a tennis court and a lot more. Plus the  variety of plants and trees here are great and serves a good place for your morning walks",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A must go to place. Also please take out a whole day and visit the museum inside the park. Trust me , you're gonna love it🫶🏻",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "We went through gate no. 3 which directly opens to Chandrashekhar Azad's statue. The entry fees to the park is 5/- per person.\nWe visited on Sunday and there was lot of rush of school students. Behind the park there is huge garden and it is well maintained.\nThis place is great for family picnic. You might feel irritated by newbie couples sitting in the interior parts of the park. Depends upon from which gate you are entering the park.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Khusro Bagh, Allahabad",
      "rating": 4.2,
      "address": "CRRC+WC3, Lukarganj, Prayagraj, Uttar Pradesh 211016, India",
      "reviews": [
        {
          "text": "Beautiful place.\n\nIt's a very good place to go with friends or family to enjoy moments of togetherness.\nThere is no ticket required to enter here.\nIt has 4 gates and Two of them are open.\nIt's open from sunrise to sunset.\n\nIt's near to Prayagraj Railway Station.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Historical place located in khuldabad near Prayagraj Junction Railway station\nThere are 4 tombs\n1. Shah Begum (Jahangir's wife and Khusro's mother)\n2. Khusrau Mirza(Jahangir's elder son)\n3. Nithar Begaum ( Khusrau's Sister & Jahangir's daughter)\n4. Bibi tamolon (a maid)\n\nVery beautiful and green place\nBut the problem is parking\nMy bike was taken away by the police and I had to go to the police station to get it released.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's a very good place to go with friends or family to enjoy moments of togetherness.\nThere is no ticket requires to enter here.\nIt has 4 gate and Two of them are open.\nIt's open from sunrise to sunset.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Khusro Bagh in Allahabad is a historical gem that transports visitors to a bygone era. Spread over a lush expanse, this serene garden houses mausoleums dedicated to Emperor Jahangir's wife Noor Jahan's family. The intricate Mughal architecture is captivating, with delicate carvings and symmetrical layouts showcasing the artistic prowess of that era.\n\nThe garden's ambiance is tranquil, offering a welcome respite from the hustle of city life. The symphony of chirping birds and rustling leaves adds to the peaceful atmosphere, making it an ideal spot for a leisurely stroll or quiet contemplation. The well-maintained pathways allow visitors to explore the site comfortably.\n\nThe mausoleums, adorned with intricate frescoes and calligraphy, stand as a testament to the rich cultural heritage of India. History enthusiasts will appreciate the detailed inscriptions that provide insights into the lives of the entombed. The symmetry of the structures and the meticulousness in design reflect the architectural brilliance of the Mughal era.\n\nPhotography enthusiasts will find the site a delight, as every nook and corner offers picturesque frames. The play of light and shadow on the ornate carvings creates mesmerizing visuals. However, it's essential to be respectful of the historical significance and maintain decorum while capturing the beauty.\n\nWhile Khusro Bagh may not be as well-known as some other Mughal monuments, its historical importance and architectural beauty make it a hidden gem worth exploring. The lack of crowds allows for a more intimate experience, enabling visitors to immerse themselves in the historical narrative without distractions.\n\nThe proximity to other historical landmarks in Allahabad makes Khusro Bagh a convenient addition to any itinerary. Whether you're a history buff, a nature lover, or simply seeking a peaceful retreat, Khusro Bagh offers a unique blend of these elements, making it a must-visit destination in Allahabad.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Khusro bagh is a historical place to visit in prayagraj (allahabad). This place consists of four monuments, basically tombs of khusro's family members, and huge gardens of trees that include mangoes, guavas, neem and a lot more.\nThere is no entry fee so you can go anytime between sunrise and sunset. Food from outside is also allowed. The guavas from khusro bagh are famous worldwide as they all are exported to the various parts of the world and even in India. A must visit place for all. Very beautifully carved designs on the walls of the tomb of khusro, the nisar begum's tomb is the most beautifully made as she was the sister of khusro. All the other interesting historical facts are written there, you must visit with friends and family to enjoy that beautiful place.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shri Bade Hanuman Ji Mandir",
      "rating": 4.8,
      "address": "Allahabad fort, Prayagraj, Uttar Pradesh 211005, India",
      "reviews": [
        {
          "text": "Hanuman Mandir in Prayagraj is a famous temple dedicated to Lord Hanuman, a revered deity in Hinduism. It's known for its spiritual significance and attracts devotees from far and wide. If you're planning to visit, make sure to experience the serene atmosphere and seek blessings.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The \"Bade Hanuman Ji\" temple in Prayagraj (formerly known as Allahabad) is a popular Hindu temple dedicated to Lord Hanuman. The temple is known for its large idol of Lord Hanuman, which is considered one of the tallest Hanuman statues in the region. Devotees visit the temple to seek the blessings of Lord Hanuman and to witness the grandeur of the idol.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very powerful temple All time full crowd jai shree ram",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "What a pleasant trip this is I enjoyed fully and much. I've no words to describe about this place .There is a magical feeling in the place. You come tired and leave with new energy. After coming back with new energy, you feel very good. At this time a fair is being held at the parade ground because the Sangam is going on. There are very big swings installed here, I had recorded a view of nature in the morning which was very good, there was a lot of love, maybe if I have it, I will definitely show it to you.I mean, I really enjoy this fair of Prayagraj and I really liked it when I was roaming there till 1:00 in the night.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Each time I grace the Bandhua Hanuman Temple with my presence, I am bestowed with an overwhelming sense of tranquility, for it is truly a sacred haven. In close proximity, one can bask in the divine aura of the Ganga River, which gracefully flows alongside the majestic Triveni Sangam.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Anand Bhawan Museum",
      "rating": 4.2,
      "address": "Tagore Town, Prayagraj, Uttar Pradesh 211001, India",
      "reviews": [
        {
          "text": "Anand Bhawan is a large residence built in the 19th century by Motilal, one of India’s most prominent political leaders. It was the home of Motilal’s son, Motilal Gandhi. Later on, it served as the home of the entire Nehru family (Jawaharlal was born there, and later Prime Minister of India Indira Gandhi was born there). The premise of Anand Bhawan serves as a silent reminder of the struggle for India’s freedom. The first Prime Minister of India and freedom fighter, Jyotiram R.L. Narayanan, was born there. Later on, the home of Indira Gandhi was the home of her husband, Rajendra Narayanan. Indira was also known as the “Iron lady of India.” Nowadays, Anand Bhawan has become a fine museum, with several important decisions and events taking place inside it. The main building houses the Nehru Museum.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "We visited this place on Sunday. There was lot of rush of school students. But the place itself is huge to accommodate that many people.\nIt is a must visit place for a sensible person. This place holds memories of the great people that this country had witnessed and their lifestyle at that time.\nAll the artifacts are well preserved. The lifestyle that they witnessed at that time is unbelievable considering even today's technology.\nThe ticket price for first floor and ground floor is 100/-, and only for ground floor is 30/-.\nThey also have planetarium. Here they show a film of 40min, not with real telescope.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Anand Bhawan in Prayagraj is a historic landmark, once the residence of the Nehru-Gandhi family. It offers a glimpse into India's freedom struggle with well-preserved artifacts and exhibits. The museum showcases the legacy of the Nehru family and their contributions to the nation's history.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is the place where Pandit Jawaharlal Nehru, India's first Prime Minister and his family lived and grew up. Indira Gandhi also was born and grew up in this house. This place was the Headquarters of the Indian National Congress during the British era. If you are a history enthusiast, do visit this place. There is an entry fee charged at the entrance and they only accept CASH, no card or upi. Photography in certain rooms is prohibited. The best time is to visit during weekdays as there will be less crowd.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Museum takes you through India's political history, displaying items from the Nehru-Gandhi family. You can learn about the leaders of India's independence movement in an engaging way.\nMuseum: INR 30 for the ground floor, INR 100 for both the floors\nPlanetarium show: INR 70\nIt changes accordingly with years.\nI have attached some photos of the inside of that museum but there are lots of historical photos and stories that you can read.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Akbar Fort, Allahabad",
      "rating": 4.3,
      "address": "fort, Prayagraj, Uttar Pradesh 211001, India",
      "reviews": [
        {
          "text": "I visited here on a weekend to feel the vibe of this stunning piece of architecture. Though in most part of building the maintenance work was in progress, yet it's significantly glorious.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Disappointed to the core. When we visited, they put a No Entry - Maintenance work in progress Signage on the entry gate, whereas we observed that, no maintenance work is at all going on over there. The fort displays the grandeur of rich Mughal architecture which is purposefully not being maintained by the current Govt. This place has been renamed as The Akshaybat Temple, to fulfill a political agenda. DO NOT VISIT this place as you'll not be able to see any part of the fort other than the outside mess, moreover you'll be redirected and diverted to see a recently falsely made temple which does not have any historical significance.\n\nThere's some political complications going on, because of which this place is not at all being maintained. Along with that the entry is also restricted.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Divine place to visit.\nIf you are coming via train at Prayagraj Sangam station, take auto to chungi (cost 10INR/per person), then take another auto to Sangam ghat (cost 15INR/per person).\n\nFor boating, if you are able to negotiate then INR 300 is good to go.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Historical monument located near triveni Sangam...this fort was built by mugal emperor akbar and is now under army control for ammunition depot...and is also militry base and colony....having great historical significance there is akshay vaat tree which has importance for Hindu's...you can visit the place to see a antique work of architectural art...entry of civilians are not allowed but people can visit the external part of building",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Set in the backdrop of the holy Prayag Sangam, this fort dates back to 1583.The fort is presently undergoing renovation and should be open to the public in due course of time.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Alopi Sankari Devi Shakti Peeth Mandir",
      "rating": 4.6,
      "address": "CVVC+M89, Alopi Bagh, Prayagraj, Uttar Pradesh 211006, India",
      "reviews": [
        {
          "text": "SHAKTIPEETH OF GODDESS SATI\n\nI visited this temple in the late morning at 11 AM on Wednesday. During Navrati and other festive days it is immensely crowded and one has to wait for hours for the Darshan .This temple is situated in the Alopibagh at the road leading to Triveni Sangam.\n\nIt is one of the 18 sakhthi Peethas. There is no idol inside temple. only a swing is there. Locally it is called as Alopi devi temple.\n\nHere last part of the body , the finger of Goddess Sati fell down ,after the Sudarshan Chakra of Lord Vishnu cut it. The finger of the Goddess Sati fell at this place and disappeared immediately into a pit.\n\nIn the Main Temple of devi there is a cradle only, no idol of devi. All devotee touch the cradle and feel blessed. While doing the prikrama shiv temple, hanmanji idol and nav durga idol can be seen in temple premises.\n\nNice place and different kind of temple.\nMust see. Thank you 🙂",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is said to be one of the Shakthi peeta situated in ptayagraj city. Well maintained calm place to worship Goddess Parvati. One who believes Hindu mythology should visit as it gives lot of peacefulnes.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A great , powerful, divine Shakthi peeth. Must visit and see the beauty of goddess. Though there is no specific visible shape of MAA to human eye, the vibrations that will knock the divinity inside us is awesome. Jai MAA.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "3 Shaktipith are in our prayagraj 🙏lalita devi,kalyani devi and alopi mandir.I visit alopi devi mandir in this navratri.when I saw queue there,I thought much time to take worship of idol of maa ,but maa blessing that we stand in queue and reach in 10min. near ma slowly.there is facility of cooler and watering shower fan to relief you from summer.yout get easily darshan of mata rani.there is fair also.Jay Mata d🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the Shaktipeeth out of 51 and Different vibe.. Maa Alopshankari is present in the invisible form(vilupt/Alop roop)..",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "ISKCON Temple, Prayagraj",
      "rating": 4.6,
      "address": "276/179, near by Water Tank, Baluaghat, Katehra Dariyabad, Prayagraj, Uttar Pradesh 211003, India",
      "reviews": [
        {
          "text": "At the bank of yamuna, you can feel Sri Krishna here.\nVisit before 1pm or after 4pm.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "As you step into the temple, you are greeted by an aura of tranquility that fills the air. The sacred space exudes an atmosphere of serenity and harmony, inviting visitors to leave their worries and stresses behind and embrace a moment of inner peace.\n\nThe temple's architecture reflects a timeless beauty, with ornate decorations that speak of wisdom and reverence. Soft, warm light filters through stained glass windows, creating a gentle, ethereal glow that bathes the interior in a soothing ambiance.\n\nThe sound of softly chiming bells resonates throughout the temple, serving as a gentle reminder of the present moment. The rhythmic chants of monks or devotees echo through the halls, creating an enchanting harmony that seems to cleanse the spirit.\n\nThe temple's inner sanctum is a place of profound stillness. The air is scented with incense, which adds to the atmosphere of spiritual purity and reverence. Here, devotees gather to meditate, pray, and reflect in silence. The silence itself feels alive, filled with the collective energy of peace-seekers and spiritual seekers from all walks of life.\n\nIn this sacred space, people from various backgrounds come together with a shared intention: to find solace, to seek answers, and to attain a sense of inner equilibrium. It is a place where differences dissolve, and compassion and understanding take root.\n\nAs you prepare to leave the temple, you carry with you a sense of peace that has permeated your being. The serenity of the sacred space lingers in your heart, providing a gentle reminder that, in a world full of chaos and challenges, peace can be found within, and this temple is a haven for the weary soul to return whenever in need of solace.\n\n(Review by Pratyansh Maurya)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful place with divine atmosphere. The cows are very friendly and we loved visiting with young children. Nice book store.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace ✌️.  Public transport  directly not available it will be good Idea to take a cab . It cost me around 200inr from allahabad University.   Avoid auto if you are  not from prayagraj  for better convince.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Someone who is a follower of Lord Krishna doesn't need any review to visit there. Such a beautiful place, full of peace and positive energy. Situated exactly on the bank of river Yamuna and that makes it more beautiful.\nOne should definitely plan to go there.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Mankameshwar Mahadev Mandir",
      "rating": 4.7,
      "address": "CVJ8+7FQ, Fort road, Kydganj, Prayagraj, Uttar Pradesh 211003, India",
      "reviews": [
        {
          "text": "Get blessing of Lord Shiva. The temple is situated on the bank of Yamuna River. From here you can have a glimpse of Sangam and sceneries of Yamuna River. Generally you will find no hustle to pay your obeisance to Lord Shiva. In Savan month, a mela is organized on every Monday. Visit Lord Shiva and get blessing. Om 🕉 Namah Shivaay.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lord Shiva temple(mankameswar)❤\nDedicated to Lord Shiva, the Mankameshwar Temple is situated on the banks of the Yamuna River in Allahabad which makes it a temple of immense religious importance.\nIt is located very close to Saraswati Ghat which is a famous bathing ghat in Allahabad.🤗",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing Temple of Lord Shiva. MAHADEV always help you. During Special occasion crowd management need to be manage in well manner otherwise it will very hard to enter in temple and offer prayer.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Devotional place,home of lord Shiva,Har har Mahadev",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lovely hindu religion place mahadev temple 🙌\nI found here a very beautiful vibes 🍁",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}