{
  "places_with_reviews": [
    {
      "name": "Wayanad Tea Museum",
      "rating": 4.3,
      "address": "Pozhuthana, Achoor Estate Road, Achooranam, Achoor, Kerala 673575, India",
      "reviews": [
        {
          "text": "Housed within a meticulously restored 100-year-old tea factory, Wayanad Tea Museum offers a fascinating glimpse into the world of tea cultivation and processing.\nAnd that’s not just it!\nConclude your visit with a delightful tea tasting session. Savor the distinct flavors of various teas produced by Harrisons Malayalam.\n\nEntry Charges: ₹40\n\nBrowse the museum shop and pick up a selection of premium teas as a souvenir of your visit.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It had  detailed information on origin of Tea and how and when it started in India. Tasted different types of tea. Chocolate teas was good .",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is an experience and a tourist place with all sorts of history and also mentioning the tribals of wayanand, it is good… it has an entry fees of Rs. 40/- per adult which is nominal, at the end it has a cafe not tea tasting basically so we can try the tea and coffee after purchasing, there is a store available from where you can buy the local tea, coffee, essential oils and natural perfumes. The cafe has scenic view fir the photography. Overall, good place to visit.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good café with a pleasant ambiance... and a nice spot to try different sorts of tea and coffee while admiring the views of the hills and various bird species....",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The place has an entry fee of ₹50. The theme as you guessed it, is tea and its origin, followed by how it reached the land of Wayanad. Could be marked as must visit if you’re a museum goer, however the experience isn’t extraordinary.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kurchermala Waterfalls",
      "rating": 4.4,
      "address": "HXVW+236, Pozhuthana, Kerala 673575, India",
      "reviews": [
        {
          "text": "Small water falls.. not much explored place.. Worth spending time..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "There was some little water when we visited during the time of May. It's better to go there in a group since it's a risky place in case of security.\nKindly check with local guides or auto drivers as if the water is there or not.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is a hidden waterfall in Wayanad, near pozhuthana, the exact location is pozhuthana kurichermal road.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A truly amazing place to spend time with friends and family. Bit far to reach through vehicle and need to walk a bit too to catch up to the falls.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A beautiful water fall situated in tea estate. Very safe for kids... Best time to visit Nov-Feb",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "View point",
      "rating": 4.4,
      "address": "H2FV+RWF, Chundale Factory Rd, Chelode, Kerala 673123, India",
      "reviews": [
        {
          "text": "Perched high in the Wayanad hills, this viewpoint offers an unforgettable experience. The rolling tea plantations create a stunning tapestry of lush green, their fragrance wafting through the air. However, the true magic unfurls at the summit. A panoramic view of majestic mountains emerges, a grandeur that defies words. The vivid contrast of the emerald tea gardens against the towering, indigo-hued peaks is simply breathtaking. As the sun bathes the scene in golden light, a sense of peace and wonder envelops you. This serene setting invites introspection, and it's a perfect spot to relax or meditate. A cup of local tea in hand, this view will remain etched in your memory, a true travel treasure.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice view...but not worth travelling 12 kms from kalpetta...if u are on the way to khozikode from kalpetta then u can stop at point and can have some beautiful snaps...this is jst my opinion,its upto you guys now😊",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "superb",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I liked the estate, it's a good place to click some photos.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Crowded at weekends but really nice view",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Peringave views",
      "rating": 4.2,
      "address": "Vythiri -Tharuvana Rd, Vythiri, Kunnathidavaka, Kerala 673575, India",
      "reviews": [
        {
          "text": "False location. Nothing to be seen here. Please don’t waste time",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Couldn’t find the location. Found a spice garden near the location shown in Google maps though",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It was a great experience of wayanad, greenery 😍😍🥰😍🥰😍🥰",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "We just been there on the way. But it's mesmerizing beauty didn't let us go. We have to stop by for taking pics. Awesome! Awesome! We are planning to visit again just in wayanad to explore it more for sure!!",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice place with a lot of medical plants and trees ; you can take a lot of pictures here for free",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Tea plantation view point",
      "rating": 4.3,
      "address": "H299+W6, Sughandhagiry, Kerala 673576, India",
      "reviews": [
        {
          "text": "It looks very beautiful during monsoon season. Located on both sides of anoth road. One can visit anytime during daylight. A zipline activity is also there. No ticket prices for this place.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Wonderful view",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "beautiful place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A great place for photography",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice view point",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Chasam Ayurvedic & Spices Garden",
      "rating": 4.2,
      "address": "Vythiri -Tharuvana Rd, Vythiri, Kunnathidavaka, Kerala 673576, India",
      "reviews": [
        {
          "text": "We went there just by chance. And unexpectedly we felt very good here. If you love little bit of botany, you will love this place.  They charge Rs 100 per person to visit this small garden but a dedicated guide will tell you everything about the plants. Our guide Mr Umesh was very knowledgeable and he explained very well about herbs. We ended up buying some quality spices.\n\nDo visit this place if you are passing through Vythiri town.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It was fabulous experience. Developed our knowledge for ayurvedic and important of ayurvedic and nature. It was 30 to 45 guiding program . Lot of ayurvedic and spices  plants in the garden .All languages available for explaining ayurvedic medicine and plants..... The great atmosphere and ambiance. You will purchase. It was good for students. Especially there explain briefly. And each plan you can see and there explain. Done  river side bamboo garden you have rest and take pictures that was nice not explained in words because that innovative and exceptional. There staffs adorable and amiable. The owner mrs Babu sir very incentive and friendly. Manager his mrs Rijo great handling for guest here attitude was nice. staffs Especially Lincy mam was very great guidance for multiple languages Malayalam, Hindi, Kanada , Tamil , English .  Seema mam she is known as Malayalam and Tamil. Umesh bro he is all languages , Alphonsa mam handling in all especially English and Arabic. Totally there service and approach to guest was well treated.\nYou have purchased medicine and spices. They can send querer service also.you have visi choclate productions. Live chocolate making\nSo you come wayanad must visit",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "We got a lot of knowledge and it was overall a great experience. You get to also buy some authentic, first quality spices and medicines.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Was good. A bit high at the cost end. They  never gave any discount.. all natural products",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Pros:\nVariety of plants\nGood maintenance\nGuides available to explain\nNatural products\nCan order from anywhere\nSpices store to buy\nNormal price\nGood taste (after use)\n\nCons:\nLocation\nOff season looks vague\n\nHope this review is helpful. Thanks.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bamboo Rafting wayanad",
      "rating": 4.5,
      "address": "Vythiri -Tharuvana Rd, Peringoda, Pozhuthana, Kerala 673575, India",
      "reviews": [
        {
          "text": "Good for group tours with friends. Not too many restrictions. Need to bargain.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Make sure that your raft is new and raft  bamboos are new, green, and large in diameter, otherwise when your are boarding the raft you will fall in the river. Do not board raft in this condition as shown in picture.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Had a great experience bamboo rafting with family. Very professional thank you Shameer and team.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "There is nothing except the bamboo ride here. Only limited number of tickets will be issued. So, if it's a long weekend and there are chances of huge crowd, you might not get a ticket. Going all the way till there would be a total waste. Ensure you're there quite early. Or even better contact the authorities there about getting tickets.\n\nWe had gone in bikes, and the ride was painful. The road from Sultan Battery was good, but with lots of twists and turns. After such a tiresome ride, we were very sad that we couldn't make it to bamboo rafting. So, be careful if you're going there on a bike ride.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Dear adventure lovers,\nThis place is good for enjoyment but on the other hand please note that there is no regulations on the charges paid as lot of cheating is taking place. No written boards / signs or receipts are given to you. Exorbitatantly charged after completing the trip. Be careful before getting into the agreement.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "LALA LAND Adventure Park & Field of Lights",
      "rating": 3.9,
      "address": "334, Vellamkolly, Chundale, Chelode, Kerala 673123, India",
      "reviews": [
        {
          "text": "Great spot for kids to play in pool now\n\nThey are planning for new games now.\n\nThey have good amount of parking and good space for kids\n\nOnly problem is kids are not to play in pool which have only stomach height water",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "The park seems incomplete, leading to a less-than-ideal experience. There's room for improvement in completing the work to enhance visitors' overall satisfaction.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Most of the rides are yet to come, good ambience. May be the start of night life at Wayanad.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "This place is under construction but had a few activities. The water park was fun but other activities are expensive. Wayanad has a plenty of options at affordable price. The Rs. 60 parking fee was very disappointing and hence one star.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Lala Land Adventure Park is a thrilling destination that promises excitement and fun for visitors of all ages. With its wide range of rides, attractions, and entertainment options, it offers an unforgettable experience filled with adventure and adrenaline. From thrilling roller coasters to family-friendly attractions, there's something for everyone to enjoy. The park's vibrant atmosphere and friendly staff ensure a memorable day out for families, friends, and thrill-seekers alike. Whether you're seeking heart-pounding excitement or leisurely relaxation, Lala Land Adventure Park has it all.",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Small tea garden view",
      "rating": 4.5,
      "address": "H2G9+FJM, Vythiri -Tharuvana Rd, Kerala 673575, India",
      "reviews": [
        {
          "text": "Awesome service thanks to boys who take care of all this ❤️\nGood view from dam & chill swimming pool\nOverall nice place to stay with family and friends\nBut very nice to stay👍\nThere are games like:-\nCarrom board\nBatmatton",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful tea garden",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Not expected kind of view",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's Awesome",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "TEA plant",
      "rating": 4.4,
      "address": "H2FX+7R9, Wayanad Rd, Chundale, Chelode, Kerala 673123, India",
      "reviews": [
        {
          "text": "Beautiful 😍\nZip line, cycle on the rope and other activities were available. One can just roam around as well through the beautiful tea garden.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best choice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "👌🏻",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A beautiful place, tea and coffee plantations, and a beautiful, mild weather.",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    }
  ]
}