{
  "places_with_reviews": [
    {
      "name": "Kasar Devi Temple Almora",
      "rating": 4.8,
      "address": "Binsar Rd, Kasardevi, JMR6+PP7, Mat, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "I couldn't found better rating so I gave it 5 star rating very humble. This quiet place is in Almora. It is place where Swami Vivekananda meditated. It is very peaceful . One can have very nice sunrise and sunset view from here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "There's a saying about this place that it's believed to be located on the Earth's Van Allen Belt( a huge lectromagnetic field ). The place surely has some extremely strong and positive aura. You can have the best view of both sunrise and the sunset here. People come for meditation and yoga, and even after spending hours in silence, you won't get even a bit bored here !",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This temple is famously known as the only three places on this planet under the impact of highly charged geomagnetic fields that come within the Van Allen Belts discovered by NASA. Nestled on a hilltop stands the devi and shiva temple. One can view the entire town from the temple, it’s best to take a seat on the rocks and enjoy the peace and feel the power of the magnificent energy. There is plenty of space to meditate. There are many other tales of swami Vivekanand & Devi maa as well. The temple is said to be over 2000 yrs old.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Must visited place, Because there are only two or three such places in the whole world where magnetic fields are found, these places are the best places to meditate, there is a lot of calm and positive energy here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful place. Best place for meditation. I personally felt really energetic after siting here for sometime. And do not miss the sunset here.  To reach the shiva temple on top , it’s around 30-50 steps to climb.\n\nBeware of monkeys",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Chitai Golu Devta Temple",
      "rating": 4.8,
      "address": "Chitai, SH 37, Almora, Kuchar, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "Here he is worshipped as God of justice, and believed that he rides the area on his white horse. People put write there issue’s on paper and hung here, once there wish is fulfilled then people hung bells here. When u visit this please u see so many bells here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "We were very blessed to visit this temple of Golu Ji Maharaja. There are many temples of Golu Devta; however, this one is the main temple, where a lot of devotees come every day throughout the year. Golu Devata is known for giving fair judgement in any conflict, dispute, or court case (as people believe). When you visit there, you can write down your personal issue or conflict on paper and tie it there with a bell. 🔔.\nBeware of the monkeys there; while entering the temple or standing in queue, they snatch the prasadam or things. One should visit this place while in Almora.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "God of mountains. It's also known as Bell temple. You will see lot of bells hanging in temple. Devotees put bells after completing there wishes.\n\nHoly place.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The extent of belief extended by the people is amazingly awesome .\nPeople write out petitions requesting for divine intervention and hang it all around the temple premises , once fulfilled they donate bells to the Devta in gratitude .\nIt is a pleasant sight to see the premises covered with bells of various sizes.\nAs long as there is no violence and hatred, any kind of belief is fine .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I regularly visit Golu ji , I always get peace and feel blessed , you can offer a bell , you will see thousands of bells and letters of request to the Golu ji\nMust visit place !",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Almora Uttarakhand",
      "rating": 4.6,
      "address": "Dugalkhola, Almora, Khagmara Kote, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "Good place to visit\nEnjoy your trip",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "So beautiful so elegant just looking like a wow. .\nVery good place to visit such a good place for mountain lover.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "**Almora, Uttarakhand: A Himalayan Gem of Cultural Richness and Scenic Beauty**\n\nNestled in the Kumaon region of Uttarakhand, Almora stands as a testament to the harmonious blend of cultural heritage and breathtaking landscapes. Here's an in-depth review to guide you through the allure of this Himalayan town.\n\n**Cultural Heritage:**\nAlmora, with its rich history dating back to the Chand dynasty, is a cultural treasure trove. The town is adorned with ancient temples, including the revered Nanda Devi Temple and Kasar Devi Temple. The intricately carved architecture and spiritual ambiance make these sites not only religiously significant but also fascinating for history enthusiasts.\n\n**Scenic Beauty and Panoramic Views:**\nPerched at an altitude of approximately 1,651 meters (5,417 feet) above sea level, Almora offers panoramic views of the surrounding Himalayan peaks. The town is situated atop a ridge, providing breathtaking vistas of snow-capped mountains, including Trishul and Nanda Devi. The Mall Road and Zero Point are popular vantage points offering spectacular views of the landscape.\n\n**Best Time to Visit:**\nThe ideal time to visit Almora is during the spring and summer months, from March to June, when the weather is pleasant, and the flora is in full bloom. This period allows for comfortable exploration of the town and its surroundings. Monsoons (July to September) bring lush greenery but also occasional rainfall, while winter (December to February) offers a serene experience with chilly temperatures.\n\n**Local Markets and Cuisine:**\nAlmora's local markets, such as Lala Bazaar and Mall Road, offer a delightful shopping experience with traditional Kumaoni handicrafts and unique local products. The town's cuisine, featuring local dishes like Bhaang ki Khatai and Singal, provides a gastronomic journey into the flavors of Kumaon.\n\n**Cultural Festivals:**\nAlmora hosts various cultural festivals that showcase the vibrant traditions of the region. The Nanda Devi Mela is a significant event, celebrated with much fervor, drawing both locals and tourists to participate in the cultural extravaganza.\n\n**Accommodation Options:**\nAlmora provides a range of accommodation options, from heritage hotels to budget-friendly guesthouses. Many establishments offer panoramic views of the mountains, providing a comfortable and immersive stay in the lap of the Himalayas.\n\nIn conclusion, Almora, with its cultural richness, scenic beauty, and Himalayan charm, offers a captivating retreat for travelers seeking a perfect blend of history and nature. Whether you're a culture enthusiast, nature lover, or someone in search of tranquility, Almora unfolds its charms in every corner, promising a memorable journey into the heart of the Kumaon Himalayas.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best city in Uttarakhand state for travelling and exploring new things I must say that at least one time in life you have to visit Almora district ✨❤️👍🤍",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beauty, beauty and beauty. Though the place has now become crowded, but still you get some of the mind blowing views from this place.\nMy recommendation would be to surely go to Vridh Jageshwar and Jageshwar Dham. These places have unmatched beauty. The old temples are just heart thumping as if Lord Shiva is really watching you from somewhere.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Maa Nanda Devi Mandir",
      "rating": 4.7,
      "address": "HMX6+XC4, Unnamed Road, Dharanaula, Almora, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "About 1000 year old temple. Maa statue is very beautiful, temple also attached with a shiva temple. Inside temple you may see some unorganised items, just ignore focus on the purpose u came for.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nanda Devi temple in Almora is a local temple in Almora. It is nice temple. Positive vibes",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful hindu Temple of Maa Nandad Devi. And old and beautiful temple inside alomora Market., Uttarakhand.\nJay Mata Ji.......🙏🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice Maa Nanda Devi Temple is at the top of the hill. Area is neat and clean. Location is fine.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Located in the Almora city market and yet so peaceful. Inside this 1000 years ancient temple, there is shivling and nanda devi shrine, who is also known as destroyer of the evil. An open space outside to have fresh air and meditate. Parking area is nearby.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Katarmal Sun Temple",
      "rating": 4.7,
      "address": "Sun tempal katarmal, Almora, Adheli Sunar, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "There are only 2 sun temples in Bharat, and Karatmal is one of them,\nFew miles away from almora district this place has its own magnificent history and aura.\n\nThe temple itself, steeped in history, exudes an aura of ancient grandeur. Though not imposing in size, it captivates visitors with its timeless beauty, showcasing weathered stones and intricate details that tell stories of a bygone era. The view from this vantage point is nothing short of breathtaking, offering a glimpse of the past and the natural beauty of the surroundings.\n\nTo make your visit even more comfortable, there are drinking water taps available to quench your thirst after your exploration. If you find yourself in Uttarakhand, this unique destination is a must-visit, granting you the privilege of witnessing the one and only second sun temple in all of India.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A must visit place.\nThe only Sun temple on the world where everyday Pooja is being performed and God Sun is in “Padmasan” with all their Ganas.\nThis temple is believed to be from Tretayug by locals and Katyuri rulers have renovated it in 9th century with marvellous architecture.\nThis is an amazing place with most ancient arts carved on the stones and idols.\nThis temple is situated along Almora -Ranikhet Highway not too far from Almora, around 18 KM (45 mins due to hilly road)\nYou’ll have to track uphill by around 10-12 mins and you’ll reach.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The way to the temple is so beautiful and the view is just mesmerising. It’s a very old and beautiful temple. A very quiet place to sit, relax, pray and meditate. Specially like the Dhoop smell surrounded by the entire temple prangan.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Such a peaceful and serene place. Must visit. Important Info- there is a parking on the way, don’t park there as it is a long walk from there. You can park just 50meters below the temple, just follow the road and you’ll see the last point on the road.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Over eight centuries old, this intricately carved temple in Almora is set amid the jaw-dropping vistas and deodar forests of the Kumaon hills. This ancient structure dedicated to the sun god is one of the foremost temples of its kind. Despite its age, it continues to be the spiritual centre of this village and an important site of worship that brings in devotees from across the country especially during the annual Chhath Puja celebrations.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Katarmal Sun Temple Gate",
      "rating": 5,
      "address": "JJP5+QWV, NH109, Katarmal Gunth, Uttarakhand 263643, India",
      "reviews": [
        {
          "text": "he temple is very clean and exquisitely beautiful, with intricate carvings and a unique architectural style. What's more, the place is not crowded, allowing for a peaceful and serene visit. The mountain views from the temple are absolutely stunning, adding to the overall charm of the place. I loved my visit and would highly recommend it to others.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "It’s a Lord Surya temple of 9th century by Katyuri kings. Beside main big temple you see many more small temples of other Lords , Devi also. Place is on a height so you have to climb many steps, and during that you get a chance of local village life, beautiful old homes with flowers pots. Plum tree etc.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "What an amazing experience ❤️\nThe location of the temple is beautiful :) located at the top of the hill.\nWe visited temple in off season no crowd no tourist so peaceful ☺️\nOne should not miss this place when ever visiting Almora.\nChai maggie shops are available in case you feel hungry 🤤",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Beautiful temple, made in 17th century. Destroy by invaders. Masterpiece of architecture. Sunlight comes directly inside the the temple every morning. You can find it on way from Ranikhet to Almora.\nIt’s a temple site which consists many temples.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Highly recommended while going to Almora from Kausani. It’s a detour of a few kilometres. Not many tourists know of this place. One of the very few Sun temples in India. Currently under the department of archeology.\n\n9th century temple of a great architecture built by the Himalayan rules of that time. It’s a half kilometre walk little uphill. But definitely worth taking the effort.",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Golu devta Mandir",
      "rating": 4.4,
      "address": "JJVM+228, Hawalbagh Village, Uttarakhand 263636, India",
      "reviews": [
        {
          "text": "Faith and Belief can move mountains, this sacred place proves it",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very peaceful place,",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Golu temple is the temple of Justice. Do visit once.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A great place to visit",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "My village is bast",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Balta waterfall",
      "rating": 4.2,
      "address": "JMVJ+5VG, Unnamed Road, Balta, Bintola Malla, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "The waterfall is all dried up, ask the locals before going the there, gather full information if the waterfall is running or not. It was a bit tricky to find the fall, trail is beautiful tho. There’s around 1.5 km hike to the waterfall, wear full clothes because there are some poisonous plants on the way and they will make you itch a lot.\nLocals were taking a dip in the still water, and it wasn’t were clean.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's a hidden gem amidst the jungle and valley of kasar devi.\n\nIt's about 8 kms from papersailley or the kasar devi road. Then you'll have to park vehicle road side.\n\nIt's a serene hike of about 2 kms. Not recommended for senior citizens. The route to reach the waterfall is a bit tricky.\n\nBut once you reach, it's absolutely mesmerising and the solace will give you relief.\n\nMust visit. Kindly don't litter. Cheeeeeers 🍺",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Keep this hidden and clean first of all.\nThis place a nature’s paradise with beautiful waterfall and lagoons around.\nThe hike here is short and beautiful.\nI visited here twice but the fresh water, beautiful sunshine and clean green area makes this a paradise to chill.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Balta waterfall is hidden by pine and deodar trees in the middle of a lush green dense forest. As you drive to the spot from where you must go on foot, be careful as the road is bad. While it is a steep hike from the road, it is worth a visit. You walk through a scenic jungle trail,\nsurrounded by mountains. Carry your own water, wear caps, and plenty of sunscreen. Locals warn you of leopard sightings even during the day at the waterfall, so it is advisable to go in a group. Both the path and the place are deserted. When you reach, the view is simply amazing! In the Monsoons, its gorgeous! Be careful with selfies though, people have slipped, and the water is freezing. Once done, do take all your garbage as you leave. Let us keep Balta waterfall pure and pristine.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "To reach Balta waterfall, you can drive to the village of Balta and then hike for about 1.5 kilometers. The hike is relatively easy, and it takes you through a scenic forest trail. Once you reach the waterfall, you will be rewarded with stunning views of the cascading water and the surrounding mountains.\n\nBalta waterfall is a great place to relax and enjoy the beauty of nature. If you are looking for a peaceful and scenic spot to spend a day, then Balta waterfall is the perfect place for you.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mrig Vihar Zoo (Baldhauti)",
      "rating": 3.7,
      "address": "SH 37, Almora, Almora Range, Uttarakhand 263601, India",
      "reviews": [
        {
          "text": "This place is very beautiful. In this place tigers, cheetal , owls, dear and  white monkey.\nAll animals are safe and happy in this zoo.\nTicket cost is very low only 20 rupees.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Not many animals but can be visited once, may be exciting for children....",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Only four types of Animals\nBear , Monkey and Himalayan Vulture were in very pathetic condition . Deers were hungry. When we visited no one was there to take care of them.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Almora Zoo (Mrag Vihar) is situtated about 6 Km from Almora at Almora Barechhina Road, This zoo is  in hill area & its area is medium size. it has an animals like Leopard, Bear, Monkey, Deer, barasingha  ( Swamp Deer) and Rabbits. The white Deer & white Monkey is a rare one.\nThe\nA good place for Children enjoy viewing the wildlife.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Good for a stroll....but not worth visiting as a zoo....very few animals.....fee charged is only 20 rs. Per person which makes it worthy of an extra star",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Chitai Golu Mandir",
      "rating": 4.6,
      "address": "JMH3+P6R, Almora Range, Uttarakhand 263601, India",
      "reviews": []
    }
  ]
}