{
  "places_with_reviews": [
    {
      "name": "Moosi Maharani Ki Chhatri",
      "rating": 4.4,
      "address": "HH9V+P5X, City Palace Rd, Mohalla Ladiya, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Good place for photo lovers. A place with a great history behind it. Do try to collect the water from here, it is said to increase the positivity in the house. One of the gems of Alwar city. The lake with the small hill in the back drop adds more to its beauty. The guides are available if you want to know more about the place. And there is a museum with lots of antiques, good for a visit with the kids.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "moosi maharani is historical monument. I had come in 2017. then this place had not maintained.recently I visited there this place has made maintain by government",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Chhatri in Alwar is truly a marvel of architectural and artistic craftsmanship, drawing visitors from near and far to witness its beauty firsthand. Situated amidst the scenic landscape of Alwar city, this cenotaph stands as a testament to the rich cultural heritage of the region.\n\nUpon arrival, one cannot help but be captivated by the grandeur of the Chhatri's design. Built on two levels, the lower portion showcases the use of vibrant red sandstone, while the upper level is adorned with the elegance of grey and white marble. This contrast in materials adds depth and visual appeal to the structure, enhancing its overall aesthetic.\n\nAs you approach the Chhatri, its symmetrical design immediately catches the eye. Each detail is meticulously planned, from the layout of the pillars to the arrangement of the carvings. The architects of this monument have ensured that every aspect of its design exudes harmony and balance, creating a sense of tranquility for visitors.\n\nStep inside, and you'll find yourself surrounded by a treasure trove of exquisite carvings. The inner pillars, walls, and roof are adorned with intricate patterns and motifs, each telling a story of the rich history and cultural heritage of the region. From floral designs to geometric patterns, every carving is a testament to the skill and artistry of the craftsmen who created them.\n\nAs you explore the Chhatri further, take a moment to appreciate the attention to detail that has gone into its construction. From the precision of the carvings to the quality of the materials used, every aspect of this monument speaks to the dedication and craftsmanship of its creators.\n\nFor travelers passing through Alwar city, a visit to the Chhatri is a must. Whether you're an architecture enthusiast, a history buff, or simply someone who appreciates beauty in all its forms, this magnificent cenotaph is sure to leave a lasting impression. So make it a point to visit this cultural gem and immerse yourself in the timeless beauty of the Chhatri in Alwar.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Decent place\nPer say but they can make it a lot more people friendly by adding a number of amenities\nAs of now it is pretty raw causing ig to sometimes be cumbersome for people to be there specially the elderly who might want to enjoy beautiful views but are in no position to walk around so much without basic support\nIt also enthrals us with fauna thats amazing. Youll fond deers sambars galore\nApproachable allright but needs ti be cleaner",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The place is beautiful with a serene view and Perfect for pictures. No entry fees.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "SMD Circle",
      "rating": 4.2,
      "address": "Alwar - Bhiwadi Rd, Alarm, Bhiwadi Road, Moti Doongri, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Smd public school and Gori devi girls college and Raj Rishi college available near smd circle distance around 500m only",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good cctv surveillance near circle also traffic police is available during duty hours nearby circle.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "SMD CIRCLE IS LOCATED NEAR BY ALWAR RAILWAY JUNCTION",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice wark congratulations",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Hope Circus",
      "rating": 4.4,
      "address": "HJ83+HPJ, Munshi Bagh, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Wonderful I love this place it's all things good food , shopping whatever u can find it their",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Hope Circus has always been a great place to have the complete and birds eye view of the entire Alwar City.The market is having almost each and every type of product , apparels, merchandise etc to explore. Tourists from all.across globe find the place good enough for multiple benefits. The small size of shops makes it unique in itself. The shopkeepers are always friendly and supportive.There are various local food items to cherish such as Kachori, namkeen,  Sweets, juices, ghee etc. For every visitor to Alwar, this is undoubtedly the must visit place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Lord shivji temple at top is best",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Heart of Alwar\nWell connected from all four sides of city wonderful local market with all types of shops\nClothing, tailoring, ladies garments,furnishing food, sweets and all types of utility items shops sorroundings\nFavorite spot for all festivals purchasing s\nA must visit market for all alwarites",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Nehru Garden",
      "rating": 4.3,
      "address": "Indira Colony, near S.M.D. Circle, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Very well maintained park for kids having a nice toy train ₹20 for adults and ₹10 for kids. Kids under 5 have to be accompanied by adults. The entire park is maintained and there are many rides and swings.\n\nAlso there is a paddle boat having the same price ticket as train. Overall good experience..ample parking space.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place to visit with your children. Children will enjoy here. I have been coming here since childhood.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Small age young children can enjoy a picnic with their schools here. The number of slides, electric train , boating facility, open air gym will excite you.\nGood and faithful.\nThere is two restrooms for each Males and females respectively.\nYou can take your pet dog with yourself. Here,  the dogs are treated well",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice garden and beautiful Playground and beautiful location and I have been waiting for the alwar ki nice 💯💯💯 location",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A visit to Nehru Garden Park is a must for nature enthusiasts, with its lush greenery, vibrant flowers, and tranquil atmosphere.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Clock Tower / Ghanta Ghar Alwar",
      "rating": 4.2,
      "address": "Ciba Clock Tower Old Sabji Mandi, near Hope Circus, Munshi Bagh, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "It’s beautiful clock tower during evening hours.Heart of the Alwar city.All show rooms are present in this area.This area is the main market place of Alwar city.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's an important place in Alwar market.\n* Great decorations on Diwali festival.\n* Great hustle bustle during market hours.\n* A good parking space for two wheelers around the clock tower.\n*There is vegetable market nearby. One can get fresh vegetables and fruits at low rates.\n* We enjoyed diwali fair.\nLocally known as ghanta ghar, the Victorian clock tower in Alwar is located in a crowded market area known as the Church Road in the old part of the town. It is a four-sided structure (with clocks on all sides) and is said to have been built in the early 19th century, surrounded by a charming colourful market selling local knick-knacks.\n\nThe structure is distinctly visible once you enter the circular complex inside the market, for it towers above other buildings. A visit to the Clock Tower is recommended to see the daily life of Alwar at close quarters and also shop for some local delights as it right in the middle of a market called Hope Circus. The beautiful St. Andrew’s Church is nearby and is worth a visit.\nThank you ❤️",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I visited a bustling market in Alwar recently, and it was quite an efficient experience. Despite the crowd and the maze of narrow lanes, we were able to find everything we needed in one place. The market seemed to have a wide variety of items, and it was convenient to get what we were looking for without much hassle. If you're in Alwar and need to do some shopping, this market is a one-stop destination to consider.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "* It's an important place in Alwar market.\n* Great decorations on Diwali festival.\n* Great hustle bustle during market hours.\n* A good parking space for two wheelers around the clock tower.\n*There is vegetable market nearby. One can get fresh vegetables and fruits at low rates.\n* We enjoyed diwali fair.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very crowded place/market. Avoid using four wheeler when going there. Fresh fruits and vegetables market is nearby.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Alwar City Palace Vinay Villas Palace",
      "rating": 4.2,
      "address": "City Palace, collectorate, Mohalla Ladiya, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Not much to do here\nBut you should definitely visit it once to get to know about the city and culture and monuments.\nA very beautiful place to get good pictures. So impressed by the infrastructure of the fort it's beautifully designed. Proud of those Indian workers who made it.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice palace. Museum is well maintained. Entry fee to the museum is Rs 25 per person. Back of it lies Moosi Maharani ki Chhatri, another beautiful palace with nice view.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The City Palace complex is very beautiful and there are plans to build a balcony along it. There is a big field behind the gate. There is Krishna temple in this ground. Just behind this is Musi Rani's Chhatri and other places of interest. In the morning, when the first rays of the sun fall on the main gate of the City Palace complex, its shade is worth seeing. Its condition is pathetic in recent times.\n\nThis entire building is occupied by government offices, mainly that of the District Magistrate and the Superintendent of Alwar Police. It was built by Raja Bakhtawar Singh in 1793. Tourists cannot live without praising its beauty. There is also a museum on the top floor of this building.\n\nA fee has to be paid to visit the museum. It is divided into three halls. In the first hall, royal costumes and clay toys are kept, the main attraction of this hall is the bicycle of Maharaj Jai Singh. Every thing here is beautifully decorated. In the second hall, there are pictures of many famous kings of Central Asia.\n\nPictures from Taimur to Aurangzeb are displayed in this hall. Munitions are displayed in the third hall. The main attraction of this hall is the swords of Akbar and Jahangir.\n\nThere is a sheath here in which two swords can be kept together, this is a special sight for the tourists. Time to visit the museum is 10 am to 5 pm, closed on Friday",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Must visit place if you are visiting alwar. Entry is free throughout fort or palace only entry to museum will cost ₹25 rest palace is very beautiful with very famous and most believed in area - \"Moosi maharani ki chatri\" with Sagar kund in front and historic mahadev temple as well.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "One of the few good places to visit in Alwar. There is also the Museum which everyone can visit.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Jyoti Rao circle",
      "rating": 4.3,
      "address": "HJ43+9V, 36, Manu Marg, Kabir Colony, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "this is a circle ⭕️ in memory of shri jyotibha fule, a statue also here",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice circle 🔴 Thare is a bus stand here where from buses are arriving and departing to your destination.... Except it... Autorickshaw and other transport vehicles are available in this area 📌📌\n\nThis is known as naya bas circle 🔴🔴",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You can easily reach this location whether you're a urban resident or not. You can enjoy the trips of buses of each and every type such as Roadways, private, etc.\nAre you planning to move on? Are you preparing to give Govt and other important exams? Do you want to succeed in your life? Then stop here,\nThis is a place where you can find several coachings to boost up your performance by solving the tests and exams as on which you want to prepare.\nCoachings include - Mother's,  Bharat, MDSA, SBI,  RBI, Venus, Aakash,  etc.\nTransportation facilities are also up the mark.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Mahatma jyoti raw fule circle is also known by  bus operators as nayabass circle",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is only a cross road circle with a statue of Jyoti Rao Phule.\nHistorical...???\nNothing more interesting.\nNot a place to visit.\nNot beautiful, all side encroachment by small food vendors without cleanliness and hygiene.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Alwar Museum",
      "rating": 4.4,
      "address": "City Palace, Mohalla Ladiya, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Amazing Museum, you can gain a great knowledge and know the history of Alwar.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice tourist place all ancient culture is here",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Title: A Time-Traveling Adventure: Alwar Museum\n\nGet ready for a 'dhamaal' time as you embark on a magical journey through history and 'desi' art at the Alwar Museum! Located in the heart of Rajasthan's vibrant city, Alwar, this 'hatke' gem will sweep you off your feet and leave you 'masti-fied' and craving for more.\n\nAs you step into the museum's 'shandaar' entrance, you'll be awestruck by its majestic blend of Mughal and Rajput architecture, standing tall like a 'mehfil' of historical grandeur. But the real 'jadoo' begins when you walk inside and discover the treasure trove of 'desi' heritage and 'purani kahaniyan' that will leave you 'wah wah'ing in amazement.\n\nThe collection of ancient sculptures and relics will make your 'dil' skip a beat. 'Dekho' closely at those intricately carved stone statues, each with its own 'kissa,' 'kahani,' and 'dastan.' It's like you're 'raiding' the past, getting a 'mazedaar' peek into the lives of the people who once lived and loved in Alwar.\n\nCalling all 'art lovers' - you're in for a real treat! The gallery is a riot of colors with 'desi' Rajasthani paintings and 'chhota mota' art that will make your eyes dance with joy. 'Uff,' the detailing in those miniature paintings is something else! You'll be left 'sharminda' at the talent of local artists who've captured the 'ada' of Rajasthan so beautifully.\n\nFor the 'deshbhakts' interested in the 'dhai kilo ka hath' of the Rajput warriors, the 'dhamakedar' armory exhibit will 'dhishoom dhishoom' you! Gape at the fearsome weaponry and 'zabardast' defense strategies that made Alwar's warriors a force to be reckoned with. It's like a 'bollywood blockbuster' unfolding before your very eyes.\n\nBut what 'bindaas'ly sets the Alwar Museum apart is its personal touch. You'll feel like you're 'ghoonghat mein ghotala' as the exhibits take you on a 'rango se bhara' journey through the lives of Alwar's former 'rajas' and 'ranis.' 'Mazaa aayega' as you learn about their 'jung' and 'pyaar,' and how they shaped the city's 'kismat.'\n\nWhile the Alwar Museum is already 'bahut badiya,' a sprinkle of 'masala' could make it even more 'chatpata.' Imagine 'thumkas' with interactive displays, letting you virtually join in on historical 'naach gaana,' or maybe 'tadka' it up with multimedia installations that bring history alive.\n\nIn 'sabko bolo' language, the Alwar Museum is an unforgettable fusion of 'itihass,' 'kalakari,' and 'sanskriti,' celebrating the 'masaledar' essence of Rajasthan. So don't 'socho' twice - head over for a 'full-on paisa vasool' experience that will leave you saying, \"Alwar Museum, you rock!\" 'Balle balle'!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Alwar Museum, also known as the Government Museum Alwar, is a museum located in the city of Alwar in the state of Rajasthan, India. It is situated within the City Palace complex, which is a prominent tourist attraction in Alwar.\n\nThe museum was established in the year 1940 and is known for its diverse collection of artifacts that showcase the rich cultural heritage and history of the region. The exhibits in the museum encompass various periods, including prehistoric, ancient, medieval, and modern times.\n\nSome of the key highlights of the Alwar Museum include:\n\nArchaeological artifacts: The museum houses a wide range of archaeological finds from the region, including tools, pottery, coins, sculptures, and inscriptions dating back to different periods.\n\nArms and weaponry: Visitors can explore an extensive collection of arms and weaponry used by the rulers of Alwar, including swords, daggers, guns, rifles, and armor.\n\nMiniature paintings: The museum also displays a remarkable collection of miniature paintings, showcasing the rich artistic traditions of Rajasthan. These paintings depict themes from mythology, court scenes, and daily life.\n\nManuscripts and documents: A section of the museum is dedicated to preserving and showcasing ancient manuscripts, royal decrees, and other important documents of historical significance.\n\nSculptures and statues: There are several sculptures and statues on display, representing different artistic styles and religious themes",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Friends, If you are history lover than you gonna love Alwar Museum as you can find the amazing collection of historical articles. You will gather more information if you visit this amazing place and in return they only charge Rs. 10. I must say this is one of the nice museum.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Naya Baas Circle",
      "rating": 4.2,
      "address": "HJ23+9MF, Manu Marg, ITO Rd, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "Good place alwar coching hub is located at Naya bas\nAnd famous food zone available name is topi wala shop",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The circle is for the flower decorators for cars and everything, you must bargain as their rates are high enough.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Naya bas circle alwar ll, calledloins circle of alwar . That leads smd circle kala kua , jyotiraocircle , motidoongri, laldiggi etc",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Alwar Coching institute hube located",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very much crowded due to being an epicenter for coaching and student PG. Road around the circle are pathetic..lots f food vendors always are there which blocks the path way. However u can buy almost everything here, since it's has been turned into a mini market.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mata Temple",
      "rating": 4.3,
      "address": "HJJC+W9R, Sahab Johada, Karamchari Colony, Alwar, Rajasthan 301001, India",
      "reviews": [
        {
          "text": "I gave two stars because it's a very dirty place but some  great seen behind the temple",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very beautiful natural place.. Hills, greenery, temple, fort and the best view of the city ALWAR!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good palace to visit Jai mata di",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This was nice place and very perfect architecture",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is very nice and very peaceful place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}