{
  "places_with_reviews": [
    {
      "name": "Venkateswara Swamy Temple",
      "rating": 4.7,
      "address": "Mahipala vidhi National Highway 214 East godavari dist, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "When ever we need some peace we can go and sit and feed the fish ur mind will be refreshed. compare to old now new reconstructed was so awesome.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Such a beautiful place.. very peaceful and Nithya annadanam is there here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Who wants to see the GOD peacefully and to experience the temple environment Go except Saturday. It's an amazing place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amalapuram most famous temple\nSri Venkateswara Swamy\nTemple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Venkateswara Swami Temple in Amalapuram is a famous Hindu temple dedicated to Lord Venkateswara, also known as Balaji or Govinda.\nThe main deity of the temple, Lord Venkateswara, is depicted in a standing posture with four hands, holding a discus, a conch shell, a lotus flower, and a mace. The idol is adorned with richly embroidered clothes and jewelry, and is placed on a high pedestal inside the sanctum sanctorum.\nThe temple attracts thousands of devotees from all over India, especially during the annual Brahmotsavam festival, which is celebrated for nine days in the month of September or October. During this time, the temple is beautifully decorated with flowers and lights, and various rituals and processions are held to honor Lord Venkateswara.\nApart from its religious significance, the Venkateswara Swami Temple is also known for its cultural heritage. The temple hosts several cultural programs and events throughout the year, including classical music and dance performances, religious discourses, and festivals celebrating the rich cultural heritage of Andhra Pradesh.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Clock Tower",
      "rating": 4.3,
      "address": "H2G3+Q5C, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "It is one of the heavily crowded areas in this town. The newly built clock tower looks pretty stylish too. It barely remains a landmark with no obvious historical significance but the connect it had with people of this town stands it apart from other monuments.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A most important landmark in amalapuram town..little bit conjusted with traffic...And one of the main shopping centers in the town.recwntly renovation work is in progress. The old clock tower is dismantled and construction of the new clock tower is in progress. The new clock tower looks appealing and may be expected to be completed in next few months.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A nice place in the heart of the city. A very old landmark, which has been renovated recently and has nice additions such as fountains, color changing lights etc..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place usually a common place for gatherings meetings and dharnas.\nHere parking is some times risky. They send chalanas. Recently renovated.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Heart of Amalapuram.... The Old one is replaced and now it's newly constructed with our national flag beside... And we can see I ❤️ AMALAPURAM here.... With all the facilities like shops and all....",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Vijayawada",
      "rating": 4,
      "address": "HX2Q+3P7 Paruru Y Junction, NH 214, Perurupeta, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": []
    },
    {
      "name": "Sri Vasavi Kanyaka Parameshwari Kalyana Mandapam,",
      "rating": 4.2,
      "address": "H2M4+235, Black Bridge Main Rd, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "Very nice for 300-500 guests marriage functions or parties",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very reasonable prices and taste is yummy",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very nice place but very less space. Ac hall is good. No parking available, have to keep your vehicle unsafe on the road in the unsafe driving of Amalapuram",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A good place for occasions which can handle nearly 500 crowd easily",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good for 200 people's function",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Vittanaala Vari Palem, Amalapuram",
      "rating": 3.8,
      "address": "vittanala vari palem,, H2F7+4J8, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "Nice and all most 🌲 trees are there that also buetiful",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Soo cute place",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Very conjusted roads.Road condition is worst",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Very nice suggested",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "True hot people",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Sri Saraswathi Devi Temple",
      "rating": 4.2,
      "address": "HXCG+VRW, Indupalli, Andhra Pradesh 533221, India",
      "reviews": [
        {
          "text": "It's a very nice and big Saraswati temple in that area. No other temples available in that location",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Wonderful Holy Place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Panthulugaru gave a good effort and way of pooja also SUPER.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "One & Only temple of saraswathi in surroundings",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Manna Jubilee Church",
      "rating": 4.4,
      "address": "Manna Jubilee Church Rd, Amalapuram, Andhra Pradesh 533221, India",
      "reviews": [
        {
          "text": "Very big and beautiful ambiance.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is easy to find from normal traffic. There is wheel chair accessibility here, there is a  parking structure for parking of vehicles , this place is filled with gods presence and you will definitely experience it,  here we can worship can , it is peaceful here and the preachers preaches the best and they will tell us how to live a good life and also to experience god. It is located next to the road.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Located in Amalapuram.\nGood place to worship. Every Sunday 3 services . Parking available",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nearby church at Amalapuram actually it is located at eedarapalli rather than the word of God, music is more preferred here... Similar to a rock band music,, that too lively and spiritually.... But no evangelist is there to spread gods word there in that church, sorry to say this",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a good place and a blessed place.  I love it. Glad to know about this church. Actually, I'm from Vizianagaram. But, when I go to Amalapuram,  I use to Go to this wonderful and revival church.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Amaleswara Swamy Temple",
      "rating": 4.5,
      "address": "H243+8XW, Rollapalem, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "This is the temple which is the reason behind the formation of the name AMALAPURAM,i.e Amaleswara swamy  temple.Every Saturday there is annadhanam and its is nearly 2 to 3 kms from amalapuram.Rollapalem is the place where temple located and there is no parking for cars beside the temple,you have to park it in walkable distance from there .Every day abhishekam facility provided.along with god shiva and godess parvathi also ganapathi,hanuma,naga bandanalu and 2 to 3 worship trees are there to worship.finally you will definitely enjoy the nature and village atmosphere there!!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is a devotional place lord Siva was founded here as amaleyswara Swamy.\nThe local people are tells about Amalapuram city name created by this temple name.\nWe can  observe such an oldest lingam here\nYou may feel lotd Siva blessings here.\nGood place for peace and spirituality...\nOm namasivaya.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to worship lord shiva no noise devotional atmosphere",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The temple on which the town is named from. Amalapuram.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "sri subbalamma temple",
      "rating": 4.8,
      "address": "H2H3+GCC, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "Very powerful goddess. Everyone feels as if really Matha is sitting there for blessing us. Very pleasant atmosphere. Located in the centre of the town. Martha's blessings will always be there for those who sincerely pray Matha.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Its Holli pace for Hindus. Very famous in amalapuram",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice and place for worshipping the godess.🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very power goddess\nit's famous temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very popular and powerful Godess",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sri Venkateswara Swamy Temple",
      "rating": 4.4,
      "address": "HXGR+F8X, Amalapuram, Andhra Pradesh 533201, India",
      "reviews": [
        {
          "text": "Environment makes the mind relax and climate is also good. Police and gaurds were very friendly during darshan period. Accommodation and locker facility makes us little irritate",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Sri venkateswara swamy temple🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Loved it\nThanks again for all of you",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "🔥😅",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}