{
  "places_with_reviews": [
    {
      "name": "Amarkantak Temple",
      "rating": 4.5,
      "address": "MQF5+2R9, Amarkantak Rd, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "The temple and surroundings are well maintained and good.\n\nPushkar ghat\nSeveral vehicle parking places for vehicle safety but paid parking\nHotels and several ashram were also available\n\nHistory:\nThe Amarkantak region is a unique natural heritage area and is the meeting point of the Vindhya and the Satpura Ranges, with the Maikal Hills. This is where the Narmada River, the Son River and Johilla River originate.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Amazing architecture of nagar style , built by King of tripuri Karn dev rai during 11th-12th sanctuary.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice place, beware of the monkeys near the temple they will snatch the red packet.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful and well managed Temple with lots of shops around, lots of parking space nearby. If you are coming from chattisgarg, road conditions are not excellent. In MP roads are excellent.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Well Maintained...\nThe Udgam-sthal of River NARMADA....\nMust watch Narmada-Aarti...",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Sonmuda Amarkantak",
      "rating": 4.4,
      "address": "Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Beautiful place to visit when you are going for a religious journey. Place dedicated to the origin of the river Son and sati. The place is surrounded by forest cover and a beautiful valley view. But beware of monkeys as they become hostile sometimes.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best tourist places\n\nA perfect spot to spend your weekend is the \"Origin of the Son River\" temple, which is a small but beautiful temple.\n\nYou can capture some amazing pictures with a stunning background and also visit the Hanuman Ji temple located in between. Additionally, there are some rare herb shops that you won't find anywhere else.\n\nHowever, be cautious of the monkeys that roam near the entrance, but you can feed them if you wish. This place is a must-visit for all nature enthusiasts.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "One the best place to view sunrise..\nI really suggest to visit this place..\nThis place is surround with tress and clouds...\nNature place and very Peace ful places..\nI really liked it hope you also love that place 💞💞😇😇🙏🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This mythological place is a hidden gem full of serenity. Best place to click pictures with beautiful background and there is also a hanuman ji temple in between, some herbs shop are also there which are rare to find anywhere else. Just beware of the monkeys roaming near the entrance, you can feed them if you want. A must visit place for nature lovers.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place for visiting in weekend...there is a small temple,people called it \"Origin of the Son River\"..A stream of water coming out of a small well has taken the form of a big spring after some distance...",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Mai Ki Bagiya",
      "rating": 4.3,
      "address": "MQ9C+F36, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "The way to Mai ki Bagiya is motorable. It appears that a few people visit, but many people have faith in deity and go on foot.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A beautiful temple within the nature surrounded by greenery trees. A must visit place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Complete package for pilgrim + adventure + nature.\nMai ki bagiya is addressed as the narmada river's (goddess) play area of her childhood. The temple has inner core cave , the forest area covered around the temple and the long trees beside road is very amaze.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Natural and greenery place for people who loves nature....Original udgam sthal Narmada river.....",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is the place where Natmada river first appeared. A nice place. This plave is on Maikal hill. Parikrama wasi people visit this place to worship. There is maiyyas mandir, Shivmandir and some rooms. Beware of monkeys.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Narmada river udgam sthal",
      "rating": 4.3,
      "address": "MQC7+GV8, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Origin of river Narmada.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a pure bliss to see the source of a sacred river like Narmada. Felt myself lucky to have the glimps. Located inside the Narmada temple complex just beside the main temple of Mata Narmada it's also inside a temple called Narmada udgam. Daily aarti is such a beautiful and devine feeling here. Jai Ma Narmada 🙏.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is narmada river origin place, descovered by Pradeep Kumar B Tech (engineer) using satellite images and researches,",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ggg",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Narmada Udgam Sthan",
      "rating": 4.6,
      "address": "Savitri Sarovar, MQF5+2R5, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Har Har Narmade!\nAn experience you would not forget , visit various places nearby and participate in evening aarti (7pm) to see the magnanimous extravaganza .  This place holds great significance in Hindu mythology and when here don't forget to check out ayurvedic medicines (beware of counterfeits).",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Tranquil Oasis of Serenity - Narmada Udgam Kund\n\nVisiting Narmada Udgam Kund was an awe-inspiring experience that left me rejuvenated and profoundly connected to nature. Nestled amidst lush greenery, this hidden gem truly lives up to its reputation as a sacred site and a tranquil oasis of serenity.\n\nThe moment I arrived, the sound of the gushing Narmada river greeted me, instantly soothing my senses. The crystal-clear waters emerging from the earth's depths were nothing short of breathtaking. It was humbling to witness the natural phenomenon where this holy river originates, creating a sense of reverence for the forces of nature.\n\nThe well-maintained pathways, seating areas, and informative signage made my exploration of the site seamless and educational. The surroundings were teeming with diverse flora and fauna, offering a delightful experience for nature enthusiasts and birdwatchers alike.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Narmada or Narbada River is an important river flowing in India.  It originates in the Amarkantak Mountains in the central Indian state of Madhya Pradesh and flows in an east-west direction, and is about 1,312 km (815.2 mi) long, eventually emptying into the Gulf of Khambhat, the Arabian Sea.  1,312 km (815 mi) approx.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jai narmade, Temple is very clean and very well maintained. There was so much rush during new year however on normal days one can complete darshan and site seeing in an hour. Be aware of monkeys. Parking available outside the temple,",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful, so charismatic but visit during non holidays and festive occasions you'll be able to visit Mata ji comfortably.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Yantra Mandir",
      "rating": 4.2,
      "address": "MQ86+H27, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Very beautiful from outside but cant go inside because this temple under construction.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Must visit to understand architecture of these temples .and these temples are renewated by ASI.\nMust visit in Amarkantak",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Most unique and unusual place you'll ever come across at the further most part of Madhya Pradesh, at the Chattisgarh state border. The inside of this temple looks like a chausath yogini temple, which is circular in shape and this temple is ancient. It also has an underground part where the God/ Goddess idol is placed. Only for the people who like to explore to the core.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good to visit but it is under construction and you are not allowed to go inside.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Excellent experience. I would love to visit again.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Narmada river starting point",
      "rating": 4.8,
      "address": "MQC7+GV8, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Narmada is the holiest. She is also called Reva and Purvaganga. It is said that a view of the river cleanses our sins. Interestingly, legend goes that when Ganga feels polluted thanks to her worshippers who take a dip, she comes in the form of a black lady to have a purifying bath in the Narmada! Narmada is a river in central India and the fifth longest river in the Indian sub continent. It is the third longest river that flows entirely within India, after the Godavari, and the Krishna. It is also known as \"Life Line of Madhya Pradesh\" for its huge contribution to the state of Madhya Pradesh in many ways. The Arati time is in the evening and it's soooo beautiful and devotional. We just love the way they pray.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Kapildhara so beautiful place❤",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Celebrating Our Aranyak Culture of Bharat.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Natural Beauty 😍",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great experience. Nice views inside.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "नर्मदा मंदिर",
      "rating": 4.6,
      "address": "CT, MQF5+2V6, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Puja / Aarti - everyday at 7.00 Pm evening , just front of Narmada temple on Narmada Kund.\n\nThe full area filled by visitors & pilgrims. The most people are not following the COVID rules , but at- least you should must wearing mask\n\nThe source of the Narmada is a small reservoir, known as the Narmada Kund, which is located at Amarkantak on the Amarkantak plateau in Anuppur district of the Shahdol region of eastern Madhya Pradesh.\n\nMust Know - Proper clothing must wear, Kept shoes outside the temple area in the show rack or in your vehicle. No one can bath in the premises of kund & temple premises.\n\nTicket - Free for all\n\nPrasad - Paid service from counter inside the Temple premises\n\nParking - Some time paid , some time free, must park your vehicle faraway from temple because too much vehicles will park any time near to temple and then jaam- packed situation created.\n\nThe river descends from Sonmad, then falls on a cliff as Kapiladhara Falls and flows into the hills, crossing rocks and islands through a course to the ruined palace of Ramnagar.\n\nOne of the major seven rivers of India, the Anupam Narmada originates at Amarkantak and is located in Madhya Pradesh. Amarkantak is counted among the holy places of India. The lush green Amarkantak, situated between the Vindhya and Satpura ranges at an altitude of 1065 meters, Amarkantak is also known as omkarpeeth. Amarkantak, covered with a dense forest of Sal trees, is a religious, historical, spiritual, archaeological and famous tourist place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very attractive place. Looks very nice in the evening. Temple is very beautiful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The holy place of source of Ma Narmada river is really giving spiritual feeling,heart  feeling with emotions, positive energy and inspiration for being simple and good.It is also one of SHAKTI PEETH,giving an symbolic energy with visiting,really it is great place of India,it's beauty is reflected with spiritual love...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Divine place. Narmada kund temples, the origin of the Narmada River is located in the state of Madhya Pradesh.\n\nAmarkantak is a Hindu Tirtha Place, a site where three rivers , the Narmada, the Son and the Johila(Tributary of son) emerge.\n\nThe Amankantak region is a unique natural heritage area and is the meeting point of the Vindhya and the Satpura Ranges, with the Maikal Hills being the fulcrum.\n\nThe temples other than the white temples are the Ancient Temples of Kalachuri Period, famously known as Trimukhi Temple. It is situated in the South of the Narmada Kund or Narmada temple, just behind it. These were built by Kalachuri Maharaja Karnadeva(1041-1073 AD).",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "place of Narmada River Origion ,  As per historical evidences  it was built by Kadchuli around twelfth century. Narmada Udgam Kund (birth place of Narmada) was built by Rewa Nayak ,After so many years,Bhonsle, the king of Nagpur gave the shape to Narmada Mandir.A mega complex of temples with idols of gods and goddesses is built around the temple.Idol of a elephant and a horse is placed here on which ,statues of Lakhan and Uddal are placed which are supposed to be damaged during the Aurangjeb period.\nOne of the famous tourist destination of MP , easy connectivity by road from Raipur or Jabalpur airport , nearest railway station is pendra or anupur. Inside campus is so peaceful & well maintained . Must be part of your travel plan if you are planning to visit Bqndhawgarh  or Kanha national forest .",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ancient Temples Of Kalachuri group",
      "rating": 4.4,
      "address": "MQC5+MCW, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Good place with excellent weather..\nIt is Not only famous among religiously inclined tourists, but it is tremendously famous among other nature lovers as well because of its location.\nIt is located near to the narmada river.\nIt's an ancient temple which is registered under archaeology departments.\nFully peaceful place\n\nEntry ticket= 20rupees",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "You will be mesmerised by the historical architecture of ancient India and the amount of effort they put in building these temples and the stories behind them. The stone tablets put up by the archeological departments do help a lot in understanding what they are but having someone who knows the lore(stories) attached to them is a feat everyone should atleast try once.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great place to visit, lot of greenery and temple inside the area. It is near the narmada temple and in walking distance from that temple. If you will go to amarkantak you must visit this place once and enjoy there.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place. Well maintained and clean and has small amount Rs. 20 (after discount of Rs. 5 for online) entry ticket.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The ancient Kalachuri period temples are a historical site located in Amarkantak. Here you get to see many ancient temples. The ancient temple of Kalchuri period is located near Narmada Kund in Amarkantak. You can also walk to this place. Here you get to see many temples. Whenever you go to Amarkantak, you can come here. These temples were built by the Kalachuri kings. The temple here has been protected by ASI. These temples were built between 1042 and 1072. These temples were built by King Karan Dev. Karan Mandir and Pataleshwar Temple are very famous among the ancient temples of Kalachuri period.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shiv Mandir",
      "rating": 4.5,
      "address": "MQF5+2R3, Amarkantak, Madhya Pradesh 484886, India",
      "reviews": [
        {
          "text": "Sri Yantra Mahameru Temple is a must visit place located in Amarkantak. This temple is a very beautiful temple of Amarkantak. You can come here and see very nice sculpture. The entrance of this temple is very beautiful. There are many idols at the entrance, which are standing in different postures. It looks very beautiful. If you go inside the temple, you get to see the temple in a square shape. You can come here to hang out with your family and have a good time.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple is a Hindu temple dedicated to the god Shiva located on Amarkantak,  The famous religious places to see near the temple like Narmada River flows Point and Hill view point and many small small temples you can enjoy with your family and friends",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Amarantak is the originating place of one of the holiest Indian River Maa Narmada, which, according to Ved - Purans, is the unmarried daughter of Lord Shiva. For Hindus it is an important pilgrimage point.\nThere are a number of temples around the holy pond of Narmada.\nThe temple is very well managed by the Temple Management and the MP Government and is very neat and clean in and around the temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best place to visite in madhya pradesh if you want to know oun self and need meditation to go there and look peace and divine energy.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "There is a natural water source and it's called narmada mata according to local beliefs. People worship god shiva and narmada mayiya and take good wishes and blessings from god and goddess there is lots of scenic places in amar kantak good luck with your tour and have fun",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}