{
  "places_with_reviews": [
    {
      "name": "Shri Arasuri Ambaji Mata Temple",
      "rating": 4.8,
      "address": "Ta.Danta, Dist.B.k, Khodiyar Chowk, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "No words\nKuldevi\nN heart of  sati\nMany stories r behind this temple\nIn 12 months many festival r celebrating",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Among most n frequently visited pilgrimage places in Gujarat , this temple of Ma Amba or Ma Ambika Ma Arasuri, is among top,\nMain deity is Devi Amba,it's an old temple dating back more than a century,time n again it has undergone renovation,as of now temple is fully covered by gold plates which adds to the glory of the temple,located in north Gujarat around 190kms from Ahmedabad, 60 kms from Palanpur\nDevotees pour in everyday for darshan , but every Poonam ( fulmoon) is a day when more devotees throng in , annually on full moon day of Gujarati Bhadarvi Poonam hundreds n thousands of devotees come, amongst them many come walking on their feet from far away places, it's a must visit for all devotees who follow Devi or Shakti",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the 51 SHAKTIPEETH of Mara ABMA PARVATI JI one of the best location in the world everyone should visit this SHREE ARASURI AMABJI TEMPLE one of the most located places on India Gujarat as this place holds powerful energy of god as here told to be an HEART ❤️ of an goddess Parvati as it is called SHIV-SHAKTI goddess Mata shakti Parvati’s heart is for everyone and best for families and friends wonder happening place for everyone it also located on arvelli mountain range on MOUNT-ABU road with lots of mountains holds Mata parvati ji’s heart also visit the wonderful place GABBAR MOUNTAIN near temple also a rope way and walking paths stairs are available JAY AMBE…\n\nAmbaji Yatradham, famous as Shaktipeeth all over India, is located in Danta Talka of Banaskantha District of North Gujarat. Ambaji, one of the 51 Shakti Peeths in the heart of nature in the Aravalli Hills, is blessed with more than 125 lakh pilgrims paying obeisance at Ambe's feet every year. Sindhwar, Mayurdwar and Gajdwar are built for entry to Ambaji Nagar.\nSarkarshree, District Administration Banaskantha and Sri Arasuri Ambaji Mata Devasthan Trust Ambaji are determined to embellish this rare heritage of religion, culture and spirituality with a story of development and to preserve the cultural heritage…\n\nGabbar literally means \"mountain\" in Gujarati, on the Gabbar mountain sits Ma Ambe in the form of a flame.\nHere Mataji's \"Akhand Jyot\" is lit. At a height of about 500 meters from the ground, Gabbar Akhand Jyot and Mataji idol are installed. 999 steps have been constructed to climb Gabbar mountain. The facility of rope way is also available here. It is said that Chaul rites of Lord Krishna i.e. Babri rites were also performed here.\nEven today, Ambe's footprints (signs) can be seen on the top of Gabbar as a real sight. There is also a belief that one's wish can be fulfilled just by seeing the Paras Pipli here…\n\nA parikrama route like no other, an unprecedented spiritual journey and home to all the shaktipeeths located around the world converging with the 51 satipeeth circumambulation in Ambaji. An exact architectural replica of all the 51 Shaktipeeths was constructed in a circular shape and was formally enshrined in the year 2014. Every year in the month of February, the \"51 Shatipetha Parikrama Mohotsav\" is celebrated in Ambaji.\nAccording to RAMAYANA Lord RAMA and ALKSHMAN also visited this temple in search of MATA SITA and have prayed here for energy of goddess parvati ADI SHAKTI… JAY AMBE ❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Ambaji Mata Temple is a pilgrimage site visited by millions of devotees during the week of the Bhadarvi Poonam fair. It is one of the 51 Shakti Peethas. It is situated at a distance of approximately 65 kilometres from Palanpur, 45 kilometres from Mount Abu, and 20 kilometres from Abu Road, and 185 kilometres from Ahmedabad, 50 kilometers from Kadiyadra near the Gujarat and Rajasthan border.\n\nDevotees also visit the temple on Purnima (the full moon).\n\nAmbaji is a town within taluka district Banaskantha, North Gujarat, India. It is located at 24.33°N 72.85°E. It is at an altitude of 480 metres (1,570 ft). It is surrounded by the Araveli Hill range. Ambaji is within the Aravali Range 'line of peaks', is a range of mountains in western India running approximately 800 km in a northeastern direction across Indian states of Gujarat, Rajasthan, Haryana and Delhi.[5][6] It is also called Mewat hills locally. Ambaji town also in between the borders of North Gujarat and Abu Road of Rajasthan.\n\nAs of 2011 India census, Ambaji had a population of 17,753. Males constitute 9,132 of the population and females 8,621. Ambaji has an average literacy rate of 78.39%, higher than the state average of 78.03%, with 85.76% of the males and 70.78% of females literate; 14.12% of the population is under 6 years of age.\n\nSummers are typically hot and humid with hot winds and temperatures between 26 and 46 degrees Celsius. In winter the temperature ranges between 6 and 36 degrees Celsius and rainfall is about 15 to 30 inches; in the monsoon season, average rainfall is about the same as in winter. Amabaji is at an altitude of 480 m.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Shakti peeth where the heart of maa sati fell, Shikhar of the temple is made up of gold.\nPhotography inside premises is prohibited, parking is available at many spots avoid parking at shop they obliged to purchase Prasad from them.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Gabbar hill ambaji",
      "rating": 4.8,
      "address": "8VJ2+CJ9, Khodiyar Chowk, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Visited after many years, glad to see such an improvement in all aspects. Great roads, infrastructure, cable car and facilities. Well done.\nPlease do something about people throwing garbage along hillside (mostly those who work and do business there)\nGreat experience though, mind the monkeys!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Cute little Rodeway towards the Temple situated on Gabbar hill. There is bound to be rush on weekends and holidays. Price is okay. Takes about 10 minutes to ascend and descent. Looks safe from a distant but not once you get in. Especially if there is a lot of wind. Near the top, the car can sway dangerously. I would avoid if the canditions are too windy. Otherwise, it's a superb experience with great views. The temple is very nice. The surrounding gardens etc are also good. I would suggest going early and if possible inquire before hand it the rope is closed.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful spot.  We chose to hike not to use ropeway it worked keep going and resting for  a while.  It was crowded may be due to weekend.  But still walking up wasn’t that difficult.  Coming down was I think due to some imperfections steep steps we use ropeway.  It took only four minutes using ropeway.  It felt safe no issues there,  I would love to visit again as long as you don’t carry too much stuff with you becomes easier.  There used to be dolly people carrying visitors decades ago I guess they do not have employment anymore.  Bunch of kids asking to buy puja stuff from them making me sad that they could be at school.  We actually got a shared Jeep to reach at the location was only 20 Rs per person.  It wasn’t crowded just three passengers and a driver.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "There is a famous pilgrimage site in Gujarat which is known by the name of Shakit Peeth Ambaji",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Lovely  Temple🛕\nParking, Ropeway Facilities,Snacks And other things are available.\nParking charge for Car is 30rs and there are 2-3 official Parking spots.\nFor Ropeway Facility you have to go through gate no. 02👍🏻\n\nThere is also a light show at night. [We missed it so no photos]",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shree Arasuri Ambaji Gabbar Tirtha",
      "rating": 4.8,
      "address": "Gujarat State Highway 54, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Jay Ambe !\nAmbaji is one of the shaktipithas. It is a famous pilgrimage place of Gujarat in India situated on the border of the States of Gujarat and Rajasthan near Abu Road, in the Danta Taluka of Banaskantha District. This divine place of Goddess Ambaji has magnificent and serene energy. The view from the top of the hill is sublime. There are two ways - Stairway  and Ropeway. Approx 1000 steps are there from the stairway. The Ropeway ticket price is approx 125/- Rs.(included return ticket)per person . We visited this place on a working day. No big line for Ropeway, so usually if you visit here on working days you can complete your darshan through Ropeway within 40-45 minutes. On the weekend, holidays, festival time, Navratri time and on Poonam it will take more time because of the huge rush of the crowd. A food court facility is also available here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Ambe mat ni jay🙏. Really nice atmosphere in winter and probably in monsoon too. One can do a prikrama of Gabbar mountain which path includes small temples of 52 shaktipith. There is two ways to reach the top of the gabbar either by climbing through  stairs or by rope way cable car. Rope-way cable car has it's own fun adventure.\nThe prices of rope-way cable car is Rs.125/- per person for an adult which includes round trip. and Rs-100 for children based on height basis. For handicapped peoples the price is Rs 100. If you climb by stairs and wants to come down using rope-way is also possible for that you have to buy a ticket from the top of gabber.(i don't know the prices from above, probably half).",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good energy at the temple,\nThe beautiful view from above, Ropeway is a very comfortable ride.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Maa Amba oldest temple on Gabbar Hill.\n\nRope way facility available and also through stair you can visit Maa Amba temple.\n\nHere everyday at night 3 laser show arrange by trust, that is unbelievable.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the best place if you have to try your stamina power and blessing of god on you. You must climb gabbar mountain by walk. You really enjoy the beauty of gabbar mountain and cold wind waves. When we are climbing we saw a chitta at bottom of the mountain. So this types of priceless experience you also fill by climbing mountains. There are one spiritual that “ if you don’t visit gabbar mountain than you ambaji temple journey of blessing is not over” so must come and got blessing of maa ambe on you and family. Jai ambe mataji.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ambaji Gabbar",
      "rating": 4.8,
      "address": "8RQH+5M4, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "A must visit mataji temple on hill top,the only problem here is there is no facilities for seniors and devyangans.\nThe Roop way costs Rs. 125/- two way.\nNo discounts for women, seniors and devyangans.\nMismanaged and arrogant security staff.\nPhoto & video is allowed here.\nThere is a laser show in the open, in the evening at 7 pm timings may change according to climate.\nDon't worry if you miss this as there is nothing great for you to not miss this.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "We visited Gabbar ji Temple this Saturday... Really a nice experience ... What a view .. The laser show was fantastic... The Rope experience was really wonderful....",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I parked my car on road side some dodgy people are locked 🔐 my car and they stealing money from me this are gangs and when I asked show my your id so guys get angry please be careful of this guys . Jay mataji🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Maa amba , ambaji gabbar on top hill ,of ambaji place is very peace and blessed. Enjoy it.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "According to the Indian Scriptures Gabbar Tirth, situated on the bank of the origin of the Vedic virgin river SARASWATI, in the hills of Arasur in Ambica forest, towards south-west side to old hills of Arvalli is one of the Fifty One (51) famous Ancient Pauranik Shakti Piths in India",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ambaji Mata Shaktipeeth",
      "rating": 4.8,
      "address": "8RPX+976, Khodiyar Chowk, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Ambaji, a renowned pilgrimage site in Gujarat, India, sits on the border of Gujarat and Rajasthan near Abu Road. It's always bustling with devotees, particularly on Purnima days. The original seat of Ambaji Mata is atop Gabbar hill in the town. Each year, a significant number of devotees flock to the temple, with a particularly large mela held on Bhadarvi Purnima (full moon day).",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A beautiful experience at the temple. You can choose the ropeway also, which is a more convenient way to reach the gabbar.\nThe place is filled with a magnetic aura of a very pure power that calms you down.\nMake sure to take care of your belongings as a lot of monkeys roan around.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best part is you can see Maa Ambe upclose. However, with so much resources, there is a lot of scope for improvement to make everyone's visit memorable",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This Shaktipeeth is 2nd after the one we have in Haridwar..it's so beautifully built that I was awestruck...surrounded  by hills we witness a beautiful sunrise and sunset both from here...\nEntire temple complalex is built  in marble...and speciality  I felt is marble  didn't  turn hot even during afternoon as compared  to the cemented floor we covered for some distance from the parking...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Heart of mataji\nThere is no idol just yantra decorates looks like mataji\n\nJust darshan gives u holy\n\nKuldevi",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Kumbhariya Jain Mandir, Ambaji",
      "rating": 4.7,
      "address": "8VF7+P34, Kumbhariya, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Extremely peaceful place. The dharmshala is very well designed, very clean and well-maintained. The food in Bhojanshala is also very good and hygienically prepared. The entire staff is very co-operative and well mannered. Best Jain Tirth to visit at ambaji with ambaji golden temple and gabbar mata mandir",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I recently had the pleasure of visiting the enchanting Kumbhariya Ji Jain Temple with my family over a weekend, and it left us all spellbound! Nestled amidst nature, this historic Jain temple exudes a tranquil ambiance that's truly rejuvenating.\n\nWhat took our experience to the next level was their accommodation. Imagine staying in rooms that rival a 3 or 4-star hotel, all while being enveloped by the serene beauty of nature—it felt like we were in a luxurious resort!\n\nAnd let's talk about the food—absolutely delightful! They offer scrumptious meals throughout the day, from hearty breakfasts to sumptuous dinners, all at nominal charges.\n\nIf you're Jain, this place will resonate deeply with your spiritual side, blending the essence of ancient traditions with the beauty of nature. Trust me, Kumbhariya Ji Jain Temple is more than just a place to visit; it's a peaceful retreat for the soul. Don't miss out on this gem!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a beautiful place to visit..for photography tickets are available at the office..Rs.100 per camera",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very old temple ,destroyed some parts in past attackers. Renovation going on ..\nTry Jain food at reasonable rates of Rs. 90 only. Good and hygienic place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is more than 1200 years old which was built by Vastupal or Tejpal or the main temple which was built by Vimalshah Mantri is such a great structure.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ambaji Temple",
      "rating": 4.7,
      "address": "8VP2+95F, Khodiyar Chowk, Ambaji, Jharivav, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Tucked up in Gujarat's Aravalli Range, Ambaji Temple is a heavenly location that radiates spiritual energy. The temple's architecture exudes a timeless beauty with its elaborate embellishments. In addition to the temple's religious significance, the tranquil atmosphere that surrounds it draws devotees. A special aura of reverence is created by the pilgrims' dedication and the vibrancy of the aarti rites. The well kept temple complex exudes calm and tranquillity. For those looking for spiritual comfort, a trip to Ambaji Temple is more than just a religious experience—it's a cultural encounter that makes a lasting imprint.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ambaji Temple, nestled in the Aravalli Range of Gujarat, is a divine destination that exudes spiritual energy. The temple's architecture, adorned with intricate carvings, reflects a timeless beauty. Devotees are drawn not only by the religious significance but also by the serene ambiance surrounding the temple. The vibrancy of the aarti ceremonies and the devotion of pilgrims create a unique atmosphere of reverence. The temple complex is well-maintained, offering a sense of tranquility and peace. Visiting Ambaji Temple is not just a religious experience; it's a cultural journey that leaves a lasting impression on those seeking spiritual solace.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Excellent Mandir and spiritual experience when you visit this holy place. You will feel emotional and get motivated to God's energy.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very very nice golden temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jay Ambe! With every single visit, you immerse in a divine experience that is beyond few words to express...",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Koteshwar Mahadev Temple",
      "rating": 4.7,
      "address": "Koteshwer Mahadev Mandir, Unnamed Road, Koteshvar, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Good template.\nThis is starting point of Saraswati river\n\nAlso have valmiki Rishi ashram here\n\nMust visit if you are around Ambaji temple\n\nSerenity",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Must visit on rout to Ambaji. Naturally flow water strim & one can have bath. You can purchase local marble artistics outside temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Koteshwar Mahadev Temple is a must visit place for pilgrims who comes to visit Ambaji.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Hindu temple. Peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best place in the area to visit\nIt's like a heaven in monsoon\nQuite water flowing through the stones\nThere are also small pools for taking holy bath\nGreen mountains range from north to north\nHighly recommended to visit",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Gabbar Mata Temple",
      "rating": 4.8,
      "address": "8RQH+7JR, Gujarat 385110, India",
      "reviews": [
        {
          "text": "Historical  and devoted place of Gabbar Mata temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jay shree ambe ma. Jay Gabbar vali maa. Excellent system. After morbi incident, the trolley system is taken care in a serious approach now. May ambe maa bless all devotees.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Devotional place of Maa Amba , you need to climb 1000 steps and ropeway is also available here. Waiting will be of more than one hour for tickets itself on weekends and poonams, plan accordingly.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is gabbar of ambaji mata temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is also said that Mangal and his wife , a devotee couple of Mata Ambaji used to go for cow grazing near Gabbar Hill , where they saw an unknown white cow , usually grazing near their ones and then disappearing over Gabbar Hill. So one day they followed this cow and went on the hills of Gabbar and reached at night to a big ground,floored with marbles and wonderful pillars and Torans with the doors of heaven which were opened simply by the voice of this holy cow Kamdhenu and they found the Goddess Devi Adhya Shakti siting in her palace. So these cow grazing couple requested for  remuneration from Amba Mata, for the service of cow grazing job for that wonderful white cow and Mataji gave them some grains of Jav ( Barley) , but they carelessly thrown the invaluable grains on the hills of Gabbar but in the morning they found some of the grains made of gold. So they repented and went back on the hills to see Mata Ambaji and worshiped for mercy without any exe to grind. Ultimately Mataji pleased and graced to reincarnate as their daughter in future. And then, this couple born again as Nand & Yashoda, the foster parents of Lord Krishna. And Mata Ambaji  reincarnated as their daughter Maha Maya, who disappeared in jail, after warning Raja Kans.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ambaji Mandir (Official Mandir address )",
      "rating": 4.6,
      "address": "mandir official adress in maps, Khodiyar Chowk, Ambaji, Gujarat 385110, India",
      "reviews": [
        {
          "text": "The most spiritual place and beautiful too many people but still clean. The place is so big that you could get lost the way but the police team is really good and kind they help everyone. I would suggest you should visit this place at least once in your life and don't forget to visit gabbar which is about 1 km from the mandir",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Breathing Techniques learn from your yoga class.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Holy place people come here from 400-500 Km away by walk",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple of Mata ji",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best management and staff police",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}