{
  "places_with_reviews": [
    {
      "name": "Aadishakti Mata Yogeshwari Devi Mandir, Ambajogai",
      "rating": 4.7,
      "address": "Mandi Bazaar, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Great,Very nice temple of goddess mata yogeshwati devi mandir.\nIts at boundary of ambajogai.\nAmbajogai is well connected due to parli vaijnath.\nOne can visit parli vaijnath by railway route.. Also\nTherefore no need to worry about the travelling...\nAmbajogai is actually a well developed taluka of district beed....We can not rate mandir of God,this was Mata Yogeshwari devi temple,temple is mid size,it was very clean,Pujari was cooperative,there was no crowd hence we got darshan of devi very nicely.Devine peaceful temple. Everyone must visit nearby historical places like hatti khana, water kund.\nThis pLace is also having good quality BHAKT NIVAS to stay with family.\n\nGood time to visit is early Morning, no waiting time and you can also have Prasad🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ambaijogai's ancient temple of Mata Yogeshwari is well-preserved. The architecture is beautiful and there is a peaceful atmosphere to it.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the must visit temples. The vibe is very positive and after taking the darshan you will feel positive and peaceful.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Devine peaceful temple. Everyone must visit nearby historical places like hatti khana, water kund.\nThis pLace is also having good quality BHAKT NIVAS to stay with family.\n\nGood time to visit is early Morning, no waiting time and you can also have Prasad🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ambejogai. approach is good. ample parking. covered with trees. big temple complex. it was around 8.30 . had peaceful darshan.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mukundraj Valley, Ambajogai",
      "rating": 4.4,
      "address": "P9XG+2R5, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "It's very pleasent area, full of greenery everywhere. Mukund Raj valley is one of the best spot in Ambajogai. I just love this place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Mukundraj swami Samadhi and the Temple around is a very calm and soothing place to be at. The valley view is not much to talk about. Good to visit during the rain.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Today i visited with family,\nThere no word to describe the genuine nature beauty of  ' AMBAJOGAIE '",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place but I'm almost Bitten by a snake yesterday be careful evening time",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Mukundraj valley is one of the tourist attractions in Ambajogai. It's beautiful and surrounded by greenery.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Ambejogai Bhakt Nivas",
      "rating": 4.8,
      "address": "P9QP+28H, Gawli Pura, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Very nice place to stay .very affordable  Hot tea served as welcome drink .  Comfortable well ventilated rooms with attached toilet ,solar water . Coolers, They also have dormitories . Very nice food ,tasty we had breakfast lunch and dinner ,clean place . TV in case you want to watch . Big waiting room .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Comfortable stay, clean/airy room, 24 hours hot water, good food in the reastaurant, very courteous staff.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good facilities for devoties recently water softener also installed, hot water in the morning for taking  bath, car park for 8-10cars, helping nature staff",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is an arrangement by devotees. And not for Profit as moto. Some 3/4 (750 meters) KMs from local bus stand, 65 KMs from Latur (LUR) station, 24 KMs from ParliVaijnath, or 95 KMs from Parbhani (If you need to visit Aundhya Nagnath Jyotirling temple). Whenever possible Bhaktniwas makes Taxi arrangement to travel to & fro any of above Rly.Stns. Enough car parking, clean and well equipped rooms at reasonable fee, very good food, tea & breakfast and very polite service. The temple is conveniently reachable in 3 minutes walk.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Basic budget accomodations for devotees coming for darshan. Bigg rooms, 4 pax can accomodate easily, big bathrooms, Air coolers available, good homely cooked maharashtrian style food available. Need to inform in advance.\nNote : while you think of residing here, make sure you carry your toiletries & towel. Only soaps are provided in the bathroom.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Chhatrapati Shivaji Maharaj Chowk Ambajogai",
      "rating": 4.4,
      "address": "P9JP+R4C, Parli Rd, Jaywanti Nagar, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Chhatrapati shivaji maharaj chowk....\nMostly crowded place..\nMost things or equipment shops are nearby..\nOne can go and take easily anything they want ...\nMain chowk...\nU get transportation options...\nU get all requirements....\nAll just at moderate price...\n❤❤❤",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Crowded area of public holiday and weekend, no. Of services are available at here like post office, ATM, puncture store, fruit store, lock and key stores, hotels, cycle stores, shoe stores, cafe stores, bajar samiti, banks, xerox stores, kirana stores, etc. are available. Police station and court is also nearby.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Absolutely beautiful place. Everything is antic here ....! Most important, the Staff - Professional and Kind hearted. I am loving every day spent here",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Now a days road broadening work is in progress so bit traffic congestion",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Crowded place. Court, Police Station, Post office is very close to the Chowk. And  Chowk divides main road for Govt Hospital one side, second to Yogeshwari Temple, third to Bus stand and Parli and fourth to Govt Quarters and Latur, Beed road.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Adyakavi Shri Mukundraj Swami Samadhi Ambajogai",
      "rating": 4.6,
      "address": "P9XG+6MP, Mukundraj, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Marathi Adyakavi Mukundraj samadhi temple is situated near Ambajogai in the Beed district of Maharashtra.\nIt’s a very scenic place to visit. Those who are interested and learned Marathi literature are very well aware about Kavi Mukund Raj and his contributions to Marathi literature.\n\nA small temple has been built on his samadhi on the banks of Jayanti river .\nAmbajogai is known as the place of origin of Marathi language, as Mukundraj written his famous Granth , Viveksidhu at Ambajogai.\n\nThe valley is a very scenic place to visit , it is also known for the jungle of medicinal plants .\nIt’s a must visit place for nature lovers ,Marathi language enthusiasts, researchers and students of geology, geography and botany as there is a huge scope of studies in these areas.\nThis samadhi temple is merely 1/1.5 km from Ambajogai . Nearest railway station is paralı and it’s well connected by road to Ambajogai . Latur and Nanded are the nearest airports .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful and peaceful place to visit especially in the evening during the sunset. During monsoons, you will find greenery and waterfalls all around the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best Place in ambajogai for all agers from child to elders\nHold on these is an big review\n\nParking :  available for 2 & 4 wheelers\n\nShops : Not available there\n\nYou can go there in  and watch the Natural beuty of caves and trees and higher water fall\nThe more than 500 Stairs will add more Happiness during Going down side....i dont know while back these stairs  may seat you at corner...hahaa\nAgain\nthere is a small Mandir you can expect free prasad there and drinking water ( Water 💦 not good there pls go with water bottle)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is the ancient and holy place belongs to Marathi proto poet MUKUNDRAJ , who wrote Viveksindhu , Paramamrut , Pawanvijay and many more . It's very beautiful place situated on left bank of JAYANTI river , near AMBEJOGAI city in BEED district . Also it has an waterfall right in front of samdhi temple of MUKUNDRAJ . In monsoon season it looks Indescribable .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its a samadhi place of sage Mukundraj. There is mythological story behind it. Beautiful place to visit and spend time. On the other end of mountain you can see lots of peacocks . You may also see deers.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Dongar Tukai Waterfall",
      "rating": 4.8,
      "address": "Q96M+479, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Untouched waterfall in ambejogai ..bigger waterfall than mukundraj waterfall.. almost no crowd must.. visit place in ambejogai",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best place to enjoy waterfall around Ambajogai",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Dongar Tukai is a very nice place with a water fall",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Rajiv Gandhi Chowk",
      "rating": 4.2,
      "address": "Shop 1, Rajiv Gandhi Chowk, Morewadi, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Good food service fast and taste",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "👍👍",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Your service is good.",
          "languageCode": "en-US",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "दगडूशेठ हलवाई गणेश मंदिर",
      "rating": 5,
      "address": "P9GJ+VC4, Miya Bhai Colony, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Amleshwar Mandir",
      "rating": 4.7,
      "address": "Q92X+J8V, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Very peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amruteshwar Known as Amleshwar Temple God Mahadeva most Awakening Goddess",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temples has some nice carvings on exterior walls.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place is a historic and so devotional peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Historical place ..... Old temple ..... God shiv ji's temple .....",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bara Khambi Mandir, Sakleshwar Mandir",
      "rating": 4.6,
      "address": "Barakhambi Mandir, Ambajogai, Maharashtra 431517, India",
      "reviews": [
        {
          "text": "Barakhambi is an ancient Mahadev temple in ambajogai.there is 12 khamb in this temple but we counting them is will be not a 12 there is 11 or 13 .This is too much beautiful temple construct in 16th century.tye history is that the mandir is in out side of the ambajogai village .\nThe vast expanse around the granite temple is largely dry, acc­entuating its forlorn looks. Till recently, the secluded spot used to be a den for drinkers and gamblers even as the 800-year-old structure, contrastingly, features an enclosure for a solemn occasion: last rites of the Lingayat community. It’s another matter the Bara Khambi mandir in central Maharashtra had been threatened with encroachment. Today, the small Shiva shrine off Ambejogai is in the throes of a make­over that is turning out to be increasingly controversial.\n\nIt happened a couple of months ago when a massive clean-up exercise around the place of worship gave clue to it being just the top of a much bigger structure. The site lies half-excavated, begging for restoration, conservation and, more imp­ortantly, protection. The facelift was part of the Swachhata Abhiyan involving residents of Ambejogai in Beed district. Along with the volunteer-driven shramdan activities, a JCB was deployed. It is hard to tell if the purpose was excavation or sanitation. Whatever, the mission churned up a range of artefacts: idols (big and small), structures resembling the wheel and an arch. Steps to a tank-like structure have resurfaced after the soil was moved. The state department of archaeology has stepped in, but things are moving at a snail’s pace.\n\nIt isn’t as if none had a hunch of ancient valuables beneath the temple soil and around. Activists and local residents say that occasionally, after a heavy spell of rains, an idol or two would peek out of the ground. The officials were tipped about the phenomenon 15 years ago. “We had written to the department of archaeology as well as to the local tehsil office. That was way back as 2002 when people from brick kilns tried to steal the soil around the temple,” says Hanumant Pokharkar, who runs a publication called Jai Siyaram and was one of the organisers of the ‘cleanliness drive’. “We are Lingayats (whose worship is centred around Lord Shiva). We do the last rites of our members in that area around Bara Khambi. The pujaris have, thus, been using the temple vicinity for centuries.”\n\nEarlier this year, the locals decided to clear the thorny scrubs around Bara Khambi mandir. Over-enthusiasm led to unscientific excavation, prompting the local media and activists to alert the aut­horities in Aurangabad, 200 km northwest. The excavation was stopped, and officials decided to carry it out on their own—at a later date—while ackn­owledging the protection-worthiness of the shrine. A preliminary report says the architecture of the temple dating back to the 12th century has influences from the periods of the dynasties of Chalukya (6th to 12th C) and Yadava (for five centuries till 1334). It may also fit the description of Hemad­panthi style of architecture that used black stone and lime, available loca­lly, to build temples as well as mosques in the 13th century.\nAmbejogai, which most famously has a temple by that name (the clan goddess of Kokanastha Brahmins), is hometown of late BJP leader Pramod Mahajan. That gram dev­ata shrine, which is now part of the pilgrimage circuit, has around it shops and hotels. Several buses from all over the state reach the town, which also has Hattikhana (elephant house) stone-cave. Legend has it that it is a precursor to the Ajanta Ellora caves (480 to 1000 CE). It is said the artists first tried to carve in Ambejogai, but found the stone too hard. The town also houses the samadhi of Mukundraj Swami (1128-1200) who wrote the first Marathi poetic work, Vivek Sindhu. Locals believe that restoration of the Bara Khambi temple will add to tourism value",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Last year, we saw a lot many sculptures spread in the periphery of the Mandir but none of them were seen last week. There should be a board about the history of this Mandir put up by Archeological Survey of Bharat for visiting public.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great example of architecture.A mahadev mandir is situated deep down this temple. Must visit. Well maintained and pleasent environment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's really amazing place to visit for those who have interest in history and old sculptures.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple, built in the 12th century, is a must visit for people who visit the nearby ambajogai temple. It is about 2.5 km away from the devi temple.\n\nAfter you climb a few steps in front of the Mandir, there are two concentric circles of pillars. The outer circle has 12 pillars, hence the name \"Bara Khambi\" Mandir. The inner circle has eight pillars.\n\nThis being a Shiva temple there is a big Nandi outside and the main chamber has a few steps that you use to go down to reach the innermost part of the temple.\n\nFrom a distance the temple looks like a Shiva Linga. This place needs better restore ration to preserve the heritage from 800 years ago.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}