{
  "places_with_reviews": [
    {
      "name": "Shree Mata Vaishno Devi Temple, Sector 10, Ambala",
      "rating": 4.7,
      "address": "764, Sector 10, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "I had an amazing and spiritually uplifting experience at the Shree Mata Vaishno Devi Temple in Ambala. The divine atmosphere and the serene surroundings made this visit truly special. The temple's architecture and the aura of devotion are awe-inspiring. The peaceful ambiance and the positive energy inside the temple were truly enchanting. The temple staff was helpful and courteous, ensuring a comfortable visit. I felt a deep sense of connection and spirituality here. It's a place where you can find solace and inner peace. My visit was a five-star experience, and I look forward to returning.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Hi Everyone..!\n\nI recently visited Shree Maa Vaishno Devi Mata in Sector 10 Ambala City and I must say it was a spiritual and peaceful experience. The temple is well-maintained and has a serene atmosphere that immediately puts you at ease.\n\nThe staff were friendly and helpful, and the temple was clean and well-organized. I appreciated the ample parking space and the ease of navigating the temple premises.\n\nThe temple had a great selection of religious items and souvenirs, and the devotees were respectful of each other's space and beliefs. I enjoyed the puja rituals and the darshan of the goddess, which left me feeling blessed and fulfilled.\n\nOverall, I would highly recommend Shree Maa Vaishno Devi Mata for anyone looking for a spiritual and peaceful experience in Ambala City. It's definitely worth a visit!\n\nThank you..!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Mandir is mini replica of maa vaishno devi katra. Here you find sanchi chatt, ardhkumari, chadai, mukhya mandir.\nThis is must visit because you will very happy and adore the concept if the mandir♥️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Place is like photocopy of Vaishnav Devi temple. Resembles as you have visited right the orignal one.\nBeautiful, well organized and clean.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I had a great experience at the temple. It is a great place to visit especially with the family members and experience a peaceful environment.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Radha Krishan Khatu Shyam mandir Trust",
      "rating": 4.9,
      "address": "near ram bagh ground, 9QJC+7Q6, Old Town, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "Khatushyam ji Temple,Ambala.Beautiful visiting experience and always crowded.Parking place available here.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Jai Shri Shyam\nPlaced will be loved by all.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice temple in ambala city near ambika mandir",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This temple is situated near jagadhri gate wonderful and piece full place\nKhatu sham aarti will start at 7:30 pm .",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "The temple has very beautiful sculptures of shayam baba and many lords like Lakshmi Narayan. It's a clean and peaceful place.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Shri Ambika Devi Mandir Ambala",
      "rating": 4.6,
      "address": "Kumhar Mohalla Rd, Old Town, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "Must visit\nThe oldest temple of Ambala",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is one of the ancient Temples devoted to Goddess Durga in Ambala City. Words are short to describe the magnificence.  Truly one can find solace here. We can also have Darshana of Lord  Hanuman ji , Maa संतोषी ji, शिव Parivar, Shani Dev ji, Mata Madaan वाली, Sheetla Maata here. It is Truly a blessing over coming here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A place where you find peace. Maa Ambika Devi temple which is famous on name Maa Amba. Location is easy approachable near Old Civil Hospital.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A place you can go whenever you are either feeling happy or distressed. Just give a haazari  to maa and she will hear all your prayers. Jai Mata Di.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This Ambika devi Mandir is the oldest Temple situated in the Ambala city.\nwhen ever you are searching for #Hindu #Temple specially old one, you cant ignore this temple.\nhere i have visited this temple on the eve of #Navratri Found lots of #Peace here post darshana you will also feel the same, if you believe in devi so have faith and surrender your self to the devi.\nthis is oldest Ambey bhawani temple on which the city name had been kept #Ambala.\nthis temple has got multiple entry gate\none parikrama (circular path for worahip) inside the temple.\nwherein bhandara and prasad distribution is going during navratra even hot milk had also been served as prasadam..\nThis temple already has got drinking water and wash room available for the worshipers.\nJai Mata Di.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "INCO CHOWK",
      "rating": 4.1,
      "address": "9Q7R+P32, Model Town Rd, Model Town, Ambala, Haryana 133006, India",
      "reviews": [
        {
          "text": "Reliance Mart , zudio , and many more are there",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "No traffic management",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very busy",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very much water logging",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Neelkanth Mandir",
      "rating": 4.7,
      "address": "9QGG+2Q2, Sector 7, Ambala, Haryana 133001, India",
      "reviews": [
        {
          "text": "Excellent. Sufficient space/ area. Neat & clean. Good ramps are also there for the old ones.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "All is at ur own....",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "VERY NICE AND CLEAN PLACE. YOU WILL FEEL GOOD TO BE HERE. I FEEL VERY ENERGETIC WHENEVER I GO IN THIS TEMPLE AND SIT SILENTLY IN FRONT OF LORD SHIVA. THE TEMPLE IS LOCATED IN THE HEART OF THE CITY AND EASILY APPROACHABLE. YOU WILL FIND LOT OF GREAT OTHER THINGS TO DO HERE AT THIS PLACE. THERE IS A PARK NEARBY. A LOT OF PEOPLE DO THEIR MORNING OR EVENING WALK HERE.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple is owsem and everyone who want to prey to God they will came here anytime the temple was open till 5am to 10 pm in the night and there is also a hall to organise any public creativity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Biggest temple of sec-7 ambala city. Management is always ready to serve society in tough situations. Jai Shree Ram",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Prem Mandir",
      "rating": 4.5,
      "address": "9QH9+WRM, Old Town, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "This place WOW full of Blessings called Prem Mandir(TEMPLE FOR LOVE). I came here first time in 2003 to drop my Friend mother for Guru Purnima( Full Moon night) now more then 13 years every time I come to India I can not go back without visiting the holly temple it's not because God Statues are here as an Hindu ritual. it's because people who look after this temple has dedicated whole there life and check this no men do any thing here only Women's run and Manage this place. They have given there whole life for this, more then 100K people visit every year. I don't only get peace & spiritual  experience here but also when ever I came here they make sure you don't go without having Parshad ( Holly Food). It's really touch my heart! 🙏🌺🕉🌺🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "firstly i came here with my grandmother in childhood. Since then when i have a time I always visit here for inner peace n blessings. Very beautiful temple to bring ur children here as it is reconstructed. There is huge hall in  middle of the temple where satsang/kathaamrit performed. Lots of people  visit here who have a faith n trust. Jai shree harmilap. Jai gurudev. Jai shree ram.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is our guru's mandir/ashram. They offer self made food to every visitor. They love and treat everyone like family. It is very peaceful and subtle besides being a beautiful temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is very beautiful temple in vrindavan which is living place of Shree Krishna & Radha whose show, the true love with people and the whole universe. This temple is structured by chaitanya mahaparbhu.\nSo I say with my loving heart\nRADHEY RADHEY....🤗😊\nJai Shree vrindavan dham",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is great place for worship. You come here and enjoy peace.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Krishna Kripa Gita Temple, Sector 8, Ambala",
      "rating": 4.6,
      "address": "9Q8C+7CJ, Sector 8, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "This is my First Experience, I feel very lucky to get the chance to darshan of Lord Krishana and Lord Shri Radha.\n\nA very beautiful temple in Ambala City.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Famous temple of Radha Kishan ji in Sec-8. There are 2-Big Halls which used for Last Prayer Meet and other family functions.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Religious place. Peaceful environment. Management of the Mandir is requested to get the Washroom cleaned before any function/event is being organised to avoid the inconvenience to the public.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Washroom not maintained",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mandir hall is good but little bit parking problem outside the temple",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Haryana Swarn Dwaar",
      "rating": 4.5,
      "address": "9Q9X+GCF, Sena Nagar, Dholkot, Ambala Cantt, Haryana 133001, India",
      "reviews": [
        {
          "text": "Beautiful place.\nThe gate or dwar is in bow shape.\nI was there during my Shimla Sarahan Ride SEP-2023.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "When you enter In Haryana state from Punjab side This Dhanush is Like Gateway of Haryana ! Land of Mahabharata",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "the entry gate of haryana state... d swarn dwar - golden gate,  a kind of midway munchies and entertainment",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Pride of every Haryanvi symbolise through Gitagyan and Maharashtra",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Haryana Government has made this Golden Gate as an entry gate into Haryana (Ambala) as Ambala connects Delhi, Rajasthan, Uttrakhand, Himachal, Uttar Pradesh and Punjab. The Gate resembles A Bow (Dhanush) and below are standing two lions embarking Make in India. It's one of it's kind in India. Jaggi City Centre is located just few metres from it where one can shop from various factory outlets and eat from no. of different restaurants.\nPS: please take left for Chandigarh, Shimla, Dehradun, stay right for Amritsar, Jammu, Manali.\nThis is a serious note to be taken by authorities as people coming from other states get confused here which road to take, please make a big signboard atleast 1kms behind this junction.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shagun palace",
      "rating": 3.7,
      "address": "near Tulsi school, Patel Nagar, Ambala, Haryana 134003, India",
      "reviews": [
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Video",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Kali Mata Mandir",
      "rating": 4.6,
      "address": "151, Ghel Rd, Hira Nagar, Ghel, Ambala, Haryana 133006, India",
      "reviews": [
        {
          "text": "It is one of the oldest Goddess kaali temple in Ambala city.\nThis temple usually crowded on Saturday and Navratri days.\nIt is the only temple which is situated in middle of a pond(but due to negligence there is no water in the pond and it's not clean nowadays).But when there is water in the pond this temple looks amazing.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best mandir ever visited and the aarti omg my god was the best ever and the bhajans were soo good I had goose bumps at the time of aarti",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Oldest temple situated in beautiful water pond",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Great place ..related with Hinduism...it is thought that maa kaali complete the wishes of people here if they come in row for 5 Saturdays.. peaceful and lovely place ..😊",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jai mata di very clean & beautiful mandir",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}