{
  "places_with_reviews": [
    {
      "name": "Sree Krishna Swamy Temple, Ambalapuzha",
      "rating": 4.8,
      "address": "SH 12, Ambalapuzha, Kerala 688561, India",
      "reviews": [
        {
          "text": "Good Krishna temple. Big premises. When we have visited not much rush. At 12 pm we witnessed nevedyam Pooja. Inside temple beautiful paintings on lord Krishnas important life events. Good shopping opportunity while entering the temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I really loved this place, which provides a calm and peaceful atmosphere.\nYou can see Krishna peacefully, and 'chandanm charth' will give you a mind-blowing experience.\nMoreover, if you love palpayasam, then you will get the most famous ambalapuzha pal payasam here, for which booking starts from 11 am. If you are really lucky, then you will get the token. Payasam will be ready by 1 PM, and you can collect it by giving your booking slip. It is properly packed, but if you want, you can bring your own vessel to collect.\n\nEarly booking is available at a separate counter. If you book there, there will be a waiting period of one week.\nNb: no online booking available",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most famous and most important temples in Kerala because of Ambalapuzha Srikrishna Temple is directly connected to Guruvayoor Sree Krishna Temple , During the invasion of Tipu Sultan in 1789, the idol of Sri Krishna in Guruvayoor Temple was carried to Ambalappuzha Temple for safe custody. The idol was seated on the south nada at Ambalapuzha. That location is now known as Guruvayoor Nada . The payasam served at the temple is of immense importance to the devotees and it is believed that Guruvayoor himself visits here to have the payasam, Distribution of the palpayasam is on a first-come-first-served basis from the prasadam delivery counter. The belief is that Sree Guruvayoor Appan visits the temple every day at noon for the palpayasam.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Well ambience.. peaceful and calm surrounding to flow with the blessings of lord Krishna 🙏🏻\nUnniyappum is soo tasty..and it will be good if we get paalpayasam earlier😻",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the famous temple in kerala. Famous for Ambalappuzha palppayasam(a dessert offering), Ambalappuzha Vela. So peaceful atmosphere inside of temple is full of murals we can see dashavatar on exterior wall of sanctum santorum. We can also see musical instrument called mizhavu used by legend Kunjan Nambiyar.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ambalappuzha Temple Bus Stop",
      "rating": 4.3,
      "address": "99M8+9J4, SH 12, Ambalapuzha, Kerala 688561, India",
      "reviews": [
        {
          "text": "Nice atmosphere. From the pond sude it gives an amazing picture of the temple. Not much crowded in the weekdays.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Better experience. The temple will close at 1 pm them open at 5pm.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful place with a beautiful pond",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Ambalappuzha Temple is a cultural gem in Kerala, dedicated to Lord Krishna. Its annual festival, \"Ambalappuzha Palpayasam,\" is famous for sweet rice offerings. With intricate wood carvings and vibrant murals, the temple is a blend of architectural beauty and religious significance. To find it on Google Maps, search \"Ambalappuzha Temple, Kerala\" for precise location details.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "✨",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Purakkad Muslim Juma Masjid",
      "rating": 4.6,
      "address": "9947+5XJ, Purakkad, Kerala 688561, India",
      "reviews": [
        {
          "text": "Purakkad was known as Burkkare in ancient time. Foreign traders used to stay in the place and bought local produces like black pepper. =History== The literal meaning of Purakkad is \"out of forest\".[1] The village of Purakkad was the scene of battles between Travancore and Kochin forces in 1754 AD and between Travancore and Zamorinforces in 1756 AD. There was an ancient port at Purakkad. The Dutch East India Company had a factory at that time. A crucifix was presented by Dutch seafarers who landed on Purakkad beach when their ship was lost at sea in a terrible storm. The crucifix has never been repaired since all these years. Now the church housing the crucifix faces demolition threat because of road widening plans",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The best thing is having a good parking space in front. It was good for long distance travelers to park and have prayers...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ideally located on national highway 66 ,ample parking. Nice place for travellers to offer prayers . It's simple but beautiful mosque.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Here you can see the qabar of a great Islamic scholar from Yemen. Many people find solutions to many problems from here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good ambiance... Positive vibes... It is located in the highway",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Payalkulangara Sree Devi Temple",
      "rating": 4.7,
      "address": "NH 66, Komana, Ambalapuzha, Kerala 688561, India",
      "reviews": [
        {
          "text": "Payalkulangara Temple West is a small Village/hamlet in Ambalappuzha Block in Alappuzha District of Kerala State, India. It comes under Ambalapuzha north Panchayath. It belongs to South Kerala Division . It is located 16 KM towards South from District head quarters Alappuzha. 3 KM from Ambalappuzha. 138 KM from State capital Thiruvananthapuram\n\nPayalkulangara Temple West Pin code is 688561 and postal head office is Ambalapuzha .\n\nAmbalappuzha(south) ( 1 KM ) , Purakkad ( 3 KM ) , Punnapra (north) ( 6 KM ) , Thakazhi ( 6 KM ) , Nedumudi ( 7 KM ) are the nearby Villages to Payalkulangara Temple West. Payalkulangara Temple West is surrounded by Champakulam Block towards North , Harippad Block towards South , Veliyanad Block towards East , Alappuzha Block towards North .\n\nAlappuzha , Changanassery , Chengannur , Thiruvalla are the near by Cities to Payalkulangara Temple West.\n\nThis Place is in the border of the Alappuzha District and Pathanamthitta District. Pathanamthitta District Pulikeezhu is East towards this place . It is near to arabian sea. There is a chance of humidity in the weather.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Payalkulangara Sreedevi temple is very old one from the Chembakassery dynasty. It is believed that the idol of the goddest seen flotting on the moss, fisher man took idol and bought it to the land and installed, the name of the land became payalkulangara.The festival being celebrated in the month of  february or march.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sweet silent temple. Feels really good when visit and pray",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It located at Ambalppuzha, near Alapuzha. Holly place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I am living near to that temple...",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Erattakkulangara Sri Mahadeva Temple",
      "rating": 4.6,
      "address": "99P3+VQ7, NH 47, Ambalapuzha, Kakkazham, Kerala 688561, India",
      "reviews": [
        {
          "text": "Erattkkulangara Temple  Is a famous\nSiva Temple  standing  more   eight 8⃣  hundred  years\nKiraatham Aattakkatha  was written by  Erattkkulangara Warrier in  front of The  Idol Lord Siva  here\nOpposite  to  the  temple  there is anancient  mosque  The  Vankuvili\nat mosque  and  Aarathi at this  templeis is simultaneously done\nA typical  example  of religious\nharmony",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My favourite god is mahadev so i like this place very much and i am feeling very peaceful at this temple🙏🏻",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is situated in a clean, calm and peaceful neighbourhood in Cochin. The temple has an adjoining pond and auditorium where marriage functions and meetings take place. The temple and its surroundings are well maintained. A great place for devotess.temple having west face with pond, and three poojas are performed in daily. The temple situated half kilometer north from Ambalapuzha junction in Erattakulangara.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the ancient Mahadeva temples in Alappuzha situated in Erattakulangara near Ambalapuzha is on the side of NH 66. The temple is facing west towards the royal path of `Arattu' of Sree Krishna Swamy  Temple, Ambalapuzha which  starts from here. The temple is dedicated to Lord Siva with upadevathas and sub shrines.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Calming environment . We will get a peace of mind while sitting in the temple. There is a pond in the temple. One of the ancient Mahadeva",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Karumady Jn",
      "rating": 4.4,
      "address": "99JQ+V2Q, Karumadi, Kerala 688562, India",
      "reviews": [
        {
          "text": "Exploring the serene beauty of Karumady and its iconic Buddha statue was truly soul-soothing. Surrounded by tranquility, it offered a peaceful escape from the hustle and bustle of everyday life. A perfect spot for quiet contemplation and connecting with nature's serenity.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Karumadikuttan is a famous Buddha statue in the village of Karumadi in Ambalapuzha taluk of Alappuzha district in Kerala.  This small village is known by the name of this Buddhist statue.  and rice.  Other crops also make this village beautiful",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a good place to visit for getting peace.not much crowded",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Village beauty",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful location..to enjoy Morning and evening time",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Thakazhi Smrithy Mandapam",
      "rating": 4.3,
      "address": "Ambalapuzha, 9CF4+PR8, SH 12, Thakazhi, Kerala 688562, India",
      "reviews": [
        {
          "text": "A memorial made for The famous story writer Shri Thakazhi Shivasankara Pillai.The museum cum house is located on the road side to Ambalapuzha.Visit time starts from 9:30 AM to 4:00 PM.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good place. There kept all the momentos and award shields won by Thakazhi sivasankarappilla.. The last used shirts and Dhotis were kept as such.. Jnanapeeda puraskaram shield is one of the major attraction. Statue of Thakazhi is another attraction.. Thakazhi's home is now kept as smrithi mandapam...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's the house of Thakazhi sivasankara pilla, known as Thakazhi, close to railway cross Thakazhi. A small house .\n\nYou can see awards, include njanappedam , padama Vibhushan and his chain, bed accessories etc there . Some of his books displayed there. No sale ! Just 10 minutes required to complete the visit",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Thakazhi Sivasankara Pillai (17 April 1912 – 10 April 1999)was an Indian novelist and short story writer in the Malayalam language. He is popularly known as Thakazhi, after his place of birth. He wrote several novels and over 600 short stories. His most famous works are Kayar  (Coir, 1978) and Chemmeen.\n\nThe Thakazhi Memorial Museum functions at the Sankara Mangalam house of the legendary litterateur Thakazhi Shivasankara Pillai, to perpetuate the memory.  The Government of Kerala took over Shankaramangalam in 2000 and converted it into a museum in 2001.\na museum is arranged in the four rooms in the Northern part of Sankara Mangalam. Articles used by the writer like his pen, spectacles and clothes are preserved in the museum. Besides, the museum showcases the awards, prizes and certificates won by the writer. It is the only museum in India where the Jnanpith Award, the highest honour and award of India, is exhibited.\n\nThe museum is maintained by the Department of Archaeology, Kerala is open to the public from 09.30 - 04.00pm. Lunch time 01.00 pm to 02.00 pm. The museum will be closed on Mondays.\n\nBehind the museum, one can also see Thakazhi’s Memorabile and there is a full figure bronze statue of the great writer.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Thakazhi Museum and Smritimandapam is a museum-cum-memorial hall dedicated to the memory of the late Thakazhi Sivasankaran Pillai . Known by his pen name thakazhi. the famous Malayalam writer who won the Jnanpeeth award in 1984. His writings include 35 novels and 600 short stories. all of these things were happened here at his house , the place is a living monument to his memoies. It is located  around 20 to 22 km from Alappuzha town.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "St. Nicholas Syro Malabar Church Karumadi",
      "rating": 4.1,
      "address": "99PP+MQP, Kerala 688005, India",
      "reviews": [
        {
          "text": "Syro-Malabar Church. Accessable by road.Has schools attached, including English medium. Quiet and serene ambience",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Good admosphre it's a Christian pilgrimage centre",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Nice church with real good peaceful atmosphere",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Very nice old Church on the shore a small waterway in Kuttanadu...The access roads could be more wide but what to do one side is a waterway...So the convenience being, it's accessible by a boat also ..And in the olden days I believe that was the way everybody came to  the St.Nicholas Church. And of course the name ...It's Santa Claus's Church in the middle of Kuttanadu....It was a very memorable experience for me and I believe it would also be for you too.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Big old parish church.approach road is narrow, tarred and good.a small tributary of takazhy river flowing to the front alongside the road.really beautiful...church also has big parish hall...an LpUp school is also run under the church in the same compound",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Kakkazhom Muslim Juma Masjid",
      "rating": 4.6,
      "address": "99Q3+H62, NH 66, Ambalapuzha, Kerala 688561, India",
      "reviews": [
        {
          "text": "This mosque is believed to have been constructed around 500 years ago.It is named after the famous sufi \tmaster,Muhiyuddin Abd al-Qadir al-Gilani(1077–1166 CE).The timber needeed for the construction of the initial structure was brought by pattamar(Indian cabotage vessel) and offloaded at the shore.They were carried to the site of construction by members of the Dheevara(Hindu fishing caste)community.During Rabi al-akhir,the mosque conducts a week long remembrance festival of Sheikh Muhiyuddin.The rope needed for hoisting the festival flag-denoting the start of the Chandanakkudam festival,is given by the Dheevara(Pallikavi)family who assisted in the construction of this mosque.The community feast conducted during this festival is attended by members of all communities.Here also, the food is first served to the members of the Pallikavi family.During the month of Ramadan,the special gruel (Marunnu kanji) prepared for fast breaking is distributed to all- irrespective of their religion. Till about 60 years, offerings known as 'Anchekalum koppum'(5.25 Edangazhi(7 Kg) Rice, provisions, money, oil, sambrani, sandalwood)were made from the nearby Ambalappuzha Sri Krishnaswami temple towards this mosque. A Neettu from the Travancore Maharaja dated 1-11-1027 M. E.(16 June 1852) pertaining to the Kakkalam (Kakkazham)mosque is still preserved in the Government records",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the old mosques on Kerala. It is said that the inner mosque was built by jinn as per some old folks(citations required). It is located near to Ambalapuzha Railway Over Bridge with ample parking space and facility for the travelling women to read their prayer. Halal hotels are available near to the mosque. Very apt for jumua prayer for the NH66 commuters.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is the only mosque in kerala where the sufi, muhiyyudin thangal came and went back to Persia. Not like other sufis who were buried here in the soil of kerala",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Muhiyudheen Juma Masjid (Malayalam:കാക്കാഴം മുഹ്‌യുദ്ധീൻ ജുമാ മസ്ജിദ്) is a mosque in Kakkazhom, Ambalapuzha Taluk, Alappuzha District in the Indian state of Kerala.\nImportant festival - Chandanakudam of  Kakkazhom Juma Masjid",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ancient masjid. And symbol of Religious friendship ❣️❣️",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ejaba Juma Masjid",
      "rating": 4.6,
      "address": "C932+3C5, NH 66, Neerkunnam, Vandanam, Kerala 688005, India",
      "reviews": [
        {
          "text": "A beautifully crafted Musjid with amazing architecture along the NH66.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good and well maintained. Ladies place kept in wondering condition",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The mosque is located on the road side and has a separate prayer area for women",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Worst leaders handle in the mosque,  but people is very good....\n\nHere applying purely business... There leaders spread fully negatives\n\ni am saying again worst leaders in this mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sunni Juma Masjid just besides salem-kanyakumari National Highway. Prayer room available for women. Higher Secondary madrassa attached to masjid. A convention hall available for marriage functions. Parking facility available for few vehicles.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}