{
  "places_with_reviews": [
    {
      "name": "Om Shakthi Temple",
      "rating": 4.4,
      "address": "Melmaruvathur, Tamil Nadu 603319, India",
      "reviews": [
        {
          "text": "Most famous temple in Chennai trichy highway control of Bangaru Adigalar Mostly devotees are from Karnataka to worship Lord Aathi Para sakthi amma. Recently Irumudi season go live so only people who fasting for 48 days are allowed to see the lord closer. Spiritual place. Those who have faith in GOD from any religion can worship here. Daity is Annai Adhiparasakthi. Ladies are allowed inside Sanctum Santorum to perform poojas. Ladies are allowed even during mensus period.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very sacred temple and blessed place for prayers and who celebrates -sri matha Ji ji as godess",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "such a divine place. Luckily we didnt get any rush but season its full I heard. Only ladies managed place and even police station near by is fully managed by ladies.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I am visiting this temple since my childhood,  siddhar peedam Arulmigu Adiparasakthi Amma, people who come over with problems in there life gets receded over a period of time. Bangaru adigalar also devotes call him as Amma who is the main Guru for this temple. It’s on the main highway and you would never miss this temple. Would recommend if your travelling towards down south to visit this temple and go 🙏🏼😊",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Everywhere advertisement of the man! More than the god, his picture was everywhere. That was disappointing for me.\n\nRestroom facility can get improved.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "melmaruvathur temple",
      "rating": 4.4,
      "address": "CRGH+PX5, Melmaruvathur, Tamil Nadu 603319, India",
      "reviews": [
        {
          "text": "Ohm Shakti godess matha very blessed and powerful for devotees",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "We visit this temple every year since 2017.\nThe temple was good. But temple volunteers inside the campus are behaving very rudely.\nEvery year we face this issue and the experience was very bad.\nThis year too (two days back), a lady scolded and treated us badly and we left the temple with so much of anger and pain.\nThe management should look into this issue and warn the temple volunteers to behave politely to the public.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Powerfull god but big looters all over the place.  Very commercial without any basic amenitiea...  Dirty place all over the areas.  Temple staffs act like baffons and minting money like anything.  Mad crowd.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Come here to spend your money for the local businessmen. They simply sit and earn money, but middle class families are spending money like water.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's very nice temple and then people's most of them come",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Mazhai Madha Shrine",
      "rating": 4.7,
      "address": "Mazhai Malai Madha Arulthalam, CR56+R2Q, Kancheepuram District, South India, Acharapakkam, Tamil Nadu 603301, India",
      "reviews": [
        {
          "text": "It is a well-known site of worship. From the Acharapakkam bus stop, it's a short walk to the mountain's base. Shrine is situated in the bottom of the Malai. It's a crowded are during festivals and weekends. From here you can climb the steps to reach the top. On the top  a wonderful statue of Jesus is there. The view from the top is spectacular. There are many shops here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Mother Mary, also known as the Virgin Mary, holds a central role in Christianity, particularly in Catholicism and Eastern Orthodoxy. According to Christian tradition, Mary was the mother of Jesus Christ, conceived through the Holy Spirit, making her a central figure in the nativity story. She is revered for her purity, humility, and unwavering faith. Mary is often depicted in art and literature as a symbol of maternal love, compassion, and devotion. Throughout history, she has been the subject of countless prayers, hymns, and devotions, and is considered a powerful intercessor for believers. Mary's significance extends beyond her role as Jesus' mother; she is also venerated as a model of faith and obedience for Christians around the world.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a very pious and religious place to visit. This Church is 100 Km away from Chennai and we can reach there by hopping on a bus to Thindivanam. There is a church in the bottom of the hill where all the prayer services are carried out. There are steps to reach the hill top where the seperate small church there, which is the famous one. Most of the people who comes to visit this Church for some request, need to walk to the top of the hill to pray in the small church in the top. There is also a huge Jesus statue with the cross in the top of the hill, which is a huge attraction. Also the view from the top is breathtaking.\n\nIt is advisable to take care for the elder ones because it will be a little hectic to reach the top and also the terrain is still rough in the top, so the elderly will face problems when walking on top and reach the church there. The steps to reach the top is also very high. So please take care.\n\nThis place have good parking facilities and also have shops nearby. So everything is available for a pious family trip here. Please do come and visit and get the blessings from Mazhai Malai Madha!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful church it will take some 2 to 3 hours to see all places specially on top of the mountain car parking available Church opening time 9 am",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "People are not properly using the night prayer all are \"sleeping\" & Using mobiles only,  audio is not clear, Father's can avoid cine songs in night prayer.... Better can avoid this type of prayers..... Not feeling like prayer night.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sri Aatcheeswarar temple",
      "rating": 4.7,
      "address": "Atcheeswarar Temple, Temple Street, Ravathanallur, Acharapakkam, Tamil Nadu 603301, India",
      "reviews": [
        {
          "text": "A Padal Petra Sthalm\n\nThis temple have two main Shivaling and two sananthi. Here devi also two.\nBehind main Shiva temple the other mai Shiva have Nandhi in different manner.\n\nWhoever goes to this temple, ask the Priest the Sthala Puran.\n\nNear to main gate of this temple, one Ganapati temple also there. This Ganapati broke the Acchu (wheel of Ratham), when Shiva go against Tripura samkara.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "An old Shiva Temple surrounded by beautiful garden. Loved the calamity and peacefulness!! Must visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Neatly Maintained & one of the ancient temple. It's very neat to GST, hence have a visit when you go that side next time",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very Old Shiva temple and a must visit. The priest Babu gave a detailed explanation of the temple history and did a good Pooja.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The only 2 sivalingam temple I have ever seen. The lord Ganesha breaks chariot wheel bearing because lord Shiva his father didn't said to him while lord Shiva going to war and said to be chariot breakdown then lord Shiva said to Ganesha and then chariot repaired to fight with against evil one. So this place having 2 Siva lingams. Acharapakkam name arrived from Achu eru pakkam 2 sided bearing wheel one of the oldest temple also try to see this temple and mountain Siva temple too...",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Arulmigu Perumber Kandigai Murugan Temple",
      "rating": 4.4,
      "address": "9QHM+R58, Acharapakkam, Perumbairkandigai, Tamil Nadu 603201, India",
      "reviews": [
        {
          "text": "Very very ancient (5200 years) temple on a small hill near Acharapakkam.\n\nAround this area about 30 temple are here. As per Newspaper report many temples is not known well and not maintained also.\n\nIn this area Ellaimmen is so famous because of this temple is many family Kuladeivam. Here two old Shiva temple also there. But it's condition is so ... . This temple have no devotees and temple is very pathetic condition.\n\nHowever this Murugan temple is so famous because of a Yanta is worshipped here. Many people worship this Yantara (Shatru samkara) to get relief from their problems.\n\nTemple is opened in morning for few minutes only. Before going confirm with Temple Preist to open this temple.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Temple timing showed as open up to 6 pm. But we found it closed at 11.30 am. No one was there to respond.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a very old temple situated on a small hill. The place is incredibly peaceful, with a nice atmosphere.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Temple is open every morning from 7 am to 10 am. Temple opens in the evening only on Auspicious days. So try to worship this place in the morning.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This temple is located on a hilltop near Acharapakkam, this temple can be accessed via steps or through any vehicle via road also.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Adhiparasakthi Advervana Bathrakali Temple",
      "rating": 4.5,
      "address": "CRJJ+CMJ, Melmaruvathur, Tamil Nadu 603309, India",
      "reviews": [
        {
          "text": "It's very beautiful temple and then people's most of them come",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place and powerful god temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Prayer the god for what you need...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "🇮🇳",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Melvaruthur Temple Waiting Shed",
      "rating": 4,
      "address": "CRMJ+2H2, Melmaruvathur, Tamil Nadu 603319, India",
      "reviews": [
        {
          "text": "Have a good experience in normal day. Dharisanam is very tough when special days like Amaavaachai, Pournami etc..",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Parking for car 50 rupees",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Pious temple for worship of maruvathur amman",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Not ambient and unhygenic toilets",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Live",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "C.S.I St. Paul's Church - Acharapakkam",
      "rating": 4.9,
      "address": "12, 1st street, Periyar Nagar, Acharapakkam, Tamil Nadu 603301, India",
      "reviews": [
        {
          "text": "Good worship",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Graceful",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Melmaruvathur adhiparasakthi valipadu mandram-KP-67 மேல்மருவத்தூர் ஆதிபாராசக்தி வழிபாடு மன்றம்",
      "rating": 3.7,
      "address": "Gandhi Nagar, NH 32, Acharapakkam, Tamil Nadu 603301, India",
      "reviews": [
        {
          "text": "Best place and nearly there were temples of ayyappan and hanuman , sivan temple\npower full om sakthi amman mandram",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Nadupalanimalarnilayam.",
      "rating": 4.7,
      "address": "CR38+C73, Periyar Nagar, Looproad, Acharapakkam, Tamil Nadu 603301, India",
      "reviews": [
        {
          "text": "The Lord Murugan looks like Similiar to Malayasia Batu Caves.\nMalayasian Batu caves Murugan height is 140 feet.\nNadu Palani height is 40ft",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's almost same as pazhani temple but hear the special is maragatham moolavar silai",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place to visit",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Old temple",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}