{
  "places_with_reviews": [
    {
      "name": "Mahamaya Temple",
      "rating": 4.6,
      "address": "4687+VW3, near Mahamaya mandir, Bhagawan Pur, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Mahamaya temple is located on Ambikapur city Chattisgarh… the temple is very famous and popular…\n\nThis is my 9 time visit in this temple I feel very peaceful and spent some good times in this temple … maa Mahamaya is very powerful so people come and take blessings from maa Mahamaya\nSome key factors about this temple……\n\n1- temple is located on middle of the city ( AMBIKAPUR)\n2- temple is very neet and clean\n3 - Mahamaya temple campus is very big and beautiful\nNOTE- if u visit Mahamaya temple after that plzz go samlaya temple is almost 1 km to Mahamaya temple 🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mahamaya Temple is a serene oasis in the heart of the city. A peaceful haven offering tranquility and solace. Visiting this temple provides a sense of inner peace and spirituality amidst the city's hustle. A must-visit for those seeking a moment of calm and reflection.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The place which made Ambikapur famous. The temple is famous for Goddess Mahamaya Devi.\nIt's open from morning 5 am to evening 8 pm.\n\n(⭐out of 5)\nCleanliness- ⭐ ⭐ ⭐ ⭐\nPlace-⭐ ⭐ ⭐ ⭐\nRecommended-⭐ ⭐ ⭐ ⭐ ⭐\nFood Availability-  No\n\nSo, you can visit this place with your family or friends.\nThe photography is not allowed inside. So you can click all photos from outside.\n\nPrasads are available outside the temple, as there are few shops for that.\nAlso, parkings are available but mostly prefer 2-wheeler to visit there.\nThe temple is made so beautiful & amazing.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mahamaya temple is situated in Ambika pur near about 2 kms from bus stand. This temple is made by maharaja sarguja Raghunathsharan . This is called mahamaya temple in the name of goddess ambika and this place Ambikapur is also called in the name of goddess ambika. This temple is very old and it is the time of kalchuri kal .This was built in between 1879 to 1917 in Nagar shaili .It’s shape is just like a mandap pattern. When we visit this  holy temple we feel very internal peace in mind.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very powerful place. The audacity of the temple is unparalleled.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hanuman Mandir ️ joda pipal chowk",
      "rating": 4.6,
      "address": "45HR+5VC, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "The temple is meticulously maintained, reflecting the reverence with which devotees regard it. The marble floors gleam, and the fragrance of incense lingers in the air. It’s a place where you can connect with the divine without distractions....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Compect place, rush area, Hanuman and shiv temple both are stablish in side.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beutiful palace",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ghadi Chowk, Ambikapur (घड़ी चौक अम्बिकापुर)",
      "rating": 4.4,
      "address": "45HQ+2J5, Ghadi Chowk, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Best pre owned car dealership in chhattisgarh",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Be tq you",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Food",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Maharana Pratap Chowk",
      "rating": 4.3,
      "address": "45PX+Q5F, Shivdhari Colony, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Building construction",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good 😊",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful statue of Maharana ji , beautiful place to visit located near Marine Drive makes it more attractive 🤩😍",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "❤️👍",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "So beautiful picture and plece",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Bada Hanuman Mandir School Road Ambikapur Surguja Chhattisgarh",
      "rating": 4.6,
      "address": "46G2+X38, near Government Multipurpose Higher Secondary School, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Oldest Hanuman ji mandir in Ambikapur. Peaceful place in the centre of the city. Old place but situated in good place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Hanuman mandir in good palace Mandir",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Close temple after 12 o'clock pm.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good tampal well management Jay Shri Ram",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "very Nice Place Jai Shree Ram🙏Temple of Hanumanji🙏🐒🧡❤️👌✌️",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Banaras rod ambikapur",
      "rating": "Unknown",
      "address": "Subhash Nagar bhagwanpur, paranaw bhawan, samudayak bhawan, Ambikapur, Chhattisgarh 497001, India",
      "reviews": []
    },
    {
      "name": "Shri Ram Mandir",
      "rating": 4.5,
      "address": "459V+9V7, Ram Mandir Rd, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Jai shree Ram🙏🏻❤️ good place..good  vibes  here 🙏🏻",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful temple... And nice people",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very peaceful place for devotees",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice temple..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice Temple of Lord Ram\nDharmshala provides minimum price residential facility.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shree Shyam Temple",
      "rating": 4.4,
      "address": "shree shyam Temple, near ambedkar chowk, Ambikavani, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Very nice 👍",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice temple. Beautifully crafted and soothing atmosphere.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Religious place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jai Shri Krishna",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very peaceful area",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Maharaja Palace (Raghunath Palace), Ambikapur, Surguja",
      "rating": 4.3,
      "address": "458V+CRJ, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Locally known as Raghunath Palace, it is the palace of royal dynasty of Ambikapur. The palace still stands on its firm ground due to its marvellous architectural design. The palace has rich historical importance in Chhattisgarh context. One must visit this place when in Ambikapur. The palace also has hotel attached which is owned by the his majesty the king himself- Shri T.S. Singh Deo.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Surguja Palace named Raghunath Palace is one of the palaces of India which have rich history and a great legacy behind them to explore and be informed about.\nWith a unique architecture it attracts and radiates it's glory of past ages. It has a very rich museum which is full of historical artifacts.\nDussehra (दसहरा) is still observed with much fanfare in the precincts of this magnificent Palace building. Pooja (पूजा) for the specific day is observed by the present Maharaja Shri Tribhuvaneshwar Saran Singh Deo, popularly called as T.S.Baba by the masses.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Maharaja Palace is the historical palace of Ambikapur, the history of the princely state of surguja has been very glorious.  What makes this history even richer is the Raghunath Palace, the palace here.  This palace has seen the golden period of the princely state of Surguja.  Whose testimony gives its rate and wall.  But with time, this palace has now become a palace to cherish the old memories. This palace was built long before 1895.  But in 1895, facing north, it was given a complete shape and this palace was named Raghunath Palace after the then Maharaja of Surguja, Raghunath Sharan Singhdeo.  This palace holds thousands of memories.  With the passing time, the palace has also become old.  The walls are cracked but it's amazing nonetheless.  A wonderful heritage can be felt on seeing it. The credit of making this palace and the best decoration in it goes to Maharani Vijayeshwari.  Maharani Vijeshwari was from the Nepal royal family.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice place , ancient Royal palace",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's incredible to visit the place .\nPrefer visiting their on dashara eve so that the King Shri T.S. Singh Deo presence can be expected.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "रानी सती मंदिर",
      "rating": 4.6,
      "address": "497001, Ambikavani, Ambikapur, Chhattisgarh 497001, India",
      "reviews": [
        {
          "text": "Dadi Rani Sati Temple Ambikapur,\nThe temple is a symbol of history of Rajasthan where there was a lady known as Narayani Devi (Dadi Rani Sati) who committed Sati on her husband's death with some more lady who lost her husband in a war,\nThe story was between the 13th to the 17th century.\nThere are many temples in Northwest India but one is very famous for Dadi Rani Sati temple was in Jhunjhunu Rajasthan.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Hindu 'Devi' (देवी) temple, added in recent year. Impressive look with spacious interior.\n[Note: We in India adopt dual standards, as we have not allowed to get bill passed in Parliament for promised 33% representation for women yet. Instances from ‘Mahabharat’ (महाभारत), and recent happenings prove that we have regarded this 50% population as ‘object’ (वस्तु). We have glorified her for forced barbarian ritual of yesterdays as ‘Sati’ (सती) over the years and living still in same mental set up.\nWe are the people of a land of contrast & contradictions. One can find 'time warp'. Many different centuries exist at the same time in this land of extremes.]",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful place 😃",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good place, it is mind soothing for people..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is out of city.but you can enjoy here",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}