{
  "places_with_reviews": [
    {
      "name": "Saiva Kshetram Thallaya Palem Temple",
      "rating": 4.6,
      "address": "GGRM+X66, Guntur, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "This is the one of the best saiva kshetram name called koti linga temple there are so many types of sivalingas and Naga Pratima and Navagraha structure and there is the one main thing there are marakata godess statues there are best thing daily done Anna santharpana i strongly recommend in our life must visit this place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The TEMPLE WAS AWESOME AND VERY DIVITIONAL AND ON EVERY STEP WE HAD TEMPLE. Religious Significance: As a Shaiva Kshetram, it holds importance for devotees of Lord Shiva.\nPleasant surroundings: The temple is situated near the Krishna River, creating a serene atmosphere.\nFree meal service: The temple offers free meals to visitors, promoting a sense of community and service.\nReligious significance: Temples serve as a central place for worship, offering a space for devotees to connect with their faith and perform rituals.\nCultural heritage: Many temples are architectural marvels, showcasing historical and artistic elements. They act as repositories of cultural heritage and traditions.\nSense of community: Temples foster a sense of belonging and community among followers of the same faith. They often provide a platform for social gatherings and celebrations.\nPeaceful haven: Temples can provide a sense of peace and tranquility due to their serene atmosphere and emphasis on spiritual reflection.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very huge area . I.e 8 acres of land allotted for saiva temple by sri siva swamiji . I visisted long back around 2008 when it was just a small temple with all the siva lingas marakatha lingam, swarna, loha ,ratna, rasa, spatika etc lingas.  Now we got to see the structured temple  with 108 ganeshas, veebadhra swamy and maha kaali statues , and nakshatra vanam, and sahasra lingas and there exists a facility to \"siva pratista\" to which  your sivalinga pratista wil b allotted number and 108 ganeshas mandir is there. And panchaloha lingas, mercury abhishekam to sivalingas, and marakatha lingam... and the gold swarna lingam is having tomb like kedarnath and the garbharakshambika amma, natarajasamethaammavari darshan etc.\n\nUrdhwa mukha and chathurmukha kotilingeswara swamy temple is completed and is open.\n\nProbably, in coming few years, the temple will be completely constructed. For now it is under construction.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited today on 6th Jan 2024 and did our baby annaprasana....\n\nIt's a very big temple and lot of construction is still going on...\n\nFelt very peaceful and devotional......",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple with many god Siva need so much time to see around the temple",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "TTD Sri Venkateswara Swami Temple , Venkatapalem, Amaravati, Guntur District, AP",
      "rating": 4.8,
      "address": "GH92+HG8 TTD Temple, Venkata Palem, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "Praise the serene atmosphere, spiritual ambiance, and architectural beauty of the lord venkateswara temple. Emphasize the cultural richness, respectful staff, and the significance of rituals. Share your personal connection and the sense of peace experienced during your visit. Om namo venkatesaya.\nTemple timings:- 6:00am to 7:45 pm (12:30 noon & 6:00 pm half an hour  break)",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "TTD was recently open this temple in guntur near Venkata palem.This temple was same as temple in tirumala .Good place to visit with family.U can enjoy the premises of temple .om namo narayana nayah🙏🏻🙏🏻",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Om Namo Venkatesaya. Temple started recently by TTD. Happy to visit the temple. Must visit if you are living in vijayawada. 🙇🏻",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "VENKATAPALEM \"VENKATESWARASWAMY TEMPLE\" management by TTD.\nTHIS IS CONSTRUCTED in 2022. It is 11 K. M distance from KANAKADURGA TEMPLE of VIJAYAWADA. Very neat and clean temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Peaceful & Beautiful 🤩 place to Visit.\n\nLooking at Venkateswara Swamy Murthi feels like you're in Tirupati",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Temple",
      "rating": 4.5,
      "address": "GGG6+RFQ, Velagapudi, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "Became main place new Amaravathi city",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Amareswara temple ghats",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jai Mata ji",
          "languageCode": "en-US",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Prathyangira Devi temple",
      "rating": 4.8,
      "address": "GGVM+263, Sri Saiva Kshetram Rd, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "Need to be more development.. peaceful atmosphere,,need improve road way",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very pleasant and peaceful atmosphere time passed like snow. Feel graceful for doings homam",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Enjoy alot",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Pleasent place",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ashta Kalabhairava temple",
      "rating": 4.7,
      "address": "GGRJ+CV4, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "This temple is also called Thantra kshetram\n\nHere Archana, Homas and special pujas  will be done for all gods at respective prices\n\nDetailed price list is provided below\n\nLord Bhairav idols are so big in size\n\nThere is nice seating space available for visitors and drinking water facility is also available\n\nIt is just beside Shiva kshetram temple in Thalaya palem",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful and Powerful temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is amazing",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Avadhutha Polaiah Swami Temple",
      "rating": 4.6,
      "address": "GH82+7RJ, Venkata Palem, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "We have the opportunity to meet Sri Avadhuta Polaiah Swami 5 years ago. He blessed us and gave us prasad for our Gurudev Paramahamsa Vishwananda",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best devotonal place great sage saint",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Today visited Avadhutha Polayya Swami gaaru with my office staff.\n\nFelt great bliss in his presence.\n\nGot dal rice as his prasad.\nWe took nothing for him as offering But one devotee gave us fruits to all of us as our prasad.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My dad believed him soo much!!! Though i am not a devotee personly...felt something at this place... Nd i was very much amused dat they provide lunch everyday for devotees!! Visited twice never got bored though we stayed there for whole day!!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lord Sai Baba in Temple & Polaiah Swamy next to it in a small room. Swamy is not in a good health now a days & one can only see him from a 6 ft distance behind a rope due to covid restrictions.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sivalayam",
      "rating": 4.3,
      "address": "GG9F+WQ2, Mandadam, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "Pleasant temple with excellent climatic conditions",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice temple at Krishna River with pushkar ghat",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice spirutual  center for Hindus...Temple authority  should  develop the things  in few areas.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very famous temple in this locality. You can get autorikshaw from vijayawada to this place.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The famous temple of Siva is especially for  rahu kethu puja",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Vinakayakuni gudi",
      "rating": 3,
      "address": "GG9G+687, Mandadam, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "A nice temple in mandadam",
          "languageCode": "en",
          "rating": 3
        }
      ]
    },
    {
      "name": "ఐనవోలు, ఆంధ్రప్రదేశ్.",
      "rating": 3,
      "address": "MDR119, Inavolu, Amaravati, Andhra Pradesh 522237, India",
      "reviews": [
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 3
        },
        {
          "text": "Roads are not good",
          "languageCode": "en-US",
          "rating": 3
        }
      ]
    },
    {
      "name": "Masjid",
      "rating": 4.3,
      "address": "GGCF+532, Mandadam, Amaravati, Andhra Pradesh 522503, India",
      "reviews": [
        {
          "text": "Peace full place for prayer",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice on road side. Easily accessible. Praying here jumma from last one year",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This masjid is near Mandadam, malkapuram and assembly at Amaravathi.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Suitable for travelers to pray while in journey",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Famous mazid in around Thullur mandal and it is located in mandadam",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}