{
  "places_with_reviews": [
    {
      "name": "Periya Anjaneyar Temple",
      "rating": 4.6,
      "address": "QPR9+HFJ, A Kaspa Road, Rahman Nagar, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "If we are born with a boon then we will definitely visit this Temple for seeking Lord Hanuman blessing and especially during the difficult phase of life when Saturn's influence becomes predominant & during that period if we come here to light the akal lamp 🪔 the sufferings of that devotee gets drastically reduced and all their challenges & obstacles comes down especially for those who undergo the Shaniswar Bhagavan Dasha.\n\n🙏 Jai Sri Ram 🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Jai Sri Ram Jai Hanuman ki Jai 🌹🌹🌹🙏🙏🙏 No words to say... I believed in Sri Periya Anjaeyar 🌹🌹🌹🙏🙏🙏 This is second temple I have seen in India one in Gujarat,  Surat Dist and In Tamilnadu Tirupattur Dist Ambur in same style Anjaneya Swamy",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is situated amidst the bustle of a small industrial town. The 11-foot idol of Hanuman carved out of hard black stone here is in the posture of crushing Sani Bhagwan under his foot. Since this is a Ugra stance, nearby is another idol of Hanuman so that people can worship him. There are two vigrahas or Statues of the Lord and the Main Anjaneya is on left side inside the Garbhagriha and cannot be viewed or seen directly from the Main entrance and another Anjaneya statue is in the main entrance and this is a Rare type and said that all Shani Dosha parihara will be solved by Visiting this temple. Interestingly, the main deity Hanuman is placed in one corner of the sanctum sanctorum facing south. This is considered a rarity in India. It is believed that, because devotees lit oil lamps at this temple, it got rid of the harmful effects of Saneeswara, in one stroke. The temple has been drawing thousands of devotees steadily. The Temple has a huge Deepasthamba found in front of the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "✓Nice place\n✓Peacefully mind to be arranged\n✓Good structure\n✓Following covid 19 rules\n✓Great infrastructure to remove stress full mind\n✓Separate yoga place\n✓Government provid food for 50 person (below poverty line people use)\n✓Restroom is available for temple vistor (OUR TEMPLE OUR CLEANING MUST)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is located in the center of a residential area and the neighborhood is nice and good.\n\nThe visitors can buy flowers and Tulasi Maalai at the temple entrance and interestingly there’s a water pipe in front of the entrance so that the devotees could wash their feet and enter the premises.\n\nThis temple has a divine charm there yet the manner how it is been governed and maintained may need some better supervision and coordination so that it could be better for aged people.\n\nJai jai Bajrangbali..\n\nJai Hanuman 🙏🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "MASJID-E-HASHIM مسجد ہاشم",
      "rating": 4.8,
      "address": "Masjid-e, Hashim Road, Vaatimanai, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "masjid  E hashim is located in main area of vathimanae in ambur   its a every nice masjid to recite namaz  its look very beautifull from  inside\nmost probly its has huge place in the back side   its almost look like mosque  in international country",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "All masjids in this world are Best.....No comparisons ...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Extra ordinary look of masjid\nKind people, But street lanes are bit narrow what they are suppose to be. Big SUV 's cannot enter into these streets. Only small size cars can manage such as Martui 800, Alto, i10, 120,Scross etc.....",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice place.. I was taken pic from my home",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful mosque",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Jamia Masjid - Big mosque(بڑی مسجد)VANIYAMBADI",
      "rating": 4.8,
      "address": "146, Mottu Kollai W St, Ambur - Vaniyambadi Rd, Jalal Pet, Mootukollai, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "Yes, Jamiah Masjid is a large and beautiful mosque located in Ambur. It is known for its grandeur and spiritual atmosphere.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "An Excellent peaceful Muslims prayer performing traditional old Mosque situated corner of the Ambur, spacious, clean and hygienic worship place. Maintained very excellent attached with a Modern Arabic school situated inside the Mosque.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Though all the masjids offer peace and tranquility, this one is unique. There can not be an Amburian who has not performed his prayer (namaz) here. No worries regarding parking. Burial ground is probably the biggest in Ambur. Living in and  around this area is considered a mark of status.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This masjid is the head quarter of ambur. It's clean and green. I'm really satisfied by visiting this masjid.💜",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is very big masjid in ambur,,everyone's favourite,well mainted,,and very peaceful,,,",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Neelifield Masjid (مسجد نیلی کھیت)",
      "rating": 4.8,
      "address": "neeli fild mosque, VA Kareem Rd, Flower bazar, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "Religious place where we pray 5 times a day and connected to Memories with mixed Emotions",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Alhamdulillah. Is near my house the sound of Azan is heard well and the place of peace.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the well known masjids in Ambur. It covers the most populated locality of the city. My younger brother is laid to rest here only. Ample space for the devotees, amenities, a madarasa and the Imam of this masjid etc. make this famous.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Excellent place of peaceful prayer of Muslims with a spacious burial place located in the heart of the city with all infra structural facilities, maintained in an excellent way by the Jamath Head Mr.Nattamkkar Abdul Wahab since 40 years.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "absolutely Best mosque",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Quba Mosque",
      "rating": 4.4,
      "address": "Quba Mosque, Main road, Vaatimanai, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "Beautiful mosque",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "God willing",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Masjid E Khaderpet",
      "rating": 5,
      "address": "QPQ9+V73, khaderpet, Mosque, Street, Noorullahpet, Naganadi, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "Beautiful mosque for prayers",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Excellent and neat",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Great",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "AMBUR KHADERPET FIRST STREET MSJAID",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Shri Anjaneyar Temple",
      "rating": "Unknown",
      "address": "QPHG+5GC, Gandhi Nagar, Ambur Plantation R F, Ambur, Tamil Nadu 635802, India",
      "reviews": []
    },
    {
      "name": "Choti Masjid",
      "rating": 4.9,
      "address": "QPR7+222, Eidgah Rd, Mootukollai, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "It's an old mosque which has been recently renovated with an excellent finish. Peace and serenity.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Masha Allah very good looking",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Good Calm and ambient atmosphere...",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Good masjid good atmosphere, good people, nice",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Went to attend a funeral. The mosque is great but the roads to reach the mosque were horrible.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Suyambu Samundeeswari Amman Temple",
      "rating": 4.6,
      "address": "PPW6+H96, Tamil Nadu 635814, India",
      "reviews": [
        {
          "text": "One of the famous Temples in the area of Ambur and deity of lot of families. Located on the scenic bank of Periyankuppam Lake.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's simple silent and divine temple,near in Lake is awesome..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's oldest powerful temple..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I am favourite to peryankuppam temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of most famous temple located in Periyangkuppam village nearby Ambur.periyankuppam is a village located in the national highway from Ambur to vaniyambadi.....temple is quite outer the village nearby a lake.......goddess samundeshwari was formed as a suyambu so the temple is named as suyambu samundeshwari Amman kovil....people say one of the most powerful goddess. every day the temple is open during the month of feb every year thiruvila will be taking place most famous festival over the surroundings . most of the marriages ,ear piercing function takes place over here.....we can find a small marriage hall nearby temple.....from Ambur bustand we can get many share autos to the temple...",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Fathima Masjid",
      "rating": 4.5,
      "address": "QPV7+CP2, 2nd St, Jalal Pet, Vaatimanai, Ambur, Tamil Nadu 635802, India",
      "reviews": [
        {
          "text": "Beautiful Mosque, a peaceful place for prayer, This mosque is situated towards Babullah makkan to Mottukkollai,  in Vathimanai between T A W Matriculation Higher Secondary School and Farida Classic shoe factory back side, next to Fathima Marriage Hall.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice masjid for T. A. W.  School Boyz & shoe factory workers & surrounding area for Prayer👌👌👌",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice mosque. But wazu khana is not comfortable to sit..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice mosque and peaceful. Useful us to surrounding peoples...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to pray... Masha Allah peaceful place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}