{
  "places_with_reviews": [
    {
      "name": "Amboli ghat",
      "rating": 4.6,
      "address": "XX4V+V9W, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Wonderful place with lush green forest, waterfalls and sunset points.entire drive from tarkarli till Belgaum via this ghat road was memorable. Would like to visit this place again during monsoons and will stay there for a day. There are many spooky stories too about this place and would like to have a round of 5-7kms in the hills on my Royal Enfield to feel the chill 😜. Overall a lovely cute hill station.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is one of the best places to spend some time if there is no traffic on the ghat. In monsoon, it turns into heaven, one of the best of you love to see sunsets . Once you reach on top, the roads are narrow. If you are visiting in monsoon, you'll see many waterfalls along the way and a lot of stalls where you can have some tea and snacks.\nMake sure to ride/ drive safely on ghats and keep your speed low. Happy travelling ✨️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The place is a picturesque paradise, with lush green slopes covered in a vibrant tapestry of greenery. Crystal-clear streams meander through the hills, their soothing sounds harmonizing. Truly breathtaking taking view with a charming contrast to the grandeur of nature. Amazing place for sightseeing and enjoying nature.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amboli Ghat is a mountain pass in the Sahyadri. The hill station of Amboli lies on this ghat.This ghat receives heavy rainfall and is surrounded by thick forest, waterfalls and beautiful natural landscape.This ghat is one of the tourist attractions in Maharashtra. It has breathtaking view with cool and calm environment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I have done Mumbai to Goa Bike ride via Amboli Ghat..  The roads are not that good but the Ghat view is really Amazing.. Enjoyed visiting here. If u are taking our vehicle drive or ride carefully. Highly recommended👍",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Hiranyakeshi Temple",
      "rating": 4.6,
      "address": "X23G+XWV, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Beautiful and serene place. Although it is pious religious place , visiting there just for peace is also suggested. Approach road is narrow and rough. People need to walk around 500mtrs to reach there temple premises",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful and peaceful temple near Amboli. Best to visit in mansoon or just after mansoon. surrounding area is very clean and you feel calm.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful place. Do visit this place in monsoon. You can see there are many small water falls. Nature around this place is awesome. There is free parking place available near the temple. We need to take 10-15 minutes Walk to reach the temple. You will definitely enjoy the place in monsoon. This place is less crowded and wonderful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A true in nature spot. Must visit. Do checkout on your next trip to Amboli Water Fall or on your way to Goa, situated between mountains , the roads might look tricky but do ask locals for directions. A truly magnificent Shiva Temple which soothes your soul. Mut visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "After parking your vehicle, there is 5-10min nice walking path to this temple. Hiranyakeshi Temple is the point from where Hiranyakeshi river originates from the mouth of caves. Temple is beautiful, clean, peaceful and calm.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Amboli Waterfall",
      "rating": 4.5,
      "address": "Sawantwadi, Vengurla - Belgaum Rd, Amboli, Kegad, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Best road side waterfall in Maharashtra, easy to access. Must visit in rainy season. Don't visit weekend very crowded.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is the perfect place to stop for a short break on the way to or from Goa. There are many stalls that offer steamed corn on the cob, maggi, boiled eggs, omelette, tea etc. The main attractions are the amazing natural waterfall on one side and the breathtakingly beautiful valley on the other side of the road. There are staircases with handrail for safety while climbing to the top. There is no designated parking area, the cars are usually parked on the side of the road. The waterfall is at its top most glory during the monsoons. The journey becomes a little risky because of the fog and rain but if you drive slowly and carefully, there is no problem.\nSimply beautiful. The best time to visit is early morning before 9AM as it won't be crowded till then.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice view with a wonderful waterfall but yes December is not the right time to visit if you want to feel the view of the waterfall. But the nature view is on point. You will get snacks stalls besides the road and yes there are monkeys roaming over there who can't wait to steal your snacks, so be aware of that. Overall a nice spot to have a small break with an awesome view .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The ghat (canyon) roads are quite bad and in desperate need of repairs as of this review in late Nov, 2023.\nThe waterfall is really beautiful. Dustbins are needed and caretakers to keep the place clean since there's a lot of trash all around.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It very beautiful place. One you can see waterfall and on side you can see beautiful valley covered with mist and climate is chill but not freezing cold. Must visit in afternoon time.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "AMBOLI GHAT",
      "rating": 4.6,
      "address": "XX7X+CV5, Sawantwadi, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "This waterfall is full of water from July to October.Yes, tourists come from a long distance to see the waterfall.The atmosphere here is very nice.\nHotels and resorts are also available for you to stay and eat here",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The amboli wharf is one of the biggest and Wonderful wharf if you want to view  That wharf then you will have to Go by aajra way there is also another benefit for you that you can also go Goa with that way\nThere is also one waterfall it has one speciality that is water come from down to up and that is beautiful waterfall\nAnd there is also view point... it's a evening view is Exquisite",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is very scenic.  There is sun set point and parking area.  Good place for photography.  Ghat road and turns are very stiff.  Every care has to be taken while driving.  Don't drink and drive.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice, cool, calm and naturally green place. Best in rainy season. Famous for wateralls.....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best time to visit in rainy season plz avoid weekends to visit and any govt holidays to have good and peaceful visit it in weekdays\nPlz take cash rather than gpay or PhonePe or Paytm as network is less there",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mahadev Gad",
      "rating": 4.6,
      "address": "XXCG+9QJ, Amboli, Parpoli, Maharashtra 416531, India",
      "reviews": [
        {
          "text": "Good for sunset views and also have a trail where you may sight wild animals.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best view of mountains Majestic, gargantuan, humbling, vast, massive, collosal, titanic, towering, monumental, mammouth, mighty, enormous.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful panoramic views of the mountains. It took us about 15 mins to get there from the Amboli-Belgaum highway as road conditions were terrible.\n\nI feel if initiatives were being taken to fix the potholes as well as maintain the Mahadev Gad viewing areas, this place would have way more tourists than normal.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Location is too good with great views, but road leading to the location is very pathetic. Be careful on weekdays as there will be hardly anyone.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice serene and calm view point.. We visited early morning and noone was there and the view is amazing.. Must visit in amboli",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Amboli Valley - Hill view Point",
      "rating": 4.7,
      "address": "Entrance of, Amboli Sunset Point, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Very good place and views are fantastic. If you are passing through this way please stop and take some pictures.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amboli is a charming & quaint hill station located in Sindhudurg district of Maharashtra. Due to its captivating surroundings, Amboli is a frequented weekend escape for the residents of Mumbai as well as Pune. It is visited by hundreds of holidaymakers, honeymoon couples as well as tourists.\n\nAmboli is perched in the foothill of Sahyadri ranges and is a home to exotic flora and fauna. The Hiranyakeshi River feeds the land of Amboli. Due to such location, the climate of Amboli is classified as subtropical. Amboli experiences normal temperatures during summers with a median temperature of 35°C. During the winters, the average temperature of Amboli rests at 12°C. It receives a high amount of rainfall during monsoons that lower the temperature even more.\n\nAmboli is a traveler's delight. It's beautiful and charming Sahayadri Hills are frequented by the visitors. The venture of trekking can be enjoyed in these hills. Hiranyakeshwar Shiva Temple, an ancient Hindu temple, is located in these hills. It is revered as a sacred site by the locals.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Feel it",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing view but roads aren't good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good place to stop and stare for some time. Don't stare for too long as the roads get too busy so it can trouble other travelers.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Amboli Forest Park",
      "rating": 4.4,
      "address": "XX5X+XVJ, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "It was a great evergreen forest and in Monsoon its hub of amphibians and reptiles also you can sight wild animals.\nBest time to visit : Monsoon.\nIt has so many endemic species that are only found in amboli.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful place for relaxation...\nVisit there it is awesome place...\nGood place for family relaxation very peaceful.\nVery calm and silent.\nAnd this newly added Butterfly garden is like cherry on the cake.\nYou can see lots of rare and endangered species of butterflies here.\nAnd recently they’ve added so many flower plants including lotus.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Located in the market behind MTDC resort, entry will be a bit confusing but the left most road leads to the park. There is no entry fee. Once inside there are lot of slides, swings, seesaws and ropes to climb. For parents and senior citizens there are benches to sit on. There are two tracks which you can take to view the trees and different birds in the park. One on the right also leads to the Butterfly park wherein there are lot of butterflies and caterpillars for kids to view. Also there is a small cave with a tiger statue in it where kids can take pics. Overall a very good park, needs a bit of maintenance during off season. But in rainy season or holiday season will be very nice.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful and peaceful place..rare species of trees, snakes and frog's found here.butterfly garden is awesome..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Quiet, lonely, left by people ( had been culturated by people in past, and in nowadays becoming wild),  misterious, Strange because of combination of park and the kids playgrounds.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shirgaonkar Point",
      "rating": 4.2,
      "address": "WXQX+4W7, Kegad, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Quite place, not crowded. But huge rusty barrier brokes the impression. Also the view is partially blocked by trees.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "View from point is good, but view point itself constructed badly. One need to climb up railings to get a good view.\nNothing much to roam around. Small view point and lesser parking space.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Railings are created at the point.  Not the main attraction though at Amboli, one can go ahead lilttle towards chakul village and abt 200 meters from this rallings one can have a view of watch tower. That goes through aranya jungle lodge road.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Just. Platform spot to see the scenic beauty.  Other than that u find the anjeer fruit in large number",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Great view of the Amboli, easily one can reach there by roads, quite silent place n surroundings, one can tracke through dark green dens forest from Amboli stop.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Hiranya keshi mandir",
      "rating": 4.8,
      "address": "X296+VHC, Amboli Hiranyakeshi Temple Rd, Gavthanwadi, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "Views and vibes are amazing and temple structure is beautiful I love it",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful place to visit.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Amboli Church",
      "rating": 4.1,
      "address": "XX7X+555, SH 121, Sawantwadi, Amboli, Maharashtra 416510, India",
      "reviews": [
        {
          "text": "This church is in Andheri West. The area is too busy, lot of traffic. Nice place as everything is available in walkable distance.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Wildlife sanctuary\nBest for Jungle ride\nFull of greenery\nGood place to spend your time",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "There is amboli church in Andheri west Mumbai named Amboli Church.But this is the perhaps only church in Amboli",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Church is near to amboli naka walking distance from station is about 20 mins\nI dont thik parking is available",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Queit peaceful inside though its connected to the main road.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    }
  ]
}