{
  "places_with_reviews": [
    {
      "name": "Sri Harmandir Sahib - Golden Temple",
      "rating": 4.9,
      "address": "Atta Mandi, Katra Ahluwalia, Amritsar, Amritsar Cantt., Punjab 143006, India",
      "reviews": [
        {
          "text": "Visiting the Golden Temple was a truly enriching experience. From the moment I stepped onto the premises, I was captivated by the serene atmosphere and the stunning architecture. The intricate details of the temple and the tranquil waters surrounding it created a sense of peace and spirituality.\n\nDespite the large number of visitors, the temple complex was well-organized, allowing for a smooth and enjoyable visit. The queue system for entering the main temple was efficient, and the volunteers were helpful and friendly.\n\nOnce inside the temple, I was struck by the beauty of the Golden Dome and the soothing chants echoing throughout. Sitting by the sacred pool, I found a moment of tranquility and reflection amidst the bustling crowd.\n\nOverall, my visit to the Golden Temple was a memorable and spiritually uplifting experience. I highly recommend it to anyone seeking solace and inspiration.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "What can I say that hasn’t been said already. Truly remarkable place for visitors and locals alike. The generosity of this place is beyond any words I have. I have deep respect for Sikhs and how compassionate they are.\n\nThey serve over 1M meals a day, 24 hours a day 7 days a week to anyone. It’s simple, nutritious and plentiful. Truly incredible experience that I will never forget.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "No words can brief the beauty, magnanimity, and majesty of this Holy place of Sikhism. It is situated in the heart of Amritsar city and conveniently located & approachable and is open for all faiths without any if or but. Certain restrictions are mandatory. Community kitchen service is open round the clock for all. This place is extremely well maintained in all respects and all amenities are available here. Cleanliness is superb and service to mankind is unparalleled.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Peaceful place. Amazing environment.\nIt feels so nice to be here, positive vibes. Just sit there and enjoy the inner place. The Gurudwara is beautiful to watch and well maintained.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Unlocked one of my bucket list. This holy place is a must visit if you are in Amritsar. Neat and clean surrounded with beautiful holy pool. I Felt calm and happiness the whole time I spend at the golden temple. Had Langer and spend good quality time with family.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Jallianwala Bagh",
      "rating": 4.6,
      "address": "Golden Temple Rd, Jallan Wala Bagh, Katra Ahluwalia, Amritsar, Amritsar Cantt., Punjab 143006, India",
      "reviews": [
        {
          "text": "The place is obviously a very important one if we talk about our history. The complex is quite huge in terms of its area. There are 3-4 one storey cottages type buildings which are used as a museum. There are few places which are preserved very well and still reminds of that era. The place was beautiful decorated with plants n gardening. Entry is free for everyone.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If you are in Amritsar, this is a must visit place. Everyone knows about the history this place holds, but to be there can give you goosebumps. But to be very Frank, mostly it feels like a normal park. It should have been maintained the way it was. There are some nice things to witness like the well and the walls with bullet marks. The museum is also decent. But the overall wibe is missing. I am giving 5 stars because of the rich history of the place, otherwise I would have given 3.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This historical place ,we all are aware of ..it would be nicer ,if there is a sacred place or a temple where people can offer their prayers to the deceased souls, to offer respect to them. We can't imagine what they must have gone through. Also some.benches in the garden park also should be kept for senior citizens n children.  I.must say though, that its maintained nicely .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's not a place for enjoying or for picnic purposes. It's a historical place. It's just nearby Golden Temple.\nYou can visit this place and can find resemblance from what we have study in our history book.\nYou can find bullet marks and also well in which so many Our freedom fighters jump to save their lives.\nMust visited place.\nAgain place is not for enjoyment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I’m visiting this place after 10 years and what a transformation! The place is beautifully redone in a way that reminds everyone of the grave history. There are multiple galleries that tell multiple stories, there are places just to sit and reflect; everything for free. There is no entrance fees and yet the place is maintained so well. Just walking around, reading gives goosebumps.\n\nI would highly recommend visiting this place if you’re touring in Amritsar.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shri Durgiana Temple, Amritsar",
      "rating": 4.7,
      "address": "near, Hathi Gate Chowk, near Durgiana Mandir, opp. golbagh, Hathi Gate, Goal Bagh, Amritsar, Punjab 143001, India",
      "reviews": [
        {
          "text": "My visit to Durgiana Temple in Amritsar on Diwali evening was truly magical. The sparkle of the firecrackers illuminated the temple, creating a festive atmosphere. As the evening descended, the temple's beauty was heightened, with its reflection shimmering on the water. The peaceful and serene environment made the experience truly special. The well-maintained surroundings and the presence of other temples within the complex added to the overall charm, making it a perfect blend of spirituality and cultural richness.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Shri Durgiana Temple is situated between a pond and the temple looks very beautiful. The entrance had the statue of Lord Shri Ganesh and Lord Ma Durga. Inside the temple had the statue of Lord krishna and Radha.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is truly a divine experience to visit Laxmi Narayan Mandir aka Durgiana Mandir. Ancient architecture and tomb covered with Gold and inside temple seeing beautiful Living statues of God is a blessing to world and humanity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Our visit to Durgiana Temple on a Sunday was a spiritually enriching experience. We had the privilege of a serene darshan, as the temple was blissfully uncrowded, allowing for a peaceful and meaningful visit with the family. The tranquility added to the overall atmosphere, making it a memorable and deeply spiritual outing.\n\nExploring the complex, we also had the opportunity to visit the oldest Hanuman Temple, adding a layer of historical significance to our visit. Learning about the rich history of Durgiana Temple, often referred to as the \"Silver Temple\" due to its silver doors, deepened our appreciation for its cultural importance. The architectural beauty and the religious harmony within the complex make it a must-visit destination for those seeking a blend of history, spirituality, and tranquility.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This Temple in Amritsar is a captivating spiritual haven that mirrors the grandeur of the Golden Temple. Adorned with intricate architecture and vibrant surroundings, it offers a serene atmosphere for contemplation and worship. The temple's cultural significance, coupled with its well-maintained premises, makes it a must-visit destination in Amritsar for those seeking a deeper connection with the divine.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "The Partition Museum - Amritsar District, Punjab, India",
      "rating": 4.6,
      "address": "Hall Rd, Town Hall, Katra Ahluwalia, Amritsar, Punjab 143006, India",
      "reviews": [
        {
          "text": "It's one of the best Museums I have ever been to.\nThe museum is one of the must visit places when in Amritsar.\nIt's close to the golden temple and is easily reachable by walking.\nThere are washrooms available in the premises.\nThe museum explains the conditions of the common man during the partition phase.\nThere are many things from that phase for viewing like newspapers, clothes, letters etc.\nThere are also audios and videos of the people sharing their experiences and the presentation of migration available.\nThere is a lift available for senior citizens and specially abled people.\nThe ventilation was not that good..there was AC available but they weren't switched on and the fans were also available at some places only.\nClicking pictures is not allowed at all inside the museum.\nThere is a Rs.10 entry fee also.\n\nHappy Traveling!!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "10rs entry ticket and if you want to take guided tour then audio tape is available for 100rs.\nPhotography isn’t allowed inside, but you can take a shot in one of the galleries where there’s a big portrait with all the leaders on a round table.\nIt’ll easily take 2+ hours to go through all the galleries and understand everything in detail. Keep good time and strength to walk and read through all the info.\nWorth visiting. We visited on a weekday. There wasn’t heavy rush we easily got tickets and audio tapes. We spent almost 3hours here to understand everything in great detail.\nDo not miss visiting this museum😇",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Partition museum is a must visit when in Amritsar. Its close proximity to the Golden Temple makes it easier to visit. The entry is fee is hardly 10 rs, though photography is not allowed. The set up and layout of the exhibition is very thoughtful and some of the display such as vessels and the tents is truly special. The place truly takes you back in time!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a lovely place with a beautiful entrance. We went in the evening and it looked quite pleasant. We clicked so many pictures there. Although the museum closes at 630pm in the winters, we won't be able to go inside. But I love the vibe there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is a very well maintained museum and the quality of information at display is breathtaking. It was a dark time in Indian history and the photos, videos, news cuttings have depicted that to the fullest. The galleries are well organised and not crowded. Will definitely recommend this place if you are in Amritsar.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Gurudwara Ber Baba Budha Sahib",
      "rating": 4.8,
      "address": "The Golden Temple Amritsar, Golden Temple, Golden Temple Rd, Atta Mandi, Katra Ahluwalia, Amritsar Cantt., Punjab 143006, India",
      "reviews": [
        {
          "text": "The Golden Temple, known as Sri Harmandir Sahib, holds a special place in the hearts of Sikhs worldwide. Situated in Amritsar, Punjab, it's not just a religious site but a beacon of spiritual and historical importance. Getting there is easy with options like the nearby airport and railway station, as well as buses and taxis.\n\nConstructed by Guru Arjan Dev in the 16th century, the Golden Temple's golden dome is iconic, housing the revered Guru Granth Sahib. It's a haven for prayer, meditation, and community service.\n\nDespite its popularity, the temple management ensures a smooth experience for visitors, even during busy times like festivals.\n\nWhat truly stands out is the langar, a communal kitchen offering free meals to everyone, irrespective of their faith. It's a beautiful expression of Sikh values, promoting equality and humanity.\n\nThe Golden Temple in Amritsar is more than just a tourist spot; it's a profound journey into Sikhism's essence, offering serenity and inclusivity to all who visit.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Definitely one of the best experiences of my life,  such a warm welcome,  felt very humble to be their,  travelled from u.k with my wife......it was her gifted wish, for me to see the golden temple in  person. Blessings to all who visit this holy place*",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Golden temple, a peaceful place. Visit early in the morning to avoid long waiting. Volunteers are friendly and help in all the ways possible. Liked the cleanliness criteria and overall maintenance of the temple.\nMust visit place in North.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Not enough time to explore inside. So just taking photos outside and going back to airport. This huge place and many shop between sells a lot of things. We ate at rang punjab and just casually walk here. Not know what inside.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Guru Arjan Singh compiled the Guru Granth Sahib and installed it in the Harmandir Sahab in 1604 AD. Ber Baba was the first 'Granthi', (the reciter of the Holy Book).\nBudha (बुड्ढा), was a title assigned to him by Guru Nanak ji.\nIt is said that as a small boy, he had some interaction with Guruji about God and Guruji, very impressed by his seriousness gave him this title.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Gobindgarh Fort",
      "rating": 4.3,
      "address": "Old Cantt Road, inside Lohgarh Chowk, Vijay Chowk, Amritsar, Punjab 143001, India",
      "reviews": [
        {
          "text": "Needs more activities and engagement for tourists. I went there with a ticket of 850 which included everything inside the fort. The light and sound show and 7D laser show are really good however you don't feel the energy there except these two. Buffet was included in my ticket and I would say better avoid it and you can save 150 rupees there only. Very average food and no options.\n\nI like the whole concept, to provide one-stop for tourists into Punjab's hostoysnd culture however I do feel it requires brushing up!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The first we had seen the 7D movie of Ranjit Singh which was very interesting then the riding of camel and double riding cycle was very new experience which was amazing. Then the Bhangra dance which was very nice.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Great historic place, firstly I was thinking that the ticket is costly but after the experience, it is really worth it . The activities like horse riding/camel riding, games, 7d show and bicycle are included. You also experience live Bhangra here with it weapon showcase is also there.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We enjoyed our visit to fort. 450/- is the lowest entry ticket which includes fort entry, live performance of Bhangra and Gidda, laser show and some fun activities like couple bicycle, hoverboard ride, horse/camel ride, archery, basketball, dart etc..\nIf you pay 600/- then you get access to 7D show which is fun🤩 add another 150/- and you’ll get your unlimited maharaja thali meal included in the same.\nWe took 750/- ticket per head and enjoyed the fort experience thoroughly.\nWe entered around 6:30 and were done by 9-9:30/-pm.\nYou might need assistance to ask what to do when, you can check the same with volunteers. 8pm is 7D show and 7:30 is laser show.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The place is good but not verses the price. It's overpriced. With the ticket of 450, you can watch 7D and a very short camel ride. They don't charge for kids below 5 years, but  inside, nothing is free for the kid. Even camel rides are not free for kids they will charge Rs.50 for the same. If you go for 7D, they will not offer the 3D glass to wear. You have to fight for it.\n\n7D show was good.. one can enjoy a nice evening there.. 2 Seater Cycle Ride is free, but they should have multiple cycles.. otherwise, you end up with a round or so..\n\nVR game was very good we all enjoyed it..\n\nRs. 50 is the charge for the polo cart, which takes you from the ticket counter to the fort. If you can walk, then it's actually no need. The main area is not that far..\n\nOverall, good..",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shrine Baba Deep Singh Ji Shahid",
      "rating": 4.9,
      "address": "JV9G+JHG, Atta Mandi, Katra Ahluwalia, Amritsar, Amritsar Cantt., Punjab 143006, India",
      "reviews": [
        {
          "text": "Inside Golden Temple gurudwara complex. On parikarma marg",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "good",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It is a holy place inside the circumference of Shri harmandir sahib (golden temple). Baba deep Singh ji, one of the top devotee in Sikh religion, under the shadow of Shri guru gobind Singh ji fought bravely to save the destruction of Shri darbar sahib( golden temple) against mughals in 18th Century. Defeated the mughals single handly and in between baba ji was beheaded by mughals but with the blessings of Guru gobind Singh ji, babaji placed his head on his hand and after fighting devinely from the distance of 40 kms, babaji finally offered his head at this place and made his way to heaven. Holy place to pay obeisance.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Good place and good vibe",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "peaceful",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Mata Lal Devi Mandir",
      "rating": 4.7,
      "address": "Shivaji Park Rd, Mohindra Colony, Amritsar, Punjab 143001, India",
      "reviews": [
        {
          "text": "Beautiful temple.  Be prepared to walk.  There are caves built like Vaishnodevi temple. There are so many idols of God under one roof.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very much attractive and a little adventure Temple in Amritsar. Small caves and built attractily. Really seeing lots of history inside the Temple. Also keeps beautiful by authorities.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is different type of temple, which has replicas of some of the famous temples of India. It’s worth a visit. It has lot of tunnels and stairs",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The most beautiful temple I have ever seen. ...all kinds of god and goddesses are there .....",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its a hidden gem in Amritsar. One should also visit the place while arriving Amritsar. Travelling time plus touring time will hardly take 40 minutes.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Vaishno Devi Mandir Amritsar",
      "rating": 4.5,
      "address": "40 khoo jaura phatak, Krishna Nagar, Amritsar, Punjab 143001, India",
      "reviews": [
        {
          "text": "Amazing architecture and designing done for gods and goddesses I loved the walk and the way it has been constructed You do not feel any pain of visiting it was and the feel is amazing the cave it was maintained",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "If you visit Punjab must visit this temple\nSingle temple shows you a huge variety of temple and God .and best thing is that you can feel how old people visit vashno devi temple at katea exactly they made a den",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This was totally an unexpected surprise for us. The path to see each god idols was awesome. We have to go inside cave like structure in the 1st floor and many small passages. Do explore the native beliefs and culture if you are visitor.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful temple with glass work done throughout. It's very well made with an interesting route towards the Devi darshan guiding through different hindu gods and goddesses on the way, almost like a mini adventure trip in a maze. A must visit if you're around this temple!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Mata Lal Devi Temple is a sacred Hindu pilgrimage that is considered to be full of miraculous powers. Dedicated to a 20th century female saint named Lal Devi, it is regarded as a miniature of the popular Vaishno Devi temple in Jammu because of its similar structure.\n\nColorful mirror hallways shining gracefully with lights adorn the interiors of the temple magnanimously.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Akal Takht Sahib",
      "rating": 4.8,
      "address": "JVCG+753 Harmandir Sahib, Golden Temple Rd, Atta Mandi, Katra Ahluwalia, Amritsar, Amritsar Cantt., Punjab 143006, India",
      "reviews": [
        {
          "text": "AKAL TAKHAT SAHIB is the SUPREME COURT of sikhs.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The Akal Takht is one of five takhts (seats of power) of the Sikhs. It is located in the Darbar Sahib (Golden Temple) complex in Amritsar. The Akal Takht is part of the Golden Temple. Its foundation was laid by Guru Hargobind Sahib",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Amazing peaceful place in india, one of the top most peaceful and full of positivity feels here",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "I hv been to three Gurudwara so far Namely Golden temple in Amritsar, Takht Shri saheb in Patna and Shree Bangla Sahab in Delhi. I must say that all three visits created so much of respect for Sikhs. The amazing peacefulness, devotion and true spirit to serve in the of God just touched my heart. No hassles, no haggling, no politics, every person gets a fair chance to spent time ther. Golden temple was the first of the gurudwaras and I would want to visit there again and again.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is one of the Holy place of India which is located in Amritsar.  This place is known as Golden temple. Akal takht is located inside Golden temple where WaaheGuru darshan can be done. It is situated at distance of 3km from bus stand of amritsar. Take Handkerchief or anything to cover your head inside temple. Everyone has to cover head when they go for WaaheGuru darshan. Akal takht is located in between Pond. Saturday and Sunday is most busiest day here. Too much crowd on Saturday and Sunday. Everyone is helpful there. 24hrs Hours community Kitchen is there where you can eat food and have  tea free of cost,this is called Langer in local language. Luggage room and shoe rack is there to keep your belongings over there. You can book room also there . They provide room at golden temple campus at very affordable price for more than 1 members.for single person you will not get room but they provide mattress and hall with lockers and fan you can rest over there. Overall you will find this place full of energy , full of devotion .",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}