{
  "places_with_reviews": [
    {
      "name": "Trimandir, Amreli",
      "rating": 4.6,
      "address": "Liliya Rd, Bhojal Para, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "So beautiful place and I also try lunch and dinner in unodari food it's so delicious 😋",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very calm and sacred place. You can also have food (lunch and dinner) at very nominal charge (60-70 Rupees) inside temple canteen. Children will also enjoy a lot.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Soothing experience. It's a really calm and composed place of worship.. Here there're idols of jain tirthankar, lord Krishna, shrinathji, Devis and shivling of lord Shiva. For having food here you can avail passes of 70 Rs. And have pure and satvik food here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple is known as Trimandir,\nTrimandir is the innovative concept of a non-sectarian temple by Dada Bhagwan. It aims to bring the gods of Jainism, Shaivism, and Vaishnavism on one stage.\nVery peaceful, clean and calm place, a canteen and garden area is also here and both are well maintained, you can bring young kids here.\nFood is also available here at a cost of Rs. 50/- only and the food is of good quality.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Experience the serenity, tranquility, divinity and peace of this nishpakshpati Trimandir yourself.\nThere is satvik food and refreshments, stop and stay, parking, garden available.\nEasily reachable through Google maps.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Somnath Mahadev",
      "rating": 4.5,
      "address": "J635+959, GJ SH 34, Rikadiya, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Best temple give peace to a mind must visit",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Historical Temple... Jay somnath 🙏🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jai mahadev..\nGood temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Historical n cool place of worship",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lord Shiva temple is very beautiful",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shyam Circle",
      "rating": 4.2,
      "address": "H6VH+PRJ, GJ SH 110, Bhojal Para, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Circle To Circle jevu che.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Trimandir  Amreli is very near to this circle.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's good",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Bhojaldham",
      "rating": 4.5,
      "address": "H686+VJ9, Fatehpur, Gujarat 365601, India",
      "reviews": [
        {
          "text": "This is very nice and quite bhojaldham temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Bhojal dham is a Good place.  Its a place of Guru of Jalaram Bapa.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hindu temple of Sant Bhojalram guru of Sant Jalaram  renovation work in progress likely to be completed within two years",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jay bhaojalram\n\nSaint shree bhojalramvabapa is guru of saint shree Jalarambapa. Bhojaldham is good place. In this temple provide bhojan, room and other.vaishakh sud punam fair in this place.\nMany people went to bhojaldham.\nThis place now under construction for new temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "If virpur attracts millions, this fatehpur based bhojal dham deserves more. The bhojalram, guru of jalaram bapa was based here and jalaram bapa went to virpur by following his guru's instructions. wonderful calm and Spiritual place with accommodation available.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kamnath Mahadev Mandir",
      "rating": 4.6,
      "address": "H6V4+CR8, GJ SH 34, Jesingpara, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Good, religious as well picnic place...\nBig parking area\nNice garden, temple, statue of lord shiv, children playing area...\nNeed little bit more care....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The tample is very good and have a big open space in front which is good for vehicle parking and playing for kids.also it have the lake near it which has many birds which come for eat from people so you can also give birds somethings to eat.also it have the touched garden to it where you can bring kids for play and also it is good for photoshoots.overall very good family place with free parking and very good to bring young kids.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good devotional place. Big place which need to maintain and develop.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Historical Temple with Big Pond,Big Shiva Statue and kids play area.\nHere snaks like Panipuri,Chana Jor garam and Gola also meet here.\nHanging Pool is now closed after Morbi Accident.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful temple build near a water reservoir. especially on sunday evening a large number  of people visit there with family to enjoy.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "S.T Division, Home",
      "rating": 4.6,
      "address": "kalyannagar, 1, Lathi Rd, K.K Park, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "I don't know how it is.. they are buying a review...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good application, but show all Passing station which you can't visited that's a bad point",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "nnice place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Swaminarayan Mukhya Mandir",
      "rating": 4.5,
      "address": "Shree Swaminarayan Mukhya Mandir Panidarwaja, J625+399, Gajerapara, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Swaminarayan Temple Amreli is a magnificent structure that exudes beauty and spirituality in every aspect. This temple, located in the heart of Amreli city in Gujarat, India, is one of the most revered and visited Hindu temples in the region.\n\nThe temple's stunning architecture is a blend of traditional and modern styles that reflects the rich cultural heritage of India. The intricate carvings, detailed designs, and exquisite craftsmanship of the temple's interiors and exteriors are a testament to the skill and dedication of the artisans who built it.\n\nThe temple's peaceful and serene atmosphere creates a sense of calm and tranquility that is conducive to meditation and introspection. Visitors can enjoy the temple's various facilities, including a spacious prayer hall, wider ground and well built modern rest houses.\n\nThe temple's management is highly efficient and dedicated, ensuring that the temple's cleanliness, safety, and security are always maintained. Visitors are treated by saints with warmth and hospitality, making them feel welcome and at home.\n\nThe temple's spiritual significance and cultural value make it a must-visit destination for anyone interested in Hinduism and Indian culture. The temple's regular religious and cultural events provide an opportunity for visitors to experience and appreciate the rich traditions and practices of Hinduism.\n\nOverall, Swaminarayan Temple Amreli is a magnificent temple that is worth visiting. It is a testament to India's rich cultural heritage and the enduring spirit of its people. The temple's beauty, spirituality, and hospitality make it a must-visit destination for anyone traveling to Amreli.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Place is very peaceful quite and maintained.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is very peaceful and nice swaminarayan Mukhya Mandir. Saints are friendly. You can take prasad also there but need to inform in advance. There is facility for paid accommodation which is very at reasonable amount.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a good temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Spiritual place for worship of god. Jay swaminarayan",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Bhidbhanjan Mahadev",
      "rating": 4.5,
      "address": "J628+5RC, Station Rd, Batar Wadi, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "🤗",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's Temple Of Lord Shiva",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very ancient temple of lord Mahadev in the Herat of BHAVNAGAR city. People comes on regular basis for darshan and some of them observe 45 days tek (Mannat) to fulfill their wishes",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Devine and Peaceful Full Place Of Shree Devadhi Dev Bhagwan Shankar.\nFind Your Self with lots of Bird Chattering and Different People Around the Area.\nAlso enjoy Near By Shops of Colths, regnable price Fast Food from Jaliyan Farsan and also seasonable store of Crackers,Kites, and many more Festive items Near by.\nJay Bhidbhanjan Mahadev",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "BAPS Shri Swaminarayan Mandir, Amreli",
      "rating": 4.9,
      "address": "BAPS Swaminarayan Mandir Pramukh Vatika, nr. Sardar Circle, Mani Nagar, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Best place for Hindus .and it's provide hostel for students.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very peaceful place, I like it.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This is indeed the best place to attain peace of mind in Amreli which has beautiful land cape garden and a children park at the entrance and magnificently beautifully sculptured mandir made from pink stone is under construction.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Divine and dignity of this place is Amazing",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Good and holy place",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Amreli Tower",
      "rating": 4.4,
      "address": "J626+3WH, Gajerapara, Amreli, Gujarat 365601, India",
      "reviews": [
        {
          "text": "Amerli Tower is a central place in amreli. Here you can do shopping for multiple things from groceries to jewellery... Main market of Amreli",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Here is some information about Amreli Tower:\n\nIt is located at J626+3WH, Gajerapara, Amreli, Gujarat 365601, India.\n\nIt has a 4.4 star rating on Google Maps.\n\nHere are some reviews of Amreli Tower from Google Search:\n\n\"Kathiawadi food is excellent. The way to watching tower is full of adventure at night. You can listen lion roar at night. Take ride in car at 11:30 pm.\" - GIR N JOY RESORT.\n\n\"Amreli Steels has an overall rating of 4.1 out of 5, based on over 41 reviews left anonymously by employees. 87% of employees would recommend working at Amreli Steels to a friend and 81% have a positive outlook for the business.\" - Glassdoor.\n\n\"Hotel city palace stay was nice, all staff very good, daily cleaning rooms. Overall a very good stay there. Thank you.\" - MakeMyTrip.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "👍Very good old structure.\nBut government could do better to maintain clock and tower windows.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ordinary place on regular day but on special occasions like diwali & ramnavmi decoreted looking awesome",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Historical landmark of amreli.... probably more than 100 yrs old",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}