{
  "places_with_reviews": [
    {
      "name": "Virasat-e-Khalsa",
      "rating": 4.7,
      "address": "6GM5+M27, Anandgarh - Kesgarh Road, Near Qila, Khalsa Heritage Memorial Complex, Anandpur Sahib, Punjab 140118, India",
      "reviews": [
        {
          "text": "If you ever find yourself near Chandigarh, check out Virasat-e-Khalsa in Anandpur Sahib. It's a huge museum with lots of parking and green spaces around. The building is really cool, covered in fantastic art and graffiti. It's super clean and well-kept. When you step inside, it's like \"wow\"! You get to learn about the history of Punjab and Sikhism – they even tell you stories. It's a must-visit place, and you'll leave with a better understanding of the area's rich heritage.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Wonderful experience with knowledge. Great light and sound show enabled galleries. The ambiance is great with water elements all around the building. A one time must visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Virasat-e-Khalsa stands as a monumental testament to Punjab's rich culture, tumultuous history, and the sacrifices made by its people in the pursuit of independence. As you step into the expansive museum, you are immediately struck by the immaculate cleanliness and the breathtaking interiors that greet you. The museum's design seamlessly blends modern architecture with traditional elements, creating a captivating ambience that draws visitors into the heart of Punjab's narrative.\n\nThe museum's primary focus on showcasing Punjab's culture, history, and the valour of its warriors is evident in every corner. From intricate exhibits detailing significant historical events to poignant displays honoring the sacrifices made during the struggle for independence, Virasat-e-Khalsa serves as a poignant reminder of Punjab's enduring spirit.\n\nOne of the most striking aspects of the museum is its meticulous maintenance. Every corner is flawlessly preserved, ensuring that visitors can immerse themselves fully in the experience without distraction. The cleanliness and orderliness of the space further enhance the sense of reverence and respect for Punjab's heritage.\n\nDespite the prohibition on photography inside the museum, this restriction serves to encourage visitors to fully engage with the exhibits and live in the moment. Instead of focusing on capturing images, visitors are encouraged to absorb the sights, sounds, and stories that surround them, creating a more profound and meaningful experience.\n\nEach step taken within the museum's halls is accompanied by a sense of awe and reverence. Whether admiring the intricately designed interiors or reflecting on the sacrifices of Punjab's heroes, every moment spent at Virasat-e-Khalsa leaves a lasting impression.\n\nIn conclusion, Virasat-e-Khalsa is not merely a museum but a profound tribute to Punjab's rich heritage and the indomitable spirit of its people. With its clean and captivating spaces, meticulously curated exhibits, and unwavering dedication to preserving Punjab's legacy, it stands as a beacon of cultural pride and historical remembrance. A visit to Virasat-e-Khalsa is not just an educational experience but a deeply moving journey through Punjab's past, present, and future.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Viraste Khalsa is a Museum of old Punjab  and Gurus Histories even the Mughal and British empror show in this place. But I like most the speech of one statue robot who addressing the people looks like orignal.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A perfect getaway from city's bustling life......very spacious parking.... a perfect amalgamation of religion, history, culture patriotism and rural life...one can find inner peace and spritual satisfaction here.... Every graffiti tells a story, a tale of valour and heroism.... Videography and Photography are not allowed in the premises...but the place is so much tempting you can't stop yourself....5 stars for cleanliness and parking space",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "8th Wonder (8va Ajooba) 8ਵਾਂ ਵੱਡਰ ਅਜੂਬਾ",
      "rating": 4.7,
      "address": "6GM5+G2F, Khalsa Heritage Complex V.I.P Road, Khalsa Heritage Memorial Complex, Anandpur Sahib, Punjab 140118, India",
      "reviews": [
        {
          "text": "It's a wonderful spot for a family outing, free of entry fees and meticulously maintained with impressive sound and light effects.\n\nHowever, despite these positive aspects, the staff members are consistently impolite and prohibit visitors from taking photos, even when there are no explicit rules against it.\n\nIf the goal is to showcase Punjabi culture, allowing photography could help capture and share more moments, attracting a wider audience to experience and appreciate the cultural richness of the place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best place to visit....\nKnowledge of Punjab's Rich culture and  history....\nMust visit and  bring your kids and family to this beautiful Museum...\nYou can book tickets online or offline for free of cost",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Excellent experience ever had . It's wonderful place must visit 😊.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best place in Anandpur Sahib, the name given to Virasat-e-Khalsa,\n\nThis place tells us about the culture of Punjab and Sikh history. It depicts the 19th century of Punjab as it was in the earlier century. The inside is very well designed. If you want to know about Punjab then please come here. The history of Punjab has been told very well in this.\n\nIf you want to tell your children about Sikh history and Punjab, then definitely bring them here because here they will get a lot of information. You can also bring the elderly here. wheelchair and lift facilities have also been provided for the elderly.\n\nYes,\nthere is no ticket to see Virasat-e-Khalsa,But to get the ticket, you must have identity proof and you can get tickets for 10 people in one ticket.\nif there is a need for parking for the vehicle, then there is a ticket and that too is not much. Also canteen is available on ground floor\n\nTiming - 10:00 AM to 4:00PM\n(MONDAY CLOSED)",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "My experience is very amazing. They show the history and cultural development of Punjab in very effective way. Overall it is very gorgeous i recommend to all must visit and enjoy.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kisan Haveli",
      "rating": 4.3,
      "address": "6GV4+45M, Kisan Haveli Road, Mohalla Bali Sarkar, Anandpur Sahib, Sahota, Punjab 140118, India",
      "reviews": [
        {
          "text": "Worth staying at this place . Lovely , beautiful , peaceful .\n\nNo words to explain . Bigger room size\nGood food.\n\nNear to Anandpur Sahib.\n\nCentre point ,and go anywhere like Anandpur , kiratpur , guru ka Lahore",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Such a peaceful place and also good services room was neat and clean and staff also coprative",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Lovely building but needs renovating. Rooms and bathrooms were not clean. Dead insects in shower. The grounds and views were fantastic. Better than inside. Chef was very accommodating and food was good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very calm , peaceful, close to nature , eco friendly place, everyone visiting Anandpur Sahib must visit this place, fare is nominal and value for money , staff is cooperative, lawns , building and surrounding jungle is very beautiful",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome food. Tastes like home made. The environment is clean/hygienic. Very courteous and helpful staff. The rooms were spacious and comfortable. The AC was not working but since the environment was not that hot we were able to manage. Definitely recommend everyone to visit.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Baba Balak Nath Mandir",
      "rating": 4.7,
      "address": "Near The Govt High School, Shri Naina devi Ji, Tarapur, Himachal Pradesh 174015, India",
      "reviews": [
        {
          "text": "Good location , atmosphere is also good u can take bus to reach there from Hamirpur kangra Bilaspur and Una",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jai ho",
          "languageCode": "en-US",
          "rating": 4.7
        },
        {
          "text": "Namah Shivay.",
          "languageCode": "en-US",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sarovar Anandpur Sahib",
      "rating": 4.6,
      "address": "Keshgarh Sahib, Anandpur Sahib, Punjab 140118, India",
      "reviews": [
        {
          "text": "place where sikhs get their identity with the baptised in the sikh community started here by GURU GOBIND SINGH JEE IN 1699 the place is not only for sikhs it is for everyone from seeing the top of the gurudwara the all area with white wash every where look nice and the langer in the free kithen is too great.\nTravelers must visit this Gurudwara Sahib as well as Virast E Khalsa. So peaceful and beautiful. We specially made this trip to visit here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Enveloping  History of Sacrifice, Self Dignity and Welfare of Society &Nation, is none other than Sacred Anandpur Sahib where two  Sikh gurus lived here. Gurudwara has all the facilities and amenities for All and special arrangements for Old ,Weak & Differently abled persons. One get inner strength after visiting this place.\nLocal conveyance is available including eateries. There is a Museum Virasat e Khalsa showcasing Royal Majestic History of Sikh. There are worth visiting places Holy Kiratpur sahib,Village TakhatGarh where Guru Maharaj Shastras were discovered.\nA must visit Place  for All especially Teens and Youth.\nSurya Kant Sharma",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Not clean, not maintained. Please maintain it properly and with clean water.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The pious and holy waters of the Sarovar Anandpur Sahib are like a cleansing ritual for the soul. This sacred lake, covering an area of about 80 square metres (around 860 square feet) is a must-visit spot for locals and tourists alike. Situated right next to the Takhat Sri Kesgarh Sahib Ji, this Sarovar is flocked by people who come to the holy city of Anandpur Sahib for their pilgrimage dip.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a just water for who's didn't know about it's value in a life . But it's a purity of Guru's teaching . Because in this Srover when some one take bath he/her pray for forgiveness his/her sins to Waheguru and the point is they realize there sins and asked for forgiveness and punishment....",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sri Guru Teg Bahadur Sikh Museum",
      "rating": 4.6,
      "address": "6FPX+248, Nai Abadi Road, Keshgarh Sahib, Anandpur Sahib, Punjab 140118, India",
      "reviews": [
        {
          "text": "The Sri Guru Tegh Bahadur Museum was built in 1983 in commemoration of the third centenary of the Guru's martyrdom. Located near Takht Sri Keshgarh Sahib, the museum's architecture reflects that of the gurdwara. A large collection of paintings, narrating the history of the Sikhs, including depictions from Guru Tegh Bahadur's life, is displayed here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice place to know about Sikhism. The museum also had very old artifacts. I will say that you should come here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "IF YOU NEED PEACE ✌️ THIS IS BEST PLACE",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A best place to visit to know the sacrifices of our ancestors for the kind of good life we are living now. A best place to bring our children to know the history of our guru's that how they bring peace for future generations by fights and sacrifices of their lives and their families lives",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Sri Guru Tegh Bahadur Museum was built in 1983 in commemoration of the third centenary of the Guru's martyrdom. Located near Takht Sri Keshgarh Sahib, the museum's architecture reflects that of the gurdwara. A large collection of paintings, narrating the history of the Sikhs, including depictions from Guru Tegh Bahadur's life, is displayed here.\n\nTimings: 10am – 5pm (Tues-Sun) / Closed: Monday / Entry:  Free",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Veergarh Fort",
      "rating": 4.8,
      "address": "Kisan Haveli Road, Mohalla Bali Sarkar, Anandpur Sahib, Sahota, Punjab 140118, India",
      "reviews": [
        {
          "text": "View of Shri Anandpur Sahib",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Baba balak nath mandir",
      "rating": 4.5,
      "address": "6FRW+V6Q, Sahota, Punjab 140118, India",
      "reviews": [
        {
          "text": "A very good place for meditation.\nBut there is a parking problem during mela days.\nNear the temple parking, the HP taxi operator has the monopoly.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "anadpur",
      "rating": 5,
      "address": "6GP2+6G6, Keshgarh Sahib, Anandpur Sahib, Punjab 140118, India",
      "reviews": []
    },
    {
      "name": "Baba Balak Nath Mandir",
      "rating": 4.8,
      "address": "6FXX+P5H, Lamlehri, Punjab 140118, India",
      "reviews": [
        {
          "text": "One of the  spirituals  destination  in himachal Pradesh    Baba balak nath temple situated in  hamirpur district",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Jai baba balak nath ji",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "God",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    }
  ]
}