{
  "places_with_reviews": [
    {
      "name": "Anakulam Tourism",
      "rating": 4.5,
      "address": "Anakulam - Mankulam Rd, Mankulam, Anakulam, Kerala 685565, India",
      "reviews": [
        {
          "text": "It was a truly great experience to witness elephants. There is no designated parking area, however you can park along the roadside. There is a bamboo park nearby. We have to wait patiently for the elephants to arrive. Sometimes for hours. But it's truly worth the wait. The sight of a bunch of elephants assembling and drinking water from the creek is spectacular.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The wild elephants come to cool themselves off. You can visit this place either in the morning between 5-7 or from 3pm to 9pm. Usually the herd is of minimum 5 elephants and if you are lucky then you can see about 30 together. Parking facility is available and there are small tea shops with less options.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "An awesome place to watch a bunch of elephants at a time. This is a favorite place to drink special water for elephants in the area. The tourists are very safe here to watch the large number of wild elephants. They come most of the days especially on the summer. This as my third trip to Anakkulam and my first two trips are not successful to see elephants. Currently the roads are very good to visit this place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place was amazing, must visit. You probably won’t get to see wild elephants from this close anywhere else. The elephants predictably come to  have a drink and bath and play in the shallow water at around 5pm everyday (that what we were told and it was pretty accurate). It’s said that there is something in the water here that attract the elephants to come and everyday.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I would say, one of the most underrated places. Not only you can watch wild elephants but you can see the mystery of drinking/taking something from the water by elephants.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "33 Waterfalls",
      "rating": 4.5,
      "address": "Aluva - Munnar Road Anakulam, Mankulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "This place is located wrongly in the gmaps. Try searching \"moopathimoon kuthu\". We had to go on different steep roads and only high power cars can climb or you can park your car down and walk for 15 mins. The jeep drivers helped us to navigate through the unmaped roads in gmaps. The map showed a difficult road since it's wrongly located on maps but there is a very decent road to the falls.and only jeeps can climb.\n\nVery clean water, 3 places you can bath , water is very clean you can climb some rocks to go to the falls not dangerous at all\n\nThe waterfall's majestic cascade captivates with its sheet power , creating a mesmerizing display of nature's beauty. The roaring sound, combined with the misty spray, enhances the sensory experience, making it a breathtaking and rejuvenating sight .the surro lush greenery adds to the overall enchantment,making it a must -visit destination for nature enthusiasts.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I have never been to a waterfall this beautiful. It is not that easily accessible. One has to take the efforts and also book a jeep to reach the place. No trek no private cars can make it to the waterfall. So yes another beauty for the day seen 😊 you can see crowd in the video but it vanished when the sudden rains started😁",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a beautiful and small waterfall located in the Mankulam area. Visitors can enjoy a refreshing bath and spend around an hour there. During the rainy season, it's important to be cautious of leeches. You can easily reach the waterfall with the help of jeep safari teams.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Small yet beautiful waterfalls. The roads leading to the falls is narrow and quite steep, we took a Jeep package which took us to many spots including this waterfalls.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Truly underrated waterfall in Mankualm. This waterfall is so much deep into the village have Offroad trails too. You can take a package to Explore mankualm so that you can see all other major spots situated there.\n\nWe have chosen TRIPPMATES for our travel needs. You can find them on Instagram if you are planning to visit",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "PERUMBANKUTHU WATERFALLS",
      "rating": 4.5,
      "address": "4WQ7+FJH, Mankulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "Nice waterfall. A watch tower kind of set was available for us to see the falls. It is properly maintained and they collect Rs.10/person to reach there. It wasn't the monsoon time and the water level was low. Still the fall was nice and the view through the downside of the falls also nice. They built the tower on the perfect place to enjoy the view.\n\nIts advisable not to climb down to the falls sicne its too risky there.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice waterfall in Mankulam. It would be fantastic to visit during monsoon. I went there in winter and the water was still flowing. It has many layers of falls. There is a gallery area where we can watch the water fall and take pictures. There is not much rush in this place. Access is restricted via 4 wheel Jeep only.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a beautiful and small waterfall located in the Mankulam area. Visitors needs to pay 10 /head for entering the watch tower. We have have a great view of the fall from there .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Visited in May 2023.\nView point with entry fee. Has safe fenced platform.\nAnother view point from a distance is in Mankulam-Anakulam road.\nFalls will look majestic after a rain with nice flow.\nMost day Jeep packages include this falls in their 1 day package.\nWe visited just before going to Anakulam.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Enchanting mighty waterfalls..  Located near maankulam, these waterfalls and surrounding landscapes are enchanting. No entrance fee. A slightly remote area in forest fringes and along the proposed 'Munnar rajapatha'. Small shops run by local people, ice-cream vendors etc seen around. Plenty of space for parking by roadside. No toilet facilities. Anakkulam is a nearby attraction.\n\nThe public can get down at two points: near the river and on the rocky platform to get a better view of the waterfall. There are no tourist guides or rescue team. Be careful not to slip n fall over the rocks. Even if the rocks are dry, you might slip once you step on them with wet legs.\n\nThere is an old bridge over the river which leads to Perumbankuthu forest Outpost, beyond which movement is restricted. The bamboos lining the entrance to bridge form a lush green arch. The river flows over rocky slopes and turns into a wide n beautiful waterfall which is better viewed from below. There is a narrow walkable steep mud path along the roadside leading to the waterfall. The path ends upon a rocky platform from where one can have a beautiful view of the waterfall that continues further downwards into a bigger waterfall.\n\nReach via machiplavu - korangatty - Mankulam -Perumbankuthu Rd while travelling towards Munnar. Place is included in various KSRTC tour packages.\nNB: Photos posted are from visit during the dry season.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Anakulam waterfall",
      "rating": 4.5,
      "address": "5W57+MHJ, Anakulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "Awesome place to take a bath in nature while there are no Elephants taking bath.\nBe careful i had seen some snakes though while taking a swim here.\nIt is a very peaceful place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Which is calm place. Sometimes we are not able to see the elephants. But the place is really nice. Don't expect climate same as Munnar.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It was a nice experience. But unfortunately the place gets dirtier because of local shops and tourists. The place is good for a picnic",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A local area where you can watch the elephants come for a drink at night. Sadly when we went we saw a lone deer but no elephants. Was however disappointed with the other tourists who honked and put on lights which I felt was quite disturbing especially if animals are to be watched in their envitonment",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Feels like entered into Elephants Kingdom. Very good experience.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Anakkulam View Point (Check Dam 1st Block )",
      "rating": 4.5,
      "address": "1st Block Bridge, Pooyamkutty - Mankulam Rd, Anakulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "This is such a scenic spot. A small junction where you have a small river which separates the jungle and people. During morning hours people are allowed to go near the river but during nights there are restrictions. If you are lucky enough you will get to see elephants drinking water. Barking Deers(kezha) also comes near this place at night. They have small tea shops nearby, you will get more details if you interact with those people.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Our visit to the check dam was a hit! Perfect for kids with safe swimming and a great atmosphere. Clean water and well-maintained surroundings made it an enjoyable experience. Highly recommend for a quick and refreshing family getaway!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A view point aprox 2 km above anakkulam Elephant view point , a small check point safe for taking bath , road is not very good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "There is no other place where elephants are so attuned to humans",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice trekking site",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mankulam Tourism",
      "rating": 4.4,
      "address": "Makulam Town, 2nd Mile, Anakulam - Mankulam Rd, Mankulam, Anakulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "Mankulam is a hidden gem in Munnar. A perfect place to get away from the hustle and bustle and enjoy the beauty of nature. It will be a good experience for those leaving Munnar from Kochi to reroute and go via Mankulam.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful area where you can see elephants very close in their natural habitat. A must visit place for those who seek calm serene and offbeat location to refresh their mind and body.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Indeed a hidden gem in munnar. If you are travelling kochi-munnar route, a short detour will take you to this pristine village.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Ecological..\n\nNice place to visit",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Waterfalls",
      "rating": 4.3,
      "address": "4W8G+WP5, Mankulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "A peaceful place to spend your day away from the busy city life. Few vehicles passing by and the friendly locals makes it more comforting.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A serene place away from the chaos. Being my hometown, I have never felt more peace than when I am here. There is not a lot of disturbance. It's a nice spot to click a few pictures as well. I recommend going here rather than going to the heavily crowded spots.\n\nAlso, guys please don't litter around. And beware of leeches in the monsoons. Don't carry a lot of things while visiting this place.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Superb trecking,  must visit",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Breathtaking view! 💦",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A must visit place in idukki. 25Km from munnar. Only 4/4 works in this area",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Mankulam Tourism Information Centre And Jeep Safari",
      "rating": 4.4,
      "address": "Mankulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "This is a beautiful place and you have to visit this.\nThe roads and mountains look incredible.\n33 waterfalls is a private waterfall and you can reach there by jeep safari.\nThere is space for changing dress as well after giving a dip inside the water.\nA small tea shop and banana fry made this trip an unforgettable experience",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Fantastic experience by Mr Praveen Jose. Who well organised it",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Excellent place for stay",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Awesome tourist destination...\nMini munnar.... Mankulam is a village in Idukki district in the Indian state of Kerala.This is the first Grama Panchayat in Kerala which produces electricity their own and sell it to the Electricity board of Kerala.Aanakulam is a very remote much close to isolated tiny village in the Munnar valley,bordering thick woods and accessible only on saturday 4 wheel drive vehicle.This village is frequented by elephants even at noon  from the adjoining woods,to enjoy the salt content in Estacholayar river,that seperates the village from woods.Here you can watch bathing and playing of elephant herds in its natural ambience.It will present a rare feast for your eyes and definitely an unforgettable experience.Kerala’s beauty is enchanting and Munnar the land of Waterfalls,Rivers,Rainforests and sprawling Tea estates.The waterfall is at a walking distance from the resort and guest can take drive through the manicured tea estates.A jeep safari takes you through the forests showing you huge waterfalls, rivers and dense forests all the way.The resort also arranges for Campfire for the guests on request.You can make a visit to tribal colony ,to experience the life of tribal group to Munnar Valley.Pure honey is widely available in this colony.\n\nIt is the first Grama Panchayat in Kerala which produces electricity their own and sell it to the Electricity board of Kerala..Mankulam is Now Tourist Destination consisting of several water falls,hanging bridge,several tributories of river and Reserve forests.The Migrants from Ernakulam districts are more in this area.The Mankulam also having somuch cultivation of apiculture,cardamom,pepper,and several other spices.There are 3 main mode of climate distributed in this area like cold,normal temparate and low altitude place having milder hot climate.Several schools also are there in this place.Few resorts are replinished in this area.Trucking destinations are also a main attration.\nThe forest department conducts an eco-tourism trek to this area, which is referred to as the ‘dark forest.’ The charges include accommodation, but hardly any tourist has heard about it.The route to Mankulam is via Kallar, from where the scenery and weather change.  There is incessant rain as a visitor passes spots known as Viripara and Munipara\nThe road is so narrow that two vehicles cannot pass at a time. The hub for Mankulam trip is the forest’s department office at Viripara. A guard accompanies every trekking group. It was divisional forest officer V N Nagaraj who created the framework for the Mankulam trip and named it ‘community-based ecotourism programme.’The path to Kynagiri starts from Viripara. The route is much more pristine than that from Munnar to Chinnakanal. Kynagiri is about 2 km from Viripara and has an office of the Nature appreciation centre. The attractions at Kynagiri are the waterfalls, a swimming pool and the overwhelming presence of mist. Water plunges from a considerable height from the southern side and flows to the eastern direction. A check dam has been built where the water touches the ground. One can enjoy the sight of the falls from the check dam as well as the nearby rocks.\nThe British reached Munnar from Kochi via Aluva. They built a bridge across the Nallathanniyar at Perumbankuthu, near Mankulam, along the road stretching parallel to the banks of the Periyar river.  This bridge, with iron rails, is still intact after all these years. The biggest waterfall in Mankulam, Perumbankuthu, is downstream of this bridge. It has as much water as the famed Athirappilli falls, but cannot be approached as no protective fences have been built. However, eager visitor can view the waterfalls, which is a good 100 m high, from a nearby rubber plantation.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very beautifull place",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Hanging Bridge 6th mile",
      "rating": 4.4,
      "address": "4WPM+78H, Mankulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "The Hanging Bridge, located at 6th mile in Mankulam, Munnar, is a popular tourist attraction. It's a suspension bridge that offers stunning views of the surrounding mountains and valleys.\n\nThe original bridge was unfortunately damaged in the 2019 floods, but a new bridge was opened in April 2021.\nThe new bridge is sturdier and more weather-resistant than the old one, making it a safe and enjoyable experience for visitors.\n\nThe bridge provides breathtaking views of the surrounding valley and river. It's a photographer's delight, especially for scenic shots below the bridge.\nLocated right off the road, the bridge makes for a quick and easy break on your journey to Munnar. Shops opposite the bridge offer refreshments and souvenirs, and restrooms are available nearby.\n\nThe bridge appears old and could benefit from better maintenance. While sturdy enough to walk on, the side-to-side movement when crowded may be unsettling for some, especially those with a fear of heights.\n\nThe bridge tends to get crowded, especially during peak season, making the swaying more pronounced. If you're concerned about safety, proceed with caution and avoid peak times.\n\nSome additional details about the Hanging Bridge:\n\nIt is located about 6 miles from Munnar town. I think it is open from 8:00 AM to 6:00 PM.\n\nThere is no entry fee. Parking is available nearby.\n\nVisit during off-peak hours to avoid large crowds and minimize movement.\n\nHold onto the railings for added stability while crossing.\n\nIf you have concerns about heights or safety, it's best to skip the bridge and enjoy the view from the banks of the river.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Mankulam hanging bridge is a nice place to enjoy the surreal water stream. There is not much rush in the area, one reason could be because of tougher access roads other than 4 wheel jeeps. The water is cool and clean. But entering the stream is not recommended because the stones are slippery and dangerous.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Scenic beauty of the hanging bridge is all into another level of Natural supremacy💯 The walk over the bridge above the Massive river bed is is worth watching 😍❤",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a great place to chill with friends and family .we can have scenic photos and enjoy the beauty of nature",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great view even though the amount of water flowing was less when we visited. Would suggest to go early otherwise it will start getting rush on the weekends.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "River Bed Home Stay & Tent House",
      "rating": 4.9,
      "address": "5W57+MHJ, Mankulam, Anakulam, Kerala 685561, India",
      "reviews": [
        {
          "text": "Calm and quiet yet beautiful homestay.Their service should be appreciated. You can relax and have a fun stay there with ur loved once. Tent and you'll get to play in the small water streams there. Recommend stay 👍❤😌",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very nice place👍🏼. Super service",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "😍nice homestay & service",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very beautiful place with a lot of attractions. Good service with lovely atmosphere. Highly recommended",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Super atmospheres and excellent service\nReally enjoyed",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    }
  ]
}