{
  "places_with_reviews": [
    {
      "name": "ISKCON Temple",
      "rating": 4.6,
      "address": "Hare Krishna Land, National Highway No.7, Somaladoddi, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "The ISKCON Temple in Anantapur is a spiritual haven nestled in the heart of Andhra Pradesh, India. This majestic temple is part of the International Society for Krishna Consciousness (ISKCON), founded by A.C. Bhaktivedanta Swami Prabhupada in 1966. The temple is dedicated to the worship of Lord Krishna and is a center for spiritual education and cultural activities.\n\nHistory of the Temple\nThe ISKCON Temple in Anantapur was established to promote the teachings of Lord Krishna and the principles of the ancient sacred texts of India like the Bhagavad Gita and Srimad Bhagavatam. Over the years, it has attracted devotees from all around the world, becoming a significant site for religious tourism. The architecture of the temple reflects traditional Vedic styles, and the serene environment provides a peaceful retreat for visitors and devotees alike.\n\nImpact on Tourism\nTourism at the ISKCON Temple in Anantapur has flourished, bolstered by the temple's reputation for serenity and spiritual enrichment. The temple has not only been a source of attraction for pilgrims but also for travelers interested in Indian culture and spirituality. It serves as a testament to the rich cultural heritage of the region and has played a crucial role in promoting religious tourism in Andhra Pradesh.\n\nLatest Tourism Trends\nIn recent years, there has been an increasing trend toward experiential and spiritual tourism. Visitors are seeking more than just sightseeing; they are looking for opportunities to engage in local practices, meditations, and cultural exchanges. The ISKCON Temple in Anantapur caters to this trend by offering a variety of programs such as yoga workshops, meditation sessions, and spiritual discourses, allowing tourists to immerse themselves in devotional practices and learn more about the Vaishnava traditions.\n\nVisiting the ISKCON Temple\nWhen planning a visit to the ISKCON Temple, it's important to note the temple's schedule for various ceremonies and festivals. Festivals like Janmashtami (the birth of Lord Krishna) and Radhastami (the appearance day of Radha) attract thousands of visitors. Guests are welcome to participate in the joyous kirtans (devotional songs), traditional dances, and feast on the delicious prasadam (sanctified food) offered at the temple.\n\nThe temple is also involved in charitable activities, including midday meal programs for underprivileged children, adding another layer of social responsibility to its appeal. The tranquil ambiance, coupled with opportunities to give back to the community, make the ISKCON Temple in Anantapur a unique and fulfilling destination for tourists across the globe.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pleasant place.Best view at night.\n\nThe stunning ISKCON Temple is situated at Somaladoddi village, on the outskirts of the city. The temple is dedicated to Lord Krishna and The beautiful temple looks even more scintillating at night when lights illuminate its walls. The most cherished festival is Janmashtami, the birthday of Lord Krishna.\n\nThe temple is designed in the shape of a chariot with big horses at the entrance. Ample of place available for parking .\n\nTIMINGS : MON -SUN:\n4 am–12 pm\n4:30–8:30 pm",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place. Can visit the temple when near by. It's close to NH, no need of even taking any turns.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Horses look mighty but they are a different world on the inside. I didn't like this iskcon temple because it was very restricted. There is no way to roam around the temple and admire the architecture, barricades have been placed both ways obstructing the path ways. By the time we went it was evening 6:30 pm and we waited almost half an hour for darshan, they closed the curtains and did some rituals to the founder and Tulasi. There are separate queues for men and women. Families can't stay together, the devotees were made to sit, stand, lay flat on the floor and salute in a way they had instructed. I felt like there was no freedom of expression ,how we want to sit and pray in silence. Even though I tried to sit in a place and meditate,I was asked to get up by the purohit and follow others. This had really upset me and soon after I saw the God, i didn't even feel like going near because of how those people treated. i just wanted to leave that place. I wasn't peaceful at all. We all visit temples and God to find the peace right ?",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Iskon temple there are many temples of Krishna but this is so special and more space was there. Even there is highway, there was piece in the temple. Best looking idols, namaste. 🙏👌🙏👌",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "National Park",
      "rating": 4,
      "address": "PH6V+6WC, Stalin Nagar, Anantapur, Andhra Pradesh 515004, India",
      "reviews": [
        {
          "text": "National Park is a park and tourist attraction located in Anantapur, Andhra Pradesh. The average rating of this place is 4.00 out of 5 stars based on 2109 reviews. The street address of this place is PH6V+6WC, Stalin Nagar, Anantapur, Andhra Pradesh 515004, India. It is about 2.02 kilometers away from the Anantapur railway station.Function hall is also available here with a moderate price we can able to celebrate any functions here.\nMainly marriages receptions are going on there\nNice locations to get photographs. Here lot of entertainment is there here can't elaborate more visit once the entry fee is only 20rupes .have a great moments on there enjoy with you family.Having boating ⛵ areas such a nice view with low cost.\nSnacks also available at the besides of gym area and besides of function hall.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good for walk. Visited on Friday evening. It was all empty. All the play area is empty and things were damaged. No proper maintenance. But still there is lot of Greenery around, which is very scenic. They are about to open up a 12D mini theatre.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "I visited the national park many times, but the 12D mini theatre experience was too bad. The price is 80 rupees but the thing is the technical fault is there in the seating arrangement and the goggles which they give to watch are not even 3D glasses but they are saying 12D. Everyone(15 people) said their opinion and talked to the people who are taking care of it. They don't even listen to the customer's opinions and they're simply saying that we don't have any faults. They are not accepting customers'  opinions who have watched it. They are simply arguing instead of listening.\n\nThe worst experience in National Park, don't waste 80 rupees on it. Instead, take a horse ride, it is far better.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A good park to relax and enjoy with family and friends 😊 also for lovers 😆 and couples ❤️😉. And a good feeling in the morning is more fun and entertainment with our kids and also with other people in the park.\nHaving a volleyball court free of cost.\nHaving boating ⛵ areas such a nice view with low cost.\nSnacks also available at the besides of gym area and besides of function hall.\nFunction hall is also available here with a moderate price we can able to celebrate any functions here.\nMainly marriages receptions are going on there\nNice locations to get photographs. Here lot of entertainment is there here can't elaborate more  visit once the entry fee is only 20rupes .have a great moments on there enjoy with you family",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Best place for lovers , couples as well as children",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Thapovanam",
      "rating": 4.3,
      "address": "MHWM+V6R, Tapovanam, A.Narayana Puram, Anantapur, Andhra Pradesh 515004, India",
      "reviews": [
        {
          "text": "Excellent food, friendly staff, hygiene food, reasonable cost for all food items",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It was a nice place.. God will conformly bless u.. If u visit this place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Area like a bus stop for Anantapur and a nice highway\n\nVery dangerous, vehicles will move very fast",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is good atmosphere and good for peaceful purposes. I enjoyed a lot with this place. This is the most beautiful place for peaceful purposes. It just a few kilometers away from the Anantapur city.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Tapovanam has extended a lot.  But the roads not lengthy.  Most of them are either 15 feet or 20 feet road.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Clock Tower",
      "rating": 4.5,
      "address": "1, Clock Tower, Gulzarpet, Anantapur, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "The Clock Tower Anantapur, a tribute to those who sacrificed their lives in India's fight for independence, stands tall with its 8 faces symbolizing the eighth month of the year, August. The 15 ft radius of the clock serves as a reminder of India's Independence Day, which falls on the 15th of August. This beautiful tower, which continues to stand to this day, is especially stunning when lit up at night.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Located in the vicinity of Anantapur town's Arts and Science degree college and railway station, the circle stands tall as a significant landmark that enhances the beauty of the town. Its distinctive features and impressive architecture make it a constructive addition to the town's landscape.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Historical place in Anantapur, symbolic of atp.....",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's a nice place and it's the center of attraction for ananthapur and also a landmark to tell others for easy identification. Public transport is available from here mainly (shared autos ) .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Anantapur Clock Tower, located in Anantapur, India, is a significant structure built in memory of Indian freedom movement martyrs. Constructed in 1945, its design holds symbolic significance: with a radius of 15 feet representing the date 15th, 8 faces symbolizing August, and a height of 47 feet signifying the year 1947. This landmark stands as a tribute to the country",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Nasanakota Mutyalamma Temple",
      "rating": 4.2,
      "address": "11- 2- 391, Naik Nagar, Sharada Nagar, Anantapur, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "It's a nice one and good to enjoy this place hope so you all love it",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Small temple but larg quantity of people wishing to on every Sunday larg quantity of goot & hens sacrifice you must visit one time jai hindu temples",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "BEST TRAVELS IN ANANTAPUR",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "🙏🙏",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Sri Baktha Anjaneya Swamy Temple",
      "rating": 4.7,
      "address": "3rd Phase, Housing Board Colony, Anantapur, Andhra Pradesh 515002, India",
      "reviews": [
        {
          "text": "We have booked function hall there for our engagement worst management ever.. Decorators was not responsive and workers are not responding if we faced problems there..coolers which they provided are not in a working condition and loose connections are there in the hall..worst ever …completely unsatisfied with the management… Think twice before you book function hall for your event",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sri Baktha Anjaneya Swamy Temple is a very nice and peaceful place. The idol of Hanuman is very tall it occupies 3 floors from ground. And Sai baba temple is also there with in the temple premises.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Gigantic Anjaneya swamy statue. Very pious and powerful temple... Peaceful darshan in evenings...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "So much loud voice\nHow can one keep such loud voice\nThere is one more temple near this temple some bambam baba\nDaily they sing loud songs disturbing everyone\nEver thought how irritating your loud singing of songs are\nCan’t you do quietly",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good peaceful temple.... Can spend peaceful  time with family.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Venkateshwara Swamy Temple",
      "rating": 4.6,
      "address": "MHCM+VRF, Ram Nagar, Kovur Nagar, Anantapur, Andhra Pradesh 515004, India",
      "reviews": [
        {
          "text": "The place is great and clean for the devotees of Lord Venkateshwara Swamy.\nOm Namo Venkatesaya",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited on Vaikuntha Ekadashi, the atmosphere was very nice.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pleasant darshan of Sri Balaji.Good devotional activities are conducted",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place for Devotion situated in Ramnagar Ananthapur district AP",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple with ancient dravidian style stone work on it.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tirumala Tirupati Devasthanams",
      "rating": 4.5,
      "address": "Tirupati Rd, SBI Officers Colony, Anantapur, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "Loved the place on top of hill, and as a fact yes the management prefers to send those who bought special tickets early into the temple and the remaining people has to suffocate in a jail kind of waiting rooms, when I went with my friend one guy got fits in the room and he bleeded , only after 15-20 mins the medical department arrived there , with that scene of worst management many people left without even visiting the temple including us, things need to be taken care.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Loved the place on top of hill, and as a fact yes the management prefers to send those who bought special tickets early into the temple and the remaining people has to suffocate in a jail kind of waiting rooms, when I went with my friend one guy got fits in the room and he bleeded , only after 15-20 mins the medical department arrived there , with that scene of worst management many people left without even visiting the temple including us, things need to be taken care.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good location...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place and peaceful location",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good place to enjoy the climate",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "C.S.I Holy Trinity Church - Anantapur",
      "rating": 4.2,
      "address": "MH9V+2X3, Aravinda Nagar, Sharada Nagar, Anantapur, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "The Church is very big and beautiful but out side the church is very dirty and not maintained. My advise is that  the authorities can make cement flooring and construct good washrooms and hand washing taps and drainage system well. Provide a care taker who can maintain the whole premises well and make an provision for the visitors and tourists to come and pray.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Peaceful place in Anantapur",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's such a wonderful church with even more wonderful spirituality.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's amazing church, the biggest in the Rayalseema region. Can accommodate more than 1500 people.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful Newly Constructed C.S.I  church .",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Sri Hari Hara Sri Lalitha Parameshwari & Satyanarayan Swamy Devalayamu",
      "rating": 4.5,
      "address": "MJ92+7Q2, Ashok Nagar, Anantapur, Andhra Pradesh 515001, India",
      "reviews": [
        {
          "text": "The temple has lord vishnu one side and lord Shiva at other side , the road outisde the temple was busy so inside the temple was good, parking facility was less , the temple art and architecture was good . place was peacful and some vibe was there when enter into the temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "An old divine Temple and a brand new Temple next to each other. Both temples are pious and peaceful. Satyanarayana vratham was being performed by priests on need basis. But the priest was skimming through his social media platforms while performing vratham, which is not fair. It downgrades the value and piousness of vratham. Prasadam was delicious by the way :-) Please do visit...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple is new. It was opened in 2020. Place inside temple is more. Archaka swamy performing pooja well. Outside parking place is more.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This temple located in Ashok Nagar. Very peaceful atmosphere and one should take blessings from Lalitha Parameshwari and lord Hari Hara. Newly Built Sri Sathyanarayana Swamy temple located adjacent to it. Very pleasant darshan in both Temples",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good devotional place. Lord Sree Sathyanarayana swamy temple. We can find rarerly and no such temple in Anantapur district. Performing Sathyanarayana swamy vratham every day.\nI have n't seen such a nice temple.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}