{
  "places_with_reviews": [
    {
      "name": "Chattabal chitargul anantanag",
      "rating": 4,
      "address": "P4JX+FF4, Banghidar, Anantnag, 192101",
      "reviews": [
        {
          "text": "Superb place pollution free environment",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Geologically very interesting, evolving landscape!",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A calm place to relax with fresh waters aside.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "The valley of Kashmir has unique geographical features. Being home to the rarest of natural beauties, Kashmir hosts some of the most wondrous places in the world. When we think of Kashmir, the first thing we visualise is the beautiful Shikaras in Dal Lake, the exquisite Mughal Gardens, the cascading Shrunz and Aharbal waterfalls, the magical Betaab valley, the stunning Sonamarg and the glorious Gulmarg. True, Kashmir being one absolute Jannat or heaven on earth is brimming with natural splendour in every corner, but you still have more places in the valley which are unheard of and unexplored yet. One among them is Chattabal, surrounded with serene Himalayan ranges and meadows of pine and fir.\nChattabal of Chitergul-Shangus area is just 32 km from district Anantnag and merely 20 km away from the famous Mughal Garden of Achabal, situated in the lap of Pir Panjal mountains. Chattabal is not really a name that many tourists know about. Not many people go in that direction, primarily because it is not high on the list of places to visit in Anantnag. The majority of the folks you will find up there will just be the locals from Anantnag or any of the nearby villages. The valley is replete with natural vegetation and flowers of wild nature. The vast green plains look like natural tapestries, as if spread by divine hands. It has two routes through which people can reach the place: one is from Achabal/ Shangus road, and the second is from KP road/ Kehribal.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "I can't describe the beauty of chatabal in words the fresh water, pure air and mountain covered with snow that is the most attractive view 🍁🍁",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Masjid Noor مسجد نُور",
      "rating": 4.6,
      "address": "P4QQ+GQ2 Masjid Noor, KP Rd, Nai Basti, Anantnag, 192101",
      "reviews": [
        {
          "text": "Best place I hve seen ever In this area",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a beautiful religious place to pray Namaz . Got the peace of mind here ✨",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I prefer to pray Nimaz-e-Jummah at Masjid Noor.\nGreat preacher is delivering sermon on Friday while listening his lecture  sinners eyes will get wet and heart melting.\nAlways my favourite.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's perhaps oldest masjid located on KP raid khanabl and now a days it's looking beautiful for its new construction  and popular for  large building also called Noor masjid",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I have always loved visiting and praying there. First time I prayed there was in the month of Ramadhan and I felt immense satisfaction.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Lal Chowk Anantnag",
      "rating": 4.8,
      "address": "P4JX+GV3, Mehman Mohalla, Anantnag, 192101",
      "reviews": [
        {
          "text": "Lal Chowk, meaning \"Red Square,\" is a prominent square located in the heart of Anantnag town in the Indian union territory of Jammu and Kashmir. It serves as a bustling commercial and cultural hub, attracting locals and visitors alike with its vibrant atmosphere and array of shops, markets, and eateries. Lal Chowk is not only a bustling marketplace but also a center of political and social activity, often serving as a venue for rallies, protests, and public gatherings. Over the years, it has remained a symbol of resilience and community spirit, embodying the enduring spirit of the people of Anantnag.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Lal Chowk in Anantnag, Jammu and Kashmir, is a bustling commercial center that serves as the main market area in the town. Known for its vibrant atmosphere, Lal Chowk is lined with shops, restaurants, and various businesses. The market offers a diverse range of products, from traditional Kashmiri handicrafts and textiles to everyday essentials.\n\nAs a central meeting point for locals, Lal Chowk is not just a marketplace but also a cultural and social hub. The area reflects the unique blend of Kashmiri culture and commerce, providing a glimpse into the daily life of the community. Whether you're exploring the market for shopping or experiencing the local lifestyle, Lal Chowk stands as a focal point in the town of Anantnag.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "🤨",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's nice to visit market place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Main market in town but has traffic congestion",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shiwala Mandir شیوالا مندر",
      "rating": 3.4,
      "address": "janlat Janglat Mandi Anantnag Jammu and Kashmir, P5G4+F56, Janglat Mandi, Anantnag, 192101",
      "reviews": [
        {
          "text": "A temple known since for decades. Though the structure remains closed all time. Few security personnel are seen guarding the structure. The name is most often used as a land mark than a place if worship because the residential Hindus don't seem to visit it.",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "My locality...... But poor road width....new bypass should be thrown open for public as soon as possible",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "This is age-old temple and locked out for decades. Few policemen kept gaurding the structure. No hindus in the locality so no rituals taking place for decades on.",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "Not in good condition. Needs renovation.",
          "languageCode": "en",
          "rating": 3.4
        },
        {
          "text": "It is a very historic and ancient temple",
          "languageCode": "en",
          "rating": 3.4
        }
      ]
    },
    {
      "name": "GHanTA GHaR",
      "rating": 4.2,
      "address": "Mehman Mohalla, Anantnag, 192101",
      "reviews": [
        {
          "text": "🔔 Ghar. Renovated clock tower in Lal chowk area of Anantnag.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Clock Tower is a charming landmark that adds character to the local surroundings. Its historical significance and intricate architecture make it a focal point for residents and visitors alike. The surrounding area offers a pleasant atmosphere, providing a glimpse into the town's cultural heritage. Overall, the Clock Tower enhances the aesthetic appeal of Anantnag and serves as a testament to the town's rich history.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Famous for its historic importance and for being the business hub of the city. GEE ENN Paper Emporium, the exclusive wedding invitation card store  of the city is located here at Badam Gali. Besides the area is also famous for sports items...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's nice place....smart City 🤠",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Really adding a metro taste to Srinagar City.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Swami Vivekananda Nagdandi Aashram",
      "rating": "Unknown",
      "address": "Swami Vivekananda Aashram Nagdandi, P4JX+CFV, Banghidar, Anantnag, 192101",
      "reviews": []
    },
    {
      "name": "Raghunath Ram Mandir Nagbal Anantnag",
      "rating": 5,
      "address": "P5J3+GWJ, Mattan Chowk, Anantnag, 192101",
      "reviews": [
        {
          "text": "Very old temple, depicting the cultural heritage of hindus. Temple also has sulphur water stream which is known to cure skin ailments. One gurudwara is also there within the same campus.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "I want to  know is there any stay faculty in this temple",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Very lovely good location 🤩",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jai Shri Ram🚩",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Highground Hill Anantnag Kashmir",
      "rating": 4.1,
      "address": "P5H5+X9X Janglat Mandi hill, Sheer Pora, Anantnag, 192101",
      "reviews": [
        {
          "text": "Public inconvenience is at a high level to reach this place.Requires alternative mode of transportation/path",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Best wiews of anantnag and I love this place I rate this 5 stars because I love this place and very beautiful wiew I love highground hill Islamabad I hope you visit I recommend you to visit this beautiful place very beautiful place",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Level crossing c2",
      "rating": 3.7,
      "address": "P3XX+JHH, Srinagar - Kanyakumari Hwy, Sar Suna Anantnag, 192124",
      "reviews": [
        {
          "text": "Railway crissing.... road overbridge work under progress.... after complete overbridge   road jaam tension will be finish ..",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Gud",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Lovely",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "🥰",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Nice places",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Andarnag Temple",
      "rating": 4,
      "address": "P5J3+HQ3, Reshi Bazar SherBagh Rd, Mattan Chowk, Anantnag, 192101",
      "reviews": [
        {
          "text": "In 2005 my self & mrs after visiting Amarnath from pehalgam ,reached Shrinagar from Baltal ,I was read some place about Raghunath mandir & about sacred water,but security was the main thing,after seeing Shrinagar all tourist places reached Shrinagar old bus stand,very small  so so ,got 407 mini bus for Anantnag ,in bus we 2 are the different faces other wise all Kashmiri apples,reached Ananatnag bus stand absolutely it was MT,sarrounding shops also closed,luckily one shop opened little, we went there,it was a punjabi sardarji,he took us inside the shop , asked about us & told why u came here,i explain him,he told dont say Raghunath mandir , say Sherbag,waited luckily a auto came ,we reached Sherbag.just adjacent temple ,steel gate was closed ,we nocked it was opened Army person came & enquired about us ,took inside entered our details in book after verifying our identity cards,then we went met temple acharyji he told to accupy any room in  near by 2 storeyed building built by wood only some portion of building was damage  by aatanki attack ,everywhere dust ,leaves  it was not cleaned  since long time as no visitors visited &xstayed here ,no power no light,cleaned room then had bath in sacred water tank,it was thrilling experience as some different type of flavour was in that water,evening with acharya ,2 other temple persons some army jawans gathered & had bhajan ,puja,8 pm light came,chapati,bhaji ,rice served from acharyaji , had slept,for 2 days water flavour was in our body recentle from google map only i came to know its name is Andarnag,next day from here went to Kokarnag ,Vernag return & stayed here 3 rd day left for Jammu,every place local people ask about us  and local conditions ,they were so co operative,some people even forced us to stay in their homes,for these places general tourist nor yatries  reach as it is not known .",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "This area is controlled by the security forces. The temple and spring are inaccessible to civilians",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Speciality due to ALMIGHTY ALLAH'S SPRING",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Awesome place for Hindu pilgrim.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4
        }
      ]
    }
  ]
}