{
  "places_with_reviews": [
    {
      "name": "Wonder Valley Adventure and Amusement Park",
      "rating": 4.2,
      "address": "No. 89, Chithirapuram P.O Anachal, Munnar, Anachal, Kerala 685565, India",
      "reviews": [
        {
          "text": "It was a very good deal packed with almost 20,25+ adventure and fun activities. needs little improvement in safety protocols specifically with the jeep that picks and drops you to the main gate.\nFew things to remember -\n1.They accept debit card or cash payment only. no UPI no credit cards etc.\n2. You will need good 3 to 4 hrs if you want to enjoy all the rides and the ticket counter closes by 5 and rides stops at 6.30 so plan accordingly and have fun.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "If you want to enjoy it much more than just zip lining, This is the place where you should go. There are a lot of fun and adventurous activities to do over here (around 25 activities). The ticket price for this place is ₹1k per person and most importantly they only take cash, so that's one thing you should keep in mind. For couples it's a lovely place as there are many things which can be done together",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "About this palace if you are adventure lover and you like to have fun. Than you have to visit ghis place you will find multiple activities of fun games approx 30.\nAnd one of the highlights is their last jeep safari after you finish your all activity they provide free jeep service to the exit it was a fun ride. Don't miss this ever",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Totally worth the price. The best part is you are free to choose what you want to experience and everything is included. There was np rush when we went and got a chance for all rides pretty easily. The crows is well spread out.\nIt was great fun overall.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This place is soooo fun!! The only downside is that the entry fee is Rs 1000 per person + GST. You can do all the activities once. If you want to go twice, you have to pay an extra fee.\n\nThe list of things they have: hanging bridge, zipline (2 people can go at a time. They take photos of you from the other side, so remember to smile. You can purchase the photos for 25 rs/photo), trampoline, activity centre with archery, gun shooting, darts catapults, mechanical bull, hamster wheel, and many more, slides, swings, 360° bicycle ride. They also have many rope climbing activities including riding bicycle on a rope.\n\nThey also have a huge balloon in the water that you can play in. They have a jeep ride and 12d movie at the end.\n\nThe best thing about this palce is the staff. They will take videos or pictures of you as much as you want. They are really kind and patient as you go through all the rides.\n\nAnother downside is that they don't have helmets for the rope climbing activities, or safety nets at the bottom. The ropes are pretty sturdy though.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Pettimudi Hill Top",
      "rating": 4.6,
      "address": "Idukki, Kerala 685561, India",
      "reviews": [
        {
          "text": "The place was so beautiful and clean that the birds were chirping the whole day, and we could hear peacocks singing from a distance. My trip to Pettimudi Hill Top  was a lovely experience, especially the climate of the place. It was a really great experience to visit a hill top for the first time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful to visit early in the morning. Good to plan if it rains on the previous night as you definitely get a chance to see and experience the fog from the top of the mountains. Actually it is a forest area and there is no proper way or roads. You need to trek to the heights.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good experience, very less crowded when we hiked. Only 2 or 3 people were there. But we found some difficulty in finding the path to start the hike. It's the only problem faced. The view was beautiful and while we were hiking a small rain was also there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If the sky is not cloudy, best choice to watch sunset 🥰",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is so nice to watch at sunrise.\nThe trekking of the place was moderate level and the ways are really nice.\nThere are no charges to enter this view.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kottappara Hilltop Viewpoint",
      "rating": 4.6,
      "address": "Kallar - Mankulam Rd, Munnar, Adimali, Kerala 685565, India",
      "reviews": [
        {
          "text": "Nice place, easy access and can reach almost near to the view point",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bikes travel to the top of the mountain. A great view of the sun rises. It is safe to stay in a tent at night . During the season cloud beds can be seen.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awesome place to visit with friends and family. Nice breeze and the view was mesmerizing. The way to the top was so steep old people might feel some uneasiness. Mostly jeeps can reach hill top.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful offbeat place, easy to climb to the view point and the peak. The view is amazing from here. I went here twice, first was just to see what’s around my hotel - Ela Ecoland and second day I went to witness the sunrise here. I was lucky enough to see a rainbow it was magical. Best place to hangout with friends, may be have a small picnic and enjoy the nature.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful view\nA place to must visit\nAfter a rainy day it is awesome\nThe mild sound of the water stream\nThe chill breeze and the green stunning view of mother nature was unforgettable...",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Karadipara View Point",
      "rating": 4.3,
      "address": "22P9+H9V, Kochi - Madurai - Dhanushkodi Rd, Kallar Vattiyar, Kerala 685561, India",
      "reviews": [
        {
          "text": "Karadipara view point is one of the best view point you can enjoy from the travel to munnar it was road side view point",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the view points in Munnar - i felt it is a bit exaggerated. Nothing much to explore here. Worth spending just 5 to 10 mins for a couple of clicks.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is a must visit place if you travelling to munnar or nearby places. The view from the hill top is amazing. The best time to visit would be before 10 AM - it isn't crowded or almost empty - you would feel this to be a private hill top where only you will be available.\n\nSuggest, to have a local guide to reach this place and take you to the view point. The climb is not hard - it's a easy climb when a good guide is available with you.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "No doubt a good view point but compared to other places in Munnar, its average. While i say this, its around mid Feb climate.\n\nIts got a view of the valley and beyond. However even from a photo perspective, I feel there are other places in Munnar with better views.\n\nThere are monkeys that venture around the road bend here. There is a small hotel (Highway restuarant, surprisingly charging Rs 10 for the photo view point 😀).",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the top view points in Munnar. Could be best enjoyed just followed by a rain. You can feel the cloud on your face & those distant mountain ghat ranges will be covered up by clouds. Best scenic place.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Cinnamon Gardens Spices Plantation",
      "rating": 4.4,
      "address": "Karadippara, Munnar, Kerala 685561, India",
      "reviews": [
        {
          "text": "The garden was a treat to the eyes and definitely a checkout for parents and family.\nMany thanks to our guide, George, we now understand Indian spices and their uses much better than before. He did an amazing job making the session interactive and fun with some humor in the mix. Given the quality of products, all of us did end up buying spices to take home.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Wonderful place, very well maintained.... The Guide was really knowledgeable & worth having him to explain the entire process & details. It was a real informative visit\n\nStill can feel the freshness of spice  we witnessed",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's worth a visit - go check it out.  The guide was very knowledgeable and friendly. It was really informative to learn about how different spices are grown, etc.\n\nNote, however, that you only get a tour of a selection of sample plants and not the full spice plantation. Still a decent selection in this vast sample area.\n\nI've taken one star off as there is an emphasis of ayurveda and plants used for ayurveda. They also have a section of the shop dedicated to herbal medicines. As someone who is not interested in these things, it was a part of the tour that could've been omitted.\n\nThe spice store is relatively small but sells all their organic produce. As it is organic, spices are expectedly on the higher side, but they are apparently of high quality.\n\nI'd set aside 1-1.5hr to visit this place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Mr George was our host who guided us through the plantations. He gave us all the details of various medicinal and floral plants. The outlet seems to be on a  little expensive side but the quality is premium. Must visit if in Munnar !",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Fantastic experience! Our guide, Purushotham was passionate and explained us everything in detail - with a great sense of humour. Highly recommended!",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Pettimudi view point",
      "rating": 4.6,
      "address": "2X8H+JHH, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "It's a nice place to watch sunrise and sunset. It's so relaxing calm and quite.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place offers distinct view of the nature.. hailing towards the top makes you feel like the path to heaven even though the way towards heaven is bit rough..  even the road to the peak is not smooth at all.. but all your tiredness will wave off once you reach the peak. It was js 4 in the evening but the peak was covered with heavy mist..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the Best view point in Kerala. Its located near Adimali. If you travelling to Munnar you should definitely try these spot. Its only 30-45 minutes climb the hill. If you climd in the early morning you can see the beautiful sunrise from here. Many people use tent to hang out here.\n\nThere is a 2,3 km peak road to get there. You should have good vehicle to get the parking area, or otherwise you have to walk to parking area on the top. We can see the cloud beneath our feet here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Pettimudi view point (also called koompan para) is located near Adimaly town.That is in-between the road to munnar from Adimaly. The best time to climb here is in the morning and evening. If you go in the noon, it will be terribly hot there. It is a bit difficult to climb. Be careful to climb the mountain. And let us keep this place plastic free. 😇",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Be aware this is forest department area, so if you carry items for your enjoyment and get caught then your are responsible for it. Apart from this it is a great place, a breathtaking view, avoid going during hot weather. Better gor early morning or before sunset. Boys usually travel here and put a tent to stay for night. I believe they see a one in a life time view during early morning and in night.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Adimali viewpoint from waterfall top",
      "rating": 4.3,
      "address": "2XC4+G9G, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Nothing great about this place\nDo not go by the online photos and reviews. The road is very steep and narrow even for a 4 SUV and not worth the effort. Especially if you are with family dont try.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The road is very dangerous. Its a narrow concrete road and its too steep. If you are new in this kind of road please be careful. 🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Adimali Waterfall, nestled within the scenic beauty of Google Map's location, is a mesmerizing natural wonder that captivates with its beauty. As I ventured to this enchanting spot, the journey itself was a visual treat, with lush greenery and winding paths leading me to the hidden gem.\n\nUpon reaching Adimali, the cascading waterfall unveiled itself in all its glory. The sound of rushing water, coupled with the refreshing mist that filled the air, created a serene ambiance. The waterfall's sheer force and the surrounding verdant landscape painted a picture of unspoiled nature.\n\nWhat sets Adimali apart is its accessibility via Google Maps, ensuring a hassle-free exploration for nature enthusiasts. The app's precise directions led me effortlessly, allowing for a seamless and enjoyable experience.\n\nThe picturesque setting makes Adimali an ideal escape from the hustle and bustle of city life. Whether you're a photography enthusiast seeking the perfect shot or a nature lover craving tranquility, Adimali Waterfall on Google Maps proves to be a hidden paradise worth discovering. The blend of technology and nature here provides a seamless journey to this natural spectacle, making it a must-visit destination for anyone seeking solace in the embrace of Mother Nature.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's such a nice place ,The whole Adimali town can be seen from the top. But highly not recommended for ladies because there are a lot of uncultured native people's there making fun of ladies.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Whater fall munaar Kerala\nTourist places near to hell",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kallar Vattiyar Water Falls (കല്ലാർ)",
      "rating": 4.2,
      "address": "2XMP+WG7, Kallar Vattiyar, Kerala 685561, India",
      "reviews": [
        {
          "text": "A very small waterfalls in Munnar. There was very little water when we visited in January. You can view the same from road and one cannot go near the falls.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A calm waterfall on the Aluva Munnar highway. There was no much water when we visited in Jan 2024. We can view the waterfall from a distant road and we are not allowed to go near the waterfall. There is a footpath on the road where we can stand and view the waterfall and click some lovely pics. Nothing very exciting about this waterfall - worth spending just 5 to 10 mins.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Road side water falls. Bigger one . On the way to Munnar road . Beautiful 👌 . These many waterfalls welcomes you to Munnar 😍. Everywhere waterfalls on the way to Munnar",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A beautiful waterfall to visit. Its 500 meters downhill from main road but you can walk down or take a Jeep ride.\nThere is also a cave on the way.\nViews are stunning a d you can easily dip your feet too in the water. Due to Rock formations nice place for insta worthy pics.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "If you are passing through this place. Just stop by and take a picture, relax and resume your travel.\n\nThis small waterfall is located near the roadside so no need for much walking also. We can just stop and enjoy the beauty and resume our journey.\n\nMost of the time we will get roadside parking as it's not very popular and people won't stop by much.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Hi Range Elephant safari",
      "rating": 3.7,
      "address": "2276+PF8, Iruttukanam, Kerala 685561, India",
      "reviews": [
        {
          "text": "My wife and I had a great time. Waited about 45 minutes, payed 700 each.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "The elephant ride here is slightly less cost (600rs per head) than the other elephant ride places(700rs per head). Here there is no saddle is placed on the elephant and so it gives more natural experience. We need to grip with the rope tied on the elephant's neck. The elephant ride will be 10 to 15mins on a slope and it was great experience. Must try in munnar.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "First time went for elephant ride and the experience was not that good. The elephants were not properly kept. They looked old and under-nourished. Also one elephant was saddled and the other was not.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Horrible Experience. No safety measures and just a thin rope for support. They say 10 min Safari and just ride for 50 meter and rest of time spent on photoshoot. That too very expensive even in non season period. Rude staff and support.\nStrictly not recommended. I wish I could have an option to rate 0 Star.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "The price seems to be a little too much for a 5-10 min ride. Same price is charged for kids as for adults. They were also charging if you want to feed something to the elephant. 200/- per banana. Probably the most expensive banana I have ever seen😞",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Adimali Town Juma Masjid",
      "rating": 4.4,
      "address": "2X83+C6P, Aluva - Munnar Rd, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Located on the highway to Munnar. It's a boon for tourists. Easy to spot with sufficient parking too. Well located in the town with nearby restaurants for quick bites. Well maintained.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Super clean restroom. Ladies prayer hall is available. Very nice place to have a short break in the middle of town",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This masjid is very big and well furnished in Adimali. When going to Munnar best place to refresh and pray. 24 hrs toilet facility available here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This Masjid isVery helpful for travelers to namaz and take relief because its nearly to high way.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I felt Alhamdulilla reaching this mosque. Its Juma mosque near to bustand. Especially for tourists this is best place to pray if you are on the way to Munnar. Got clean washrooms n chilled water for Ablution.\nDont miss out to eat kanji (watery rice) from hotel wn u get down from mosque.. if you are there during afternoon..it was too good. Especially wn the climate is cold. Its just adjacent to mosque . I don't remember the hotel name.. guess its hotel arafa.. small hotel",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}