{
  "places_with_reviews": [
    {
      "name": "Vaikom Mahadeva Temple",
      "rating": 4.8,
      "address": "Vaikom, Kerala 686141, India",
      "reviews": [
        {
          "text": "Beautiful Shiva Temple, must visit when you are in Kerala! Very peaceful atmosphere😇\n\nNote - Men have to remove their t shirt inside the temple!! Prefer wearing only dhoti if you are going to visit!\nWomen mostly wear traditional wear! Avoid western wear if possible!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Large Shiva temple with beautiful intricate carvings not only on walls but even on the pathways.\nContinuous chants of Shiva Shiva by devotees, mostly dresses in black and doing parikrama.\nParking opposite to temple entrance",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very old temple believed to be consecrated during Tretayuga, the rituals and customs has been set by Parasurama maharshi.\nTemple architecture is unique\nwith the fascinating mukha mandapa, sculpture work, oval Sree Kovil, big balikkall, namaskara mandapa.\nAnybody who is interested in ancient Indian architecture, cannot afford to miss this temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is a place where one can find solace, harmony, and a sense of inner calm. The atmosphere is often imbued with spirituality and reverence, creating a space for contemplation, meditation, and deep introspection. You can experience a profound sense of peace escaping from the hustle. Everyday the temple provides sadhya including payasam to all the visitors.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It is one of the oldest temple in Kerala. The temple is a historical spot. Dedicated to Lord Shiva. Vembanad lake and Kumarakom is nearby. Very famous temple. Temple is located in kottayam district. Temple is famous for Vaikom Ashtami festival. Lord Shiva is called as 'vaikkathappan'. Very crowded temple. Always want to wait for darshan. One  of the biggest temple also. Vaikashtami is usually during november and december months.  Wedding ceremony also conducting here. A must visit temple. Suitable time to visit the temple is early morning or evening time. Temple entrance towers is in four sides.❤️ good nature beauty also🌿🌿🌴🌳❤️🥰",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "St. Mary's Church Kudavechoor (Vechoor Church)",
      "rating": 4.7,
      "address": "MC95+2H2, Church Road, Vechoor, Kottayam, Kumarakom, Kerala 686144, India",
      "reviews": [
        {
          "text": "Visit and be blessed with the grace of Kudavechoor Muthi.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kudavechoor church is famous for miraculous picture of mother Mary, and believed to be a true copy of St. Luke's portrait of Mary..the picture is placed in the altar of the church,and the miraculous picture was more than 600 Years old.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ancient Church. Miraculous experience at our visit. We recited a rosary and a priest came in and asked us a few questions and opened for us ancient Mother Mary's painting hid in the alter behind. Then he was in a trance asked Salini teacher, one of our colleagues, if she had knee pain, we know she was terribly suffering from knee pain. It has shaken all of us.\nThe Church had a long past history. The Vebanad lake view near adds scenic beauty to it.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the old church .... More than 550 years old. Ancient architecture ad building structure....\n\nHospital is available nearby\n\nRestaurant also available\n\nGood ambience with calm and quiet place. Lake side view also worth to see.... Accessibility from the road is also good with enough parking space\n\nWorth to visit this location",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its a very old Church located at Vembanad lake side at Vechoor area. The church has large compound, parish hall, church administration office inside the complex.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Vaikom Fish Farm And Aqua Tourism Pvt Ltd",
      "rating": 4.3,
      "address": "Near, Attara Bridge, Thittakom, Vaikom, Thalayazham, Kerala 686607, India",
      "reviews": [
        {
          "text": "We stopped here whilst out on the river for the day for both mid morning 'breakfast' and lunch early afternoon. The staff working here are really lovely and freindly. The food was delicious and freshly made, then served on a banana leaf! In the afternoon there were local school children visiting too, it was nice to see when enjoying the river and nature too. It you are travelling this way be sure to stop by, I'm confident you'll enjoy a visit.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a very old property, better to reach their own vehicle instead public transport, it's bit inside the main road...completely fishing poultry... We opted basic package of inr 400 not at all worth, consists only four games which play in beach side... Food is ok with only non-veg of curry fish...tea and snacks extra charges which is not at all worth for the cost... For 400 certain boat games is not at all interesting, literally not worth for the cost...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place to visit. You can see varieties of fishes and you can catch fishes. Kids play area is there. You will get a welcome drink and will get lunch. Not sure about evening snacks. Timings are from 11 to 6. Mr. Vipin explained everything about the fishes in the aquarium. Staffs are very friendly. As I visited on a weekday there was no rush.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We went there today\nIt was really a wonderful experience\nMrs Geetha was our guide\nShe explained everything in simple detail way\nThe owners of the farm were also very friendly\nThe time spend there qas worth  and we would visit again",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We visited as a family - it was an amazing experience - seeing all the fish being farmed in a caring and safe environment.  We had lunch there - each dish was explained to us (there were over 20 different dishes making up the meal) and it was obvious that the meal had been freshly cooked using quality ingredients.  The Shell Museum was also fascinating.  A great day out.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "MoothedathuKavu Bhagavathi Temple",
      "rating": 4.7,
      "address": "T V Puram, Moothedathukavu Rd, Vaikom, Kerala 686606, India",
      "reviews": [
        {
          "text": "A great place with a lot of history and innocent people. The ambience is really good. A limited parking space is there. The utsav here is really something that has to be witnessed including the villadicham pattu, Garudan thookkam, Theeyyattu and much more. It is said that the temple's history has a direct connection to Madurai.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the second time I have been to this temple. It is one of the oldest temples in Kerala and is 5 kms away from Vaikom Mahadeva Shivan temple. There is limited parking 🅿️ space for your vehicles 🚗🚘🚙🏎️🏍️🛵🛴🚲. The parking space is not covered and your vehicles will be out in the rain ☔🌧️⛈️🌨️🌧️🌦️ and the sun🔥🌟⭐🌞🌝☀️. It is a very good place to go with your family and friends.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This God is parathy devi  . There are nagadevas and some other upadevas as well. While we were there, there was a talk going on , about Kali Matha. Temple was decorated well and we saw devi very near. Deeparadanai and darshan was easy today.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A very special temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "As she is my kuladeivam I am a frequent visitor to the temple.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "St. Thomas Church Kokkamangalam",
      "rating": 4.6,
      "address": "M9MG+63Q, School Road, Thanneermukkom, Kokothamangalam, Kerala 688583, India",
      "reviews": [
        {
          "text": "The pilgrim centre claims to be one of the churches established by St. Thomas the apostle and is famously called as the ezharappally. The church also boasts of a cross established by St Thomas himself. The church is a spacious structure with beautiful works of art and architecture. The view of the lake from the church yard is a mesmerizing experience. The community there is one of the earliest Christian community in the country with a legacy from 52ad itself.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "St. Thomas sailed to Kokkamangalam where he preached the gospel for about a year.[4] 1600 people converted to Christianity through him according to the narration in \"Rampan Pattu\", an ancient form of Christian folk-song prevalent in Kerala.He formed a Christian community at Kokkamangalam and enshrined a Cross for the faithful.This cross was later cut off by saboteurs, and thrown into the Lake Vembanad, through which it floated up to Pallippuram, where it is enshrined.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Church established in AD 52 by st Thomas. Good religious place with good ambience. Clean and tidy.  Divine atmosphere. Beautiful view to vembanad lake from the church compound",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A calm and peaceful place with a beautiful view of the canal behind the church. It's a historical place of great significance for the Christians as it is one of the churches out of seven and half churches or the Seven and a royal church that was established by Saint Thomas apostle in Kerala.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Kokkamangalam Church is a 1st century church believed to built in 52 AD which is among the seven churches in Kerala founded by St. Thomas the apostle..the historical church gave us a special feeling when we came to know that Apostle St. Thomas was here for some time preaching (almost one year) and also saw the cross (the original one is at Pallipuram now) erected by St. Thomas.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ullala Omkareswara Temple Navathy Mandiram",
      "rating": 4.2,
      "address": "Ullala, Thalayazham P.O, Ullala Rd, Thalayazham, Kerala 686607, India",
      "reviews": [
        {
          "text": "It is a highly uncommon temple that follows Advait philosophy. This temple bucks the trend by having a mirror as its idol, instead of the usual practice of consecrating idols! In 1927 June, Sree Narayana Guru, a renowned saint-scholar from Kerala, blessed the Ullala Omkaraswaram Temple on Vaikom Kumarakom road with a mirror. This temple is picturesque and many people are drawn to its tranquil atmosphere. Special Poojas take place every Thursday.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is one of the rarest temple with Advait philosophy in practice. This temple has mirror as the idol defying the known norms of consecration of idols!!And this consecration is done by Sreenarayana Guru a saint scholar of repute in Kerala.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Regular temple with good atmosphere",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Ullala Omkaraswaram Temple one of the beautiful temple situated in Vaikom Kumarakom road ...\nTemple has look very nice to stand inside its peaceful atmosphere , lots of peoples are visiting this temple......",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good atmosphere 😊.. visit here for peaceful atmosphere",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "St. Joseph’s Syro-Malabar Forane Church",
      "rating": 4.5,
      "address": "P9GR+98W, Vaikom, Kerala 686606, India",
      "reviews": [
        {
          "text": "The church was established on 1391.\n*Now the church is under reconstruction and will be inaugurated on 3rd May 2022.\n*The church is near to the vembanadu lake ( vaikom kayal ). When you visit the church don't forget to go near the lake.\n*The way to church from the road is also beautiful, coconut trees are planted in both side.\n*The bells here are brought from France.\n*The church have enough space.\n*An average parish hall.\n* After corona there are very few buses on this route.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is the Syro Malabar Church. It belongs to Ernakulam Angamaly Arch Diocese. It is little far from Vaikom town. It is facing the back waters. Nice view...Church is just renovated.  Super look.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful Church St Joseph Syro Malabar Forane Church Pallipurathussary vaikom esstabilshed AD1391",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Went here for a betrothal. Place is vast n convenient enough for a church and associated activities. There's a stretch of walkway in the back of the church that extends to the backwaters/river(?). It's a splendid view from there into the nature.\n\nThe inside of the church has been preserved of its old times I guess n that translates to a special vibe that u get in historical structures. Good peaceful mass.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Situated to the interiors, away from the city, It's an old building with serene atmosphere. Ample parking facility, large prayer area and a medium sized parish hall mark this church. Towards the back of the church there is a good view towards the lake. So if you are visiting this church, you must definitely visit this view area",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "T. V. Puram Saraswathi Temple",
      "rating": 4.5,
      "address": "P97R+MJP, TV Puram Rd, Vaikom, Kerala 686606, India",
      "reviews": [
        {
          "text": "One off the famous saraswathy God temples located kottayam district",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A temple which is located at a peaceful area in vaikom.It is known as \"DAKSHINA MOOKAMBIKA\".The temple gives you extreme happiness once you pray there.It is one of the best temples for a child to start his learning career...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "T.V.PURAM SRASWATHI Unique Swayamboo temple of Godess Saraswathy sitting on Hamsa having Veena, Akshamala, Grandham and Amrutha kumbham.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very famous Devi temple. Goddess Saraswathi is the prethishta here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "St. Gregorious Church, Thottakom",
      "rating": 4.4,
      "address": "PCP3+XXG, Thalayazham, Kerala 686606, India",
      "reviews": [
        {
          "text": "Church in Vaikom. And Fr. Varkky Kattarath`s Tomb is situated inside church. And there is a divine retreat near named as De Paul Divine Retreat",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "St Gregorious  church Thottakam established on 1904 Church belongs to vincentian congregation It is a Syro Malabar Parish Church",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "St.Gregorious Church Thottakam its a Roman Catholic church under Vaikom Forane in Ernakulam Angamaly Dioces.Very Beautiful autmosphere to pray and meditation.Very special thing in this church Tomb of Rev.Fr.Varkey Kattarath VC the founder of Vincecian Congregation.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Tomb of Rev. Fr. Vakey Kattarath VC, the founder of Vincentian Congregation is here. Many people come here to pray at his tomb and many testifies that there is blessings through his intercession. He was a great man of prayer and apostle of God's love for many people.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "As usual as other churches.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Thottakam Church തോട്ടകം പള്ളി",
      "rating": 4.4,
      "address": "Thottakam, Vaikom, Thalayazham, Kerala 686606, India",
      "reviews": [
        {
          "text": "Staring point of vincentian congregation. This church is a heritage of catholic church where venerable fr. Varkky Kattarath's tomb situates",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is century old church. It isaara maintained by Vincentian fathers. The founder father Blessed Varkey achan is entombed here. It is really a church one feel devotion.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful Church established in 1904 Church belongs to vincentian congregation",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small church under Vincentian congregation. Infact the Vincentian Congregation was started on 20 November 1904 at Thottakam by Fr. Varkey Kattarath, Vicar of Vaikom, with three diocesan priests.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place for prayer, it's a  Roman catholic Church",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}