{
  "places_with_reviews": [
    {
      "name": "Gunaseelam Sri Prasanna Venkatachalapathy Temple",
      "rating": 4.7,
      "address": "State Highway 25, Next to Syndicate Bank & ATM, Gunaseelam, Tamil Nadu 621604, India",
      "reviews": [
        {
          "text": "Gunaseelam Sri Prasanna Venkatachalapathy temple is one of the most sacred and divine places in India.\n\nThere is a common belief that, people with any sort of mental health challenges will be healed or cured by visiting Gunaseelam Sri Prasanna Venkatachalapathy temple.\nThe temple here is clean, easily accessible by road.\n\nGunaseelam village is located in Musiri taluka of Tiruchirappalli district. Approximately 24km from Manicka Vinayagar Temple, Malaikottai.\n\nThere is a mess on the way to the temple, which is good, and I feel it's better than other messes or hotels around that place to eat.\n(Name of the mess: Sankar Kaapi and Srinivasa Iyengar Kaapi Club)\n\nBook a slot in advance if you are wishing to sponsor an Abhishekam for God and for any such rituals too.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "You need to buy token . No free dharsan . It is only at 12:30-1:30PM.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ancient temple, The Lord was majestic and powerful with positive vibes. A must visit for all Perumal devotees.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Pongal festival in gunasheelam temple 15/01/2024 I'm and my family fast time",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the priests at sanctum exhibited a bad temper. Priests, whatever be their personal grievances should be polite to devotees, especially senior citizens.\n\nI visited the temple on a weekday, with no rush/waiting at all. Absolutely a tension free day.\n\nI am neither a politician nor a big wig to expect big respect, But as a senior citizen of 77 years, I can expect normal courtesy and regard as applicable to an old person of average means.\n\nI do not wish to pursue the matter, let whatever happened be forgotten and forgiven by  Lord Prasanna Venkatesa.\n\nI Resolved to never again visit this temple, even though it is my Kuladeivam.\n\nI will be content to worship Sree Prasanna Venkatachalapathi from my home,  TILL SO LONG AS I AM ALIVE",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Mukkombu Tourist spot",
      "rating": 4.2,
      "address": "Mukkombu Dam, Karur Main Rd, Tiruchirappalli, Tamil Nadu 639101, India",
      "reviews": [
        {
          "text": "Stunning beauty...place where kauvery river divides into kollidam and cauvery.....and the starting of srirangam island...north side kulithalai NH 17 km from chathiram bus stand ...south side namakkal NH 22 km from chathiram busstand ...amazing views parks ... bathing space ....really awesome spot must try spot ....now water is coming...go out and chill",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place for one day trip.it will be very busy on Sundays as tourists from Nearby will be visiting on large numbers,  Saturdays are good for the trip as it is not heavily crowded. There are many rides and attractions are there it is good for kids to enjoy.\n\nAlso u can enjoy ur time in dam water too, very satisfying during summer season.\n\nRides, mini train needs more improvements as it is seems old.\n\nEasily accessible through public transport like bus and train.\n\nHot samosas,  Bajji available in canteen.\n\nOverall good 👍 experience.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The park area is very huge. Children play facilities are available. But maintenance is very very poor. Gardening must be improved. One can compare this area with world class parks provided it is improved a lot. A finest place which should be made prominent throughout the world after the new dam works are finished and after necessary improvements in the existing garden.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It used to be more greenary few years ago but now its not. Thats good in a way people knows why :-) . Atleast trees are maintained and added lot of fun games from kids to adults. Definitely a good spot for one day outing with family or with friends.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Visited recently with family...We can take bath in river which is good but rides and playing area are not maintained properly. Authorities should take some action in maintenance",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mukkombu Dam Trichy",
      "rating": 4.3,
      "address": "VHPH+VWX, Kollidam Flood Bank Rd, Andanallur, Tamil Nadu 639115, India",
      "reviews": [
        {
          "text": "Go with your family/friends and get some breeze.\nThere's a park nearby for kids to enjoy\nWent on a nice climate, liked it.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Visited Mukkombu dam with family on a weekday. The fact that there aren't many people is a plus, but there isn't much to do as well. First and foremost, there is plenty of parking, so don't worry if you're coming by car. Once you pass through the entrance checkpoint, there are two large children's parks on either side. I'm not sure if it's just on weekdays, but the right side park was practically deserted, filled with stray monkeys. There were few visitors and children playing in the park on the left side.\n\nIt is necessary to mention that the maintenance of the playing equipments is inadequate. The water slide was rusted and inoperable. The swings and a few slides are in good condition. The train that circles the park was not running. However, a few small paid rides were available for both children and adults. There was only one basic canteen selling tea/coffee and packaged snacks. But beware, there are a lot of hungry stray monkeys lurking around, ready to grab anything they can get their hands on. They approach people very close because they are used to seeing them. So it's not a good place for a family picnic with food.\n\nThe only plus is the stunning view of the dam and the flowing Cauvery River. Avoid peak afternoon hours because the slides/swings are too hot for kids to use and even strolling on the dam can be dehydrating. Evenings are the only times when things can be enjoyed but the park closes at 6 p.m. sharp, and everyone is chased out starting 15 minutes prior.\n\nThis review is based on my visit during the weekday. I'm not sure if things are different during the weekends. However, some of the information is generic, so plan your visit accordingly. Because a portion of the dam is also under construction, I would suggest visiting the nearby Butterfly Park for engaging kids and peaceful walks without worrying about monkeys!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place to Hangout with family and friends.\nWhere are children's play area.\nThere is a spot on the River side to indulge in some light swimming or a dip into the river.\nThere is also some amusement rides for kids and adults.\nWhen there is water you will find people catching live fish from the reservoir and selling.\nI an old barrage for water storage and irrigation.\nAlso known as Upper Anicut on the river Kavery.\n\nProblem i noticed is that people litter and make the place dirty.\nIt could be better managed and maintained for a better experience.\n\nEntry Tickets for Persons in 4 Wheeler Rs.10 per head.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I was driving to Pollachi via this route. Entered into road leading to this spot from Samayapuram junction and finally joined Trichy karur highway through the road above the dam. There are 2 dams nearby. Road on dam is very small such that crossing over of 2 cars have to handled very patiently & judgefully. The dams, park & 2 rivers in the area is sight to watch. Very relaxing experience.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Kind of picnic spot.\nEntry fees per person ₹5/- , car/bikes they allowed according to the rush that particular day.\nJust for a Sightseeing place for couple of hours. Nothing much to explore.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "SCN003 - Paraithurainathar, Tiruparaithurai,Padal Petra Temple",
      "rating": 4.7,
      "address": "VHM7+PFX, Nagapattinam - Coimbatore - Gundlupet Hwy, Thirupparaithurai, Tamil Nadu 639115, India",
      "reviews": [
        {
          "text": "I was told that the Suyambu Lingam in this temple isn't man-made; it's a natural wonder.\n\nAll four Saivite saints have sung hymns in this temple, making it a Padal-Petra-Stalam, thereby rendering it one of the crucial temples to visit in Trichy.\n\nThe verse in this temple implies the significance of carrying out one's responsibilities with diligence and bravery, despite encountering challenges and obstacles; mentioning Thiruparaithurai as the sixth battlefield suggests it as a crucial arena where personal struggles are confronted and overcome.\n\nConstructed during the Chola period nearly 900 years ago, it was renovated during the reign of Naagappachettiyar in the Kadava dynasty era.\n\nThe sanctity of this temple is epitomized in the Nandi Mandapam.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the oldest temple situated on the banks of river kaveri. A peaceful temple which usually doesn't have crowd.\n\nIt has a big car parking very near opposite to the temple.\nThe temple needs good maintenance as it lacks many amenities.\n\nMany local PPL gather and recite slogams,there was no gurukkal when we entered the temple.\n\nIt has history related with some medicinal purposes linked with curing of cancer and other skin diseases.\nMust visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "MYTHOLOGY :\nThe region was once known as Tharukavanam. The sages of\nthe place were too proud that they were supreme in all\naspects. Their wives excelled them in pride thinking that they alone were chaste and most beautiful. Lord Shiva and Lord Vishnu decided to teach them a lesson. Lord Shiva took the form a handsome beggar Bikshadana while Vishnu appeared with alluring beauty as Mohini. While the Rishis were enticed by the beauty of Mohini and followed Her, the Rishi Patnies(wives) followed the beggar shedding their chastity pride.\nSeeing their wives following a beggar, the Rishis understood\nthat there was some magic and began to chase the\nBikshadana and fought him with all the skills they had but\nfailed and were defeated. They understood that the\nhandsome beggar was none other than Lord Shiva, fell at His feet and begged His pardon. Lord Shiva\nbecame their Guru and appeared here as a swayambumurthy.\n\nTEMPLE SPECIALTY :\nLord graces here as a swayambu Linga. The rays of Sun fall on\nthe Lord on 18th Purattasi (September-October).\n\n17-05-2023\nHIDDEN JEM TEMPLE IN TRICHY.\n👉I LIVE ON MUTHARASANALLUR AND HAVE VISITED THE TEMPLE FOR THE FIRST TIME IN 28 YEARS.\n👉UNIQUE ARCHITECTURE AND SYMMETRY.STRAIGHT LINE TO WOMB CHAMBER SEEN.\n👉THIRD BIG TEMPLE SURROUNDING AREA. REMAINING TWO TEMPLE MUST VISIT PLACES.\n👉HUGE LAND COVER RELAXATION PLACE AND FULLY COVERED PLANTS.\n👉ADVANTAGE  3 TEMPLE LOCATED HIGHWAY SO QUICKLY VISIT MOVE ON.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "In ancient times, this region is believed to have been densely covered with “Parai” trees. The Shivalingam of this temple was found among the Parai trees and this temple was later built around it. This temple’s “sthala viruksham” is also the Parai tree. Generally, the names of temples that are located on river banks end with “Thurai”. Following this tradition, as this temple is situated on the banks of the river Kaveri, it gets the name Paraithurai.\n\nIn Sanskrit, Parai tree is known as “Dharuka Viruksham”. Hence, the historical name of this place is Dharukavanam.\n\nThere are 83 stone inscriptions in this temple which date back to the periods of Paranthaka Chola-I, Rajakesari Varman, Sundarapandiyan and Krishnadeva Maharayar.\n\nThis temple is under the administrative control of the Hindu Religious and Charitable Endowments Department of Government of Tamil Nadu\n\nLEGEND:-\n\nThe legend of this temple involves some arrogant and very egoistic sages from a place called Dharukavanam. In their excessive vanity, they thought themselves to be superior than gods. To teach them a lesson, Lord Shiva asked Mahavishnu to take the form of “Mohini” (a beautiful angel) to divert the attention of the sages from their penance which they claimed was unparalleled. It is believed that the sages failed in their penance because they were attracted by Mohini. At the same time, Lord Shiva took the form of Pikshandavar and went to the sages’ house to ask for alms.  It is believed that the wives of the sages were so enamoured by Pikshandavar that they started following him. This incident further shattered the sages’ claims that their wives were most pious and devout.\n\nWhen the sages realized that this was all a play by Lord Shiva, they decided to perform a Yagna and used evil spirits and mantras to kill Lord Shiva. They failed in all their attempts and realized that it was a mistake to try and fight against the lord. The sages understood that learning all the mantras and Vedas was not for their self- preservation but was instead a way to promote the welfare of humanity. They surrendered to Lord Shiva and sought his blessings.\n\nIt is believed that Kuberan, Indran and Saptharishis have worshiped the lord here.\n\nDEITIES IN THE TEMPLE\n\nOther than the shrines of Shiva as Paraithurai-nathar and  Parvathy as Pasumpon Abayamangai, shrines of Valampuri Vinayakar, Murugan with his consorts, Nataraja, Somaskandar, Bhikshandavar, Mahalakshmi, Gajalakshmi, Pancha Bhootha lingams, Saptha-mathas, Iyanar, Nalvar, 63 Nayanmars, Kangalamurthy, Mahavishnu, Mahalakshmi, Durga Lakshmi, Bairavar and Navagraham can be seen in the corridors.\n\nIn the “koshtam” (place surrounding the sanctum sanctorum), idols of Narthana Vinayakar, Dakshinamoorthy, Arthanareeswarar (in place of Lingothbavar), Brahma, Durgai and Chandikeswarar can be seen.\n\nSalient Features\n\nLord Shiva (as Bhikshandavar) graces in the hall (Mandap) as the procession deity. The 12 zodiac signs are drawn on the roof of the mandap. It is believed that worshipping Lord Shiva and Lord Pikshandavar by standing under the zodiac signs would relieve devotees of all adverse effects caused by the position of planets in their horoscope.\n\nIdols of Lord Murugan are housed in two separate shrines. In one of these idols, he is depicted as Sri Dandayuthapani and in the other he is shown having six faces.\n\nIn the pillars in front of the Goddess Parvathy’s shrine, beautiful sculptures of Lord Oorthuva Dhandava Murthy and Goddess Kaali can be seen.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Padal Petra sthalm. Near to Kaveri. Small but very beautiful and old temple.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Vishnu Temple",
      "rating": 4.8,
      "address": "VHXJ+9MW, Trichy - Namakkal Rd, Kariyamanickam West, Tamil Nadu 621204, India",
      "reviews": [
        {
          "text": "Very ancients temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Good temple",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Power",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Superb",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Navagraha Temple",
      "rating": 4.5,
      "address": "VJ8Q+QGQ, Kudi St, Palur, Tamil Nadu 639101, India",
      "reviews": [
        {
          "text": "Sri navahiraka temple Pazlur is told to be 1000 years old.\nPandiya Dynasty built it.\nAnd now maintanence work is in progress.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "My very soul lies here ..my father a v sridharan ancestral home town\n\nGrandfather venkatraman railways\n\nTears of ecstasy run to this divine town\n\nOh Sri lord Krishna one birth I want to live with my father here",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Sri nageshwara temple situated at Trichy karur road . Very famous Navagraha temple. Lot of mini bus available in Trichy central. Road condition is very poor.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice place Here all the navagraha are sitted along with there pairs\nThis is the one speciality of this place\nTo reach this place you need to cross the railway under ground bridge.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The old temple, which is build during Pallavas period. The maintenance is not sufficient. Near by small village People have selling pooja things.  Navagirahas are special here they are giving blesses with their consorts. Very attractive place where near by River is superp.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mukkombu(முக்கொம்பு) New DAM And Tourist places( சுற்றுலாதளம்)",
      "rating": 4.7,
      "address": "VHVM+439, Vaathalai, Musiri, Andanallur, Tamil Nadu 620101, India",
      "reviews": [
        {
          "text": "This is a barrage across River Cauvery from which Cauvery River and Coleroon River divides and forms Srirangam Island. The place is beautiful to visit during October and November months.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "❄️Cool 🥰place every 🖤 one must visit🙏🏻💥💥",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Excellent place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful area",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kaasi Vishwanathar Temple",
      "rating": 5,
      "address": "VHVX+P7G, Kariyamanickam East, Tamil Nadu 621213, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "அருள்மிகு பசும்பொன் மயிலாம்பிகை சமேத பராய்த்துறைநாதர் திருக்கோயில் திருப்பராய்த்துறை.",
      "rating": 4.7,
      "address": "VHM7+MCM, Thirupparaithurai, Tamil Nadu 639115, India",
      "reviews": [
        {
          "text": "Nalbar life size statute is seen here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I was a student of vivekananda school. We always visit this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🆗",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "So peace...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Well maintained historic Temple",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "PRITHIYANGARA DEVI TEMPLE",
      "rating": 5,
      "address": "Sri Prithiyangara Devi Temple, Kulumani, RHVV+96Q, Taluk, Srirangam, Tiruchirappalli, Kulumani, Tamil Nadu DT – 639103, India",
      "reviews": [
        {
          "text": "Very powerful Amman..\nStatue looks like real mother standing ...🙏",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Powerful temple",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Prithiyangara devi temple more powerful temple",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    }
  ]
}