{
  "places_with_reviews": [
    {
      "name": "Kukudanga Picnic Spot",
      "rating": 4.3,
      "address": "V4MW+7GP, Angul - Talcher Rd, Nalco Nagar, Kukudanga, Kurudol Kurudul part, Odisha 759123, India",
      "reviews": [
        {
          "text": "Nice place to visit for chilling with family and friends.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good places angul ❤️😇\nI love kukudanga picnic park spot",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The place may be dengerous.But the place is awesome.Natural views, Mountains,Park, Rivers is mind blowing",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peaceful riding on the place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Food quality is okay type not Bhubaneswar city level.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Nalco Nagar Masjid",
      "rating": 4.7,
      "address": "R4XX+4XW, Nalco Nagar, Angul, NALCO, Odisha 759145, India",
      "reviews": [
        {
          "text": "One of my best mosque in angul to nalco peace and best place for namaz... Friday time 1:30 ... Plz go for namaz regularly... Allah hafiz...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very good & peace environment.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the most calm, peace & green environment phenomenal masjid",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Masjid is located in a very peaceful place. Muslim brothers seen offering namaz here.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Fantastic place.very peaceful area",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Jagannath Temple Nalco Nagar",
      "rating": 4.7,
      "address": "V525+WG8, Nalco Nagar, Angul, Odisha 759145, India",
      "reviews": [
        {
          "text": "The Jagannath Temple in NALCO Nagar, Angul, stands as a beacon of spirituality, its majestic architecture and serene ambiance offering a welcome respite from the everyday hustle. The sprawling complex exudes a palpable sense of peace, drawing devotees and seekers alike with its quiet charm.\n\nHowever, a closer look reveals that the temple, while beautiful, suffers from a lack of recent development and upkeep. The Bhujanalaya, once a vibrant space for prayer and gatherings, now shows signs of neglect, yearning for restoration and revitalization. The verdant grounds, though spacious, could benefit from additional greenery, with fragrant flowers and strategically placed gardens further enhancing the serene atmosphere.\n\nImagine stepping into a courtyard adorned with vibrant marigolds and hibiscus, their fragrance mingling with the sacred hymns. Picture manicured gardens offering pockets of tranquility, inviting quiet reflection amidst the temple's hustle and bustle. Such thoughtful landscaping would not only beautify the space but also create dedicated areas for devotion and contemplation.\n\nWhile the existing architecture remains impressive, a touch of rejuvenation could go a long way. Consider repainting faded murals, repairing minor structural imperfections, and ensuring consistent cleanliness. These seemingly small improvements would significantly enhance the overall visitor experience and reflect the temple's sacred significance.\n\nThe Jagannath Temple in NALCO Nagar holds immense potential to be a thriving center of faith and community. By addressing the areas of development and upkeep, this peaceful haven can reclaim its full glory and continue to serve as a cherished landmark for generations to come.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "In my recent visit I found this jagannath temple is  very clean and well maintained. They have a large and spacious campus. The temple garden is also well maintained.\nIf I talk about \"Anand bazar\" then it's a well maintained and big space for having \"prasad\".\n\nIf you are visiting the nalco colony then it's a must visit place. The place is quiet,calm and peaceful.\n\nBut one thing I didn't get, why they have not painted the sculptures and decoratives. It was looking dull and reducing the overall experience of the temple. Otherwise its good  experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I visited on 1st Jan 2024, which was a very peaceful place and well maintained.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place has all my childhood. I used to play in the stage after eating food from the Anand Bazaar.Today in fourth Febuary, we are going for the replacement of the old Bhimla idol with the new idol made with eight metals. ଜୟ ଜଗନ୍ନାଥ ⭕❗⭕",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temples of Shri Jagannath, Shiv ji, Mata Parvati, Shri Ganesh ji are here. It's a very beautiful and peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kurudol Pahada (Hill)",
      "rating": 4.7,
      "address": "V4GW+2FX, Unnamed Road, Nalco Nagar, Kurudol Kurudul part, Angul, Odisha 759123, India",
      "reviews": [
        {
          "text": "Good view",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice viewpoint. You can take your car right up to the top of hill. A place to hangout in the early morning or evening.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "You can see Nalco CPP, Smelter, Jindal, Monnet, Thermal Power Plant, Angul town, FCI at a time on the top of hill.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good 👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its a very calm and peaceful place.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Maa Hingula Temple",
      "rating": 4.2,
      "address": "R5PC+68W, Kulad Part, Angul, Odisha 759145, India",
      "reviews": [
        {
          "text": "Very nice temple with natural fire occurring every year",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Spiritual place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Old and silent place must visit once atleast",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A place which acctually gives peace to piligrims.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nothing much to see here except the temple.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Church",
      "rating": 4.2,
      "address": "R4R3+MPR, Similipada, Angul, Odisha 759122, India",
      "reviews": [
        {
          "text": "This one is a BAPIST CHURCH. This is established in the year 1916, i.e. before independence. This is a spiritual place. This is  situated besides NH55. This is at a distance of half kilometer from hotel kalpataru, 200 meters from hotel Raj, 100 kilometers from upcoming Angul new bus stand. This place is very calm & quiet.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I have attended service here as a teenager. I was impressed by the hospitality of the present Pastor who was a perfect stranger.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Lord Jesus always best for us. Special thanks fr the arrangements and place. So neat & clean. Everybody must have to go & seet to get the peace & fresh",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The Church is The place Where i find Peace,You can Go and Pray With Comfort. This Church Is Example Church is For Everyone",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's one of the oldest church in this town. Britishers had been coming this church for prayers in the '50s.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shiv Temple",
      "rating": 4,
      "address": "R4V9+MG3, National Highway-42, Turanga, Angul, Odisha 759122, India",
      "reviews": [
        {
          "text": "Accuracy is very good\nU can easily found everything",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Hanuman vatika",
      "rating": 5,
      "address": "R5R5+QPH, Kulad, Angul, Odisha 759145, India",
      "reviews": [
        {
          "text": "My happy place, blessed to be around Hanuman Ji, forever grateful. Nice people in this area. This place Refreshes my mood.🙏🙏🙏",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Best temple inside our house",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jay shree ram🚩🚩🚩",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jai Hanuman 🙏🙏🙏🙏",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Turang",
      "rating": 4.3,
      "address": "R4VH+386, NH55, Turanga, Angul, Kandasar Part, Odisha 759122, India",
      "reviews": [
        {
          "text": "Love it",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Maa Hingula Temple",
      "rating": 4.6,
      "address": "V5FF+F7F, Balaram Prasad, Balaramprasadpatna Part, Odisha 759123, India",
      "reviews": [
        {
          "text": "Should be improve\nBeauty 🌟🌟🌟\nPandit 🌟🌟\nEnvironment 🌟🌟",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is one of the another temple of maa Hingula with Gopalaprasad Hingula temple. Hingula yatra one of the main puja celebrate here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple. Visit here for peacefull day in ur busy life",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temples are always a great place.\nThis place offers a silent environment like others.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "💐🙏🏻",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}