{
  "places_with_reviews": [
    {
      "name": "Pinnacle View Point Chettukuzhy",
      "rating": 4.3,
      "address": "Kollam - kuruvikkonam Rd, Kerala 691306, India",
      "reviews": [
        {
          "text": "I visited this place without reading the reviews\n\nI visited it in the evening .. around 5 to 6.. trust me.. there were no one in the place except one or two young couples.. it does not feel like a tourist place.. i should have visited in the mrng to see the actual beauty..\n\nAlso we cannot see the view from the road side.. trees and pushes hide the view.  The other side lots of rubber trees are there...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "its a beautifull place to be at in the early morning..if youre lucky you may get fog in the morning also...around 60-65 km from trivandrum...\nits not actually a tourist spot..its a small view point on the road side only...\nthe  cool breeze and the ambience of the place instantly gives you a mood lift...",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Reach there early morning for good view. It is a view from a road side not a well developed tourist destination, but that is the beauty of it. There are sidewalls and you can sit there for good pictures and relax. There are no shops nearby, so take enough water. The area is surrounded by rubber tree plantations which also gives a amazing views.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place for visit expecially for morning .  Isn't an good view point . We can also see mist, fog,etc.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Its a far view from a road side. Ideal for morning visit before sunrise. Completely covered with fogg and mist. Extremely free visit.\nUnfortunately when i visited the place it was completely raining. The condition was too bad people who came on two wheeler. Cant find a shelter near the area.\nOtherwise a good positive and a silent spot",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kottukal Cave Temple",
      "rating": 4.4,
      "address": "VWQ4+R3F, Anchal - Chunda Rd, Kottukkal, Kerala 691306, India",
      "reviews": [
        {
          "text": "It is actually a small cave temple. This cave is made by drilling the rock. Rock is not a big one. Moreover, it looks like a normal Hindu temple, doesn't seem like a historical relic.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A rather unknown  beauty nested away in the hearts of the hills. Kottukal cave temple is one of those ancient cave temples carved out somewhere in the 6th century CE.\nIt's a small cave structure probably carved out of a single rock.\nThe view is good.\nThe temple is still functioning.\nThere are no active guides to guide you through what is what, you can ask the tantri who is usually present there, who will tell you about few of the local legends.\nIt would definitely wake that sleepy Historian in you\nWouldn't recommend if you're looking for something big and fancy.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Kottukkal Cave Temple, also known as Kaltrikkovil in Malayalam, is an existing example of rock cut architecture, built between 6th and 8th centuries CE. It is situated in the village of Kottukkal, near Anchal, Kollam district, Kerala, India. The name Kottukkal is a reference to rock cut shrine.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A rock cut temple built in 7th or 6 th century CE, situated near Anchal,kottukkal,village kollam district.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Quite inside from main road. Nobody in town knew this place. We had to use Google maps, it helped. A small temple, call",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Guruvayoorappan Temple",
      "rating": 4.5,
      "address": "WWMF+J5X, Thadikkadu -Anchal market Jn Thazhamel -Sabarigiri School -Agasthyakodu -Alenchery Rd, Anchal, Kerala 691306, India",
      "reviews": [
        {
          "text": "Good place to pray without rushing.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It’s amazing",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Love this",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "🍁😌",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Agasthyacodu Sri Mahadeva Temple",
      "rating": 4.8,
      "address": "WWQ9+HRR, Agasthyakodu - Alenchery Rd, Anchal, Kerala 691306, India",
      "reviews": [
        {
          "text": "A real calm and peaceful atmosphere. Lord Shiva is the main deity here. Shivarathri is the main festival.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very old Shiva Temple . Main Deity is Shiva. Others are Ganapathi,Vishnu, Devi,Subramaniyan, Ayyappan, Hangman, Navagraha and Nagaraja, etc.\nShivarathri festval is celebrated for 12 days with Special Poojas, followed with wonderful light decorations and special stage programs and traditional cultural programs. The participation of thousands of devotees visiting the temple during this 12 day's festival period for offering Pooja, etc, from in and around Agasthyacodu is the commendable to convey their beliefs and emotions towards such festivals.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The place named after Agasthya Muni. The temple has a very attractive historical background and is famous among devotees from various part of southern Travancore. Devotees from various part of the state visit here to receive blessings of the Lord. The attraction of the temple is the newly built standing statue of Lord Shiva. The temple has renovated newly both inside and out. Its a well known temple in Anchal.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The place named after Agasthya Muni. The temple has a very attractive historical background and is famous among devotees from various part of southern Travancore. Devotees from various part of the state visit here to receive blessings of the Lord. The attraction of the temple is the newly built standing statue of Lord Shiva. The temple has renovated newly both inside and out. Its a well known temple in Anchal.\n\nEntering into the temple compound itself is a special ambiance ... Even if it is noon when the temple is closed, sitting on the ledge of the banyan tree for a while will bring you peace of mind😊😊☺️\n\nThe temple is so calm and peaceful. The staff at the counter clarified our doubts regarding rituals and suggested certain things to be done. He was so informative. The temple is clean. Had positive vibe being there.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The temple is so calm and peaceful. The staff at the counter clarified our doubts regarding rituals and suggested certain things to be done. He was so informative. The temple is clean. Had positive vibe being there.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Panayamchery Sree Dharma Sastha Temple",
      "rating": 4.6,
      "address": "WWP2+XP7, Anchal, Kerala 691306, India",
      "reviews": [
        {
          "text": "I recently visited the Panayamchery Sree Dharma Sastha Temple, and it was a truly enriching experience.\n\nThe temple is nestled amidst lush greenery, providing a serene and tranquil atmosphere. As I entered the temple premises, I was struck by its architectural beauty. The intricate carvings and vibrant colors of the temple's facade were captivating.\n\nInside, the main sanctum dedicated to Lord Dharma Sastha was adorned with flowers and lit with oil lamps. The priest conducted a mesmerizing ritual, and the melodious devotional music added to the spiritual ambiance.\n\nWhat stood out to me was the sense of devotion and community among the worshippers. People from all walks of life came together to seek blessings and offer their prayers. It was heartwarming to witness the unity and faith within the devotees.\n\nAfter the darshan, I explored the temple complex, which included smaller shrines dedicated to various deities and a peaceful meditation area. The temple also had a well-maintained garden where I could sit and contemplate in solitude.\n\nOverall, my visit to Panayamchery Sree Dharma Sastha Temple was a memorable one. The spiritual energy, stunning architecture, and the warmth of the devotees made it a truly special experience. I would highly recommend this temple to anyone seeking a peaceful and enriching spiritual journey.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful temple of Shree Ayyappa. Hosts traditional Hindu marriage functions.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very serene atmosphere with old dining hall, wedding open auditorium (not maintained), with a long chira, pond with karimeen in it.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place. Very good atmosphere. Small parking area. This temple is located in Anchal -chengamanad road .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏nice place to visit.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Thadicadu Juma Masjid",
      "rating": 4.4,
      "address": "Vayanashaala Junction, P.O, XV3J+PG7, Thadicadu, Anchal, Arackal, Kerala 691306, India",
      "reviews": [
        {
          "text": "juma masjid  in the thadicadu area. mosque auditorium  nearby",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "situated in the heart of small town thadicadu.... one of the famous masjid in anchal grama punjayath",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice people. Road is busy and  narrow.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Tadikkad Mosque is an example of secularism",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Puthayam Mosque",
      "rating": 4.6,
      "address": "WW6C+RR7, Anchal - Kuravanthery - Channappetta Rd, Alayamon, Kerala 691306, India",
      "reviews": [
        {
          "text": "Initially it was a thaikavu build by late Mr. Maideen kunju labba. Now its a juma masjid 2.5 km from Anchal town.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its a good place for reliving our negitives and gaing positives",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I don't know  because I doesn't enter this mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place. Central part of Muslim ideologies  at puthayam\n.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place for work ship",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Thrikoyikkal Sree Maha Narasimha Swamy Temple",
      "rating": 4.7,
      "address": "WXG2+8CC, Panayam Road, Kerala 691312, India",
      "reviews": [
        {
          "text": "Nice temple with good atmosphere. The famous earoor pooram was held on this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "'Thrikkoyikal Sree Maha Narasimhaswami Temple' is a Hindu shrine at Thrikkoyikal, in the village of Yeroor, Kollam, Kerala, India. The legend of the temple is associated with Narasimha, the fourth incarnation of the Hindu god Vishnu. Constructed in the Dravidian style of architecture and Rock-cut architecture. Based on the architectural features, historians believe that the temple was built during the 16th century.The temple has a pillared hall leading to the sanctum, which has rock-cut architecture. The temple is open from 5:30 am – 10:30 am and 5:30 - 7:30 pm. Daily rituals and many yearly festivals are held at the temple, of which ten-days festival celebrated during the Malayalam month of Meenam-Medam (April-May) when the image of presiding deities are taken around the streets of the temple, being the most prominent. The temple is maintained and administered by the Hindu Religious and Travancore Devaswom Board of the Government of Kerala.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple is situated near a paddy field, thats gives a freshness inside along with devine ambience",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple. The atmosphere here is carm and quiet",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the prominent temple in Kollam district, Kerala. Many devotees from distant places are comes here. Approximately 1.1 kms from Yeroor Junction. The main deity is of Narasimha moorthy. It's calm and very quiet place. Old architecture on the temple make much more beautiful. The  darshan is the best on Thursdays. The atmosphere we get is the great.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Vadamon Sreekrishna Swamy Temple",
      "rating": 4.7,
      "address": "XW47+597, Agastiacode -Komalam -Vadaman Rd, Vadamon, Kerala 691306, India",
      "reviews": [
        {
          "text": "One of the very oldest temple of Lord SreeKrishna in Kerala. The temple is maintained just as it was in old model. Its well maintained and only necessary renovation are being done inside the temple. Its well maintained in its old fashion. Good atmosphere. Calm and quiet peaceful place. Parking space is less but since there isn't much traffic in the area it doesn't matter. Outside the temple side is its pond. The pond is big but water isn't high. Less water level. Good Temple with clean and clam atmosphere.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very good temple of load sreekrishna. Very good atmosphere and good environment. Parking area is small .Road is small but no traffic block. Their is a big pond but water level is small. The pond is not keep clean. Every year their is festival that they conduct  very correctly. Festival time good stage programs they will conduct",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is the acient time temple in the anchal area vadamon backbone is this temple and here the lord sree Krishna is the dedication here here in this temple festival is during January last to February time. Beautiful temple and well maintain surrounding for wedding, engagement etc and corresponding to the temple an auditorium is also available at low price.\nNear bus stop is.... Kuruvikonam\nAnd 30/-rs only for the stop to the temple 💓",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful Krishna attract us and very blissful environment.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Asuramangalam temple",
      "rating": 4.2,
      "address": "WVHF+9W2, Vayakkal Vanchipetti - Ozhukuparackal Rd, Ozhukuparackal, Edamulackal, Kerala 691532, India",
      "reviews": [
        {
          "text": "Workships..\n11 days ulsavam is awesome",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "😇",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Great  temple for devotees.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good.. Blessed",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Mmm",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    }
  ]
}