{
  "places_with_reviews": [
    {
      "name": "Andretta Pottery",
      "rating": 4,
      "address": "SH 17, Andreta, Chakban Andreta, Himachal Pradesh 176103, India",
      "reviews": [
        {
          "text": "If you're travelling to Palampur or Bir and feel the need to get your hands dirty, try out pottery! The best part is all members of the family can enjoy this experience and it is humbling to say the least.\n\nI took the 15 mins wheel throwing session and the uncle that was guiding me had to be the sweetest person.\n\nAlthough, the wheel throwing session does not really last 15 mins, but I loved the time I spent laughing and giggling while talking to uncle!",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Andretta Pottery in Palampur is a unique and charming place that offers a memorable experience. Located amidst the serene beauty of the Himalayan foothills, this pottery studio is a hidden gem.\n\nThe pottery studio is run by skilled artisans who have a deep passion for their craft. We had the chance to watch them at work, and it was a fascinating experience. The pottery they create is not only beautiful but also functional, making for great souvenirs or gifts.\n\nThe ambiance at Andretta Pottery is rustic and calming, perfectly in tune with the natural surroundings. The studio is nestled in a tranquil garden, providing a sense of peace and inspiration. It's an ideal place for anyone interested in art and ceramics.\n\nThe staff is welcoming and eager to share their knowledge about pottery. They offer pottery classes for those who want to try their hand at this art form, which is a fantastic way to spend a few hours.\n\nAndretta Pottery also has a small shop where you can purchase the pottery items they create. From mugs to plates and decorative pieces, their collection is diverse and reasonably priced. Andretta Pottery is a must-visit in Palampur. It's a place to appreciate art, connect with nature, and take home beautiful, handcrafted pottery. It's a serene and artistic escape in the lap of the Himalayas.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It was a great pleasure to see such artwork, these days these clay figures are getting extinct in our country.\n\nYou can come here and learn to make clay figures.\n\nIt's a very relaxing place!\n\n7 KM drive from Palampur.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "A good place to source studio pottery. Started by the well known father of studio pottery, Sardar Gurcharan Singh of Delhi Blue Pottery, it is also an artist's residency. Aspiring potters can be seen working at the wheels.\n\nA small tea and snack stall would be a good idea. It was a very hot day. The sale room could have a fan and better display of prices. There is only one staff person for questions regarding the pottery on sale.  He wraps the products and collects payments too. Some space to sit could be an idea. All this I feel could facilitate goodwill and enhanced sales.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Wonderful seeing such great artwork. The pottery is extremely cute and they hold workshops too.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Sobha Singh Art Gallery",
      "rating": 4.4,
      "address": "Village, Andreta, Himachal Pradesh 176103, India",
      "reviews": [
        {
          "text": "Shobha singh art gallery is purely a tribute to the late artist. If you are an artist and looking to find some inspiration, it is not the right place.\nThe place consists of a museum and a gallery with nearly 50 paintings.\nThe use of the camera is prohibited inside the galley and museum both.\nThe place is worth visiting but doesn't have provision like a clean toilet.\nBefore going to the museum, i recommend reading more about the artist and their contributions as the gallery doesn't highlight them.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Its Must visit for art lovers.\nSobha singh life and artwork  is well preserved. Norah richards home is 200 mtrs away also. Its close on monday.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Shobha Singh Art Gallery is a treasure trove of artistic talent hidden in the Himachal Pradesh highlands. The exhibition pays tribute to Shobha Singh, a great Indian artist whose works have made an unforgettable impression on the world of art.\n\nThe gallery is a peaceful hideout with an excellent collection of his paintings, which largely depict the Gaddi community, local landscapes, and religious subjects. Singh's use of vibrant colours and meticulous craftsmanship brings his subjects to life, portraying the soul of Himachal Pradesh.\n\nThe gallery has a peaceful and inspiring atmosphere, with artworks artfully arranged against a backdrop of exquisite natural beauty. Shobha Singh Art Gallery is a must-visit for art enthusiasts, providing a profound insight into the world of a masterful painter. It's a place where culture, nature, and art seamlessly intertwine, making it a gem in the heart of the Himalayas",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A quaint and delightful little place, that honours the memory of one of the most reputed and respected artists of India. The locality is quiet and laid back and the cool drive to the place is delightful. The visit can be combined with a trip to the Andretta village and craft centre",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Rich and Precious History.. abode of one of the Famous Punjabi Painter..",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Chintpurni Mata Mandir Rajot",
      "rating": 5,
      "address": "2HGV+QF8, Rajot Buhla, Himachal Pradesh 176063, India",
      "reviews": [
        {
          "text": "Maa Chintapurni Mandir is located in Una district of Himachal Pradesh",
          "languageCode": "en-US",
          "rating": 5
        },
        {
          "text": "Mata chintpurni ji ki jai",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Karodi Mahadev",
      "rating": 4.8,
      "address": "Ambotu, Himachal Pradesh 176076, India",
      "reviews": [
        {
          "text": "Such a beautiful place where you can take the plunge and swim too! You get absorbed in the natural beauty and the rawness of it. Easily accessible and completely safe (to swim too). If you’re a nature lover, this spot is unmissable.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great picturesque place but inaccessible. Even getting to the fall is not straightforward.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The place is surrounded by mountains and is a good spot for water lovers. The path to the place is uneven and you will need shoes to walk here. The water is around 8-9 feet deep so be careful. Not recommended for senior citizens as path is uneven and can be slippery under rains. No tickets here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A serene small waterfall. Not recommended to visit in monsoons as the water flow is heavy.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It was nice to visit here.. not so crowded..parking space available..if you know swimming you can try your hands here in the khad..Just walk carefully and Enjoy the view..!! 😃",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Gojar baba",
      "rating": 5,
      "address": "2HHH+PQ7, Agoja Khas, Himachal Pradesh 176076, India",
      "reviews": [
        {
          "text": "Jai gojar baba if u have skin realted problem then u must visit this temple and take bath at this temple .it is believed that water of this temple will cure all ur skin realted problem or allegry",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Pilgrimage......",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Jai baba gojar ji Maharaj",
          "languageCode": "en-US",
          "rating": 5
        }
      ]
    },
    {
      "name": "Waterfall Andretta",
      "rating": 5,
      "address": "2HM4+QP, Ram Nagar, Himachal Pradesh 176103, India",
      "reviews": [
        {
          "text": "Lovely but hard to get too",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Jakh Baba Ji Behru Temple, Palampur (HP)",
      "rating": 4.9,
      "address": "2H53+95G, Behru, Himachal Pradesh 176076, India",
      "reviews": [
        {
          "text": "A great place to visit beside mandir it had  great scenery or view ...",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Amazing peaceful environment lucky enough to visit there.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Divine feeling, one of the most sacred places. I was fortunate enough to witness and enjoy the huge bhandara at Shri Jakh Baba temple. Well maintained hygiene during the feast and such a great experience have never seen this much crowd and best management I must say to handle the crowd on this occasion. Kudos to the temple committee.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This temple is in a quiet place. Calm place during regular days. There is a cave where we can sit and a big hall to sleep ,eat or relax.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This place is near to my home….my favorite place…here you can feel your heaven",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Simsa mata mandir",
      "rating": 2.5,
      "address": "House No. 16/1 VPO PATTI TEHSIL-PALAMPUR DISTT.-KANGRA (H.P.) 176061, HOUSE NO. 16/1, Panchrukhi - Paprola Rd, Patti, Rajpur, Dohal, Himachal Pradesh 176061, India",
      "reviews": [
        {
          "text": "Simsa Mata patti",
          "languageCode": "en-US",
          "rating": 2.5
        }
      ]
    },
    {
      "name": "Picnic spot Tara da pull",
      "rating": 4.6,
      "address": "3HHH+HW2, Sungal, Himachal Pradesh 176103, India",
      "reviews": [
        {
          "text": "Beautiful nice place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place to visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Dream place for picnic",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Yet to visit",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Noorah Richard's Mud House",
      "rating": 4.6,
      "address": "2HP7+JR9, Andreta, Himachal Pradesh 176103, India",
      "reviews": [
        {
          "text": "Maintain by Punjabi university Patiala",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful ancient house.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}