{
  "places_with_reviews": [
    {
      "name": "Dabhol Chandika Devi Mandir Temple",
      "rating": 4.7,
      "address": "H5WG+M77, Dabhol, Maharashtra 415706, India",
      "reviews": [
        {
          "text": "The Chandika Devi Mandir in Dabhol is a spiritual gem nestled in the serene surroundings of Dabhol. Visiting this temple is an enriching experience, offering devotees a peaceful atmosphere to connect with the divine. The architecture is captivating, reflecting the rich cultural heritage of the region. Devotees praise the temple's serene ambiance and the spiritual vibrations that envelop the surroundings. Whether you're seeking solace or simply exploring the cultural essence of the area, a visit to Chandika Devi Mandir is highly recommended.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of great Devine Place of dabhol chandika devi Temple. This temple is very eternal religious Hinduism place in dabhol .Peaceful,well connected by road & rail.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Place is worth visiting , Swayambhu Chandika Devi appeared in a cave here , it's so dark in the cave that you can't see your hand in front of your face ,\n\nVery calm and peaceful place",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A very nice and calm place to visit especially during evening bcoz there is no rush at that time.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice pleasant place.\nFree Parking available.\n10 km from Kolthare Beach.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Anjanvel Lighthouse",
      "rating": 4.6,
      "address": "H48R+7HR, Navanagar, Anjanwel, Peth Anjanwel, Maharashtra 415634, India",
      "reviews": [
        {
          "text": "Good place to visit.. We were lucky enough to spot the dolphins in the sea as well during our visit. Also there are not many steps to climb to go on top.. Its like 2-3 story building height only. There is one cliff very near to the lighthouse and you may have close view of doplhins from there. Ticket price to lighthouse is 10 rs. Only per person. Posted the timetable of light house. You have to go before the switching on time",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit place with kids to make them understand Amazing engineering part of light travel for minimum 20-25kms in sea.\n\nPlace was well maintained with various garden parts and nicely made environment.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A small visit but good information that one can get here. Staff is helpful and can provide more information if asked for. It's a steep climb at the top but one can see a beautiful view from top so it's worth it (but he careful)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's 15 kms from Guhagar. There is nice view from this lighthouse. There is little space to stand and there is one slide to go up so it's difficult for children and aged people.\nYou can see 🐬 dolphins from this lighthouse. There is dolphin point djacent to this lighthouse, from there also you can see dolphins.\nThere is very nice view of sea and overall nature.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit place if you’re in Guhagar…amazing experience of visiting lighthouse at ₹10 ticket per person…if you ask they will give you detailed information about the lighthouse and it’s working…parking space is available and there is pretty temple nearby…also you can spot dolphins from here if you are lucky enough",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Swayambhu Chandika Devi Devasthan",
      "rating": 4.7,
      "address": "H5WJ+9HG, Maharashtra 415706, India",
      "reviews": [
        {
          "text": "Very peaceful place. The temple is very beautiful having a small natural cave. Must visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is inside the cave. From dapoli 25 km away situated in dabhol village. If you planning dapoli trip then must add this location in your trip. Lots off people came here fulfill there wishes. If you visit from guhagar then you also visit this place. You can came through dabhol dhopave jetty. Front guhagar place is only 20km away",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very old ancient time temple, a \"swayambhu\" idol. Easy to track using Maps, a small deviation from main road. One has to go through a dark cave inside to see the idol (photography not allowed inside the cave). Outside one can get few snacks or water or Sol kadhi. Some parking is available near the entrance. There is a lake /pind with drinking water",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great place to visit for a quiet prayer. A temple with a peculiar arrangement. The deity is situated underground in a deep cave. The entire place is filled with positive energy & a sense of history.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is dedicated to Goddess Chandika Devi, a form of Durga, the divine mother goddess. The temple's main attraction is the swayambhu idol of the goddess, which is said to have manifested naturally.  The temple is situated underground in a natural cave, adding to its mystical and spiritual appeal. The temple's peaceful and serene environment, combined with its rich history and spiritual energy, make it a must-visit destination for someone seeking spiritual growth and self-reflection.  The temple's Gharbh Graha, where the swayambhu idol of Goddess Chandika Devi is located, is well-lit by a lot of oil lamps, providing a warm and welcoming atmosphere for devotees.\n\nSwayambhu Chandika Devi Devasthan is a holy temple dedicated to the divine mother goddess and one is encouraged to approach it with reverence and respect, avoiding behavior that may be considered disrespectful or inappropriate. This includes avoiding the consumption of alcohol, non-vegetarian food, and any other substances that may impair one's judgment or behavior.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Guhagar baug beach गुहागर बाग बीच",
      "rating": 4.7,
      "address": "G58G+J56, Mouje Anjanvel, Maharashtra 415634, India",
      "reviews": [
        {
          "text": "Very neat and clean beach. A must visit one. 👍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Perfect beach for family and group of friends. If you want to enjoy peaceful best option is bag beach. There is less crowd. Good sunset point you can see enron jetty very closely. Nit, clean, tranquil beach. Perfect gateway for one day trip.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Quiet and beautiful. Not too easy to reach. But once you reach there it will be worth the time.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Hidden beach of Guhagar with absolutely no crowd to disturb…clean and quiet beautiful beach 🏖️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beach is awesome location somebuedy no else in this beach",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Dabhol Chandi Mandir",
      "rating": 4.7,
      "address": "H5WJ+9C5, Maharashtra 415706, India",
      "reviews": [
        {
          "text": "Definitely worth a detour. Extremely beautiful temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Within 1 km from Dapoli-Dabhol main road and about 3-4 km from Dabhol port, Chandika devi Mandir (temple) is a self-emerged place. This idol is 3 feet tall and is coated with Shendur (is a traditional vermilion red or orange-red colored cosmetic powder from Indian Subcontinent). After successfully acquiring the Dabhol, Shivaji Maharaj invaded Anjanvel’s Gopalgarh, Govalkot and Adivare area. There was a history that he had visited this temple several time. This is one of the oldest temple in Dabhol and Dapoli Taluka. If you are visiting Dapoli, you must visit this places. This is one of the most visited places in Dapoli.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "30ft below ground in a cave, no lighrs and photos allowed, mersmerizing idol.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place to visit and it's devi idol is unique to watch",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best Experience... People must visit this temple....",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Pawar Sakhari Budruk Sahaan",
      "rating": 5,
      "address": "G6W6+7J, Sakhari Kh., Maharashtra 415719, India",
      "reviews": [
        {
          "text": "Village",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Veldur jetty",
      "rating": 4.7,
      "address": "H5GC+J7X, Guhagar, Maharashtra 415634, India",
      "reviews": []
    },
    {
      "name": "Dabhol Beach",
      "rating": 4.3,
      "address": "H5Q7+HX7, Dabhol, Maharashtra 415706, India",
      "reviews": [
        {
          "text": "Heaven ❤️❤️❤️",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Radha Krishna Temple",
      "rating": 4.3,
      "address": "H5GC+9F6, Veldur, Maharashtra 415634, India",
      "reviews": [
        {
          "text": "snacks with good view.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Its hindu temple of lord Shree krushn and radha.\nIts near of creek of dabhol.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place in Maharashtra",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best place for roming",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful and peaceful Temple 😊",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shahi Masjid(شاہی مسجد)",
      "rating": 4.4,
      "address": "H5PG+5H6, MH SH4, Dabhol, Maharashtra 415706, India",
      "reviews": [
        {
          "text": "This mosque is so beautiful  built in adil Shah reign and yet no one knows abt it must visit its near ferry jetty",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a very beautiful and ancient mosque.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Place is good for someone who are looking for old monument. Beutifully designed hand made carvings are there on pillers and walls but The Shahi Mosque is in a very sorry state and almost in ruins.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Not very well maintained. Quiet an old structure.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Maqsood Afzal Jagirdar Afzalpur Dist Gulbarga inform that this shahi mosque appears to me  is construction of Afzalkhan noble of Adlshahi dynasty. Its replica can be seen at Afzalpur.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}