{
  "places_with_reviews": [
    {
      "name": "Jesal Toral Samadhi",
      "rating": 4.5,
      "address": "429J+CMM, Ajepar Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "Historical and religious place reflects anjar's rich and old cultural tradition.\nMust visit place for tourists come in kutch.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Jesal Toral Samadhi place was very famous and historical place in Anjar. True love story of Jesal and Toral. The tomb is an excellent place to feel the thrill of love. Lunch and dinner Prasad served by temple. History lovers and researchers must visit this location.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's devine place , where one DakuToral is worship due to his wife Jesal...one who visit kuchh must visit this place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is the one of the historical place in anjar …. This historical place based on Jesal jadeja and Sati toral …. This feel place is very popular in anjar … also the market of anjar is very famous 👍🏻👍🏻",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Place where you will mostly find people from the interiors of Kutch, resplendent in their traditional dress. Though the samadhi is not much of an attraction, the road leading to it is. Unusual items like swords attract customers.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Govardhan Parvat",
      "rating": 4.6,
      "address": "near Ahir, Kanya Chhatralay Rd, Satapar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "Very beautiful place located outside of anjar. Can go with family and friends in morning or evening. A decent place with lots of work on greenery and emphasis given on cleanliness. Small ponds covered with lighting’s at night. Another side there a temple of lord krishna at the top, few steps to go to the top. Around this there a small garden, playground, animals and birds. Very calm and peaceful place, one can spend here 3 to 4 hours. No entry fees . Divine atmosphere with bhajans playing around in small speakers in the walk area around the hillock.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "is this place so good and for a picnic with children and family .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is like a mini Vrindavan, complete with a cute little hill and a temple for Lord Krishna. You can either climb the steps for the full experience or take the elevator if you're feeling less energetic. Definitely worth checking out!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's superb Temple of Lord krishna near by gandhidham. It's like open sky place and we get peace of mind here as well as it's small zoo of birds here. I visit here with my family. I really like it.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place for family, friends and kids",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Swaminarayan Temple",
      "rating": 4.8,
      "address": "426C+8WX, Savaser Naka, near Shree Swaminarayan Circle, Koteshwar Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "Great architecture, if you are in Anjar just visit for once.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is newly developed nar Narayan swaminarayan mandir at anjar. Recently visited this place with family. Big grounds for parking, stay room, food facilities, mandir darshan, hindoda darshan this are the main attraction. Very rush of people at Sunday .\nEnjoy Himalayas and amarnath darshan . Good place to visit with family.full suggested",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great hindu temple in anjar. For Hindu people.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Loved this place and the vibes here, such a peaceful place to meditate and pray to the Almighty.\nReally an amazing place to visit, developed in such a beautiful way and maintained well.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Nice temple of god shri swami narayan its main gate is under construction you can get entry through side gate. Presence of art is very good inside the temple. Very peaceful place.you will love this place",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Aashapura Maa Mandir",
      "rating": 4.5,
      "address": "427G+7VM, Shivaji Rd, Ganga Naka, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Desh Devi Maa Ashapura temple. Its a original and main temple. Peoples are called as Mata no Madh in kutch, Gujarat. With modern facilities of accommodation and food for pilgrims visitors.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good to hangout with family",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "place of full positive energy, good arrangement of prasad. Blessings of Maa Ashapura !",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Am",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Veer Balak Smarak",
      "rating": 4.6,
      "address": "Ram Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "This place is basically a memorial for the victims of the 2001 earthquake in Anjar. It is a nice place to visit and highly recommended to visit the museum inside.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This memorial has been made in the memory of the students and teachers of the school who were martyred in the earthquake. Gujarat Government has taken a good decision by building this memorial so that the public can understand the situation of that time. 180+ school students and 20+ teachers during a rally on 26/01/2001 when they entered Anjar's khatri yl Bazar due to a sudden earthquake. These children and teachers have been victimized. In the memorial, his name along with photos and his favorite things are preserved. Also there is a simulator that makes you visualize the earthquake.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place to visit one time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good initiative and very creative approach to design a memorable museum. It's such a good experience centre to feel the emotions of 2001 earthquake. Appreciation to the administratives.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "185 school children and 20 teachers lost their lives while going for a rally in Anjar of Kutch due to an earthquake that struck in the region in 2001. The then Chief Minister, Shri Narendra Modi, announced the construction of Veer Baal Smarak to pay tribute to the children who lost their lives.\n\nThis museum dedicated to deceased children is spread over five sections. The first section presents pictures of the deceased and memories of the past. The Destruction Section presents the memorials and replicas of deceased children'. A special room has been made to enable visitors to experience the earthquake in real time through a simulator and a video on the screen. Apart from that, the process of earthquake, its occurrence, scientific reasons and other necessary details have been included in the science section. In the last section, visitors are asked questions about their experience of earthquake.\n\nA memorial has been built outside the museum with the names of the deceased children and teachers. Their names are written on the wall along with their pictures. A powerful Prakashpunj has been built here to pay homage to them. The light emanating from it will be visible in the entire city of Anjar.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Old Swaminarayan Temple",
      "rating": 4.7,
      "address": "426F+QJ5, Sorathia Naka, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "PEACEFUL PLACE,\nI VISITED TEMPLE IN THIS MONTH(AUGUST) IN WHICH SPECIAL OCCASSION CALLED\n\"HINDODA DARSHAN\"\nIS THERE ITS BASICALLY BEAUTIFUL ARTFORMS ARE CREATED ON DIFFERENT DECORATED HINDODA IN WHICH GOD SWAMINARAYAN\nIS THERE FOR GIVING US BLESSINGS,\nALSO CARVING IN WOODEN COLUMNS,\nENTRY GATE,MAIN TEMPLE ARE EYE CATCHING,\nIN TEMPLE AREA THERE IS SPECIAL  OUTLET FOR BAKERY ITEMS AND SNACKS WHICH QUALITY IS VERY GOOD.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very osam temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Loved the grandeur of the temple. Beautiful. Excellent rooms for stay.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best place to visit in Anjar, 7PM to 8 PM no Darshan due to bhog",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Amazing Art Work On This Temple",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Koteshwar Mahadev Temple - શ્રી કોટેશ્વર મહાદેવ મંદિર",
      "rating": 4.6,
      "address": "32RQ+JC7, Anjar - Adipur - Gandhidham Rd, Vir Bhaghat Singh Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "It is the edge of Gujarat, where Gujarat’s border end officially! A great place for grabbing coconuts and capturing photographs!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My soul ❤🔥🚩 It seems as if the real Parabrahman is with God.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mahadev temple near Anjar Mundra highway",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful view and amazing sea.The view is awesome and beauty of the nature is eye-catching...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "good place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Swaminarayan Circle Savasar Naka",
      "rating": 4.4,
      "address": "Shree Swaminarayan Circle, Savasar Naka, Koteshwar Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "It's very crowded place alot of buses and cars and bikes and autos are going from here and alot of pedestrian were there.there's lot of noise and the people here are very good.you can find almost everything here and here you can find fresh vegetables and sweets too here you can find good temples",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "For relaxation place with Family",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Looking for a place to remove all your Stress and a very peaceful and Beautiful Place then I will surely recommend visiting this place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good experience",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "good",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Savasar Lake",
      "rating": 4.4,
      "address": "426C+VMF, Bhakti Nagar, Anjar, Gujarat 370110, India",
      "reviews": [
        {
          "text": "People walk here for slim fit and also some game zone are open if u want to play some video games 🎮 or indore games and local gym setup type equipment free to use and also lake to see garden and birds around..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Must visit anjar im sure you loved this place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very beautifully made lake side. But water is very stincy and dirty. They need to clean lake's water. Many banche for Seating, walking track is there, well maintained. Good place  to spend time with friends or family on lake side.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place,under development, but bad smells in waters, so much fish in waters.\nOtherwise nice place for visitors and small picnics,\nNearest Swaminarayan temple and Garden",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good for walking, spending time with family and kids. Recently they have added various rides and funzone club for kids.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Mahakaleshwar Temple",
      "rating": 4.5,
      "address": "32VV+9W2, Mahakaleshwer Temple Rd, Anjar, Meghpar, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Makleshwar Mahadev temple at Anjar on Anjar-Gadshisha road. It is a temple of God Mahadev, the Shiv ling is swayambhu (self generated) and has its own significane, the one who with true heart prays and offers jal to Makleshwar Shiv ling gets all their wishes fulfilled.\n\nA must visit place, it has wide area for celebrating and having havans and other religious functions.\n\nHar Har Mahadev #Jay",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple of lords of lord Shiva ,is the named of Mahakaleshwar shiv Linga, a true divine feeling near  a lord Shiva so shivom namostute, har har Mahadev,",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Makleshwar temple is historical temple of LORD SHIVA IN  anjar city towards south side of ANJAR CITY",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very Good Place For Peaceful Environment and Devotical Place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Mahadev temple, you feel relaxed in the temple environment",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}