{
  "places_with_reviews": [
    {
      "name": "Sri Veera Venkata Sathyanarayana Swamy Vari Devasthanam Annavaram",
      "rating": 4.7,
      "address": "Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "Except God everyone working here shows the discrimination. If you are VIP you gain special entry access to the temple. No proper mats placed on the steps or on the floor/road. So do not visit in Summer time. From entry to exit you have to pay money for every service.\n\nPrasadam was very good. Must have.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A very good place Lots of belief is there\nFrom all over country devotees pay a visit to this temple\nMainly Satyanarayan swamy Vratam\nThey participate with whole family members\nGokulam is there for Puja\nDaily devotees can have their food\nIn temple free of cost\nMarriages are held here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Annavaram is a temple town on the banks of the Pampa River. It is located in Kakinada district of the Indian state of Andhra Pradesh. The village has the temple of Veera Venkata Satyanarayana, a form of Vishnu on the Ratnagiri Hill. It is 18 km away from Tuni city.\n\nWeekdays are the best place to visit the temple and have the dharshan. It is very comfortable to make Sri Satyannarayana Swamy Vratham and have a speedy darshan. The temple is so good and the god as well. It is well maintained by the AP Temples Government.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is a famous temple of lord satyanarayana swami.the temple is famous for marriages and Satya Narayana Swami vratam which is done to full fill our dreams many people visit this temple for this vratham .the temple is surrounded by natural scenaries.we can see the beautiful river pampa, ANNAVARAM is a beautiful religious place..there is a beautiful lake. Parking space is available.prasadam in this temple is sooo nice .",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "We did vratham in the temple, we bought 1500Rs ticket, for 1500rs ticket, pandith sit with you perform puja . 2000Rs ticket also same as 1500 but it is in AC room. Dont waste your money to buy fllowers maala at the hall entrance. You can buy coconuts and puja samagri for Rs 250. Other items will be provided in the temple. Vratham takes 1.5hrs to 2hrs to complete. You can buy 200Rs ticket inside the temple to enter garba gudi to see swamyy closely.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Annavaram",
      "rating": 4.4,
      "address": "7CM4+MF3, Annavaram Town Rd, Velampeta, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "It's one of famous devotional place... Lord Satyanarayana swamy..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This Place is So nice & Cool historical history but  shops sold items double rates collected",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Only temple of Sri Satya Narayan Prabhu in India",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "India's first Hari Hara both under one roof inside one gopuram.om namo satyanarayana.lord Brahma is at foot part here",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I have been visiting for the past 4 year's great experience and also a pleasant place",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Sree Ganesh Residency",
      "rating": 3.7,
      "address": "OPPOSITE TO UPHILL GHAT ROAD, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "Waste of money\n\nIts really waste of money staying here.\n\nwe stayed for one day in 2 floor room no 22, its a smelly room washroom is too bad, No hot water, Tap will not work, bedsheets not changed. when we informed in reception he came up and said there is no smell and he cant give another room.\nWe have reached in the evening 6 Pm asked receptionist to switch on the greyser he denied to do it saying they will only switch it on the morning if you want to do bath wait till morning.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Clean and neat rooms. Parking not available, but devasthanam parking is there. Don't expect a professional service as this is not 5star hotel. But best budget hotel.\nOwner and team were nice.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Very Good..... Nice location...very good staff...best rooms for low budget... And near by Temple...",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "We just stay for few hours and stay was good\nRoom was ok as we just need for refresh and luggage.\nIf you didn't get rooms in upside temple will recommend to try this hotel once.",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "It's quite opposite to Temple route.But rooms are not that much good.But it is ok to stay for few hours.Later we will suffucation and bad smell..due to no air flow",
          "languageCode": "en",
          "rating": 3.7
        }
      ]
    },
    {
      "name": "Swamy Vari Temple Gate Way, ANNAVARAM",
      "rating": 4.6,
      "address": "7CH2+GFH, Annavaram Town Rd, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "The Swami Vari Temple Gate in Annawaram, Andhra Pradesh, is a remarkable testament to devotion and architectural grandeur. Standing before it, I was immediately struck by its intricate design, combining traditional and contemporary elements in a way that captures the essence of the region's rich cultural heritage.\n\nWhat makes this gate unique is its monumental scale; it's not just an entrance but a grand portal to spirituality. The ornate sculptures and vivid colors evoke a sense of celebration and religious significance. As you pass through, you're enveloped in an atmosphere of sanctity and tradition.\n\nThe gate's location in the heart of Annawaram adds to its charm, with a lively market and bustling streets that showcase the vibrancy of local life. The locals' warm hospitality and devotion are truly heartwarming, making it an immersive cultural experience.\n\nVisiting the Swami Vari Temple Gate is not just a journey through architectural splendor but also a pilgrimage into the heart of Andhra Pradesh's spiritual and cultural heritage. It's a place where history and devotion merge, leaving an indelible impression on anyone who has the privilege to explore it. A must-visit for those seeking a unique cultural adventure.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "October to February is the best time to visit Annavaram.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "వైకుంఠ నారాయణ మహాద్వారము Way to SRI SATYADEVA TEMPLE.GhaatRoad for all vehicles.Main entrance to reach hill top to visit Sri veera Venkata Satyanarayana swamy.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Owen vechical need on morning time.remaing transaction is easy.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very powerful temple",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Annavaram hill entry",
      "rating": 4.5,
      "address": "malika lodge, Annavaram Town Rd, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "Lord satyanarayan swamy is situated in the annavaram and lord Shiva and satyanarayan swamy both situated together is the famous thing about this place u can't find anywhere like this",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I felt a sense of inner calm and peace after visiting swamy varu.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Have to pay 20 to 50 rupees.. Must take bill after payment",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Divine place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Satyanarayana swami padalu",
      "rating": 4.8,
      "address": "prasadam counter, Pedestrian Trail To The Hill, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "A divine place where you can feel the mesmerizing spiritual experience",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "In East godavari - very famous temple, and every new couple after their wedding first visiting these temple then go to their home.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Please prepare extra washrooms",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very good, but maintenance is nill,",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's an entrance to the steps👣 way",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Vishnu Sadan",
      "rating": 4,
      "address": "79MV+36P, Road, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "Worst maintenance, worst service, wash basins are overflowing, bathrooms are bad and no water. No drinking water available anywhere near the building. Even the marriage halls smell very bad.\n\nThe temple management doesn't care about pilgrims and facilities. They just eat money.\n#FreeTemples",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It is a function hall at Vishnu Sadam among many different sized halls to cater to the needs of the people who would like to arrange for a marriage function.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Rooms and function hall is okay, but food supply is not available in hill area, Food is main  problem, transportation better u should use own vehicle",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice place for marriage events, In this building more than 35 halls are available which can accommodate 50,100 and 200 based on room capacity.\n\nMaintenance wise not upto the mark.\n\nFor catering services they only providing contact numbers who are tied up with the management.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good...seems newly developing area in other hill at annavaram. I feel the marriage halls are very small n cannot accommodate more than 50. There is much scope for development at this place is a holy place for Hindus. I also see that the frequency of  devasthanam provided bus facility to this place is minimal.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Annavaram Aalaya Toranam",
      "rating": 4.7,
      "address": "7CM3+29R, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "Whoever going to Annavaram temple do carry cash,no online transaction accepted even card swipe not available,\nNear temple only one ATM centre n no cash available over der also\nIt was so troublesome",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is famous place, especially marriages spot. For regarding any marriage you can book online for mandapam,you can notice a large fan nearly 5meters in diameter near to toranam, the view is too beautiful✨. Below the temple steps they sell delicious annavaram prasadham. You also notice annavaram project while going down in road path, nice spot for photo section. Be careful in turnings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Oldest and famous temple in Andhra Pradesh",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Aalaya thoranam is seen while entering the premises of Sree Veera Venkata Satyanarayana Swamy temple located on the Ratnagiri of Annavaram. This thoranam welcomes piligrims comming through stairs path of Ratnagiri. It is seen after Vana Durga temple in the stairs path.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "There are rooms there but not management is not giving at night time",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Annavaram Arch",
      "rating": 4.6,
      "address": "79CR+G7F, Annavaram, Andhra Pradesh 533406, India",
      "reviews": [
        {
          "text": "I was on way from vijaywada to vizag. With God grace I got chance for darshan at this temple.\nThere is no word to describe the mental peace we get at this temple.\nAmple parking is available at hill top.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful place and best to visit on week days as no resh",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The temple is very peaceful and Auspicious, but shops near the temple will charge you almost double the price of any item.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Near that arch  I saw a lassy  making shop\nAnd I taste  the lassy that was verry delicious\nAnd yummy tasty really I love the taste..........",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very auspicious and spiritual place to visit🙋‍♀️😇",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Thalupulamma temple",
      "rating": 5,
      "address": "7C5C+P9W, A. Kothapalle, Andhra Pradesh 533408, India",
      "reviews": [
        {
          "text": "Good nature",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 5
        }
      ]
    }
  ]
}