{
  "places_with_reviews": [
    {
      "name": "Manav Mandir",
      "rating": 4.5,
      "address": "Ankleshwar GIDC, Piraman, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "Very peaceful, located at the heart of city.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful and peacefull place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Have grown up watching this temple evolve to what we see today. A lovely place of worship.\n\nRegular celebrations are held on various festivals. Janmashtami, shivratri etc are celebrated with gusto.\n\nManav mandir is one of the oldest places to organise Navratri Garba and In the most traditional way without any unnecessary modernizations.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "MANAV MANDIR, LOCATED IN GIDC NEW COLONY AREA OF ANKLESHWAR....This Unique Name Is DERIVED FROM Another Temple of MEMNAGAR, AHMEDABAD....\n\nIT'S MANAGED BY GIDC SANSKRITIK YUVAK MANDAL... THEY ARE ORGANIZING ALL MAJOR  HINDU FESTIVALS INTO THEIR PREMISES, REGULARLY...\n\nA MID SIZED SATSANG HALL  IS ALSO AVAILABLE IN THE TEMPLE CAMPUS FOR VARIOUS COMMUNITY RELATED ACTIVITIES...\n\nJAI BHOLENATH...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good atmosphere of worshipping of Lord Shiva at this temple here having good vibes",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Joggers Park Ankleshwar",
      "rating": 4.4,
      "address": "Gattu School Rd, opp. Mangalmurti Complex, Tulsikinj Society, GIDC, Ankleshwar GIDC, Ankleshwar, Gujarat 393002, India",
      "reviews": [
        {
          "text": "A very good park for activities such as playing sports, doing exercises, spending leisure time amidst greenery etc...👍👍",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place!! Green ground & calm atmosphere. Excercise tools available",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The well-maintained paths provide a pleasant environment for jogging or walking .Joggers Park is a refreshing haven in the GIDC residencial area.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Fun place to spend quality time with family and friends, has enough area to jog, run, exercise, hangout and chill.\n\nIt has got nice greenary all around, has a fountain, and public restrooms are also available.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice Place for visit, chilling, morning and evening walk. Best place for kids to play. Clean and neat place. So many different trees available in heres. Seating places also good. Gardening work is also good.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Ramkund Mandir",
      "rating": 4.3,
      "address": "RAMKUND, Off, Hansot Rd, Vrundavan Township, Boidara, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "Temple & ashram with facilities for large numbers (200 - 300 people at a time) of pilgrims.  Kund (pond) water looks green in color.  It's crowded, noisy and litter everywhere.  Vehicles also crowd around.  The ashram people are doing their best to deal with lots of pilgrims visiting.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This place is very sacred place. In Ramayan time Prabhu Shri Ram, Sita and Laxman pass through this place. There is an ancient reservoir Kund here. which is called Ram Kund. There are many temples inside this place. Here the saints who do the Narmada Parikrama mostly come here to stay. There is a good arrangement for food etc. for the devotees, Also this place contains śmaśāna (श्मशान) is a Hindu crematory ground, where dead bodies are brought to be burnt on a pyre.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Historical place at ANKLESHWAR .Providing stay and food to people travelling bank of river Narmada giving homage.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very Spiritual Place. Rama Kund.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the historical place.\nGau shala.\nRam kund.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "BAPS Shree Swaminarayan Mandir",
      "rating": 4.6,
      "address": "406/15, Sardar Patel Society, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "This is one of the biggest and loving temple of gujrat Ankleshwar at 7:00 pm there is always a kirtan and Bhajan with there Swami",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A very calm n quite temple. Not at all crowded",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple is in wide place and also it is very clean. You can spend beautiful time there. Temple is just adorable. 💖",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's exllent temple. Everyone to see at least once to feel happiness and peaceful.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very calm & devotional nature. Very clean area",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pashupatinath Temple પશુપતિનાથ મંદિર",
      "rating": 4.6,
      "address": "J239+C6V, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "This temple is conveniently situated in the Ankleshwar GIDC area, making it easily accessible for both locals and visitors.\nAnkleshwar GIDC Pashupatinath Temple is a hidden gem in the industrial landscape of Ankleshwar. Its spiritual ambiance and architectural beauty make it a must-visit destination for those seeking a spiritual retreat in the midst of urban life.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful and beautiful Temple🌿🍃\nJay Pashupatinath🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Temple of lord Shiva , Hanuman, Sita Ram and Radhe Krishna. A peaceful place where people reach to pray.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice temple. Cleaning is quite good. Old age people can spend all the day out here. Silence make great effect and gives u change to think over ur self.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful and peaceful temple where you can get darshan of Lord Ganesha, Shiv ji, Ram Lakshman And sita ji, Hanuman ji and Shani Maharaj. If got a chance then definitely come here and take blessings from supreme God..\nHar har Mahadev.. Jai Shankar maharaj 🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Halimshah Datar Bhandari R.A.",
      "rating": 4.9,
      "address": "mullawad, near regal hall, Joshiya Faliya, Taibah Nagar, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "Very famous Dargah in Ankaleshwar ..hardly 1 kms from Rlwy. Stn. Very well maintained masjid & garden style Qabrastan in the Dargah complex...only few eateries nearby..",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very known Sufi saint belonging to the khawaja garib nawaz, name is abdul halim shah datar bhandari, he is treasurer of khawaja garib nawaz, pilgrims come from across nearby cities and villages, very peaceful place and also well maintained.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice place for spiritual peace blessing from Almighty Allah. Must visit",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "This is the place where everyone's heart finds peace",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "The most holy place of Muslim community after Ajmer Dargah Sharif.even non-muslims are also keeps their trust on this , called HALIMSHADADA.",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Mahadev Temple",
      "rating": 4.4,
      "address": "Satyam Park Society, J2Q9+HMV, Gadkhol Part, Gadkhol Patiya, Ankleshwar, Gujarat 393001, India",
      "reviews": [
        {
          "text": "In this Mahadev Temple experience is really incredible.... Everyone have to come here and take self experience here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A great place to visit in bharuch ...at the bank of Narmda rever. U can enjoy boating also.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Situated at the bankRIVER of maa NARMADA",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful Place, seat available to sit and relax",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nyc but not maintened good government",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Akhileshwar Mahadev mandir, ONGC Temple",
      "rating": 3.3,
      "address": "J2P4+HPX, Gadkhol Part, ONGC Twp, Ankleshwar, Gujarat 393010, India",
      "reviews": [
        {
          "text": "Quite & serene location  inside the township",
          "languageCode": "en",
          "rating": 3.3
        },
        {
          "text": "A very good Temple",
          "languageCode": "en",
          "rating": 3.3
        }
      ]
    },
    {
      "name": "Jalaram Temple",
      "rating": 4.5,
      "address": "diva road, JXQV+P2M Jay Jalaram Bapa Nu Mandir, Juna Diva Rd, Bharuchi Naka, Ramnagar, Ankleshwar, Gujarat 393002, India",
      "reviews": [
        {
          "text": "I planned to go this temple we also left our home as per our schedule but happen some big traffics problem and accidents on the highway road so we could not reach over there.\nBut the thing is that place is very awesome and clam\nIf we get another chance than sure we will visit this temple and will take the bless of Jalaram Bapa.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the best temple located near bharuchi naka, there is a community hall also we can hire it on rent for functions also very good place .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Natural place.\nNice sitting area....\nIf u want piece then visit..👌☺️😊",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very religious place. People come here for peace of mind and fulfill their wishes. Very peaceful environment here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice template with good location.\nHad a parking space also",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Akleshwer Mahadev",
      "rating": 5,
      "address": "J2G7+FW5 Chota bajar, Gadkhol Part, Ankleshwar GIDC, Ankleshwar, Gujarat 390031, India",
      "reviews": [
        {
          "text": "Subscribe may senall",
          "languageCode": "en",
          "rating": 5
        }
      ]
    }
  ]
}