{
  "places_with_reviews": [
    {
      "name": "Shri Aryadurga Devi Temple",
      "rating": 4.8,
      "address": "M846+333, Mathakeri Rd, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "This temple is very beautiful and peaceful and is dedicated to Shri Arya Durga Devi. The temple is situated in a lovely town - Ankola of Uttarakannada (UK)district of Karnataka.\n\nAlong with the main temple belonging to the goddess Shri Aryadurga, the other two small distinct temples are in the same premises, one belonging to Shri Someshwara and another belonging to Shri Chandika devi.\n\nAlso a marriage hall is there in the premises of the temple.\n\nThe goddess in the temple was shifted here from present day Goa land some five centuries ago, to avoid atrocities of then Portuguese rulers.\n\nThe temple is managed by the heirs of families of those who brought the goddess here from Goa then.\n\nRooms are available for accommodations but one has to book a day in advance.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A nice temple. Has a clean surrounding. Very calm and quiet. One can experience a peaceful and divine feeling.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Use Google map to avoid recent changes on roads. Devalay has Bhakt Niwas. Rooms are spacious.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Temple premises is cleanly maintained. Rooms are available for visitors as well as for kulavi. Sanitation is carried out properly. Someshwara temple is also located within the premises of this temple. A shop is located just at the entrance of the temple, you may get some fresh juices there.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is always a beautiful visit for us. The peace and quiet is unmatched. Good provision for parking, washrooms and in general very clean. The approach road is narrow but not a problem for SUVs as well.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Shri Lakshminarayana Mahamaya Temple",
      "rating": 4.8,
      "address": "Post: Vandige, Hanumatta, Mathakeri Rd, Ankola, Karnataka 581357, India",
      "reviews": [
        {
          "text": "Calm divine place. Beautiful and well maintained temple. Very close to the national highway and the bus stand. A small walk from NH to visit this glorious temple of uttara Kannada district.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most beautiful temples I have visited in a long time. There is a calm in this place that can't be explained in words. Located in a rural place that is godly with lovely people, great aura and the tastiest food that satiated my soul.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This temple is dedicated to Shri Lakshmi Narayana Mahamaya is very beautiful and peaceful. It is situated in a lovely town named Ankola of Uttarakannada (UK)district of Karnataka. You can feel the atmosphere in and around the temple like in the Malvani-Ratnagiri region of Maharashtra.\n\nParking area is not available for the visitors, have to park on the temple premises adjacent roads which are very narrow.\n\nThe goddess in the temple was shifted here from present day Goa land some five centuries ago, to avoid atrocities of then Portuguese rulers.\n\nThe temple is managed by the heirs of families of those who brought the goddess here from Goa then. Accommodation rooms present in the temple premises are also reserved for those families only.\n\nAlso a marriage hall is there in the premises of the temple.\n\nA separate beautiful temple belonging to Shri Bhagavati is present in the temple premises just to the back side of the main temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A nice temple to visit if you are in the vicinity. Note that the temple closes at 12 noon and opens at 4 pm. For entering the temple you need to follow the temple dress code",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This is a very beutiful temple. There are total 3 temples along with the main temple of Lord Laxminarayan Mahamaya.\n\nThe surrounding area is very peaceful. I often visit here.\n\nThere is also a canteen here. One should get a coupon at the office for food. Food is good and tasty.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "NadiBag Beach",
      "rating": 4.4,
      "address": "J7XM+45C, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "Small, neat and clean beach near to Ankola. Good for sunset. On weekend gets crowded, parking your vehicle may require sometime as there is space crunch near entrance. Hike to nearby hill gives stunning sunset views.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "If you on way to coastal region around ankolo .it's a worthy cleanest sunset beach\nWhere u can enjoy a sunset with a scenic sky with  blissful tiny waves",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Quite and calm beach...there is no crowd..beach side is not soo clean...good place to spend some peace time ...One view point is also there...This beach is not soo safe",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very calm ,serene and beautiful beach",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Clean beach ⛱️🏖️ safe beach , it's is in ankola city , not much crowded  from hubballi 3 hr ka distance hai road is very good , is route Mai Jada hotels nahi milenge",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shri Shantadurga Temple",
      "rating": 4.7,
      "address": "M862+VG3, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "Grama devate of the lovely town of Ankola.\nThe temple is very beautiful.\nAlong with the main temple belonging to Shri Shantadurga devi, there are some 7 or 8 small distinct temples of different deities inside the temple premises.\nVehicles have to be parked on the road in front of the temple premises.\nThe temple design is very peculiar resembling the temples in Goa and Malvan region in Maharashtra.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A beautiful and old temple with a serene atmosphere. It is maintained well. Good place to visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the popular and powerful temple of South Karnataka..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice And Ancient temple must visit this place if you’re in Ankola",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice temple. Neat, clean and calm.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shree Kundodari Temple Ankola",
      "rating": 4.7,
      "address": "M845+GFH, Tenkankeri, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "This temple is dedicated to Shri Kundodari Mahamaya Chamundeshwari devi. The temple is very beautiful and peaceful. It is situated in a lovely town named Ankola of Uttarakannada (UK)district of Karnataka.\nAnother temple belonging to Shri Vighneshwara Mahaganapati facing west is situated on another side of the road in front of the main temple.\nThe goddess in the temple was shifted here from present day Goa land some five centuries ago, to avoid atrocities of then Portuguese rulers.\nThe temple is managed by the heirs of families of those who brought the goddess here from Goa then.\nRooms are available for accommodations and are good with hot water facilities round the clock.\nThe temple's office staff Shri Rohidas Pai is a kind and helpful man.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A calm space. Temples are located on both sides - Kundodari temple and Mahaganapathi temple. This place has a lodging facility. Rooms are well maintained with proper hygiene. Rooms are spacious with good vibes. Water insufficiency is the major drawback here. Overall, the best place to stay.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Positive vibes everywhere....10 min distance from bypass road if you come by travels...And same distance from busstand....hire auto ..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple to visit in Ankola. Extremely well maintained and clean.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful environment & oldest temple 🙏🏼",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kamakhya Devi Temple (Kamrup Kamakhya Devi)",
      "rating": 5,
      "address": "P72J+6RF, Teppadakere, Bhavikeri, Ankola, Karnataka 581321, India",
      "reviews": [
        {
          "text": "Had a devine experience visiting this temple. An ex-serviceman built this temple on his own land using his retirement benifits !! The temple came into being in March 2020. There is an aura of devine presence inside the temple. Though small in size the temple has Ma Kamakhya, Shiva, Vishnu, Brahma, Laxmi and Saraswati inside a cave like Sanctum Santorum. There is also a Sphatik Sri Chakra inside. The ex serviceman does daily puja himself and meditates inside the temple.",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Nandi Point",
      "rating": 4.5,
      "address": "M7CG+4M3, Ankola, Karnataka, India",
      "reviews": [
        {
          "text": "Located outskirts of Ankola town, this is a beautiful place with a small, hidden beach amidst two hillocks. Going up these hillocks gives a very beautiful view of the surroundings that include Arabian Sea, nearby Keni beach, the Lakshminarayana Temple and fields around. Definitely worth a visit. One of the hillocks here is very rocky and one has to be careful if interested in going up.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The view of the ocean from here is amazing. Virtually no crowd.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best beach ever i seen",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice beach",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is super excited 😍👌 I like the place 😊😍",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mahaganapathi Temple",
      "rating": 4.9,
      "address": "M84F+VR5, Ankola, Karnataka 581357, India",
      "reviews": [
        {
          "text": "It's my landmark",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Namma uru",
          "languageCode": "en-US",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Fathullah al Qadiry Dargah",
      "rating": 4.9,
      "address": "Primary School, Near, Bobruwada Rd, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "Really peaceful for my mind",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "A place to visit for peace of mind",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very good place .\nFathhullahil qadiri albagdadi is the grand son of the Shaikh Muhyadden Abdul Qadir jeelani and the grand father of the Shaikh Muhammed Qasim valiyullahi  raliyallahu anhum va nafa_anabihim fiddarayn.\nThe Shaikh known as ankola upapa among the qadiriya followers in india",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "The place in outskirt of city, sits between green.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Best tour place for Muslims and\nMore peaceful place in the district",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Jumma Masjid",
      "rating": 4.9,
      "address": "M75X+3QM, Belambar Beach Road, Ankola, Karnataka 581314, India",
      "reviews": [
        {
          "text": "Decent place for prayers!!!",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "It is the place were people pray with peace and respect every other religion 😀😀",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Beautiful and most popular jumma masjid",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very clean masjid",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Beautiful masjid",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    }
  ]
}