{
  "places_with_reviews": [
    {
      "name": "Sri Lakshmi Narasimha Swamy Vari Devasthanam",
      "rating": 4.7,
      "address": "Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Discover a historic temple with a rich legacy, though lacking maintenance and proper roads. Requires patience and time to reach from Vijayawada. Rely on locals for directions instead of Google Maps, which may suggest a route through the Godavari river involving boat travel starting from 5 am. The temple is a captivating ancient wonder, brimming with spiritual energy. 🏛️✨",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple located where Godavari meets the ocean. Better to plan in odd days to avoid crowd. If you buy RS.100 ticket you have antaralaya darshan where you can see the god from few feet away.\n\nFood is served inside the temple for pilgrims.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple  place where the Bay of Bengal and Vashista Godavari, a tributary of the Godavari River, meet. It is a beautiful temple located adjacent to the Vasishta Godavari river and nearby the sea coast. The temple premises are kept very clean, creating a pleasant atmosphere for visitors.\n\nFor darshan (sightseeing), entry to the temple is free. However, if you wish to have a closer view from inside the Garbhagudi and perform archana (ritual offerings), there is a ticket price of 100₹ per person.\n\nOn the back side of the temple, free meals (prasadam) are served starting from 10:30 AM. The prasadam is a simple vegetarian meal that is satisfying. It is highly recommended not to miss it. If you wish to contribute, you have the option to donate for annadanam (food distribution).\n\nLaddu prasadam is also available at the temple for a price of 15₹ per laddu. The taste of the laddu is known to be great and is popular among visitors.\n\nThe temple has adequate paid parking space adjacent to the premises, making it convenient for visitors to park their vehicles. However, it's important to note that food availability outside the temple is very limited, so it is advisable to make necessary arrangements beforehand.\n\nOne thing to keep in mind is that public transport options to the temple are limited. There are limited buses available to Razole town. For those coming from the train and Vijayawada side, Narsapur is the nearest rail and major bus station hub. From there, you will need to cross the Vashista Godavari river by ferry to Sakhinetipalli and then take a shared auto to reach the temple, which is a distance of approximately 16 km.\n\nOverall, the temple offers a beautiful location, cleanliness, free darshan, prasadam, and parking facilities. However, it's important to plan your transportation accordingly, considering the limited public transport options.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sri Lakshmi Narashimha Swamy Temple built at the place where Vashista Godavari and Bay of Bengal meet. The Temple was built by Pallava Kings during 16th century and later developed by Reddy Kings. Well maintained Temple. Plenty of parking facility. Festivals are celebrated in very grand manner thousands of devotees will participate. From Narsapur ferry service is available for two and four wheelers. Road over bridge is on the other side of the island.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple was constructed in 15th or 16th centuries by Pallava kings and later Peddapuram Reddy kings. The present structure is said to be built by Kapanati Krishnamma of Agnikula Kshatriya clan in 1823. The temple tower has five storeys depicting various incarnations of Vishnu and sculptures of lions on four sides\n\nLot of open parking space.\nDuring festival times, there will be heavy croud.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Anthervedi",
      "rating": 4.8,
      "address": "8PMM+GCR, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Scenic temple with rich history, limited access due to poor roads. Slightly overhyped but holds the powerful essence of Lord Narasimha. Maintenance required. Accommodation for few available.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Laxmi narasimha temple & nearby antarvedi beach.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very famous historical temple believed as our Kula daivam",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Must visit place,\nI really loved free food (Anna prasadam). White rice, dal, samber, curd, curry, sweet, good quality and simple food. Much better than outside oily food.\nIf you want to you can donate/ contribute to free food progrt by giving  ₹100 to ₹5000 temple will provide food on behalf of on your birthday day or any special day.\n\nYou can visit godavari beach from behind light hose spend time with kids sun rise/sun set very good scenic spot.\n\n**Try to avoid boating in this place they charge you ₹650 per person for 3 spots, ₹350 for two location. It's really not worth. They say we can go till the spot where godavari merges in ocean, but you will get better view from Beach. . If you go to Appanapelly same boating you will get it for ₹50 per person, or ₹400 you can hire a small boat for 1hr .",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Anna Chellalli Gattu",
      "rating": 4.5,
      "address": "8P7C+V68, Unnamed Road, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Discover Antervedi's unique charm with Anna Chellalli Gattu! Where Godavari meets the Bay of Bengal, this place offers an adventurous blend. Beware of jellyfish, high waves, and river forces. A 1.5 km walk, sometimes less, leads to the beach, but watch out for rising tides. Safety first – avoid the water without precautions. Navigate challenging roads with patience; locals can guide better than Google Maps. Explore the lighthouse (timings vary, no lift – be prepared for a stair climb). Enjoy the unique black sand beach experience!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The place has history where the river Godavari merges with the Bay of Bengal. A must visit place in Andhra Pradesh. The scenery on the way to Antarvedi is breathtaking. A place to visit at least once in our life. The temple of Lord Narasimha should be seen there. It is also one of the 9 Narasimha Swamy Temples in Andhra Pradesh.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A unique confluence point of Godavari River and Bay of Bengal.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good for sightseeing\nDangerous to Swim as it is too deep",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Love the beach, it’s so pleasant and peaceful.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Antharvedi Beach",
      "rating": 4.5,
      "address": "8P9P+X9H, Beach Rd, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "It's meeting point of godavari and the sea. There is also light house beside the beach and one can go on top of the light house by availing the ticket.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "a few vendors selling ice cream on beach. the visitors were seen making the beach dirty with icream covers and chops cover and plastic bottle.\n\nif drive a little away from main access then super beach",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The most dirty beach I have ever seen especially be careful with cows",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The place where the Bay of Bengal and Vashista Godavari, a distributary of the Godavari River, meet. Good to hangout.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Godavari River and Sea Mixing Point",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Antarvedi Lighthouse",
      "rating": 4.3,
      "address": "8P8G+V48, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "It's a light house with optic light. You are permitted to reach the top of light house. There was a minimal entry fee for visitors and camera fee was extra few bucks.\n\nNot all people can reach the top of light house. Every can reach up to certain level by using RCC steps. From there there was a 70 degree metal ladder with confined opening to the next level where actual light source is present. This particular section makes a critical pass for elders and kids.\n\nOnce you reach top you have supereb views of ocean and sangam point of godavari into bay of Bengal.\n\nVisitors are generally allowed from 2 pm to 5pm.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The view is really great, you can see the point where Bay-of-Bengal and the Godavari River meet (sangam).\nThere are about 110 steps to reach the top!\nThe ticket is ₹10",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Excellent view 👌🏽\nYou can watch the Godavari river at one side and Sea at the other side…\nThis would be open at 3 to 5 PM.\nDont miss this in your Antharvedi trip",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You can see godavari and sea from here\nNeed to climb ladder at top floor not recommended for old-age people",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Some far away from beach... It's actually godavari river... You can not bath there",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "ANTARVEDI DEVASTANAM",
      "rating": 4.8,
      "address": "8PPG+852, MDR79, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Awesome place to visit",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very Good Good Response Good Location Very Pleasant Very Happy Good Enjoy Super Places",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Antharwedhi",
      "rating": 4.6,
      "address": "8PPM+7G4, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Devotiess must visit this place, old monuments, great Indian sculptures 😇, in many serials the shooting is done in the temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bliss full place . No rush . Temple is good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit temple. And the merge of Godavari with Sea. And the hard core konaseema photo scenic nature..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Oh my God place....great divinic place ...a must visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Antarvedi Beach",
      "rating": 4.4,
      "address": "8P8F+8FH, Unnamed Road, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Beach experience: Overhyped with black soil sand, occasional jellyfish adding a hint of unease. Average beach, poor road access, long travel from Vijayawada. Don't miss the Godavari lighthouse overlooking the Bay of Bengal—scenic but not for swimming.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The beach is very near to the antarvedi Lakshmi Narasimha Swamy vari temple. Nice beach and it has abundant place to chill at the beach. Very large space for lunch gatherings. But very limited hotels nearby. Overall must visit after the temple darshanam otherwise remaining beaches are having better facilities as it is very remotely located with less transportation facilities.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I would define this beach as serene, calm and mighty as it's the sangam space of river Krishna , Godavari with sea. It's absolutely no crowd beach has so much room for tourism development. Beach entry is quite tricky to find if you aren't a local. It was very windy the day i visited could see sand flying away in spirals.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best place for hanging out and enjoy a lot",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "No words to explain. Have to visit and get experience..",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Antarvedi sri vasishta boat point",
      "rating": 4.7,
      "address": "Beside Vasishta maharshi ashramam ,Near Sri Lakshmi Narasimha Swamy temle,Antarvedi pallipalem, 8PPG+845, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Wonderful climate when we visited but missed mangrove  ride due to light fail",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Speed boats are not available, It was very much boring with the normal boats. When you decide to go to the mangrove forest please go with the masks and kerchiefs, it was very much smelly. Not so much worth the money.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A must visit place when you visit Antharvedi. The boat guy charged us Rs6000 where they'll assign a boat which can accommodate atleast 10 people. The trip consisted of the Mangrove forest, the place where the river meets the sea and the island. People with kids need to be a bit cautious. Its quite hot and sunny, so be prepared and don't forget to bring water.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice staff and I strongly recommend boat ride here. All the important locations in this area are must be visited by boat only.sangamam, mangrove forest and island are the important places. It takes nearly 2 hours to cover all the locations. Boat operators are also very nice. They are explaining about every location.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great experience with Boating…\nMust go place along with Family/Kids",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Godavari River Sangamam",
      "rating": 4.3,
      "address": "8PF9+534, Antarvedi Rd, Antervedi Pallipalem, Andhra Pradesh 533252, India",
      "reviews": [
        {
          "text": "Very famous temple Lord Almighty Narshimha Swamy temple is located on the banks of Godavari river and mighty Godavari river ends in Bay of Bengal",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Beautiful place where godavari river joins into bay of bengal",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's ok👌 good ideas of all people helping about google map thank to shring",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Wonderful.,............",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}