{
  "places_with_reviews": [
    {
      "name": "Ardhagiri Anjaneya Swamy Temple/Aragonda Anjaneyaswamy",
      "rating": 4.7,
      "address": "Ghat Rd, 7XV2+RFX, Aragonda, Thavanampalli, Chittoor, Paimagham, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "Blessed to Visit this temple. Peaceful location with Norma crowd. Good facilitates and road to reach the temple. A must visit temple for lord Hanuman blessings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very Pleasant  place. Everyone will get the peaceful Darshanam of Lord Hanuman here.\n\nYou'll get pure water from gundam here\n\nBeautiful environment 💗",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good place to visit good view and nice seenarys\n\nVehicles need to pay 20per vehicle for going to top of hill\n\nThe way to ayyappa temple was not good till shiva temple it's good",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very peaceful temple on hill side and has holy water, which is believed to have natural medicine properties",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "First time hearing about this place. This place is called ardhagiri as a piece of Sanjeevani mountain fell at this place when lord Hanuman was carrying it. Serene place, gets very busy on pournami days. There's an entry toll of 50 rupees. Lots of parking available.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Arakonda",
      "rating": 5,
      "address": "7XJ4+FHJ, Aragonda, Andhra Pradesh 517129, India",
      "reviews": []
    },
    {
      "name": "Abhaya Anjaneya Swamy Temple",
      "rating": 4.7,
      "address": "6WWW+XWH, Mathyam, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "Jus loved it.  .. every poornima and Tuesday there are special poojaa and abhishekam s.. and free meal distribution at evenings.. good place for spiritual and relaxation..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Today I've visited this temple, It's very dainty, Pass and visit the place as many times as you can.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Don't miss this temple if you pass through this road.  Just look around this temple !! Fully surrounded by mountains and you have coconut farm in front of the temple . Serine atmosphere . In the temple they gave yummy curd rice and tamarind rice . Anjaneya is big in stature. He must be 20 feet tall . Nice and peaceful!!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is a new temple on the way to Tirupathi, located in a small village. It is a very small temple, hence not much of crowd. The idol of Lord Anjaneya is magnificent in size, though much smaller than Nanganallur or Namakkal Anjaneya temple, yet pleasing to devotees.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "On the way to Tirumala on foot, we were here on  6th day ....",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sri Ramulavari Temple",
      "rating": 4.3,
      "address": "7XJ4+R7J, Ghat Rd, Aragonda, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "Very good atmosphere in the temple. Temple is pretty big sized",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the historical lord sri rama temple\nThis temple is specially famous for wedding\n\nJai sri RAM",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Once upon a time it's a big temple...now it's a business point",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is the place where anjeneya was doing Pooja to\nLord ram",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peaceful temple with good maintenance",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Madavaneri, Vinayaka Temple",
      "rating": 5,
      "address": "7XWH+8HR, Maravaneri, Divili, Andhra Pradesh 533433, India",
      "reviews": [
        {
          "text": "Super 💕 it's very powerful God",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Nanda yy",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Easy to use",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Old tample",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Mathyam Paipalli",
      "rating": 4.7,
      "address": "6WVR+4X5, MDR159, Mathyam, Andhra Pradesh 517131, India",
      "reviews": [
        {
          "text": "Full of coconut trees",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Super I am happy",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good experience",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sivakona",
      "rating": 4.6,
      "address": "8X75+M2G, Cherlopalle, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "very beautiful place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Cool and peaceful place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mathyam CSI Church",
      "rating": 5,
      "address": "6WVW+93M, Mathyam, Andhra Pradesh 517131, India",
      "reviews": [
        {
          "text": "super....",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Diguvamagham Ramalayam",
      "rating": 4.4,
      "address": "7XF8+3VJ, Diguvamagham, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "It is my native village. In the past, during my childhood, I saw and practised many of the oldest community activities like 1)  mari-bhiksham by the villagers especially by the children, chata-poraka by Sri Balakrishna Naidu, and,gorrelu-mekalu _ a large gathering of village children by late Sri Kuntamukkala Lakshmaiah Naidu and late Sri late Dasari Muneppa for a procession to cheruvu on the ganga-jathara festival day, 2) the nine days Sri Rama Navami utsavalu, 3) a month long Bhajanalu during Dhanurmasam, 4) Yeddulu tharime Pandava on Makara Sankranthi day, 5) the  greatest Maha Bharatha Harikathalu with Rathrivela Natakalu in Tamil by the GREAT TK Kannaiah Drama Party of TIRUPATTHUR, Tamilnadu, and, 6) the Pravachanams with criticisms on Maha Bharatham, Bhagavatham, and Srimad Ramayanam by late Sri Kadiyala BASAVAYYA NAIDU, late Sri Vallery MUNASWAMY NAIDU, late Sri PATURU RAJAGOPALA NAIDU ,Ex MLA, MLC, and Ex MP on the village rachha-banda\nand veedhi arugulu are highly ever memorable, about witch today's children and people don't know and can't understand. My village is very very GREAT in many aspects and I am very proud of them.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small temple with attractive idol!!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Typical Andhra village Temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Our temple",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Swayam Bhvaneshwara Swamy Temple",
      "rating": 4.7,
      "address": "7WQX+M6G, Paimagham, Andhra Pradesh 517129, India",
      "reviews": [
        {
          "text": "Swayambhuvaneswara swamy & Kumara swamy Temple is an old and beautiful temple with historical background located near to the entrance road going to the popular Ardagiri Hanuman temple in Aragonda Village Chittoor district.\nOne must visit this temple and have dharshan of lord Shiva and Kumara swamy, along with that you can see an old cave entrance inside the temple, which has been closed, but as per the information given by local people, the cave leads to the Ardagiri hill top and has a water canal inside.\n\nAlso some tales says that in olden days, rushi's & devatas come to the temple from Ardagiri hill, through this cave in the early morning and perform pooja for lord shiva.\n\nArdagiri Hanuman temple is yet another popular temple to be visited, which the name Ardagiri means \"half of the hill\",(i.e part of Sanjeevini hill fell here, while Lord Hanuman carrying it on the way as per the stories) and the Pushkarini near the temple is filled with water since many years has never dried and has medicinal properties and its a cure for many illness.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple. Very peaceful place. I go to this temple daily. Very peaceful and lovely place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple and have a decent sized hall for small to medium-sized functions.....",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best peaceful place",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    }
  ]
}