{
  "places_with_reviews": [
    {
      "name": "Mulkharka Lake",
      "rating": 4.6,
      "address": "5PC3+322, West Bengal 734319, India",
      "reviews": [
        {
          "text": "ulkharka Lake, nestled in the serene landscapes of West Bengal, India, is a hidden gem that beckons nature lovers and adventurers alike. This pristine lake, surrounded by the lush greenery of the Himalayan foothills, offers a tranquil retreat away from the clamor of city life. My visit to Mulkharka Lake was an unforgettable journey, not just through the beautiful terrains of West Bengal but also into the heart of unspoiled nature.\n\nThe journey to Mulkharka Lake is an adventure in itself, involving a scenic trek through dense forests and charming villages. The path, which can be challenging at times, rewards travelers with stunning vistas of the surrounding mountains and a chance to witness the rich biodiversity of the region. The trek is a delight for bird watchers and nature enthusiasts, with numerous opportunities to spot wildlife and exotic flora.\n\nUpon reaching Mulkharka Lake, the sight that greets you is nothing short of magical. The lake, with its crystal-clear waters reflecting the sky and the forests around it, seems like a painting come to life. The silence around the lake is profound, broken only by the sounds of nature, making it an ideal spot for meditation and reflection. The fact that the lake mirrors the image of the majestic Kanchenjunga on a clear day adds to its mystical charm, making it a photographer's paradise.\n\nWhat makes Mulkharka Lake even more special is the local lore attached to it. The lake is considered sacred by the local communities, and it's easy to see why they hold it in such reverence. There's a sense of peace and purity that envelops you as you sit by its banks, making it a perfect place for those seeking solace and a deeper connection with nature.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Offbeat place so do not expect any special arrangements, but great place to visit for the people who are photography lovers. Visit early in the morning on a clear day to see thw reflection of Mt Kanchenjunga in the water of the lake.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Well preserved natural lake surrounded by forests in a very peaceful setting. Accessible by a long and very rough stone road. There are plenty of homestays on the way. Of course they need to be building some tourist concrete houses nearby so not sure how much time it will stay such a calm place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The lake is situated on the top of mulkharka village .one has to park their vehicle at the parking and walk the rest of the path to the lake",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mulkharka, it is located practically in West Bengal but one has to reach via Sikkim. Little costly to visit this place. And should have passion for nature. Every year lots of tourists visit this place. What is the importance of this lake? One can witness the shadow of Kanchenjunga in this lake. Due to fog we couldn't capture that pic.The stones are arranged in this way by the visitors to fulfill their wishes from God of lake.Govt tourists guest house,in pic, is also there. Baki search in google.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mankhim Top Kanchenjunga View Point",
      "rating": 4.6,
      "address": "5MPJ+78R, Aritar, Sikkim 737133, India",
      "reviews": [
        {
          "text": "After a short trek you will reach this view point. Good place for sightseeing. You will get a very good scenery from here. You can see edge of the Kanchenjunga from here along with other mountains. Below you can see Lampokhri (Aritar) Lake.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent place with great view!! But have to hike for 10 mins.. At the View Point there's a Shiva temple. Very peaceful place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It was one of the most Finest destinations and is certainly a must visit if you come to Sikkim.\n\nYou can witness the scenic Kanchanjunga mountains if you're lucky to see a clear day.\n\nYou'll certainly witness Beauty through your eyes. It's absolutely Elegant and one of the best Viewpoints here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The beauty of this place from the top is absolutely mind-blowing, although it was foggy and cloudy, but it was still beautiful. There is a temple as well as a small eatery where you can get momo, wai-wai and other snacks and beverages.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Mankhim View Point in Sikkim is a hidden gem that offers an extraordinary glimpse of the majestic Kanchenjunga, the third highest peak in the world. Situated at an elevation of around 6,500 feet, this viewpoint provides an unparalleled panoramic view of the snow-capped Himalayan ranges. The sight of the sun's rays painting the peaks in a golden hue during sunrise is a breathtaking spectacle that will leave you in awe. Mankhim View Point is a must-visit destination for nature lovers and photography enthusiasts seeking to capture the mesmerizing beauty of the mighty Kanchenjunga in all its glory.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Rishi Ecotourism monkey lodge",
      "rating": 4.3,
      "address": "Reshi, road, Kashone Khasmahal, West Bengal 734311, India",
      "reviews": [
        {
          "text": "Absolutely pathetic behaviour from the owner's family - a lady who spoke very impolitely and in a bad manner. Unexpected from someone who is associated with the hospitality business. No warm water available, no electricity backup. We had to sleep in extremely stuffy rooms without electricity at a time when temperatures were about 27/28 degrees. One had to wait for at 30 minutes before you could get a cup of tea.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The location is awesome with the river and mountains all around. The rooms however are okay. The geyser facility is not there and the bathroom lock was broken. Besides that everything else was good. Must visit.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Great place to stay for 2 days. Beautiful scenery, surrounded by nature..on the banks of River Reshi.\nBike ride absolutely possible. Food is nice.. The staff is very nice..\nThey will arrange barbeque and Bonfire any place you like.. great experience..\nThere's heritage linked to this one too as Sebastian Pradhan who is the owner is actually the founder of the old silk route. So the more reason to stay here.\nGreat experience",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Lovely place, lovely food and care us very good",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the most beautiful place in Sikkim, no image or video can describe the beauty of this place. Must visit place in your life 😉",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Lampokhari Lake",
      "rating": 4.5,
      "address": "Lake, Aritar, 737133, Aritar, Sikkim 737133, India",
      "reviews": [
        {
          "text": "**Lampokhari Lake: A Serene Gem in Sikkim**\n\nNestled amidst the breathtaking landscapes of Sikkim, Lampokhari Lake is a hidden gem waiting to be discovered. Surrounded by lush greenery and towering hills, this tranquil lake offers a serene escape from the hustle and bustle of city life.\n\nThe journey to Lampokhari Lake is an adventure in itself, with winding roads offering glimpses of picturesque vistas at every turn. Upon reaching the lake, visitors are greeted by crystal-clear waters reflecting the pristine beauty of the surrounding mountains.\n\nWhether you're a nature enthusiast, an avid photographer, or simply seeking solace in nature's embrace, Lampokhari Lake has something to offer everyone. Visitors can indulge in leisurely walks around the lake, take in the panoramic views, or simply relax by the tranquil waters.\n\nFor those seeking a bit more adventure, there are opportunities for boating on the lake or embarking on nearby hiking trails to explore the surrounding wilderness. The area is also rich in biodiversity, making it a haven for birdwatchers and wildlife enthusiasts.\n\nOne of the most enchanting aspects of Lampokhari Lake is its sense of tranquility. Away from the crowds and noise, it offers a peaceful retreat where visitors can reconnect with nature and themselves. Whether you visit during the vibrant hues of spring or the serene calm of autumn, Lampokhari Lake never fails to leave a lasting impression.\n\nIn conclusion, Lampokhari Lake is a true hidden gem in Sikkim, offering a perfect blend of natural beauty, tranquility, and adventure. Whether you're looking for a peaceful getaway or an opportunity to explore the wonders of nature, this enchanting lake has it all.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Commonly known as the Aritar lake, it is surrounded by greenery. There is a concrete path built around the lake to comfortably walk. You will also be able to see some fishes and ducks as well. There is a tea and momo stall for some on-the-go bites.\nP.S.: You can opt for paddle boating as well.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lampokhari, also known as Aritar lake is one of the oldest freshwater lake in Sikkim. Situated along the way to the historical Silk route, this lake is surrounded by Alpine forest. Visitors can feed the fishes in the lake. Boating is also allowed here. A narrow jungle path connects the lake from the nearby mountain top called Mankhim.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Quite nice place for sightseeing. You can do boating there. It will charge 300 rs per boat.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very nice view, especially its view from the Mankhim view point, it just looks like a shoe shaped lake. Many fishes are there in the lake. Entry fee is reasonable. You can walk on the pavements surrounding the lake which is a must do in winter evening.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Indreni Waterfalls",
      "rating": 4.5,
      "address": "6J3J+JQP, Sikkim 737106, India",
      "reviews": [
        {
          "text": "The majestic and beautiful waterfall is a treat for any nature lover. Surrounded by lush green forest and unpolluted environment, it is a must visit place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Indreni waterfall\n\nIt is located at Takchang Kaizaley village under Amba GPU of Pakyong District, East Sikkim. This 100 m gushing waterfall is blessed with immense natural beauty, which makes it one of the most attractive and unexplored waterfalls in Sikkim. The mesmerizing view of its crystal clear water, crackling from the lush green hills and falling over the rugged pieces of mountains, allures the tourists on the way to halt and capture some incredible pictures with nature in their cameras.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Same Rute Via Bande View Point Sikkim",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is more than a place the water running through the hills and while droping to a groung the sprinkled water forms a rainbow 🌈 when the sunlight hits the sprinkled water.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Wonderful I love my home Town",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Mankhim Rai Temple",
      "rating": 4.7,
      "address": "5MPJ+662, Aritar, Sikkim 737133, India",
      "reviews": [
        {
          "text": "This an unexplored tourist place only a 5 minutes drive from Popular Aritar lake. From the car parking, one has to climb few steps to reach here. A small temple along with a view point is here. From the view point both Aritar lake & Mt. Kanchenjungha is seen on a clear sky.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Mankhim Temple is an off beat tourist destination in Sikkim which is slowly gaining popularity among the tourists because of its great historical as well as religious significance. It is situated at the top of the hill , belongs to Khambu or Rai. You can see the lampokhari lake/aritar lake from there.  The temple offer as a vantage point to get the unobstructed view of mighty Mt. Kanchenjunga.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great place with awesome view of Kanchenjunga and aritar lake. You can enjoy surise and sunset from here. Awesome landscaping view. This a beautiful place of calmness and peacefulness and it can relax your mind.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Edit:\n\nFirst review written on: 26/10/2018, 01:14 pm\nNothing special to mention. A beautiful point to visit. The hilltop. With clear views of the valley down. The three temples are very nice especially the Amitava Temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is at the top of a hill. You have to climb many stairs to reach here. Also you can have a good view of Mt. Kanchanjunga from here.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Aritar Lake",
      "rating": 4.4,
      "address": "5MPF+VWP, Aritar, Sikkim 737133, India",
      "reviews": [
        {
          "text": "Nestled amidst the breathtaking landscapes of Aritar, Sikkim, India, lies the enchanting Aritar Lake, affectionately known as Lampokhari Lake. Situated at an elevation of 4,600 feet (1,400 meters), this natural wonder spans 1,120 feet in length and 240 feet in width, showcasing a mesmerizing emerald hue that captivates visitors. Encircled by verdant pine forests, the lake offers a tranquil retreat for nature enthusiasts and adventurers alike. A well-laid pathway encircles the lake, providing panoramic views from various vantage points, inviting exploration and contemplation.\n\nAdding to its allure, Aritar Lake offers the exhilarating experience of boating, allowing visitors to immerse themselves fully in the serene ambiance of the surroundings. Amidst the tranquil setting, numerous tea stalls and food vendors dot the area, offering a delightful array of refreshments to savor while enjoying the serene beauty of the lake. Additionally, a small shrine dedicated to Guru Padmasambhava graces the banks of the lake, adding a spiritual dimension to the serene ambiance.\n\nWhether one seeks solace in nature's embrace, craves adventure on the tranquil waters, or simply wishes to indulge in the scenic beauty of the surroundings, Aritar Lake promises an unforgettable experience for all who venture to its shores.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very good and beautiful place it is.. The lake is surrounded by pine trees and has a green coloured water.. You can walk out the whole lake and boating option is also available there.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It is a very beaulitiful lake surrounded by thick pine forest.a manmade masterpiece",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is a very beautiful lake. Natural view is very amazing. 😍",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A renowned Lake of Sikkim, the tourists going to the silk route usually this is a must visit place. It is a small man made lake of beautiful shape and surrounded by long trees. The colour of the water is greenish, maybe due to the falling leaves of the trees on its side. There are paddle boats to entertain the visitors. It is within a gated area but they won't change any entry fee, only they took a parking change of Rs.50/-.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Chalisay Cantonment",
      "rating": 4.2,
      "address": "5JMX+52W, Rhenak, Reshi, Sikkim 737133, India",
      "reviews": [
        {
          "text": "Nice.. View of kanchenjunga is amazing above bijay ground",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Yes good people and nice place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awesome",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Place is quite with all the nature's beauty and scenic green everywhere.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's a nice place. It is mainly comes under Indian Army Compound.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shree Vishwa Vinayak Temple",
      "rating": 4.7,
      "address": "5JJQ+93P, Reshi, Sikkim 737133, India",
      "reviews": [
        {
          "text": "A very beautiful place called Vishwa Vinayak Temple near Aritar Rehnok. Lovely place to visit. We have seen a Ganesh idol with sixteen hands. Amazing feeling. A big temple of sri Hanuman ji. Scenic beauty is excellent. We have visited but no puja options were available there at this time. Parking area is available and no need to buy tickets to visit the temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is very nice . The temple has a Ganesh mandir and a Hanuman mandir.\nAlso there is a sob statue in the front.\nThis is located in Rhenock",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Buautiful Temple  of Rhenock. This temple, known as Viswa Vinayak Mandir is likely to be the first in the world with the installation of fifty one classical forms of Lord Ganesh. This temple  is now on a verge of completion which will attract huge numbers of  pilgrims from across the world..*@*",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Calm & devine & Serene... That was my impression of Vishwa Vinayaak Temple. Situated in the serenity of beautiful  hills  @ Rhenok, Sikkim, the temple has a calming effect on the soul the moment u step there.  And the statue of Lord Ganesha. U need to visit this place if u r a nature lover or want to connect with your soul. The sculpture outside the temple depicting samudra manthan with the picturesque background just seals the deal. I will definitely recommend this place & I will revisit this place again in different season. Hope the puctures will help.☺",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple was built superbly.. In this premises you will find Lord Shiv, Lord Ganesh & Hanuman Ji.. I think all forms of Lord Ganesha are present in this Temple.. This temple is very neat & clean.. It comes between Reshi checkpost & Rongli.. An entry fee of Rs. 30/- per head requires to enter..",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Bandey View Point",
      "rating": 4.1,
      "address": "Takchang Rd, Takchang, Sikkim 737106, India",
      "reviews": [
        {
          "text": "This view point is situated near the village  called tarathang. Established by the locals of that area. No entry tickets are required to visit this place, it is free for all. You can have a look of the view in the photos I have shared below. I have rate this place with 4 star because it is not up to the point for a proper tourist attraction and right now it is not well organised also. Overall this place is very attractive for the people who loves nature and sceneries. Hospitality near this place is not available.  It will be better to visit this place at the time of sunset or in the morning. (It is my personal opinion). Roadways to this place is just okay.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "natural  veiw and jio speed network .",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Takchang View Point, located in Takchang East Sikkim, Near Ram Mandir..",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Superb view of the Himalayas from the point and the paddy field during season",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Place like heaven. Visit Once Takchang view Point..",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    }
  ]
}