{
  "places_with_reviews": [
    {
      "name": "Kanjiramattom Mosque and Shaikh Fhareedudheen Maqbara",
      "rating": 4.6,
      "address": "RCX4+PCH, Kanjiramattom-Thalappara Road, Millungal Junction, Kanjiramattom, Kerala 682315, India",
      "reviews": [
        {
          "text": "Darga of Ganjarshakar Baba fareedudheen chishthi\nRadi'Allahu Anhu.\nVery old and very memorial, historical place in India.\nGreat spiritual place.\nGood ambience to pray.\nLadies prayer room is available.\nWide parking space.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "#KanjiramattomMosque\n\n.Kanjiramattom Mosque, about 25 km southeast of Kochi city, is built in memory of Saint Sheikh Fariduddin. The quaint ambience of the mosque is enhanced by the mazhars and dargahs.\n\n. The famous annual event here is the Kanjiramattom Kodikuthu which falls in the month of January. A ritual called chandanakkudam (literally, sandalwood pot) is conducted as part of the event to honour Saint Fariduddin. Pilgrims carry pots covered with sandalwood paste and walk in procession to the temple. Caparisoned elephants and Muslim folk art forms like the Duffmuttu and Kolkali are also part of the event.\nTranquil mosque & pilgrimage site that's host to the annual Festival of Kodikuthu.\nSheikh Fariddudin Mosque or Kanjiramattom Mosque is located around 25 km away from Ernakulam. The mosque is said to be built on the place where the Islamic guru and saint Sheikh Fariddudin was entombed to rest. Thus the mosque is believed to be built in memory of him. Currently, it is one among the most prominent Muslim pilgrim centers in Kerala. Kanjiramattom Mosque is renowned in relation with Kanjiramattom Kodikuthu festival. Every year thousands of people - including tourists from foreign lands, come to Kanjiramattom just to participate in this festival. Though celebrated in a mosque, Kanjiramattom Kodikuthu is not considered as a Muslim festival alone but unlike other religious rituals and festivals, as a festival of all without any colors of religion. Thus the festival remains a great example for religious amity in Kerala. Kanjiramattom Kodikuthu is also known as Kanjiramattom Nercha. The Chandanakudam ritual is an invisible part of this festival. Procession of people carrying earthern pots covered with paste of sandalwood is one of the major highlights of this festival. While the folk performers and decorated elephants really add more flavors to this procession, Kanjiramattom Kodikuthu remains a great stage to enjoy people performing Duffmuttu and the Kolkali, the traditional Muslim art forms. Every year, Kanjiramattom Kodikuthu is celebrated on January 13 and 14. However, you should notice that the dates can be changed to one or two days more as the festival dates are decided as per the Malayalam Calendar and not based on the English Calendar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Calm and quite place, large car parking area, praying place for both men and woman, drinking water, neat and clean toilets, comfortable location",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its a pilgrimage place.every year in January 14 they conducted \"chandanakkudam-kodikuthu\".several sweet shop nd many other shops are there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sunni Masjid and Durgha of Shaikh Fareedudeen. Very calm atmosphere. Many  people of other religions  coming here..",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Arayankavu Bhagavathy Temple",
      "rating": 4.6,
      "address": "Arayankavu, Kanjiramattom-Thalappara Road, Kulayettikkara PO, Ernakualam, Kerala 682315, India",
      "reviews": [
        {
          "text": "Nice place. Overall the town in which the temple located is not so developed. The temple itself is great and big.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Calm and wide  location.\n\"Garudan thookkam\" special in March - April in every year",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful day",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A nice and calm temple of Devi Bhadrakali. Definitely we feel the divinity there. The temple management has made almost all facilities for devotees like toilet, auditorium, etc. And of course the large ground is plus point for parking, for Garunthookkam etc. The temple has two festivals called Pooram maholsavam and Pathamudaya maholsavam, respectively. Both fall in the month of March - April.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Known for the Garudan thookkams in their festival. The festival is around at the end of March month. You can witness more than 100 garudan thookkams when you are here. The place is easy to find and of you are generally visiting ample parking space is also available.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "GREEN ISLAND RESORT",
      "rating": 4.3,
      "address": "Poothotta East, Kanjiramattom, Ernakulam District, Kochi, Kerala 682315, India",
      "reviews": [
        {
          "text": "Food: While the food quality was okay, the organization and serving were lacking, leading to limited portions. It’s recommended to increase the headcount to ensure enough food is available, especially after morning activities when guests are hungry. Pricing for non-vegetarian items seemed high, particularly for smaller portions.\n\nAmbience: The ambience was unsuitable for summer with minimal greenery to provide relief from the heat.\n\nRoom: Despite upfront requests for additional rooms, only one room was provided for a large group, leading to discomfort and frustration, especially after a long day of activities.\n\nSatisfaction: Overall, the experience was unsatisfactory, particularly in terms of organization and room allocation, making it not advisable for summer visits.\n\nActivities: While there were various activities available, guests felt rushed due to the emphasis on boating, which limited the time available for other activities.\n\nBoating: The promise of a well-equipped boat with equal seating wasn’t fulfilled, leading to discomfort and safety concerns for some guests. The quality of the boat was also below expectations compared to other services in the area.\n\nOverall, while the resort offers a range of activities, improvements in organization, room allocation, and boating services are needed to enhance guest satisfaction, particularly during peak seasons like summer.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Went for my team out. Costs 1000 per person with pool and meals.\n\nThe resort is situated on an island, and a boat is required to reach which they're providing.\n\nThere is a 3 hour boating through the lake, which is nice and relaxing.\n\nThe food was okayish. Service and other amenities were good.\n\nDefinitely recommend a one day team out.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best suited for a one day trip from Cochin. Rooms are available. I am not sure about the rooms as we went on a day trip which includes a boat ride which was quite good and lunch. The premises can be used till evening after lunch.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We  conduct a family get-together with around 200 people, they provide boat service to the island resort , kid friendly park, swimming pool, rooms are also neat and clean, meeting hall, variety of foods everything is ok,\nit could have been better if they provide a shop for everyone's daily needs, because being it's a small island there is no shop available to purchase our daily needs",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very bad customer service. Not properly attending the call to make a booking. Tried many times after a booking to confirm.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Olippuram fields",
      "rating": 4.5,
      "address": "RCXH+7J8, Oliyappuram, Kaipattoor, Kerala 682315, India",
      "reviews": [
        {
          "text": "That place is so nice, perfect for chilling out and just unwinding. The view is amazing. The neighbors can be a bit annoying sometimes, but it's still a pretty decent spot overall. Best time to visit is morning and evening..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Morning between 7-8 am is the best time to visit the Ollippuram fields.The scenery out there with green fields, water lilly, fog, sunrise,etc gives a relaxation to the mind.The beauty of the water lilly in the ponds are very calming.A brisk  walk through the fields is also a good feel.The roads and the 360° view makes this place more beautiful.There is also a railway nearby which is also a good view.Loved this place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit during evening on rainy season best place to take photos place to spend time with family and friends",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful Never ending Paddy field with picturesque Road and bridges.  Quite and lovely place, Morning and evenings visits are worth. Good to spend time with family and friends❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit during evening time or rainy days. you will love this place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Puthenkavu Bhagavathy Temple",
      "rating": 4.4,
      "address": "Puthenkavu MLA Road, V92M+J5F, College Rd, Poothotta, Kochi, Manakunnam, Kerala 682307, India",
      "reviews": [
        {
          "text": "💙",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The giant Banyan trees and the large temple ground is a feeling",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "🙂",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Holy land",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Olippuram Edakkattuvayal Arakkunnam Kochi",
      "rating": 4.7,
      "address": "RCXJ+H7C, Unnamed Road, Kulayettikara, Kerala 682315, India",
      "reviews": [
        {
          "text": "One of the most scenic places in and around ernakulam. The sunrise is mesmerizing. Great place.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great scenery.... occasionally passing trains along the vast paddy field at dusk is surely a treat to your eyes..... recommended going there by sunset and the road is with couple of steep inclines but it only adds to the experience",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its totally free to enter. Totally nature",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Natural beauty\nCalm place\nPaddy fields\nRecommended to visit in the evening",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "So Beautiful So Elegant Just Looking like a WoooW",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Chempu Juma Masjid",
      "rating": 4.4,
      "address": "Chempu P O, Vaikom, Kottayam Dist, Pin-686608, R97V+RWW, Chempu, SH15, Chempu, Vaikom, Kerala 686608, India",
      "reviews": [
        {
          "text": "Very affordable juma masjid back side have 4 wheeler parking area here",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The mosque has a nearby bus stop... So that everyone can easily reach here...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The bus stop is infront of the juma masjid",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The mosque in Chempu. A worship place for Muslim community people. A religious and harmonious place.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "😊",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Aqua Tourism by Matsyafed",
      "rating": 3.9,
      "address": "Palaikari, Kattikkunnu, Chempu, Kerala 686608, India",
      "reviews": [
        {
          "text": "We reached there by 1:15 pm. RS.250 for entrance which includes fish curry meal which gives you a pretty good feel as the fish is very fresh. It is reasonable even if we add special dishes. We can spend good time with kids if you have patience and like to spend time with children. Enough play area for children. Their ticket costs give you access to play area, pedal boating and fishing rode. I prefer going there in the afternoon by 1. Govt spots only expect the same kind of service. It is fine for this cost.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "It was a nice experience for me when I went there. I will prefer you to go there with yoir family. There only many 5 different types of boat games. If you catch fishes from there and give to chef the will make different types of food and give it to you with lunch. The lunch has a special taste and views from there are awesome but you should park your vehicles out side and walk almost 500metre to enter in this place if you dont like to walk there is also a boat service to drop you there",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "If you are looking for a uncrowded place to calmly sit and enjoy with friends and family for a while then you can go for it , it will not disappoint you",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "A good casual experience for families.There is a long walk area near to the back waters.There are some swings,pedal and speed boats.Lunch will be included in entry fees costing around 300 per person.Special fish dishes can be purchased by paying a premium.\nGood for a one time visit.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "An ideal location for a day out with friends and family.\nEntry fee Rs 300, includes a normal Fish curry meals, A boating and pedal boating opportunity in the pool and can do little bit of fishing as well.\nAt additional cost speed boat rides and Shikara boat rides too are available through the vembanad backwaters",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Murinjapuzha",
      "rating": 4.3,
      "address": "Murinjapuzha, Chempu, Vaikom, Kerala 686608, India",
      "reviews": [
        {
          "text": "A beautiful picturesque place where river is parting into two separate water bodies.  Fishermen with their canoes happily oar for catching fish.  A lovely place worth seeing.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Murinjapuzha is a small Village/hamlet in Vaikom Block in Kottayam District of Kerala State, India. It comes under Chempu Panchayath. This place give a beautiful view of backwater.This place is best for houseboat cruises along the rustic Kerala backwaters, a network of tranquil canals and lagoons.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Murinjapuzha is a part of Vembanad lake situated in Chempu, Vaikom. Naturally blessed location. House boat tourism is one of the main itinerary here.  Lots of foreigners visits here though house boats.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "While we were coming back from vaikkom, we crossed murinjapuzha bridge, I got so fascinated by the beauty of the river  and took a few photos.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "St. Ignatius Parish Hall",
      "rating": 3.9,
      "address": "VC43+P5Q, Kunnumpuram, Kanjiramattom, Kerala 682315, India",
      "reviews": [
        {
          "text": "A good and small hall. They do have a balcony to view the programs. These is no separate dining hall. The food is served either inside the hall or outside the hall after making temporary arrangements. Parking facility is not so huge but can accommodate a fair amount of vehicles. This parish hall is not in the main road",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Very bad service, they were increasing  rent without informing the booked person also. Very less lighting in the hall, no generator, very old hall and very bad smell in the washing area. There is no light in the girls washing area. Wastage money choosing this hall, they were increasing the hall rate without doing anything In call(not doing basic development )",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Suitable place for hosting functions like Marriages and all. Spacious parking place is an add on.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Good hall with big parking area ground",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Good auditorium, have got mezzanine level also. Space inside is sufficient for a gathering of around 500.\nHas got a huge ground nearby, which can be used for parking. Ground is big enough for even parking buses.",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    }
  ]
}