{
  "places_with_reviews": [
    {
      "name": "Pettimudi Hill Top",
      "rating": 4.6,
      "address": "Idukki, Kerala 685561, India",
      "reviews": [
        {
          "text": "The place was so beautiful and clean that the birds were chirping the whole day, and we could hear peacocks singing from a distance. My trip to Pettimudi Hill Top  was a lovely experience, especially the climate of the place. It was a really great experience to visit a hill top for the first time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful to visit early in the morning. Good to plan if it rains on the previous night as you definitely get a chance to see and experience the fog from the top of the mountains. Actually it is a forest area and there is no proper way or roads. You need to trek to the heights.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good experience, very less crowded when we hiked. Only 2 or 3 people were there. But we found some difficulty in finding the path to start the hike. It's the only problem faced. The view was beautiful and while we were hiking a small rain was also there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If the sky is not cloudy, best choice to watch sunset 🥰",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place is so nice to watch at sunrise.\nThe trekking of the place was moderate level and the ways are really nice.\nThere are no charges to enter this view.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kottappara Hilltop Viewpoint",
      "rating": 4.6,
      "address": "Kallar - Mankulam Rd, Munnar, Adimali, Kerala 685565, India",
      "reviews": [
        {
          "text": "Nice place, easy access and can reach almost near to the view point",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bikes travel to the top of the mountain. A great view of the sun rises. It is safe to stay in a tent at night . During the season cloud beds can be seen.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awesome place to visit with friends and family. Nice breeze and the view was mesmerizing. The way to the top was so steep old people might feel some uneasiness. Mostly jeeps can reach hill top.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very beautiful offbeat place, easy to climb to the view point and the peak. The view is amazing from here. I went here twice, first was just to see what’s around my hotel - Ela Ecoland and second day I went to witness the sunrise here. I was lucky enough to see a rainbow it was magical. Best place to hangout with friends, may be have a small picnic and enjoy the nature.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful view\nA place to must visit\nAfter a rainy day it is awesome\nThe mild sound of the water stream\nThe chill breeze and the green stunning view of mother nature was unforgettable...",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Pettimudi view point",
      "rating": 4.6,
      "address": "2X8H+JHH, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "It's a nice place to watch sunrise and sunset. It's so relaxing calm and quite.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place offers distinct view of the nature.. hailing towards the top makes you feel like the path to heaven even though the way towards heaven is bit rough..  even the road to the peak is not smooth at all.. but all your tiredness will wave off once you reach the peak. It was js 4 in the evening but the peak was covered with heavy mist..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the Best view point in Kerala. Its located near Adimali. If you travelling to Munnar you should definitely try these spot. Its only 30-45 minutes climb the hill. If you climd in the early morning you can see the beautiful sunrise from here. Many people use tent to hang out here.\n\nThere is a 2,3 km peak road to get there. You should have good vehicle to get the parking area, or otherwise you have to walk to parking area on the top. We can see the cloud beneath our feet here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The Pettimudi view point (also called koompan para) is located near Adimaly town.That is in-between the road to munnar from Adimaly. The best time to climb here is in the morning and evening. If you go in the noon, it will be terribly hot there. It is a bit difficult to climb. Be careful to climb the mountain. And let us keep this place plastic free. 😇",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Be aware this is forest department area, so if you carry items for your enjoyment and get caught then your are responsible for it. Apart from this it is a great place, a breathtaking view, avoid going during hot weather. Better gor early morning or before sunset. Boys usually travel here and put a tent to stay for night. I believe they see a one in a life time view during early morning and in night.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Adimali viewpoint from waterfall top",
      "rating": 4.3,
      "address": "2XC4+G9G, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Nothing great about this place\nDo not go by the online photos and reviews. The road is very steep and narrow even for a 4 SUV and not worth the effort. Especially if you are with family dont try.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The road is very dangerous. Its a narrow concrete road and its too steep. If you are new in this kind of road please be careful. 🙏🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Adimali Waterfall, nestled within the scenic beauty of Google Map's location, is a mesmerizing natural wonder that captivates with its beauty. As I ventured to this enchanting spot, the journey itself was a visual treat, with lush greenery and winding paths leading me to the hidden gem.\n\nUpon reaching Adimali, the cascading waterfall unveiled itself in all its glory. The sound of rushing water, coupled with the refreshing mist that filled the air, created a serene ambiance. The waterfall's sheer force and the surrounding verdant landscape painted a picture of unspoiled nature.\n\nWhat sets Adimali apart is its accessibility via Google Maps, ensuring a hassle-free exploration for nature enthusiasts. The app's precise directions led me effortlessly, allowing for a seamless and enjoyable experience.\n\nThe picturesque setting makes Adimali an ideal escape from the hustle and bustle of city life. Whether you're a photography enthusiast seeking the perfect shot or a nature lover craving tranquility, Adimali Waterfall on Google Maps proves to be a hidden paradise worth discovering. The blend of technology and nature here provides a seamless journey to this natural spectacle, making it a must-visit destination for anyone seeking solace in the embrace of Mother Nature.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's such a nice place ,The whole Adimali town can be seen from the top. But highly not recommended for ladies because there are a lot of uncultured native people's there making fun of ladies.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Whater fall munaar Kerala\nTourist places near to hell",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kallar Vattiyar Water Falls (കല്ലാർ)",
      "rating": 4.2,
      "address": "2XMP+WG7, Kallar Vattiyar, Kerala 685561, India",
      "reviews": [
        {
          "text": "A very small waterfalls in Munnar. There was very little water when we visited in January. You can view the same from road and one cannot go near the falls.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A calm waterfall on the Aluva Munnar highway. There was no much water when we visited in Jan 2024. We can view the waterfall from a distant road and we are not allowed to go near the waterfall. There is a footpath on the road where we can stand and view the waterfall and click some lovely pics. Nothing very exciting about this waterfall - worth spending just 5 to 10 mins.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Road side water falls. Bigger one . On the way to Munnar road . Beautiful 👌 . These many waterfalls welcomes you to Munnar 😍. Everywhere waterfalls on the way to Munnar",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A beautiful waterfall to visit. Its 500 meters downhill from main road but you can walk down or take a Jeep ride.\nThere is also a cave on the way.\nViews are stunning a d you can easily dip your feet too in the water. Due to Rock formations nice place for insta worthy pics.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "If you are passing through this place. Just stop by and take a picture, relax and resume your travel.\n\nThis small waterfall is located near the roadside so no need for much walking also. We can just stop and enjoy the beauty and resume our journey.\n\nMost of the time we will get roadside parking as it's not very popular and people won't stop by much.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Adimali Town Juma Masjid",
      "rating": 4.4,
      "address": "2X83+C6P, Aluva - Munnar Rd, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Located on the highway to Munnar. It's a boon for tourists. Easy to spot with sufficient parking too. Well located in the town with nearby restaurants for quick bites. Well maintained.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Super clean restroom. Ladies prayer hall is available. Very nice place to have a short break in the middle of town",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This masjid is very big and well furnished in Adimali. When going to Munnar best place to refresh and pray. 24 hrs toilet facility available here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This Masjid isVery helpful for travelers to namaz and take relief because its nearly to high way.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "I felt Alhamdulilla reaching this mosque. Its Juma mosque near to bustand. Especially for tourists this is best place to pray if you are on the way to Munnar. Got clean washrooms n chilled water for Ablution.\nDont miss out to eat kanji (watery rice) from hotel wn u get down from mosque.. if you are there during afternoon..it was too good. Especially wn the climate is cold. Its just adjacent to mosque . I don't remember the hotel name.. guess its hotel arafa.. small hotel",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Kurisupara കുരിശുപാറ",
      "rating": 4.3,
      "address": "Kallar - Mankulam Rd, Kurisupara, Munnar, Kerala 685565, India",
      "reviews": [
        {
          "text": "Its a good spot if you are travelling with fresh legs. Its a big  hill top . You need to climb up to the max to get a good view, better if you go early morning or evening as its less sunny . You can enjoy a beautiful view from the top. You can sit back and relax on the hill if you wish to . It wont be crowded as it away from the tourist areas. You can enjoy your own space there . Its better you have to take a jeep as standard vehicle wont be able to get there . Network wont be there also",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Love that mountain! 😍\nAmazing view!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "If you need to stay at kurishupara viewpoint, Onceagain Campsite welcomes you",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Kurisupara is great experience for Sunset and sunrise. Family can choose this destination like a weekend plan. Easily we can reach viewpoints",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good location , but far from town , a small village , kottappaara View point is Nice one , must visit for Sunrise and Sunset ,",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "St. Francis Assisi Church,Machiplavu",
      "rating": 4.6,
      "address": "2W9G+J47, Machiplavu, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Beautiful church situated on a small hill top.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "My Parish church. Ample parking space. Clean and neat toilet. Very nice place for prayers. Awesome place for wedding functions..\nThe one and only church in the name of St. Francis Assisi in Idukki diocious.\n\nEasy access from NH 49 Kochi Madurai highway",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace ambience",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's an Roman catholic Church situated in machiplavu... On the way in right side of kochi madurai national High way....... On right side of kurangatty root..... Lovely place... Quit.... Holly prayer is all day's marning.....👬👬🎅🎅🤶🎅🤶🥰🥰🥰😍😍😍😘😘😘🥰😎😍😍🥰😘🥰😍🥰😘🥰😍🥰😘🥰😍🥰😘🥰😍🥰😍🥰😍🥰😍🥰😍🥰😍",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good to visit from outside on the way by car and taken marvelous Church photos and look superb, after watching photos I thought I miss the chance to visit",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Nool para waterfall",
      "rating": 4.3,
      "address": "Vettikompil,Adimali-Apsara Road, VIII/330, Kochi - Madurai - Dhanushkodi Rd, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "Wow it's good place for  photography environmental",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place.good ambiance.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Loved it.. Better to go early morning, won't be crowded.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice place and good falls view. Not advisable to go by car. Road is too narrow and very steep",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very good place ! Access was not so easy and have to careful in waterfalls bcz very slippery!",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sri Maheswara Temple",
      "rating": 4.5,
      "address": "2W7W+QFG, NH 49, Adimaly, Adimali, Kerala 685561, India",
      "reviews": [
        {
          "text": "One of the best built and perfectly maintained temple.. It's at a peak.. We can reach thru couple of steps and also by vehicle to the near.. Very spacious planned and executed well.. Devotees will never miss to spend time here",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple building looks different.. located on the way to munnar..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is located very close to Adimaly town. This is only siva temple nearby. A very serene atmosphere is around this temple and a hall is beside the temple to conduct marriages etc. This is maintained by a trust.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Famous temple of the local people",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is awesome place in way of munnar.\nstructure is different to other temple",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}