{
  "places_with_reviews": [
    {
      "name": "Kollimalai Sivan Koil",
      "rating": 4.6,
      "address": "797Q+WX4, Arappaleeswaran Temple Rd, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Since We didn't had went inside the temple from outside it's good opposite to templea main gate there is waterfalls",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "1500 year's old Temple. Very powerful Temple. Lord Shiva called ARAPALEESWARAR .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the well maintained temples that I have ever visited. I could sense  positive vibes inside the temple. Courteous staff and priests. Only negative point is that the parking place is limited and you may need to park your vehicles on the main roads and walk for 100/200 meters if you are visiting during peak seasons.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One of the familiar lord Shiva's  hill top station .. totally 70hair pin bends... must visit atleast one time..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place, not a hill station but good for a day or two days stay and enjoy the natural rythem. Plan for mountain climbing, சித்தர் caves walk, agya Ganga and more falls and pilgrim centres.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Aagaya Gangai Falls - Kollimalai",
      "rating": 4.6,
      "address": "798V+HFX, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Easily one of the best waterfalls I have ever been and it was so amazing in non-rainy season. Can't imagine how it would be during monsoon. The atmosphere becomes so cool as once you get down the rocks will be surrounding you and the tiny water droplets from falls around the air keeps everything chill.\nWithout a doubt a must place falls if you are going to kolli hills\n\nNote - you need to get down ~1200 steps to see the falls and need to climb back, the incline is also more. Elderly people can avoid unless they are healthy and wants to visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Aagaya gangai waterfalls offers a truly exhilarating adventure for nature enthusiasts and adventure seekers alike but this place is not for all read the review why?.The journey to reach the waterfall itself is an adventure and provides a breathtaking views of the surrounding landscape.Upon reaching the waterfall, visitors are greeted by the sight of cascading water plunging down from the heights above, creating a mesmerizing spectacle of nature's power and beauty. The lush greenery that surrounds the waterfall adds to its charm, creating a serene and tranquil atmosphere that is perfect for relaxation and rejuvenation.However, for individuals with mobility issues or weak patients who cannot navigate steps easily, visiting this waterfall might pose some challenges. The descent to reach the waterfall involves navigating a considerable number of steps, which can be strenuous for those with mobility limitations. Moreover, the terrain around the waterfall area may not be suitable for individuals who cannot walk on uneven surfaces or manage steep inclines comfortably. As such, while Aagaya Gangai Waterfall offers a breathtaking sight for nature lovers, it may not be the most accessible option for those with physical limitations.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A great waterfall to explore in Kolli Hills! Although it requires you to go down 1100 steps, it was worth it. You can directly go just below the waterfall as well.\nThe surrounding area is very clean but the waterfall area can be cleaned further.\nGoing to the waterfall won't take much time as we need to climb down. Going back is when it gets a bit difficult. But there are water tanks and a lime juice shop in between to help you.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Climbing down the 1000 odd steps makes the falls even more worthwhile to see and enjoy. The Rocky steps towards the end could be risky for elderly and kids. Be careful when Reaching the falls using rope during heavy flow. Metal pathway or railings could be better for even more people to reach the falls crossing the pool.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Magnificent and wonderful falls. Reaching the falls place very risky. One has to get down 1200 steps. 50% steps are very steep . After visiting the falls climbing up is very hard. People above 60 should be very careful to visit. But it’s excellent place to visit.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Arappaleeswarar Temple, Padal Petra Temple",
      "rating": 4.7,
      "address": "797Q+VW8, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Arapaleeswarar temple, Kolli Malai, is a Siva temple in Kolli Hills in Namakkal District, Tamilnadu. 5km far from Kolli Town.\n\nThe temple is open from 7.00 a.m. to 1.00 p.m. and 2.30 p.m. to 7.00 p.m. During the festival days, the temple is open from 6.00 a.m. to 10.00 p.m.\n\nLord Shiva is a swayambumurthi. A scar on the head of the Shivalinga is visible caused by a hit of a plough. The construction of the shrine is such that a devotee could enjoy the darshan of Lord Arappaleeswarar, Mother Thayammai, Lord Vinayaka and Lord Muruga standing from a single spot.\n\nYou can enjoy the most beautiful 70 hair pin bend road while visiting this temple. Bus service also available till temple. The most beautiful Aghaya Ganga waterfall also near to this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is one of the oldest temples in Tamil Nadu and a must visit spot in Kolli hills. Once you reach this place, you will find sitraruvi , just outside the temple, where you can take bath in a set up like pond. There’s also a falls inside which flows to aagaya gangai. Surrounding this temple is the entry point for aagaya gangai water falls. You will also find small shops selling natural spices, fruits and other eateries. The soup sold here is very good.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This beautiful Arapalli Eswarar / Arappaleeswarar temple is located in Arapalli, where the king ruled “Valvil Ori” and where sage Kalangi first performed penance for eighteen Siddhas. Scholars believe the temple was built/reconstructed during the Chola period...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Mother Earth's medicine chest is full of healing herbs🌿of incomparable worth.\nNice Shiva temple to visit with family and friends. Presence full climate as well as more shop around the temple. And most important one you all should try a herbal soup which is very good in taste. Car parking space is also available round the temple. More fresh fruits are available on this temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "good place to visit near agaya gangai water fall",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Maasila Falls",
      "rating": 4.4,
      "address": "892V+XGR, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Walkable distance from parking places. No steep steps, very easily accessible falls, have toilets & dressing rooms properly,  kids enjoyed a lot.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Entrance to the falls is a 10 and we have parking fee too . When we went it was cloudy and their was little water but after that their was heavy rain and we did witness heavy water flow in the falls.Thier are changing rooms but not much clean and also has restrooms",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This falls is very much enjoyable. compared to Aagaya gangai falls.. we had good time spending atleast 1 to 2 hours bathing multiple times. best part is it is less crowded / easily reachable from parking lot (like 10 minutes) and very safe for families. very good force of water which can be enjoyed by atleast 10 people at a time. plenty of greeneries and a small river to see while bathing under the falls. important thing is check with the hotel on the falls status before you go because there were few years in the past when the falls was dry it seems. car parking available. hire a cab from the hotel (safe and easy) if you have mobile signal problems to get the google maps working to reach the spot.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The most exciting part about this falls is that it's pure water that falls from the top. You can taste it 💦♥️ Apart from the nature, I like the local people and humble hospitality they offered through varieties of snacks, spices and fruits. After enjoying the falls one should enjoy the hot and spicy KUZHI PANIYARAM from Malliga Akka. 🌶️🍲",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best time to visit this place is during Monsoon season\n\nNice place with small waterfall if u arrive early u can enjoy other than that it create mess because the water flow is very small and the crowd is large\n\nRestrooms are available but not maintained properly if u came with friends u can go up and enjoy but police will look after if u create any mess .",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Masi Periasamy Temple",
      "rating": 4.6,
      "address": "895W+C3Q, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Want to experience trekking at kolli hills definitely this is one of the place. It takes 45 mins to go up.\nOnce you reach the top you will have a great view.\nThe temple has a good vibe with unique structure.\nThere is a stone bench on the side of the temple to sit and enjoy the view.\nCarry water bottles and you can try paniyaram and herbal soup in the mid way.\nThis temple is very famous among the Kolli Hills.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple atop the hill is a must-visit! The short trek is worth it, but don't forget to wear jackets during winter. The deity's presence is truly powerful, creating a warm and spiritual atmosphere. I cherished my visit and will return with my loved ones. A hidden gem!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "What a beautiful temple it is you have to climb 4 to 5 kilometre upwards the mountain. Very powerful God called as \"massi perianna\" heavy crowd endoring Pournami and amavasai, we have to be careful while climbing because it is little slope up in sometimes.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Needs to walk around 1.5 km from parking. It will five you feel of mini trucking. Needs to bring food if you wants to spend some time. Otherwise can get many chat items on the way of walking. No entrance fee. Only parking charges. For bike rs.10 and 4 wheeler rs. 20 and 30. Nearby No restaurant but can get snacks.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Masi Periyanna , Masi Karupanna, kamatchi, Meenakshi .. To hold the mountain stable, Periyanna jeevasamathi is here. Very spritual place. You have trek for around 2-3 hours. Little tough to trek. But you can do it. Very beautiful view around",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Namma Falls - Kolli Hills",
      "rating": 4.3,
      "address": "Kolli Hills, Semmedu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Visited In weekend, 20/- per person,  small falls easy accessible, no crowd in falls, childrens enjoy a lot,  only 100 mtrs walk from  entrance / parking. No proper road to the falls, also its manageable to reach the falls via pathway. Toilet & dressing rooms are available, Requesting the management team to check and allow public before entering the falls area due to public bring alcohol and enjoying in the falls, so I'm not recommend the falls for family.\nNote - Before entering from parking watch for cows are roaming on the top cliff of falls water downing area, if ur lucky u can get cow dung fall on ur head😉.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Best place for waterfalls lovers and trekking lovers. Make sure you are planning to visit the monsoon. Not advisable for old age people with low fainted heart. It's an absolute wild trekking because it has 1196 steps to climb up to top. Mentally and physically prepare before coming here but best part is waterfalls is best to experience.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This waterfall is beautiful but it's crowded.\n\nThe entry ticket is 10rs and has parking space available.\n\nVisit in the rainy season",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Namma falls is located 6kms away from agaya gangai. The parking area is available and it looks like a view point. It is safe for children. You'll be charged 10 rupees to enter  the falls.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "You will find this falls while entering kolli hills. There is ample car parking space outside, after parking you need to take a short trek of about 200 meters down hill to reach this falls. They charge an entrance fee (think 20 per person). Falls has dedicated section for ladies. There are no rooms to change dresses. Overall this place is less crowded, you can enjoy taking bath peacefully. On a weekend, expect waiting for your turn to take bath.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Ettukai Amman Temple | Kollipaavai Temple",
      "rating": 4.6,
      "address": "79PF+JQ3, MDR690, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "This temple is located near namma falls while entering kolli hills. You need to be prepared for a trek down hill to reach the temple as people such knee pain or other ailments may find it difficult. Temple closes around 7 or 8 PM as it becomes too dark along the pathway leading to the temple. But this is such a peaceful place, will give you all tranquility that you needed. A powerful place with a powerful deity where you can spend time worshipping leisurely without any push from other devotees. Don’t miss whenever you are in kolli hills!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Really a cool place! I loved the green around this place 😍  I have visited this one during summer if u had a chance to visit after august it will be bliss .\n\nYou can find various  shops which  are fruits were at affordable  rate, we bought Jackfruit at 20/- and banana at 4/each!!\nBecause hillstation fruits have good taste\n\nU can find Panniyaram shops also which is famous around namakkal. And some ducks hen etc\n\nOverall a good place to visit if you're a nature lover 😊",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "FYI before visiting the temple do you homework. 70 steep hair pin bends, BSNL network works well here else download offline line maps before reaching well in advance. Plan your visit accordingly, though there isn’t any security checks here! 🙏🏼please be responsible don’t litter!!! Have a safe drive",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Whenever a trip to kolli hills our friends will surely visit this temple. Such a powerful place, suits to the person to whom the situation would undefined problems...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Lots of crowds on no-moon day and Saturday. All the other time the average crowd.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kolli hills",
      "rating": 4.7,
      "address": "79HC+8MW, MDR690, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "You Can see naturals in your way... excellent view point ... must go on weekend ... good riding experience.. if you have a bullet, your ride will be Gracy...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Perfect weekend destination less than 300kms from Bangalore! People who loves driving cars or riding bikes it's the best I feel so, 70+ hairpins+ and road well maintained, easy to get hotels without online booking and ample food options ...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Dramatic atmosphere, we will breathe the to Quality O2. If you have  plans to go to the waterfalls please prepare to reach there before 12:00pm because after 3:00 pm they will not allow to the waterfalls... Must visit places... The best place to collect good memories.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best riding/driving experience kolli hills can give. Totally 3 roads and try to explore all if possible. Go only during monsoon to experience agayagangai waterfalls. Camping sites are available here so try to book that.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Really a good place for vacation, but one should plan during the season.  Which starts after june.  Only a few places to visit, but you can have a peaceful relaxation during the stay due to the plants and trees",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Small Falls | சிற்றருவி",
      "rating": 4,
      "address": "798Q+5P4 River Bridge, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "It's a beautiful place. Best place for elder people's. And also there no dressing rooms and restrooms. And u can carry whatever u want because there is no checking.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Excellent place for kids to take bath in the pool before the falls. Look out for rocks to reach the sandy place.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Near Arapaleshwar Temple 50 steps to reach waterfalls, be careful during rainy season water level may rise suddenly, from this place only water flows to Agaya Gangai Waterfalls",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Small Falls. It's beautiful but people have ruined this place by littering. I request everyone not to litter 🚯. Be a responsible citizen and enjoy the real essence.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "It's a main falls entrance. People can't go down to main falls may visit this place",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Waterfalls View Point",
      "rating": 4.4,
      "address": "797V+H2V, Way to Aagaya Gangai Water Falls, Ariyurnadu, Tamil Nadu 637411, India",
      "reviews": [
        {
          "text": "Come feel it... Nature always Beauty...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice place.\nCovered by green carpet.\nPerfect place for trekking.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Awesome Place to visit in Kollihills...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Except",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best place in koli hils , must visit",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}