{
  "places_with_reviews": [
    {
      "name": "Eden Beach - Blue flag Beach",
      "rating": 4.6,
      "address": "Maraimalai Adigal St, Ariyankuppam, Chinna Veerampattinam, Puducherry 605007, India",
      "reviews": [
        {
          "text": "Beautiful beach! Indeed the cleanest one and the sunset at backwaters makes it even more beautiful. We visited this beach twice and spent hours just sitting at the shore and admiring the beauty.\nIf you are interested in swimming go well before time as they won't allow swimming beyond 6pm and the beach closes by 7pm.\nThere are some water rides at the backwaters, couple of food stalls are there and changing rooms are also available. Parking charges is ₹20 for 2 wheeler.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean white sand beach in Pondy with less crowd - must visit spot to spend good amount of time on seashore. Lots of activities are on the beach including kids play area, water games,etc., variety of food courts also available.\nYou need to walk by almost 500m from parking.\nIt's a Paid parking. however for people with special needs and🦼 users, please reach out to guards to allow the vehicles till beach.\nYou will also see the paradise beach with loads of water games.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful and clean beach. My favorite in Pondicherry. The vibe here is amazing. You can see the sunrise at the beach and the sunset right across at the back waters. Some fun water activities to do here and if you are a non vegetarian lot of sea food stalls here. Nothing much for vegetarians. But about the beach absolutely loved it 😍",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The beach was rather clean and lifeguards were present there for safety also there were paid services for changing rooms which were very nearby but the surroundings can be developed and renovated I would still prefer paradise beach than Eden.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neat and clean beach with a few available eateries. Ideal in the morning or evening...anything in between will burn you nicely! Take a dip in the Bay of Bengal, sip on coconut water and lie in the shady coconut groves by the lagoon. Lots of fishes can be sighted from the culverts and plenty of chirping birds around. Keep atleast 2-3 hours to relax, dip in the sea and soak in the beauty of the place...loved it",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "The Sacred Heart Basilica",
      "rating": 4.5,
      "address": "Door No, 132, South Boulevard, near Railway Station, MG Road Area, Puducherry, 605001, India",
      "reviews": [
        {
          "text": "I always love going to church, because the feel when I am inside the church is cannot be explained by any words or actions. Just love those minutes. It brings back the best memories of my life.\n\nThe reviews. Last day of 2023. First temple I visited in this that too unexpectedly which turns out to be the best memories of the year",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Oh, joyous day! Ventured into Pondy's ancient church, expecting architectural wizardry. It's like the grand old dame of churches, standing proudly in the town's belly. Bike parking is easier to find than your misplaced keys.\n\nWith a history that could out-age your grandma's recipe book, did it awe with architectural brilliance? Well, more like it's doing its own funky dance in the architectural realm – different, but not exactly winning an award.\n\nIn the heart of town, it's as peaceful as a sloth on a Sunday afternoon. Visited during what felt like the church's exclusive \"No People Allowed\" hours. If you're spiritually inclined, it's the holy grail. They even have seats for the holy mass – not La-Z-Boy level comfort, but who needs a plush seat when you're busy communing with higher powers?\n\nSo, step right in if you're on a quest for divine sarcasm or just want to witness a rebellious twist in the architectural saga. A round of applause for the architectural rebel! 🏰🤭",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A beautiful church close to the railway station. It is one of the oldest churches in the town and the interiors are very beautiful. The architecture is also great.\nFeels very peaceful when inside. The church is very well maintained and always feels welcoming whenever I go there.\nParking is available just outside the beach. Worth visiting for sure!",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place. A little different architecture than other cathedrals. While you can visit the place anytime during the day, it's quite lively during the mass time. Premises has quite some space and you will find things peaceful in there. As you come out of the premises, on turning to left side there are a couple of good tea shops and a little bakery which is worth exploring if you want a quick snack",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "The Sacred Heart Basilica is a beautiful Gothic-style Catholic church located in Puducherry, India. It is one of the most popular tourist attractions in the city, and for good reason. The church is simply stunning, with stained-glass windows, a vaulted ceiling, and a peaceful setting.\n\nI was particularly impressed by the stained-glass windows, which depict scenes from the Bible. The colors are so vibrant and the detail is incredible. I spent a good long time just looking at them and trying to take it all in.\n\nThe church is also very peaceful. Even though it was a bit crowded when I visited, it was still a very calming place to be. I would definitely recommend taking some time to sit and reflect in the quiet of the church.\n\nIf you're ever in Puducherry, I highly recommend visiting the Sacred Heart Basilica. It's a truly beautiful and inspiring place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Pondy Marina",
      "rating": 4.4,
      "address": "WR7H+3XQ Dubrayapet near, near New Light House, Puducherry, 605001, India",
      "reviews": [
        {
          "text": "This beach is so calm,they have both camel and horse ride and opposite to the beach ... You can find a food court .. it has variety of shops but it started to get crowded after 8 pm...shops like madras coffee house, la petit flour etc .. tbh i dint like any of those shops in food court because longer waiting time or its not so tidy.. so dint have dinner there. Many of the rides were not crowded because of week days\nEach ride cost around 120rs\nThey rides for both kids and adults",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "100% Entertainment for Kids, Family and friends, Beautiful sunrise view early morning, Walking, Running any Physical activity early morning very cool and peaceful, Evening Boating facilities, Foodies",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It was very very crowded .. may be it was because of the time we visited.. we visited on Christmas holiday. The beach is good. There are many food stalls with variety of food items and games/rides for both kids and elders.. But everything is on the expensive side.\nThere are rest rooms which are cleanly maintained. There are tables and chairs to relax.. spend the time with some good food and games..  there is a nice view of the light house from the beach.\nOnly suggestion is do not go on public holidays..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Great beach actually, would be a great time to visit on weekdays + there is this food court at the shore which has an ample variety of foods to try. I personally loved this place💜🩷",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place to hang out. It's not that well maintained. Litter here and there. But it's a decent place. Beach, food spots, and a play area for kids. Near the lighthouse.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Botanical Garden",
      "rating": 3.9,
      "address": "WRJC+3XM, Marimalai, Maraimalai Adigal Salai, near Anna Statue, Ambedkar Nagar, Orleanpet, Puducherry, 605001, India",
      "reviews": [
        {
          "text": "This garden is truly impressive. The ambiance is serene and inviting, perfect for families with children. The dedicated kid's play area boasts a plethora of engaging activities, including a charming toy train that adds to the enchantment.\n\nWhat truly stands out are the majestic, towering trees scattered throughout the garden. Their immense presence lends an aura of tranquility and provides ample shade, making it an ideal spot for a leisurely picnic or a serene afternoon of relaxation.\n\nMoreover, the expansive space allows for various activities - from playful frolics to peaceful lounging. The atmosphere is rejuvenating, offering an escape from the bustle of everyday life.\n\nOverall, this garden is a haven for nature enthusiasts and families alike. A definite recommendation for anyone seeking a blend of tranquility, playfulness, and natural beauty.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Nice place to see. The small toy train was the centre of attraction. It took 15 mins for the ride and the charge was reasonable of Rs.20.  I enjoyed the ride. There were too many trees so the atmosphere was pleasant.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "There is actually nothing to see there. It is in a ruined state. There is no maintenace. There is an aquarium.but you need to pay another 10 bucks to get inside.  You can see the same old fishes and turtles.\nIt is usually good for those who like walking, spent some time away from the hustle and bustle of the city.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Among those busy streets and pollution, this place aways stands greenish.\nI know Botanical Garden since my childhood. Nice play to have a quiet evening. You can witness plenty of big tress. Jogging path also available. One small lotus pond.\nFor kids: Simple play area, small train ride, Fish aquarium. Kids will enjoy.\nAs it is run by government, as usual not much maintenance. Entry ticket price is just 20 for adult and 10 for kids. U can definitely have a pleasant time. As it's just a small garden, U can hang out for an hour or 2 maybe.",
          "languageCode": "en",
          "rating": 3.9
        },
        {
          "text": "Visited during the flower show,full crowded but enjoyed the lot ,during normal days it will be a peaceful and perfect place for relaxation and walk, among those busy streets",
          "languageCode": "en",
          "rating": 3.9
        }
      ]
    },
    {
      "name": "Arikamedu",
      "rating": 3.5,
      "address": "Ariyankuppam, Veerampattinam, Puducherry 605007, India",
      "reviews": [
        {
          "text": "Very pretty place which is accessible by both boats and road. It is  the ruins of a old port which used to be functional long back. It is very good to take pictures and relax for a few hours. There is a small juice shop as well to quench your thirst in the scorching heat. It's a no-smoking no-drinking zone.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "People may be disappointed if they visit this place without knowing it's historical significance ,Though not much to see here, but if you know the history and importance of this oldest town in south india, it will give you thrilling memories! This place can be visited by boat also, there is a river connecting to it.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Good place to visit if you are interested in history. Never knew the Romans had been here in India until I read about this site. It's possible to drive to the location or to take a boat trip to it from Mike's boat house & you get a complimentary coconut.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "There are two ways you can reach here. By road or while you take the boat ride of mangroves. It is included in the package. To be honest nothing special at the location. Has one historical building. Go and click some pics. Pics will surely be instragramable.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Not so much to see there. Just a refreshment in the mangrove forest journey. We need to pay more to get lime soda, goli soda and mojitos there.",
          "languageCode": "en",
          "rating": 3.5
        }
      ]
    },
    {
      "name": "Immaculate Conception Cathedral",
      "rating": 4.5,
      "address": "204, Mission St, MG Road Area, Puducherry, 605001, India",
      "reviews": [
        {
          "text": "The church was built during the 17th century. The architecture is very beautiful and is located very close to the rock beach. The interiors are stunning and very peaceful. Went during Christmas and it was very well decorated.\nThe silence and peace inside the church is very soothing. Worth visiting for sure.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Immaculate Conception Cathedral in Puducherry is a 300-year-old mother church for the Roman Catholic Archdiocese of Pondicherry and Cuddalore. Its beautiful white and blue color scheme with golden accents coupled with a mix of Herrian, French, and Portuguese style architecture makes it a site worth visiting at least once.\n\nThe church is also known as Samba Kovil, which is a phonetic corruption of \"Saint Paul's Kovil\" where \"Kovil\" means church.It is one of the oldest tourist sites in Puducherry and was visited by Mother Teresa during her visit to Puducherry.\n\nThe Church consists of a choir loft, bell tower, an intricately redesigned esplanade (open space), and a splendid display of colors. The colors inside the Church make you fall in love with it repeatedly.\n\nThe Church lies close to Promenade beach, surrounded by green avenues and landscaped gardens.\n\nIts stunning architecture, rich history, and welcoming atmosphere make it a must-see destination for anyone interested in exploring the cultural and religious heritage of Pondicherry.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Situated close to White Town, this church showcases a distinctive architectural style, prominently featuring French design elements both inside and outside. Its unique aesthetics make it a must-visit spot for tourists seeking a glimpse of remarkable French-inspired architecture.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Visited this beautiful church on a Sunday. Absolutely amazing. Loved the interiors.\nIt was very quiet and peaceful inside. So visit the church while you are in Pondicherry.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very beautiful church. Astonishing to see very old well designed with fantastic architecture dates back to 17th century.\nHighly peaceful and well maintained church bliss with divine power of Lord Jesus is highly appreciated. Worthy to visit.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Eden Beach",
      "rating": 4.6,
      "address": "Maraimalai Adigal St, Chinna Veerampattinam, Puducherry 605007, India",
      "reviews": [
        {
          "text": "Beautiful and well maintained beach.\nNot great for swimming. It is allowed and there are lifeguards there, but the water is very aggressive and the sand gets everywhere.\n\nAll necessary facilities and eateries are available. Changing room charges are 20 rupees per person, and using the washroom costs 10 rupees. Two wheeler parking costs 20 rupees. There is a Nescafe shop and plenty of shacks near the beach. But nothing on the beach itself, as it is a blue flag beach.\n\nThe path leading up to the beach is very pretty, and there is backwater boating as well.\n\nWe faced a moderate rush at the beach on a Friday evening.\nGreat beach for taking a walk by the sea, and enjoying the view with the sea breeze.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Blue Flag Beach . Beautiful and clean beach . But for all the activities they are charging.  Even for arm sitting, they charge . Sports activities are available but all the highly charged . Suggest everyone visit early morning to witness the Mesmerising 6 view. Must visit nearby beach paradise . Must visit place for enjoyable outing with family and friends.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A peaceful place. I'll tell a secret for the boys and girls. They say no booze is allowed here. That is true. And you should follow it. But if you want a beach all to yourself and have fun drinking and dining, you should visit this place at midnights. Trust me, no one's here at those hours and it would just be you and the moon and the sea and the breeze. Maybe try it someday? But let it not be a regular thing. I mean it's kind of private property now. So let's be decent travellers and not disturb anyone.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place to get  soaked in sun and sea. You have plenty of sea food to enjoy there. You can see both back waters and sea at this beach. Clean beach with options of shower and changing for both men and women. Best beach in pondicherry.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's very well maintained & clean beach. It's been given a blue beach status which only a very few beaches will get. You can easily spend 2 to 3 hours here.\nEven though the beach is very big, you will be restricted to enjoy & roam around on a small area by 3 to 4 security guards. If you have a DSLR you'll have to pay ₹ 1000. The guards will make sure of it. Actually the beach is just to click some good photos. Since you would be able to enjoy just a small area of the beach, I would recommend you visit here during a weekday as it would be less crowded.\n\nThere are a few water activities here like Boating & Zorbing in the backwater lake adjacent to the beach. You'll have to pay for any amenities you use like parking, washrooms & changing rooms, Relaxing shacks(₹100) on the beach. The parking is quite big and they charge ₹50 for the cars.\n\nThere are a lot of vendors selling snacks, veg & non veg(mainly fish), Ice creams, maggie, omelette sandwich etc. There is no provision for proper food even in the nearby shops. For Pure Veg people there is nothing.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Lighthouse Beach",
      "rating": 4.3,
      "address": "WR8J+8CG, Dubrayapet, Puducherry, 605004, India",
      "reviews": [
        {
          "text": "This place was on my list for so long.. and this time I did it! It opens at 2 so better you go by 2ish-3 and the view is absolutely nice.\nNo shoes allowed inside … and there is a small entrence fee. The time to stay on top of light house is 10 minutes . If you stay beyond that , then the guard will ask you to leave … it’s a must visit place",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Want to see Pondicherry in panoramic view, then lighthouse is a must visit place.\nEntry is maintained by govt officials and open upto 5pm . One need to climb ~11floors to see the panoramic view",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the best tourist places in Pondy, stunning views, great experience.\nAs seen in the photos, have to climb lots of stairs with no lift.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Hi all\nEntry ticket - 10rs\nits an amazing view from the top.\nclimbing light house is one of the happy moment for me, i feel great when i reached top. Thank you",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Really nice beach to visit for the tourists... It's better in the evenings as there is a lighthouse close to the beach which will be working. The crowd is not much but can increase during the weekends. There is provision to even go to the lighthouse to visit during the evening. There is also an amusement park with food court opposite the beach.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sandunes Paradise Beach - Tourist Spot",
      "rating": 4.3,
      "address": "Sandunes Paradish Beach, Lake View Rd, Pudukuppam, Puducherry 605007, India",
      "reviews": [
        {
          "text": "Neat and clean beach where water activities are available and good food with drinks are available.\n\n₹70 entry fee only. Activities will incur charges. The beach beds are available at ₹100/hr.\n\nChanging rooms with clean bathroom and toilets are available. Locker is also available at a minimal charge.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Getting to Sandunes Paradise Beach might make you question if Google maps is leading you in the right direction, with a ride that almost makes you think you need an ATV. But once you persevere and reach the spot, you are greeted by good parking and interesting fun activities and the beach, of course. From my experience, If you go post 6pm, they do not charge for an entry fee, but they also tell you that you cannot get into the water; despite this, there are several people who foray into the ocean and have fun. I mean, who wouldn’t enjoy the sea under the cool moonlight?\n\nThey have decent changing rooms, wash rooms and a party area of sorts where there is loud music and lots of dancing. There’s also a nice fancy restaurant which we didn’t try as we had dinner waiting for us in Chennai.\n\nOh, we also saw a camel on the beach; and randos driving ATVs around.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a great place to enjoy with your friends or family. You're allowed to go into the water and bath but there's a certain limit. You need to buy tickets to go inside and apart from the beach, you can also explore other water activities here (which are to be paid separately). Apart from that, there's a changing area for men and women (i suppose) and a sitting area for people who drink. Good music and good vibes!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I don’t know why this beach is underrated. For entry, they charge around 60 rupees. Upon entering the private beach, there is a selfie point, a restaurant offering both vegetarian and non-vegetarian options, and a water activities area with additional charges. Depending on your interest, there are washrooms, dress changing rooms, a rain dance area, live music, camel rides at an additional charge🔴, and ATV bike rides for extra fees🔴. The beach is well-maintained and enjoyable, but I found the prices for water activities and ATV bike rides to be too high. Nonetheless, this spot is a must-visit when you are in Pondicherry. HAPPY EXPLORING yours foodie addict ❤️✨",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One of the cleanest beaches with soft white sand. Very good for people looking for a beach to play in pondy. There is an entry ticket of 70rs per person. There are a lot of other activities like speed boat, jet ski, donut ride, camel ride, quad bike, bungee trampoline, aqua park which are paid rides.. I felt these were on the costlier side when compared to beaches in Goa..There are food stalls and a shack. Shower and changing rooms are available. We went during the Christmas holidays and hence it was crowded and we had a wait time for rides.. Overall we had a good time at the beach.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "New Light House",
      "rating": 4.4,
      "address": "New Light House, Dubrayapet, Puducherry, 605004, India",
      "reviews": [
        {
          "text": "Superb experience at new light house in Pondy. It takes 10 mins to climb the stairs till top. The view is fabulous and mesmerising. There is an entrance fee for 10 INR. Not recommended for pregnant women’s, physically challenged, physically weak, as the steps are quite strenuous. But after climbing upstairs you feel wow.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The Pondicherry Lighthouse is a captivating and historically significant landmark that offers visitors a unique perspective of the coastal charm and maritime heritage of Pondicherry.\n\nPondicherry Lighthouse is a lighthouse was constructed in Pondicherry in the nineteenth century by the French rulers.\nA new lighthouse was constructed in 20th century by the Government of India. The old lighthouse had first beamed light on 1 September 1836. The new lighthouse started functioning in 1979.\n\nAscending the Lighthouse's spiral staircase is an adventure in itself, as it leads to a mesmerizing vantage point from where visitors can enjoy breathtaking views of the glistening ocean, the picturesque coastline, and the bustling city below.\n\nThe historical significance of the Pondicherry Lighthouse adds depth to its allure, offering insight into the maritime legacy of the region. It stands as a symbol of the city's seafaring past and pays homage to its role in guiding ships to safety.\n\nVisitors will also appreciate the serene ambiance surrounding the Lighthouse, as it provides a welcome respite from the urban clamor, allowing for moments of contemplation and relaxation. The gentle sea breeze, coupled with the rhythmic sound of waves, creates a soothing environment that complements the overall experience.\n\nTime            : 2.00 PM  - 5.00 PM\nEntry Fee  :  10 per person",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The new lighthouse in Puducherry stands tall as a beacon of maritime charm. Its sleek design complements the scenic coastline. Visitors can climb to the top for panoramic views, making it a must-visit attraction in this coastal town.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a working light house situated on pondy marina beach .they charge 10 rupees for entry.we have ti keep liquid money.we can stay for 10 minutes. It's working everyday except Monday from 2 pm to  5 pm . The view from the top is worth watching. And the wind was so good .It will be a great experience In our life .j liked it. There are so many steps to climb so try it if you want to explore.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It was really a nice view from the top.\nThe experience of the wind blew at such a height was so mesmerizing.\nIt's worth going on the top.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}