{
  "places_with_reviews": [
    {
      "name": "Sweet Lake",
      "rating": 4.3,
      "address": "Arambol, Goa 403524, India",
      "reviews": [
        {
          "text": "Lake's surrounding is beautiful but lake is small. Doesn't feel like having a bath there because of stagnant water which is somewhat dirty. Opposite to lake is a beach which is very less crowded, I liked that. To reach this beach one has to walk for around 1 km.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Go for a Hike to experience the freshwater coming into the lake. You will find peace and can truly enjoy the beauty of the nature. It's a little hidden place to go on the top.\nBring your towels and have a bath in the pool. You can drink the water as well. It's so fresh, depending upon the season.\nP.S: Don't drink the water, if you have water related allergies.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very beautiful place to visit in arambol beach .I can say it is a nature wonder . The water here is not too salty .it is like a private lake for those who can stay there for some hours and have breath taking view in the middle of the mountain and near the ocean .",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A beautiful spot away from the beach. The guy who run's or possibly owns it is very friendly and informative about the lake. It is a good place to watch the paragliders in the sky above.I would have given five star's only some of the cliental spoil the ambience by having to much to drink and showing no respect for others",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The views are beautiful but the water was not moving making it a bit contaminated and locals men were swimming there making us, tourists, a bit uncomfortable. There was a very small tent to get changed in your swim suit.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Querim Cave",
      "rating": 4.6,
      "address": "PM3V+RVC, Paliem, Goa 403524, India",
      "reviews": [
        {
          "text": "Amazing formation of the rock, Amazing place. Visited this beach in weekdays so there was less croud.\nDefinitely a place to visit if you love solitude, you can visit this place only during low tide.\nIt is a naturally formed cave. It is  just a small climb and walk and you can enjoy there with your family and friends.\nYou must visit this place. In the winters you can para gliding over the mountain side. 10 minutes walk from the parking space on Querim beach.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The cave is closed and there is no way to see the cave. There is a board which says the entry to the place is not allowed. The Guards are pretty fast and will fine if you on the spot.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing, Quite and peaceful only the problem is dirty washrooms and beach is also not clean",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Possibly one of the most peaceful beaches in Goa, although getting there is a little difficult. Definitely worth the journey!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice and clean beach to chill.\nVisit during low tide to access the caves.\nLimited food options.\nParagliding options nearby.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Fort Tiracol Heritage Hotel",
      "rating": 4.3,
      "address": "Pernem, Taluka, Tiracol, Goa 403524, India",
      "reviews": [
        {
          "text": "Very very beautiful but we made a mistake of not doing enough research. U reach this place with a ferry and the ferry stops from 330 to 8pm due to low tide. We reached at 3pm, had to leave without food or even seeing the property properly",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Stopped by at the restaurant after a visit to Querim beach. Magnificent view from the restaurant. Also requested the front desk to show us a room and she obliged. Beautiful , large rooms with sea view and nice decor.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A Unique Slice of Goan History and Luxury\n\nSet along the northern shores of Goa, the Fort Tiracol Heritage Hotel is a one-of-a-kind destination that seamlessly blends centuries-old history with modern luxury. Nestled within the walls of a 450-year-old Portuguese fort, this property offers guests an immersive experience that transports them back in time while still providing all the comforts of a high-end resort.\n\nUpon arrival, the sheer scale and grandeur of the fort are immediately awe-inspiring. The beautifully preserved structure, with its impressive ramparts and striking white facade, instantly sets the tone for an unforgettable stay. As you step through the entryway, the transition from the bustling outside world to the serene, almost meditative atmosphere of the hotel grounds is palpable.\n\nThe suites are uniquely designed, paying homage to the property's storied past while offering every contemporary amenity. Each of them is designed with Portuguese interiors and cutely named after the seven days of the week.  Spacious layouts, plush furnishings, and stunning views of the Tiracol River or the Arabian Sea create an undeniably regal ambiance. The attention to historical detail is remarkable, with elements like exposed stone walls and antique furniture pieces effortlessly complementing the modern comforts.\n\nWhat truly sets Fort Tiracol apart, however, is its ability to transport guests to a bygone era while still providing all the luxuries of a modern resort. The seamless blend of historical ambiance and contemporary comforts creates an experience that is truly unparalleled, making it a must-visit destination for anyone seeking a unique and unforgettable stay in Goa.\n\nLOCATION: Close to the Konkan coast of Maharashtra than Goa, it is located within easy reach from popular beaches of Goa like ARAMBOL, MAJORIM, QUERNEM, etc.\n\nDINE + DRINK: The in-house lounge bar (called The TAVERN) is an ode to old Portuguese taverns and comes with lovely views of the Sea. There’s also an all-day café serving Goan, Indian, and European snacks and pastries right by the river\n\nROOM: We stayed in a Room called FRIDAY, so this review is based on that;  SIZE: Spacious enough for 2 adults and simple baggage; VIEW: Sweet view of the sea from the cute attached balcony; AIR-CON: Perfectly functioning cooler that helped in setting the perfect room temperature; BED: Comfortable bed that played the expected part of putting us to sleep; BATHROOM: Stand-in shower; TOILETRIES: Good quality toiletries by INARA brand\n\nFACILITIES: No Gym or pool on site, pure Beachfront chill!\n\nSERVICE: Friendly staff that took care of all our needs with a smile and made us feel pampered and well taken care of.\n\nHOW WIRED YOU WILL BE: Free Wi-Fi that works well all over the property, and the speed is good! Big Smart TV dishing out a wide variety of channels spanning sports, news, music, movies, and  entertainment in multiple languages",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We just visited the fort and were not staying there. It has been converted to a hotel, hence cannot be seen. The best part is the ferry ride, which is the only means to reach here. This ferry carries your car as well.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Fort Tiracol Hotel is an absolutely unique amazing experience. We stayed here few times and loved it. The rooms are beautifully decorated, very clean and stylish. If you’d like to stay in the only hotel in Goa that has this historical feeling, drink tea on the little balcony with the best view possible, surrounded by tranquil wild nature, listen the waves in the night, enjoying long relaxing breakfast watching the sea, this is definitely the place to go.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Querim Beach",
      "rating": 4.6,
      "address": "PM6R+VQ5, Querim, Goa 403524, India",
      "reviews": [
        {
          "text": "Long curved beach at north most part of Goa. Must visit. Concrete boulders along beach side in half stretch to counter high tides. Very beautiful and calm beach. Water sports facilities available. Natural water caves at southern end of the beach. Take a walk on the beach to reach, visit in low tide only. You will love it.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The secluded beach offers breathtaking views, perfect for relaxation. The shore here is a mix of beautiful beige sand and some coral rocks. The captivating caves are an added bonus, enhancing the overall experience. A must-visit for nature lovers and adventure seekers alike.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Querim Caves was the attraction to visit this place... But I had a really bad experience reaching that part of querim beach... No control over the use of the beach.. Humans marked their boundaries everywhere in terms of Pee and potty.. we were told that as There is a famous temple in the vicinity and yearly fair was there people use the beach to do mornings...  Disgusting it is.. local authorities need to pay attention to this said topic.. or else the beauty of this part of Goa will be in books only.. I posted only pics of the cave when I entered inside this cave formation otherwise there were no good sight to click along the whole beach...",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Cool and calm Beach. If you want more privacy, you can visit this beach. Most foreigners spend their time here.  Even most people don't know about the Beach. There is a temple exactly opposite the beach. Been there to do Para motoring nearby, due to time constraints i have visited and I wonder 🤔 after visiting the beach. Little away from the main goa, but still I recommend this beach to spend time with your besties.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ohh My God.\nAn absolute gem of north Goa.\nVisit the bat cave and see the sunset from there. Enjoy the moonlight and silent beach along with some good food at night.\nYou can even trek to this beach from sweet lake beach in Arambol",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Tiracol fort",
      "rating": 4.3,
      "address": "PMCM+X4, Querim, Goa 403524, India",
      "reviews": [
        {
          "text": "A nice quaint place with only 8 rooms. The property is decent and can be visited from outside too. It is easier to get here via the ferry boat. The road trip from North Goa would be longer and more time taking. The breakfast was decent. The views are great and the place is in a very peaceful place. There is an adjoining beach which has a nice trail to a cave area. Not a very well clean place, but has a nice view of the sea. Sunsets would be pretty awesome from there.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Tiracol fort is now converted to a Heritage Hotel! 🥰\n\nHence if you are planning to come here as tourist make sure that you are allowed to see the fort. 💯\nSometimes we come here in the evening to visit the fort. It is always a mesmerising experience to visit forts from Portuguese era..🙆‍♀️😌❤\n\nI am happy to be a local here\n#proudme #local_speaks #heritage\n💫🙋‍♀️😇\n\nWishing you all a very Happy New Year!\n🎆💯🙆‍♀️❤",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Originally built by Maharaja Khem Sawant Bhonsle, Tiracol Fort fell into Portuguese hands in 1746. Revamped in 1764, it guarded the Tiracol river mouth, serving as a key defense for the Goan colony. Witness to the Portuguese Civil War in 1895, it briefly became a rebel stronghold under Dr. Bernardo Peres da Silva. Post-independence, the fort played a role in Goa's freedom struggle and was finally ceded to India in 1961.\n\nToday, this historic fort stands as a unique retreat, having been transformed into an exclusive hotel. While modern amenities abound, the fort retains its historical essence. With ample parking, a restaurant, and accessible areas for visitors, Tiracol Fort offers splendid views of its surroundings. Immerse yourself in the rich tapestry of battles and Satyagraha marches that echo through its walls.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Tiracol fort perched atop a hill, offers not only a rich historical experience but also stunning panoramic views of the sea. The fort's strategic location provides an excellent vantage point to admire the vast expanse of the ocean and the coastline below. Additionally, the convenience of ample parking space makes it easily accessible for visitors, ensuring a hassle-free exploration of this architectural gem amidst nature's grandeur.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Fantastic place. Excellent ambience. Good service. Food also good. Only 7 rooms so good privacy. Nearby good beach.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Ajoba Temple",
      "rating": 4.7,
      "address": "PM5V+3MF, Querim, Goa 403524, India",
      "reviews": [
        {
          "text": "Very beautiful setting and very unique Temple - in a Octagonal plan - You can sit 12 months of a year and feel the same! Aum !",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is located right on the quirem beach in pernem, there is ample of parking space here for the vehicles and one can visit the temple & than head to the beach.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I would like to give 5 star because it's heavenly good environment\nOnly don't go in beach months like summers\nIf you want to meet inner peace\nI would like to visit during rainy season, I I'll try to post same pics in rainy season\nBeach view is great\n\nBest side is that here you will get mahabharat song vibe\nThe main song of mahabharat dharma adharma satya aasatya\nPly this song and let me know what you felt by roaming on beach surrounding temple.\n\nYour opinion also matters. Helps to get some extra knowledge📚\nFor such info in goa and Maharashtra follow me",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "If you watched Kantara Movie then you will relate with the Shri Ajoba - Local Demi God. It's a swayambhu and jagrut devasthan. Feel the presence of divine energy around the temple. Nice temple to visit with family.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is located right on the quirem beach in pernem, there is ample of parking space here for the vehicles and one can visit the temple & than head to the beach.\nThis is also the start point of adventure activities like paragliding & one needs to trek for 15-20 mins from here to reach on top of the cliff.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "The Big Banyan",
      "rating": 4.8,
      "address": "PP28+42M, Unnamed Road, Paliem, Goa 403524, India",
      "reviews": [
        {
          "text": "I recently visited the Big Banyan Tree and was blown away by its sheer size and beauty. This iconic tree is an impressive sight to behold - with its sprawling branches and intricate roots, it's truly a wonder of nature.\n\nThe surrounding park area is also a great place to relax and take in the beauty of the tree. There are plenty of shaded areas and benches where you can sit and admire the scenery.\n\nI was also impressed with the cleanliness and upkeep of the park - the paths were well-maintained, and there were plenty of garbage cans around to keep the area clean.\n\nOverall, I highly recommend a visit to the Big Banyan Tree. It's a great place to take a break from the hustle and bustle of the city and appreciate the beauty of nature.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Amazing place that offers a variety of activities. You can enjoy the shade under the tree's large canopy, test your courage by climbing around on the branches, listen to talented musicians playing music sometimes (like alone under the tree), and hear the beautiful songs of birds. Whether you're looking to relax or have some fun, the Big Bunyan Tree has something for everyone. Don't miss out on this awesome spot!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice place and good for yoga lovers. Request everyone don't spoil this place by throwing bottles or any kind of waste near tree or surrounding. Keep the place clean.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful, beautiful place. This Banyan is incredible. I don't have a whole lot of experience so maybe there are bigger and more impressive Banyans, but then we talkin' reeeaaal avatar style ya know? Get up in that tree and monkey around like Tarzan yo x",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This should have a good proper way to reach, only by two wheeler and that is also thru the fields and rocks , it's little difficult to reach there, but the tree will not disappoint you,it have very nice hanging roots and a good view to Take pictures and explore the things.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Aronda bridge view point",
      "rating": 4.7,
      "address": "Aronda - Terekhol bridge, Aronda Rd, Kachakila Wada, Savarjuva, Goa 416513, India",
      "reviews": [
        {
          "text": "This is a long and old concrete bridge over a wide river surrounded by beautiful hills. This is the perfect place to watch a sunrise as well as a sunset, equally beautiful. We crossed this bridge early in the morning during sunrise and it was magnificent! There is almost no traffic so one can pause and watch for some time.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Back in 2010. I used to visit this bridge every evening just for the fresh air. The bridge was under construction maybe like 25-30% constructed but we used to chill there every evening during my summer vacations. There used to be one elderly couple selling tea and vadapav, our main reason to visit the kiranpani bridge was to eat vadapav and have tea 🤣😂🤣😂.\n\nRecently in December 2023, I visited this bridge and all the memories flashed in front of my eyes. It seemed like everything changed in a decade but yes, i loved the development and the bridge is for sure one of the best bridge with a lovely view of Maharshtra Goa Border 🥰❤️😍",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Aronda Bridge Viewpoint in Goa offers a breathtaking panorama of the serene Aronda River and lush surroundings. The bridge itself is an architectural marvel. Visitors can enjoy a tranquil moment while admiring the picturesque Goan landscape. It's an ideal spot for nature enthusiasts and photographers seeking a serene escape from the bustling tourist areas. However, amenities are limited, so bring your essentials. The viewpoint's secluded nature adds to its charm, making it a peaceful stop to appreciate Goa's natural beauty.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "U will get a scenic view from Agondq bridge. The bridge connect Goa and Maharashtra state.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Title: Captivating Scenery at Aronda Bridge View Point\n\nRating: ★★★★☆ (4/5)\n\nReview:\n\nDuring my recent trip to the beautiful state of Goa, I had the pleasure of visiting the Aronda Bridge View Point, and I must say it left me in awe of its stunning scenery.\n\nSituated in the picturesque village of Aronda, the bridge offers a breathtaking view of the meandering river and the surrounding lush greenery. The vantage point provides a perfect spot to admire the beauty of nature and soak in the tranquil atmosphere.\n\nThe bridge itself is a marvel of engineering, elegantly spanning across the river with its impressive structure. The sight of the river flowing gently beneath it is mesmerizing, especially during sunrise or sunset when the sky is painted in vibrant hues, creating a magical ambiance.\n\nThe view from the Aronda Bridge is truly captivating. As I stood there, I could see the boats gliding along the river, adding a touch of serenity to the panorama. The surrounding landscape, with its dense forests and rolling hills, further enhances the beauty of the place, making it a paradise for nature lovers and photography enthusiasts.\n\nOne of the highlights of the Aronda Bridge View Point is the sense of tranquility it offers. Away from the bustling city life, the peaceful ambiance allows visitors to disconnect from their daily routines and immerse themselves in the natural surroundings. It's an ideal spot to relax, unwind, and appreciate the simple joys of life.\n\nThe accessibility to the viewpoint is convenient, with ample parking facilities available nearby. Additionally, there are a few small vendors offering refreshments and snacks, making it convenient to grab a quick bite while enjoying the scenic view.\n\nWhile the Aronda Bridge View Point is undoubtedly a picturesque location, it could benefit from some additional amenities to enhance the visitor experience. Adding seating arrangements or picnic spots would provide visitors with more comfort while they spend time admiring the view.\n\nOverall, the Aronda Bridge View Point is a hidden gem in Goa, offering a serene escape amidst nature's splendor. It is an ideal place to witness the beauty of the region and capture some incredible photographs. If you're seeking tranquility and a chance to immerse yourself in nature's embrace, I highly recommend paying a visit to the Aronda Bridge View Point during your Goa trip.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Hidden Cave",
      "rating": 4.7,
      "address": "PMFJ+56, Querim, Goa 403524, India",
      "reviews": [
        {
          "text": "Great place to be...a little interior but worth the visit...we did not find many Indians here but a lot of foreigners... preferably go in the morning hours as the heat is too much in the afternoons.please check the condition of high or low tides before going.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Well worth a visit if you're exploring the Tiracol coastline on foot. Can be tricky to find, but there are foorpaths leading to it and the location on Google Maps is accurate. Easily accessible from Tiracol Fort - start from the car park right outside the gates and follow the path between the fence line and the low wall.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "There is nothing as such cave, it’s just small part of rock is cut, but the view of the ocean is mesmerising",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Tourists attraction.hidden cave in huge rocks.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Best place in arambol, less people, ridge and a cave inside in front of a lonely hidden beach.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Arambol Banyan Tree",
      "rating": 4.4,
      "address": "PP22+QCJ, Paliem, Goa 403524, India",
      "reviews": [
        {
          "text": "Interesting places in jungle you can see many trees and other stuff banyan tree looks amazing but baba was died when we came there but journey was amazing I recommend you use some shoes because of snakes and other animals any way it's was awesome trip",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This iconic place doesn’t exist anymore, the tree was collapsed.\nBut path to the place where it was worth to explore.\nThere you can swim in sweet lake stream and get some clay treatment.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Peaceful place, the hike is totally fine, but I do not recommend to visit it during the night, some of the branches are pretty low.\n\nYou can just sit here and do nothing except sharing food, drinks and ...\n\nLocal guy create here a small workout place which was for me, so we tried some stuff together.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A bit of trekking from the sweet lake arambol leads to this peaceful area on top of a hill and 600 years old banyan tree the trek is of medium level thru the jungle just follow the small river and small waterfalls there is no network of any mobile service you can spot and hear a lots of birds crazy bunch of people sits here all day singing and playing musical instruments but everyone is friendly and offer fruits and water and if you follow the trail up you reach a mango tree where you find another group, but the baba sits under the banyan tree who displayed his amazing yoga poses and also encouraged everyone to learn and do yoga everyday overall it was a nice experience something offbeat adventurous and peaceful for the mind and soul",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Located at Arambol beach, this place is accessible after a small trek of 15 mins. At the Banyan tree there lives a 'Babaji' who performs yoga and shells out best weed of Goa. This place is all about sharing and caring. So this booti made by babaji is shared by all those who are present there. Babaji accepts fruits as gifts. People just sit there, high on weed, meth etc. and make merry, sing songs and overall just enjoy themselves. There is a huge Russian crowd as well. Overall its one of a kind experience and worth visiting once.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}