{
  "places_with_reviews": [
    {
      "name": "Ghagar Buri Chandi Mata Temple",
      "rating": 4.7,
      "address": "Ma ghagarburi Mandir Kalipahari Asansol Paschim, M2M4+5H9, Domohani Railway Colony, Asansol, West Bengal 713339, India",
      "reviews": [
        {
          "text": "This is one of the most famous temples in Asansol named as Ghagar Buri Chandi Mata Temple. This is situated by the High road (by pass) towards Chittaranjan at a 5 mins driving distance from Kalipahari more. This holy temple is greatly worshipped by the devotees where Ma chandi is present in the form of three red stones (Shila) with eyes on that. The entire area is quite neat and clean and peaceful. The temple has a wide open surrounding area where many other temples are also present. It is also very popular for offering pujas at the purchase of any new vehicle. The river Nunia flows by the side of the holy temple but that lost its glory due to the accumulation of garbage all along the river. So, the area to visit the river is restricted. However, during the monsoon, there is a natural little waterfall made on this river.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of my favourite place for puja at present in Asansol. Ghagar buri chandi mata 🙏.  I often goes there. Puja system is really good. You can buy puja materials at any shop situated in the both side of the road towards the entrance of  temple. This place has many history. A river nunia flows behind the Temple which is known for foamy water. Peoples are not allowed to go there because they may slipped into it. There are many hotels to take food after puja & has many stationary shops in the outside ground. People mainly goes there to give puja after newly married or newly became patents.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very nice temple to visit the puja system is very good the line system is taking your test of  patience after that you feel peace most recommended temple to visit if you come by road the temple is beside highway of asansol.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very clean campus. It was about 6:30pm when we visited and the mandir was about to close for the day. There were hardly 5/6 people at that time. Had very good view of Mata Chandi and had ample time for prayer. Very good experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The most precious & famous temple of our Asansol area, I have been coming here since childhood, a very lovely place. The area here is also very big. Day by day the temple is getting better. During the season of weddings,picnics & mela it gets very crowded...",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Susanta Ray Wax Museum and Seesh Mahal Asansol",
      "rating": 4.5,
      "address": "Mohishila Colony, Hamid Nagar, Asansol, West Bengal 713303, India",
      "reviews": [
        {
          "text": "Some of the sculptures looked as if those were real. Salute to the Artist's art. Sheesh Mahal was excellent as well. Must visit once.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Best efforts to make the whole of the work. At present the number of galleries are less, but I hope it will be increased day by days.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Amazing experience filled with mesmerizing wax statues. Worth spending time here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ticket price is 100 for adults and 50 for students which is higher. It should be less.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A place of aesthetic beauty. The statues made of wax are admirable and the  upstairs Sis Mahal has a magical charm. It can be a source of pleasure for the children also. One can visit this place with their near and dear once to enjoy the artistic beauty of the Museum.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "BLUE FACTORY MINES",
      "rating": 4.6,
      "address": "Majiara, West Bengal 713334, India",
      "reviews": [
        {
          "text": "It's a old mine contain greenish blue water. Excellent look. 4.5 kms from Asansol Railway Station.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful place near Asansol. The area is a bit remote so go before dark. Do not venture into the water, it’s very dangerous. Enjoy the view and don’t litter. Space for parking available. While coming back to Asansol you can stop to Gitanjali dhaba for tea and snacks.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Its scenery is good but the fact is the place is dangerous. There's no safety there. As it's not a tourist place instead it's a factory spot. People go there at their own risks. Many people have lost their lives due to drowning there. Water is very deep there more than 300 feet. So it's better if you don't go there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is very nice place to visit and photography. Also youngsters of asansol called it Ladakh of Asansol for the view points beauty . It is very romantic place . Also can see the 🌄 and 🌇 with enjoying nature. The mine water seems as a big deep lake of blue water .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The view is awesome. Loved it ♥️",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ashram More",
      "rating": 4.3,
      "address": "33-35, Asansol - Chittaranjan Rd, Railway Officers Colony, Munshi Bazar, Asansol, West Bengal 713301, India",
      "reviews": [
        {
          "text": "This is just a crossing road. Nothing else. Lots of bank, various outlets, jewellery shops and Gupta IT college nearby. Reliance smart bazar, trendz and boutiques are also nearby. Kabristaan is also nearby. You can get bus from here for different locations. Mostly neat and clean. Need a proper bus stand",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's an extremely beautiful place and fully made in compliance with passengers' needs and comfort so that they can feel refreshed and rejuvenated while waiting for boarding their respective flights.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Suspicious  on road kyc for kotak bank wallet account was going on in this place one month ago.atraffic kyosk is their at about 5 metre ahead.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The name Ashram More is of olden times. At this  point on G.T.Road  the famous R K Mission High School , Asansol was situated. That's why the name Ashram More. In 1997 the school shifted to some other place. But still the name continues . Now a days it has shops , shopping complexes , hotels etc  around it.\n\nA road to Kalla , Domohani , Churulia bifurcates from G.T.Road.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Junction Kalla-Asansol ,shopping and hotels are nearby.  Asansol RKM Ashram was here before, so Ashram more it's called.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "DURGA MANDIR",
      "rating": 4.6,
      "address": "MXHV+WX9, Ushagram, Asansol, West Bengal 713303, India",
      "reviews": [
        {
          "text": "Very nice place to worship.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful place..... Jai ma Durga 🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place, basically during durga puja. Puja and arti of Bajrangbali perform everyday.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ghaghar Budi Chandi Mandir",
      "rating": 4.8,
      "address": "Asansol, West Bengal 713340, India",
      "reviews": [
        {
          "text": "Ghagor Buri Chandi Mata Mandir, is in Asansol, a very quite and calm place for mata ' s puja archona and peaceful also. Spend a day devotedly with lap of nature",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "The name of \"𝙜𝙝𝙖𝙜𝙝𝙖𝙧 𝙗𝙪𝙙𝙞\" temple is depict the story of a goddess who appeared in the dream of kangali charron chakroborty wearing a ghagra.\nSo it is called  maa ghaghar budi mandir.\n𝙉𝙤 𝙥𝙪𝙟𝙖 𝙖𝙧𝙚 𝙥𝙚𝙧𝙛𝙤𝙢𝙚𝙙 𝙖𝙛𝙩𝙚𝙧 6 𝙥𝙢\nAlso famous for 𝙘𝙝𝙖𝙞(𝙩𝙚𝙖).",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Maa ghaghar buri is all merciful and listens to her true devotees. Jay maa 🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "VERY NICE PLACE",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Gaghar Buri Temple, also known as Gaghar Budi Mandir, is a popular Hindu temple located in Asansol, West Bengal, India. It is a revered place of worship and attracts a large number of devotees from different parts of the region.\n\nThe temple is dedicated to Goddess Kali, who is considered to be the divine mother and a symbol of power and strength. The main deity of the temple is a black stone idol of Goddess Kali, which is adorned with flowers and traditional ornaments.\n\nThe temple has a rich history and is believed to have been built during the early 18th century by the rulers of the Bardhaman Raj. According to legend, the temple was constructed after a local farmer found a black stone idol of the goddess while ploughing his field. The idol was then installed in the temple, and over time, it became a popular place of worship.\n\nThe temple is located in a serene environment, surrounded by lush greenery and a natural water body, which adds to its spiritual ambiance. The temple hosts a number of festivals throughout the year, including Durga Puja, Kali Puja, and Navratri, which are celebrated with great fervor and enthusiasm.\n\nIn addition to its religious significance, Gaghar Buri Temple is also a popular tourist attraction and is visited by people from all walks of life. The temple's stunning architecture, serene environment, and rich history make it a must-visit destination for anyone visiting Asansol.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Murgasol Sarbajanin Durgamandir",
      "rating": 4.6,
      "address": "MXHR+PJ5, Ushagram, Asansol, West Bengal 713303, India",
      "reviews": [
        {
          "text": "Every year in durgapuja I visit this place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good maintained place. There is a very good higinenic environment.  And the place is very near to murgasole bus stand.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Durga puja is worshipped every year in this temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Place for pace. my respect always.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Wonderful place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shatabdi Sishu Udyan",
      "rating": 3.8,
      "address": "Shatabdi Sishu Udyan, GT Rd, Munshi Bazar, Asansol, West Bengal 713301, India",
      "reviews": [
        {
          "text": "Park are beautiful.. there are so many places for photography but this place not for family",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "This is great place for having fun with friends. it's not family perk because I got see there has lots of couple . structure is little good but not so much .. there has free chilled  water available .has canteen also.\nU can see beautiful lack view every corner at the perk .and .The name seems to be kept such that children perk  but  thats   park of lovers.everywhere   u can see lover there doing love making.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "This park offers a romantic atmosphere that is ideal for couples seeking a peaceful escape. The lush greenery and serene surroundings create a lovely setting. However, families may find the intimate ambiance less suitable due to couples engaging in public displays of affection.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Not a good place for children. Avoid to go there with children.",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "The worst thing about this park is that there is no food or water allowed inside the park. If you need to drink water or any food, you must buy and eat inside the park .\nYour bag will be checked upon entry to ensure that no one is carrying any food or drink . 😑 Bad experience 👎\nAnd this park is not good for young lovers👎",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Shree Shyam Mandir Asansol",
      "rating": 4.9,
      "address": "MXMH+M3C, Raha Lane, Pathak Bari, Asansol, West Bengal 713301, India",
      "reviews": [
        {
          "text": "The very authentic place for peace seekers. The spiritual vibes clean ur inner soul bring peace and give satisfaction.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very very very good and very nice Mandir",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "A well maintained beautiful temple . It feels so good to be here , peaceful environment & most importantly you feel peaceful after entering the temple. Idols are so beautiful that it seems they are real.\n\nI'd suggest you to visit here using the public transport because parking is an issue here coz it's built in market place.\n\nDo visit the place.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Great peaceful divined place..one must visit..",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Shri Shyam Baba Mandir Asansol dhaam\nPeace, silence, worship 🙏",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Asansol-Kalipahari More",
      "rating": 4.6,
      "address": "M2G6+3R9 Kalipahari Road, Domohani Railway Colony, Asansol, West Bengal 713303, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bikash Roky Raj Yadav",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    }
  ]
}