{
  "places_with_reviews": [
    {
      "name": "Valara Waterfalls",
      "rating": 4.4,
      "address": "8F6W+36J, SH21, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Its a waterfall on the way to munnar. You can take beautiful pictures here. At the most you can spend only 10 to 15 minutes here cuz there's nothing else to see apart from taking pics.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "OneOfTheBest forest experience But its not fully opened for Tourists because of wild animals ,Well maintained and peaceful atmosphere.You should take a pass from forest office",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very fascinating site seeing while crossing through there.\n\nYou should see the amount of water falls from the rock and goes through there forest is marvelous.\n\nYou cannot ignore stopping there while crossing the road at any time.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Be sure to bring a few people with you or the Forrest may be TERRIFYING. Hard to reach but totally worth it. Almost a km hike through a dense humid forest.....astgetic places on the way.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Two hours of walk inside the forest not a dense forest but nice walk through trees.at last water fall pure fresh water.way back the forest look different.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Njandamkuth Waterfalls",
      "rating": 4.5,
      "address": "7GR4+2M2, Vettilappara, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Amazing place to visit. Beautiful scenic place to hang out.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Hidden place. A short walk through the road beside the bus stop leads to this falls. Recommended to visit during summer.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Should go during monsoon",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's really a good place, which we need to walk from roadside before reaching athirapilly... Beautiful place where we can get in to the water n take bath",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Athirapally is a beautiful waterfall located in the Thrissur district of Kerala, India. It is one of the most popular tourist destinations in the region and attracts thousands of visitors every year.\nThe waterfall is situated on the Chalakudy River and drops from a height of approximately 80 feet. The surrounding area is lush green and filled with tropical vegetation, which adds to the beauty of the waterfall. There are several viewpoints located around the waterfall from where you can get a good view of the cascading water.\nTo reach Athirapally, you need to travel by road as there are no direct flights or trains available. The nearest airport is Kochi International Airport, which is about 55 kilometers away. From there, you can hire a taxi or take a bus to reach Athirapally.\nThere are several activities that you can do while visiting Athirapally. The most popular activity is taking a dip in the cool waters of the waterfall. There are also several trekking trails located around the waterfall, which are perfect for adventure enthusiasts. You can also take a boat ride on the Chalakudy River to get a closer look at the waterfall.\nThere are several accommodations available in Athirapally, ranging from budget-friendly guesthouses to luxury resorts. If you are looking for a peaceful and serene place to stay, then you can opt for a guesthouse located in the nearby villages. On the other hand, if you are looking for a luxurious experience, then there are several resorts located in the vicinity that offer world-class amenities.\nIn conclusion, Athirapally is a must-visit destination if you are in Kerala. It is a perfect blend of natural beauty and adventure, and you will definitely enjoy your time here. So, pack your bags and head to Athirapally for an unforgettable experience!",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kalady Plantation",
      "rating": 4.4,
      "address": "IB Rd, Ayyampuzha, Angamaly, Ayyampuzha, Kerala 683581, India",
      "reviews": [
        {
          "text": "Great experience..\nFebruary to May. During this period, trees often shed their leaves and are left bare which enhances visibility. However, this time of the year mostly remains dry and animals in search of water gather around whatever water sources that are left.so possibility of animal sighting is more. 😊",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A Must travelled route to athirappilly waterfalls😵🔥",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Most people are not aware of this route. The roads not good currently, but it still is a great drive. Quiet calm drive through the plantations.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Feel the nature💚",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "HP Prayer hall (masjid mosque)",
      "rating": 5,
      "address": "7FWC+85, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Those who are traveling to athirappilly and related areas its very helpful for prayer. There is no mosques near by that area",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Prayer hall petrol pump Hp",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Thanks\nFor the management and staff",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Prayer space facility available",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Thanks for the facility",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Athirapilly waterfalls road,",
      "rating": 4.5,
      "address": "7GR8+WF7, Athirappilly, Vettilappara, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Very beautiful  waterfalls and has good view point....",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "St Paul's Syro-Malabar Catholic Church Aroormuzhy",
      "rating": 4.7,
      "address": "7FWP+943, Aroormuzhy, Vettilappara, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "A beautiful Syro-Malabar Church on the way to Athirappilly waterfall which consists of 230 families in and around Aroormuzhy, Vettilappara and Vyssery. It’s situated near Silver Storm water theme park, Vettilappara.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "✨",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful atmosphere.\nGood accessibility.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good constructed church",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Syro-Malabar Catholic Church.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Scenic River Side",
      "rating": 4.3,
      "address": "Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Beautiful place. Can visit it during the evening to relax and enjoy the water flows.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place. But actually this is not a tourist place where you can freely enter. You will have to enter through plantation corporation area to reach here which is actually not allowed. Also doesn't have any security precautions. So, I advice you not to get into water.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This location is an ideal spot to gather with friends and family to enjoy the natural beauty of the surroundings. If you plan on swimming in the river, please take more care and if possible seek advice from locals about potential hazards. There may be hidden deep pits on the rocks that could pose a danger if not careful.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Literally loved it here , got time to spend time with my friends and have privacy water was fine",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This location can be found when you travel to Athirappilly from Chalakudy . Not much clean but you can visit it during the evening to relax and enjoy the water flows !",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Athirappilly Palm Garden",
      "rating": 4.6,
      "address": "7GRQ+5VX, SH21, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Spread across acres of verdant land, Athirappilly Palm Garden is a haven for nature lovers and outdoor enthusiasts alike. Meandering pathways lead through manicured lawns, vibrant flower beds, and shaded groves, inviting visitors to explore the beauty\n\nOne of the highlights of the garden is its picturesque water features, including serene ponds and meandering streams. The soothing sound of flowing water adds to the ambiance, creating a sense of serenity and relaxation.\n\nIn essence, Athirappilly Palm Garden is a hidden gem waiting to be discovered, offering a tranquil escape into the heart of Kerala's natural splendor. Whether seeking solitude, adventure, or simply a moment of serenity, visitors are sure to find what they're looking for.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice river side area to spend.  Will love it sure",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place for site seeing. It's adjacent to the chalakudy river. 200 meter away walkable from the main road.\n\nNice and calm place. It would be nice to stay there evening time for chit chat.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Perfect for families and friends to spend time in shallow falls. With a great background of forest and mountains. A tranquil area.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A good  and Calm place to visit for family,friends etc.\nPublic transport available",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ayyampuzha",
      "rating": 4.7,
      "address": "7FPQ+XX, Ayyampuzha, Kerala 683581, India",
      "reviews": [
        {
          "text": "Beautiful and scenic",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice..",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Pillappara Syro-Malabar Catholic Church",
      "rating": 4.6,
      "address": "7GRH+MWQ, Pillappara, Vettilappara, Pariyaram, Kerala 680724, India",
      "reviews": [
        {
          "text": "Good architectural work for St. Thomas Church",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pillappara is the one of the resting place on the way to Athirappilly and Vettillappara tourist centers. And this Syro-Malabar church helps the travellers who wanted to participate their daily Holly Mass.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sunday mass time 7.30 AM",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Syro-Malabar Catholic Church on the way to Athirappilly Waterfalls.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good but small church",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}