{
  "places_with_reviews": [
    {
      "name": "Sree Mangottukavu Temple, Athipotta",
      "rating": 4.7,
      "address": "Athipotta, Kerala 678544, India",
      "reviews": [
        {
          "text": "Amazing Temple with life like Beautiful Murti of Devi. Don't miss going to the Moolasthanam of Devi too. Well maintained and friendly staff too despite it being a crowded Friday. Jai Maa Bhagawati",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A divine place for a peaceful and positive vibe ....Early morning dharshan will make you energised ....Powerful temple...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Pleasant environment, ample of space for cark park, Temple morning open timing 5am -11am. free meals starts from 11.00am. From Pollachi it took around 1.5 hrs to reach and no toll roads.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is simply nice. Muttarukkal (മുട്ടറുക്കൽ) is famous in this Temple.\n\nThe temple will be little crowded on Tuesday, Friday and Sunday. Even Many Tamilnadu Devotees are visited during these days.\n\nThere is annadhaanam (food donation) for 1000 people on Tuesday, Friday & Sunday between 11.30am to 2.30 pm.\nCurrently Annadhaanam is provided Daily (EveryDay).\n\nThe Visiting Hours are as follows.\nMonday to Sunday (EveryDay)\nOpen from : 5am to 12pm &\n: 5pm to 8pm.\n\nVery large parking area is available here (Inside parking is free). Very helpful.\nChappal counter, Cloak room and Bathroom is available here.\nRooms for rent are available nearby the temple (Charges per day).\n\nThere is plenty of pooja's are done here. Great Bhagavathi Temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great ഭഗവതി temple in Palakkad dist.. Powerful devi..",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Parakkat Sree Bhagavathy Temple",
      "rating": 4.7,
      "address": "P.O, Pathanpuram, Kavassery, Alathur, Kavasseri-I, Kerala 678543, India",
      "reviews": [
        {
          "text": "The temple is famous for its spiritual atmosphere as well as the fireworks associated with the festival. The fireworks happens in near by paddy fields and is a kind of competition among three deshams called kavassery, kazhani , vavulliyapuram. The fireworks held in day time as well as in night.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great atmosphere and long and big temple devotional and peace atmosphere\nNear bus stop\nParking avilable for both 4 wheelers and 2 wheelers and 3 wheelers also\n—parakkat sree bhagavathy temple—\n\nThe almighty, Pallikkadi, parakkadi, kunnaikadi, and kodikkady named 4 goddesses together started from a place called Thiruvadi. The myth goes like, after a long journey, the goddess Pallikkadi has settled down in a place called, Paruvassery in Kannambra, the goddess\n\nThe pooram is very famous and the crackers and pooram festes are fabulous\n\nThe offerings which is been done in the nearby days of Pooram are :\n.\tKathirvela of Thulam month\n.\tMandalam kalamezhuthu pattu in Vrishchika month.\n.\tPonnin poovu in the month of Makaram,\n.\tKoothu in the month of Kumbham.\n.\tAaluvela in the month of Edavam.\n.\tThalappoli in the month of Midhunam and Eeswara seva\nin the month of Karkkidakam.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Parakkat Sree Bagavathi Temple, located in Palakkad, Kerala, is a revered site dedicated to the goddess Bagavathi. The temple is known for its regular **Nakshatra Pooja** and hosts the **Kodiyettu Festival** starting from January 26th¹. It also celebrates the **Aarattu Festival** on February 2nd¹. The temple is undergoing construction for a new structure called **seevelipura** within its premises¹. Additionally, the temple observes various other rituals and festivals throughout the year, such as **Kathirvela** in the month of Thulam, **Mandalam kalamezhuthu pattu** in Vrishchika month, **Thalappoli** in Midhunam, and **Eeswara seva** in Karkkidakam¹. This temple is a significant part of the cultural and spiritual fabric of the region, attracting devotees from all over to participate in its traditions and ceremonies.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice and huge temple of goddesses. Ample parking space, huge structure and positive vibes with peaceful ambiance makes one visit the shrine many times for sure",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful, traditional temple in Kavassery village, near Alathur. It is a divine feeling to experience the rituals in this temple, in front of the holy Bhagavathy Amman. The surrounding forests and pond are also a great place to reflect.\n\nTip: Don’t forget to bring a container! For a  small fee, you can experience the inner sanctum of the temple AND fill you container with delicious payasam!",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Thonikadavu Junction",
      "rating": 3.5,
      "address": "Thonikadavu Junction, Padur, MF65+M4V, Kavassery, Alathur, Kavasseri-II, Kerala 678543, India",
      "reviews": [
        {
          "text": "A nice place.\nCould have more traffic concern in these area.",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "One of the best tourist place in Kozhikode",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "This cannot be called a tourist attraction",
          "languageCode": "en",
          "rating": 3.5
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 3.5
        }
      ]
    },
    {
      "name": "Thennilapuram Krishna Temple",
      "rating": 4.9,
      "address": "JFPR+C83, Kavasseri-II, Kerala 678682, India",
      "reviews": [
        {
          "text": "Old Krishnan temple in small village thennilapuram.\nWorshiped many times...",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "My gramam",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Beautiful village temple",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Divine",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "kavasseri parakkatukavu Moolasthanam",
      "rating": 4.4,
      "address": "kootala, MG37+P7F, Pathanpuram, Kavassery, Kavasseri-I, Kerala 678543, India",
      "reviews": [
        {
          "text": "Parakkattu kavu bagavati temple is one of the famous temple n Kerala as the Kavassery pooram s also wel known.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The place where the deity was known to be. From here starts the pooram ezhunnallathu. A great place to be during the laksham deepam.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A divine place with great spiritual atmosphere.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Devi temple",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Kunnekkattu Bagavathi Temple",
      "rating": 4.6,
      "address": "JFPM+8W5, Erattakulam Vaniyampara Rd, Kavasseri-II, Kerala 678682, India",
      "reviews": [
        {
          "text": "Peaceful place with a lot of histories. Located in a beautiful village.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Work going on inside the temple. A bit difficult for old aged people. May improve after renovation",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice and calm place, around the temple there were rubber estate, but now it has been changed as lawn scape grass creation place.  Near by there is a mahavishnu temple is there.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice clam and quite place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sree Mangottukavu Bhagavati Temple Lake",
      "rating": 4.7,
      "address": "Sree Mangottukavu Bhagavati Temple Lake, Athipotta, near Athipotta, MF9M+WCH, Post, Palakkad, Athipotta, Kerala 678544, India",
      "reviews": [
        {
          "text": "Hindu temple. Lots of people visit daily from many states.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Lake was looking very neat and clean. Fully greeny lake. Lot of small fishes are there inside this lake. Definitely should get into this like steps where small fishes come and clean the dead cells in foot, it I’ll five feel like tickling. Near by local people wash their clothes here but still it is clean and looking so fresh.\n\nThis like is near by a coconut farm which make nice scenic view. Lake is little deep in middle. Don’t get into it if you don’t know swimming. Mostly people who come for temple will wash foot here. Neat and clean lake.\n\nOverall it’s a good lake which is neat and clean. It’s a fresh water lake.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is not a lake, only a temple pond. You can see bigger ponds than this one in many places of palakkad district. In olden days ancestors digged ponds not only for bathing but also for irrigation. All the ponds are working as a water storing tank and keeping sorrounding areas always wet.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Need a little more height to it's outter walls and do need a privacy wall in between mens and women's section.\n\nNo privacy here bit it's a beautiful open pond for make a bath",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I like this place very well,  so many POOJAS to the MANGOTTU DEVI, especially pooja @ karmas to mukkan Chathan, are the specialty of the temple, atmosphere will given you a great grace of LORD DEVIS anughras etc.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Puzhakkal Palli Juma Masjid",
      "rating": 4.3,
      "address": "MF8X+GR3, Kavasseri-II, Kerala 678543, India",
      "reviews": [
        {
          "text": "You may feel relaxed",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Shirk",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Awesome",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "God willing, congratulations on the shrine of Sultan Muhammad, may God sanctify his secret and many righteous people",
          "languageCode": "en-US",
          "rating": 4.3
        },
        {
          "text": "Vavulliyapuram",
          "languageCode": "en-US",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Thiruvadi Mariyaman Temple",
      "rating": 4.4,
      "address": "Thiruvadi, Pularinagar, Padur, Kerala 678687, India",
      "reviews": [
        {
          "text": "Small temple, beautiful people beautiful river.. a traditional palakkadan village",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Pollution less area , and one river passing through near of this temple.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Small temple but frequented by many locals ...",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "God is great",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "PADUR PANIKKANAR TEMPLE",
      "rating": 4.8,
      "address": "MF29+FWX, Padur, Kavasseri-II, Kerala 678543, India",
      "reviews": [
        {
          "text": "Good ambience",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}