{
  "places_with_reviews": [
    {
      "name": "Avanavanchery Sri Indilayappan Temple",
      "rating": 4.7,
      "address": "Temple Road, Avanavanchery, MRVM+8PQ, Attingal, Avanavanchery, Kerala 695103, India",
      "reviews": [
        {
          "text": "Calm Atmosphere. Divine Space.\nVisited the temple during the festival. The lighting and decorations are truly awesome. Food stalls and rides are open during the Ulsavam. I was stunned to see the water lighting in the Ambalakkulam & the Gopuram lighting. Speechless!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peaceful shiva temple 🥰 Cool and calm atmosphere!",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "An ancient temple, with Lord Shiva as the principal deity.Situated just with in the reach of attingal town area,on  the attingal- venjaaramoodu main road with a slight deviation of about 600 meters from the main road.\nSituated in a serene village ambience,this temple is a must visit destination.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is an ancient temple and lord shiva is worshipped there and also called as indalayappan its a great temple and best tempe to visit for a positive feel and energy\nThere yearly festivals are great and very intresting and superr they conduct pooram yearly with kodamattam and vedikettu(firecracker works) the way of conducting a pooram is very nice and classic i thing in trivandrum and kollam region it is the best quality stantard and classic pooram we can see ❤️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Calm environment. Divine space. Evening time is preferred",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Alamcode Masjid",
      "rating": 4.5,
      "address": "N.H. 47, Alamcode, Kerala 695102, India",
      "reviews": [
        {
          "text": "Alamcode Juma Masjid is architecturally very beautiful, and it is so well maintained. it is a treat for photographers during the season of eid al adha, eidul fitr and Milad ul Nabi Days, you will get your wide angle lens to work for sure, try to visit post rainy season, try to visit post afternoon to avoid direct sunlight.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Peaceful atmosphere. Good juma masjid",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Alamkod Town Masjid is a famous Jumu - a  Masjid located on National Highway - 66 between Kaduvayil Palli and Attingal. Spacious prayer facility on two floors. Vehicle parking can also be found on one side of the highway. There are many halal restaurants and hijab veil shops nearby.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "😻❤️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Taj Mahal of South kerala , easy to reach ,clean and calm atmosphere , every needed facilities are available.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Kattumurakkal Juma Masjid",
      "rating": 4.5,
      "address": "MR72+7GP, Koonthalloor, Kerala 695304, India",
      "reviews": [
        {
          "text": "One of the most famous masjid is kattumurakkal Juma masjid. The Malayalam artist Prem naseer tomb situated here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Alhamdulillah. Nice place. Its one of the biggest mosque in Kerala. Recently renovated auditorium for marriage functions. Ample car parking area.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of the biggest mosques in Chirayinkeezhu area. The tomb of Malayalam film legend Prem Nazir is here. Good atmosphere.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is the place where the great cinema artist znd Guinness record holder in acting more than 600 movies as a hero Padmabhoozhan Prem Nazeer is laid to rest.\nA man who lives in hearts of Malayalees",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I love my masjid because of all the things they have good ...good furnishing..well matted floors ..ac halls ...good and porperly hygienic wudhu areas...there is not even a single drawback one can fing about kattumurakkal Juma Masjid..guys go and have a very good and qiuet and an awsome pray ..what are you waiting for..poyi namaskarikku🙂",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "NES Block",
      "rating": 4,
      "address": "MR75+2V9, ചിറയി൯കീഴ് - കോരാണി റോഡ്‌, Mudapuram, Kerala 695304, India",
      "reviews": [
        {
          "text": "janasevana kendram service available in the first floor of the building nearest to mosque",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "NES block office junction. One super market, masjid, medical shop, restaurant,other shops near by. Grama panchayat, village office and veterinary hospital near by. Also a fish and meat market. One by road to Cheruvallimukku jn.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Good work",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Mosq hotels govt organisations are there",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Chirayinkeezhu block punchayat, all govt local bodies near by. Small shops, pharmacy, hotels are nearby.",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Kollampuzha Devi Moorthi Temple",
      "rating": 4.7,
      "address": "MRQ3+942, Koduman Kollampuzha Rd, Kollampuzha, Seemavilla, Attingal, Kerala 695101, India",
      "reviews": [
        {
          "text": "One of the oldest temples in Attingal. Walkable distance from the town, situated near attingal kottaram.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A temple with prominent historical significance in the Travancore kingdom located next to Koyyikal palace and is situated near the kollampuzha river. The Thiruvarratukkaavu devi is the family deity of the Travancore royal family.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the Most awesome Temple I've ever visited. This Temple lies adjacent to a huge paddy field on the west and kollampuzha river on the east with great Ambient and calm environment.. The deity here is Moorthy, who is the crude and powerful form of Shiva popularly known for removing the curses of worshippers. Presenting the Moorthy with red silk and Hen as a token to remove the bad omen and curses from their life. This is not a Devaswam run Temple, therefore it's not lost its own essence. This Moorthy temple opens only twice a week . Tuesdays and Fridays.\nAnother deity is Devi along with Maadan, Marutha, Yekshi , Naagar, Ganesha and other natural forces.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Ancient temple still with its purity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its a powerful diety. Opening on Tuesday(devi nada) and Friday(moorthi nada). Poojas can be made in the morning as well as evening.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Thiruvarattukavu Devi Temple",
      "rating": 4.7,
      "address": "MRQ3+P3V, Kollampuzha, Kizhakkupuram, Attingal, Kerala 695101, India",
      "reviews": [
        {
          "text": "Nice and calm location a temple with such a beautiful ambience not far away from the town One of the very oldest temple which still survive. Here we can feel our old traditional construction of temples...really a traditional atmosphere always..",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Attingal thiruarattukavu temple is a calm and beautiful place connected with the royal family\nThere are a few ancient buildings also situated around the temple annexe",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Thirivithamkoor built  temple with amble ambiance",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Peacefull place. Major Hindu temple. Connected with the Travancore royal family.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "THIS BHAGAVATHY TEMPLE IS THE PARADEVATHA OR FAMILY DEITY TEMPLE OF TRAVANCORE ROYAL FAMILY. ATTINGAL KOYIKKAL PALACE WHICH IS SHARING THE TEMPLE COMPOUND IS THE MATERNAL HOME OF THE FAMILY.THE TEMPLE IS IN KOLLAMPUZHA JUST 4 KMS FROM THE CITY OF ATTINGAL.THE VILLAGE GREENS AND VAMANAPURAM RIVER ADD VIBRANT COLOR TO THE BEAUTY OF TEMPLE. A BOAT CLUB AND CHILDREN'S PARK  NEAR THE RIVER ATTRACTS THE DEVOTEES.\n\nTRAVANCORE FAMILY STILL ARRIVES HERE IN THE TIME OF TEMPLE FESTIVAL WHERE \"ARIYITTU VAZHCHA\" OR SPRINKLING RICE OVER THE FAMILY FROM DEITY'S FEET TAKES PLACE, STARTED AROUND 16 TH  CENTURY. EVEN THOUGH BEING A HISTORICAL PLACE LESS PEOPLE VISIT HERE ........... THE PALACE RELATED TO TEMPLE IS IN VERY BAD CRUMBLING CONDITION WHERE ARCHAEOLOGY DEPARTMENT IGNORES THIS TREASURE HOUSE BOTH IN CULTURAL AND TOURISM LEVEL.\nA BIG CHEENA BHARANI  OR CHINESE POT CAN BE SEEN ABANDONED ON A SIDE ROOM.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Guru Nagappan Kavu",
      "rating": 4.5,
      "address": "PR94+CQR, Alamcode Kadakkavoor Anchuthengu Road, Alamcode, Kerala 695102, India",
      "reviews": [
        {
          "text": "Very well maintained and mannered shanthi and Temple people.Happy to visit often",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Good feel for better experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice temple and atmosphere",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Near alamcode- kadakkavur road",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Daily worship place",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Aayiravally View Point",
      "rating": 4.7,
      "address": "PRHR+PQ2, Chirayinkeezhu, Kerala 695102, India",
      "reviews": [
        {
          "text": "Calm & Uncrowded place to sit with family / friends.\nBest time will be Sunrise. Sunset is also beautiful. ** It will be very hot at noon.**\n\n# Around 500m from Main Road, approach road is hilly. Small off-road experience is there. Ample parking is there @ the end, so don't worry to take your wheels to there. Drive carefully to avoid scratches in your wheels.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a beautiful place near rajadhani institute of technology ,those who are coming for exams and all there companions can visit and pass the time ..near view point  temple is there on top we will get a beautiful panoramic view  with a awesome sunset",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice place to watch sunset",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice view of sun rise from their . Can see a pan of the village song from the temple near by is a bit disturbing some times",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place has road access. Evening or moring time is the best. enjoy with family or friends. Dont forget to vist the Ayiravilly temple. Morning and evening there will be pooja.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Kayal View Point കായൽ വ്യൂ പോയിൻ്റ്",
      "rating": 4.3,
      "address": "MQXG+9HP, Vakkom, Kerala 695306, India",
      "reviews": [
        {
          "text": "Only a small portion of lake is visible from this location. Majority of places exhibited in the reviews might be from some other side of the lake. Safe for family though not a place under security surveillance.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It’s a nice place to enjoy  the beauty of lake and enjoy some fresh air . Can park ur vehicle and enjoy the view .  I wish they had a tea stall near by . A tea and snack would have elevated the experience\n\nIt’s a small public place . Can enjoy a evening break for 30 min max here . If u are near by then worth  taking  a small stop here.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A beautiful place to hang around with family and friends. Very peaceful and scenic. Do make sure to carry food, specially when with children as there are no good shops in the near vicinity.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Not a tourist spot. If you are nearby, it is  suitable enjoy the silent evening in peace. The road is not good.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A calm place\nThe sunset views are good.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Attingal Juma Masjid",
      "rating": 4.5,
      "address": "MRVC+C5G, Salem - Kochi Hwy, Attingal, Kerala 695101, India",
      "reviews": [
        {
          "text": "Clean and quiet. Very near to Attingal KSRTC and 5 mins walk from private bus station. Inside parking is not that enough in special events have to park at road side.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its our family mosque, they well helped for my father's funeral activities, they provide every material to fulfill the burial process. Also for marriage purpose they attend correctly manner. Good development  happens recently , they install rainfall sheds. Well maintaining.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Easy accessibility from the town. Have good parking space at the backyard of the mosque. Just 70 meters away from KSRTC Bus Station, Attingal. I usually attend the Friday congregation prayer here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "My Family mosque. Nice,  locating near ksrtc, NH 47 and also seperate place for praying ladies and vehicle parking",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Located near KSRTC Bus station and National High.\nSo helpful for travelers who wish to pray.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}