{
  "places_with_reviews": [
    {
      "name": "Mundra Circle",
      "rating": 4.2,
      "address": "338J+7MJ, Ward 2A, Adipur, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Very Useful but too much dirtyness ane mash here.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Local vehical not available for mundra you waiting for 2 hours so keep Gujarat government bus service if you want reach at time.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Very good place but night time not good lighting",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "4 cross. Small street business shop avaible under lower rate",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Not Clean. But good foot flow and the circle adjoining the Mundra , Adipur and Gandhidham.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Patadiya Hanuman Temple",
      "rating": 4.7,
      "address": "23XP+Q6C, Unnamed Rd, Ravechi Nagar, Antarjaal, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Shri Patadiya Hanuman ji Temple in Gandhidham is truly divine, offering a serene sanctuary for spiritual seekers. The temple's tranquil ambiance, coupled with its architectural beauty, creates a sacred space for devotees to connect with their faith. The spiritual energy and devotion felt here make it a must-visit, leaving a lasting impression of peace and reverence.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very spacious mandir dedicated yo Shree Hanuman ji. Very much live and wishes get done by grace of Hanuman ji maharaj",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful grand pilgrimage place to visit Hindu god Hanumanji Pataliya Mandir on Saturday Evening 7:00pm Mahaprasad for all devotees. Clean surrounding area, Children park, parking area, out side Shop's for Puja samagri.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It is well maintained and has a park for kids at the side. There is a 32 ft tall idol of lord Hanuman ji. The architecture of the mandir is very attractive.\nThe place remains crowded on Tuesday and Saturday.\nThere is good space available for parking.\nThe legend behind the name is that the original idol inside the garbh grah is self created from Pataal lok, hence it is named Pataliya.\n\nJay Bajarang Bali 🙏🙏🚩",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The temple is situated 20 mins away from gandhidham city. It is well maintained and has a park for kids at the side. There is a 32 ft tall idol of lord Hanuman ji. The architecture of the mandir is very attractive.\nThe place remains crowded on Tuesday and Saturday.\nThere is good space available for parking.\nThe legend behind the name is that the original idol inside the garbh grah is self created from Pataal lok, hence it is named Pataliya.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Gandhi Samadhi",
      "rating": 4.3,
      "address": "339J+JP8, Kesar Nagar-2, Ward 2A, Adipur, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Visited Gandhi samadhi with my family . It is very well maintained . The water feature was nit Functional though . The lawn was well cut . They won't allow you with footwear in the samadhi area . The opening timings are odd . But preferable to visit in the evening after 5 pm . In and around Kandla, gandhidham these are the few things you can see... Gandhi Samadhi is such a peaceful place. where samadhi of Gandhiji is here. not much people came here . but it is all about history...\nWe had 60+ campers from Kutch camp... The time here is in the afternoon.... But he came for a visit in the afternoon in a special case..",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Peaceful place, just to sit around with your thoughts in the middle of the buzz of this city!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's okay. Entry fees ₹10 per head",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is a beautiful and peaceful place located in the district of kutch. Where Mahatma Gandhi is resting in peace  there is a beautiful garden created around the samadhi.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It's a very well maintained property. It's open in the mornings and evenings every day. People often come for walking & to enjoy the peace and quiet.\nThere's the Nirmiteshwar Mahadev (Shiva) Temple next door.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Santoshi Mata Temple .",
      "rating": 4.6,
      "address": "33FP+F3H, Ward 2B, Adipur, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "A very beautiful temple with South Indian temple style architecture. Highly recommended to visit with loved ones.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "dravidian style Temple architecture. beautiful Temple  Jay Mataji 🙏🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pure divine vibe, South Indian architecture at Gujarat - by Madurai, Tamilnadu I am happy I got blessing from Goddess santosi mata.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temples design is South Indian style. Amazing place 😍\nHere Hanumanji temple, radhe krishna temple, shivji temple, ganeshji temple , shita ram temple little very beautiful temples.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Only santhoshi maa temple in this place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shinay Dam",
      "rating": 4.5,
      "address": "23R7+454, Shinay, Gujarat 370205, India",
      "reviews": [
        {
          "text": "While the dam remains accessible throughout the year, it truly comes alive during the monsoon season. The influx of rainwater fills the reservoir to its capacity, creating a mesmerizing spectacle. Lush greenery surrounds the dam, and the air becomes fresh and invigorating. This transformation draws crowds from the surrounding areas, seeking a respite from the scorching summer heat and relishing the scenic beauty.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shinay Dam overflow beautiful view",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must Visit this Gem for experiencing mini Waterfall with friends😃",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Great view in Rainy season. You can take bath here and swim also. Good picnic spot.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It's good but public is too much and very slippy surface due to mud and keep safety of children and ur family the way to in it is not much safe",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Panchmukhi Hanuman Mandir",
      "rating": 4.8,
      "address": "plot no.35 ,ward, 3/A, Ward 3A, Adipur, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Place is very calm and sooth vibe. They have put good efforts to build this temple and they also have a Cowshed inside temple area so you can bring healthy food for them if you wanna donate.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "You will fill divine energy here.\nMust visit.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very nice place to visit and spend time specially at evening.\nExpect rush on Saturday.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very peaceful place. One can feel divine power there.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Very peaceful temple\nEveryone should be visit here",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Ambe Dham Temple",
      "rating": 4.6,
      "address": "C-47, Sapna Nagar, Gandhidham, Gujarat 370203, India",
      "reviews": [
        {
          "text": "Fairly good Hindu religious place for a detour on Naliya -Mandvi highway.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awsm temple , Really amazing peaceful place for weekend & For free time",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Awesome place at just 15km from Mandvi the beach city. People get confused about its location but its in Godhra of Kutch. Place has amazing garden, parking facility, food, temple of Bharat Mata, multi god temple, life cycle presentation and artificial cave carved from small kind of mountain..",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very peaceful place🙏🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A peaceful place to visit.\nEvery they organise Navratri Event in this ground.\nManagement is very good.\nIn navratri there too many local public come here to enjoy the dance festival called Navratri.\nTemple looks normal.\nNo facility of any restroom.\nUsed to be quite here most of he time.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ashapura Temple",
      "rating": 4.4,
      "address": "181B, Adinath Rd, Bharat Nagar, Ward 11, Maheshwari Nagar, Gandhidham, Gujarat 370201, India",
      "reviews": [
        {
          "text": "Less options and average quality for daily or routine clothing.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Awesome 😎",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Jai Ashapura Maa very nice place, mind relax here.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Santoshi Circle",
      "rating": 4.4,
      "address": "392, Maitri Road, Ward 3A, Adipur, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "It's a temple of Mata Santoshi built on South Indian theme and it has some other Gods too although it is a nice place to visit but make sure that you can not worship like gifting something or pouring water on shivji because it is strictly out of the rules.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's one of the more popular places of Adipur. The temple architecture is somewhat resembling south Indian temple architecture. Inside there are is a statue of Santoshi Maa. Bhajans and Aarti are regularly held.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Santoshi Circle is Four Road Cross and Very Popular place.\nName of this place is Due to Santoshi mata Mandir near Circle cross.\nMandir of Santoshi Mata is Very Beautiful and Piece of Art U can Find Peace at This Place,\nThere are Different different Mandirs around mata Main madir Campus,\nThere is Ram Darbar,\nGapti Bapa Mandir,\nKartik Swami Mandir,\nHanuman Bapa Mandir,\nRadhekrishna Mandir,\nShankar Bhagwan Mandir also Located in This Mandir,\nThere is Another Mandir near Santoshi mata Mandir,\nThere is Langar Called prashad once in Week for Everyone,\nAlso Behind of Mandir there is Big Ground which is given in Rent for fairs and Program's mela Also Come Here,\nThere is Play ground behind of Ground for Childrens small And Elegant for Playing,\nAround Santoshi circle lot's of stree food vendors are there selling Panipuri,pizza, Chinese,Pav bhaji,South Indian food, Gujarati foods and Much more,\nThere is Cold drink seller too also Milk Based sweets are there for drink so also Around and Near by area of Circle there is Gujarati thali and Small Restaurants and Lodges for Regular Food,\nSo Must visit Santoshi circle and Have Good taste .........",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A perfect place where spiritual and food lovers meet and explore the place with ease.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place u may visit santoshi mata mandir, there is a lot of stoles for fast food like pani puri, bda pao, dabeli, pao bhaji, fried rice, etc... near by agra nashta house where u may get chole bhature, Pizza, sandwich etc.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Gaibanshah pir Dargah",
      "rating": 3.7,
      "address": "23Q6+C8W, Mundra - Gandhidham Rd, Gandhidham, Gujarat 370205, India",
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3.7
        },
        {
          "text": "Alhamdulillah",
          "languageCode": "en-US",
          "rating": 3.7
        }
      ]
    }
  ]
}