{
  "places_with_reviews": [
    {
      "name": "Auli Hill Station",
      "rating": 4.7,
      "address": "GHH7+CF3, Auli Laga Salude, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Auli is a place for tourist attraction. The view of the place surrounded by mountains with snow are spectacular. Rope way service by government is very convenient, plus people love hiking can also do hiking here. Snow season of auli is one of the best thing you will ever experience. You can do many adventures here like sking and many more. The only con of the place is that it is quiet expensive here, food items are expensive in comparison to the market area that's it. But you should definitely visit the place with your family and friends. Auli is best for picnic and holidays.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Its a magical place .We went in March end. It was little snow, misty slightly cold but breath taking. There's a trekking route to go up the mountains. Pahadon ki Maggie hits different ♥️\nIt was a beautiful experience.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's the Switzerland of Uttarakhand & dream place for many travellers. Snow activity and ropeway is most popular here. Auli travel is life time experience for yourself ☃️⛄🏔️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Auli is one of the place where you should visit once in a lifetime . But during winters .\nI visited auli during December time and my experience was too great. What a adventure trip was. I went there by own car till skiing Resort Auli. Enjoyed the view of snow covered peak with artificial lake. We spent lots of time playing in snow, Had experience fresh snow in morning a superb place for nature lover must visit place.❄️☃️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The beauty and the charm this place holds is something not to miss.\nAtmosphere, Altitude, Views: sunrise, sunset, open sky or the shining star-ry sky makes it nothing less than heaven.\nMust visit once and the ice sport provider shop near the pond is best for all your needs🔱☄️",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Joshimath",
      "rating": 4.7,
      "address": "HH58+F9R, Joshimath, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Awesome  please like heaven. I always feel everyday \"I am in Devbhoomi\".",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Gateway of Badrinath, Valley of Flowers, Hemkund_Sahib, and many treaking destination...lots of memories from here not because it's a tourist destination it's because of MY HOMETOWN.. Since childhood I wandering in the street of jyotrimath.❣️ Tourist who will come to this beautiful place please maintain the hygiene here bcz your a small step can make a big change..❄️❣️",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the Narshima Temple. The place is beautiful and must visit. The temple also has a view of elephant mountain. We were blessed to get morning arti and lord's blessings...",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful place which is on the way to badrinath, hemkund sahib and valley of flowers........there is a kalpvruksh which is 2000 years old where adi shankarachary practice tsposadhna!. Place is surrounded by the hills and mountains.....one can experience snow mountains if the atmosphere is clear.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Road leading to Badrinath is good till Joshimath. After this around 80% of the patch is under construction and by 2025 you’ll find a smooth road between Joshimath and Badrinath too.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "auli",
      "rating": 4.7,
      "address": "Joshimath, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Desi Roshan place you should go in winter and winters every very peaceful quiet and so much of snow activities you can do and you can always go with friends family and as many as people you can go make sure you have all your coach with you as is too cold or their make sure you have all your warm clothes with you",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful place just like heaven. Cold winds are blowing constantly. Skiing resorts are there.But I will recommend to stay in Joshimath  because in the night there is no rope way service and there is no doctors so if your health will be unwell You cant do nothing.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Oh, what a weekend trip… was a bit tiring from delhi… but the views notched it off… must visit Narsingh Narain Mandir…",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sometimes the most productive thing you can do is relax and enjoy the serene beauty of mother nature. Joshimath has them all.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Really a Switzerland of India. U can't imagine a white cover of all over the hills . We enjoyed with snow and snow fall.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Shri Narsingh Temple, Joshimath",
      "rating": 4.8,
      "address": "HH48+HFQ, Narsingh Mandir Marg, Joshimath, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Near this temple dharamshala named with yatri niwas.\nI have given photo of this dharamshala.\nCost for 4 people was 600 only.\nBest place to stay in joshimath.\nRoom was very clean, beautiful,bed is very well.\nIt just beside this temple.\nYou have to go down from traveller car parking.\n5 min drive by car.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the most calming and peaceful temples I have been to. With the Haathi Parvat at the backdrop and some snow clad Himalayan Peaks! The story behind the temple is a must hear!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Narshima temple establishment done by shankaracharya some thousand years ago\nTemple was newly built in 2018\nWhere badrinath temple when closed people come here for darshan till May when the temple is re-open\nIt had a peaceful look and feel\nAlso do see the shankaracharya gaadi nearby building where the lathi is kept when badrinath is closed",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This temple is at Joshimath/ Jyotirmath in the midst of the sky touching mountains and valleys, also known as Winter Badrinath\nIt is to be said that Rishi Shankracharya Ji laid the foundation of this in the 8th Century.\n\nAbsolutely worthy religious place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A temple dedicated to Bhagwan Narsingh is situated in Joshimath of Uttarakhand. Must visit if you ever go to Auli or nearby places",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Auli Skiing School",
      "rating": 4.5,
      "address": "Auli Rd, Auli Laga Salude, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "In case Snowing, or Snow fall has occurred before you visit this place, in that case the experience is like visiting Heaven. This is one of the best tourist destination within India, which is having best views, best environment, best Skiing Facilities Created in India, and a Skiing Training Program within India.\n\nGMVN (Gadwal Mandal Vikas Nigam) is having it's Facilities / Resort to stay and the team is doing it's best to provide best possible service within their reach.\n\nFor us it was a three night experience delight and one of the finest experience of my life. I have seen half of the Uttarakhand and this was my seventh long trip to Uttarakhand, and every expedition was wonderful, but the Trip to Auli was the best.\n\nI strongly recommend this place, and best month/ time to visit is December, January, February.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful place to visit in Jan-Feb Or in March.\nCheck if there is snow or not. Must try Cahircar to head towards top of the hills. Take a guide (1000 ₹). You can view all the mountains around from the top. Can have maggie & momos & tea on the top of the hills.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I have not been for the Training. But this is one of the most popular Skiing Training Center, Fully Equipped, and conducting International Skiing Competition at Auli.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "They cater for all levels, skiing and snowboarding.\nNot all difficult runs. Great family holiday.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Like it great view. Clean air . Your life will be increased by 10 years. You would become disease free. You 💓 will become strong.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Vishnuprayag, Uttarakhand, India",
      "rating": 4.7,
      "address": "HH7G+3G4, NH 58, VishnuPrayag, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Beautiful temple of Bhagwan Visnhu-Narayan on the sangam of two rivers.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This spiritual place is located on the way to Badrinath from joshimath before givind ghat.\nIt is the first of 5 alaknanda prayags between alakananda from satopanth glacier which flows through Badrinath and dhauliganga from niti pass near Tibet border.\nWhile going to Badrinath you can see the sangam on the right after crossing bridge over alaknanda river.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Sangam place where River Alakananda and River Dhauli Ganga join. Beautiful place to visit when you travel from Rishikesh to Badrinath",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "What a mesmerizing view of sangam. Both the river having different colours of water. You can amazing.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Vishnuprayag is one of the Panch Prayag (five confluences) of Alaknanda River, and lies at the confluence of Alaknanda River and Dhauliganga River. Nice location. Sivji & visnu temple is also near the sangam. Nearly road side parking is available you can park your vehicle easily.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Artificial Lake Auli",
      "rating": 4.7,
      "address": "GHH7+F9, Auli Laga Salude, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Auli truly embodies the essence of paradise with its breathtaking views of the majestic Himalayas and snow-covered peaks. At the heart of this heavenly destination lies an artificial lake, which, although currently dried out, still captivates visitors with its serene surroundings. While snowfall may limit activities near the lake, there are a few shops offering food for sustenance also mule ride towards the top.\n\nFor those planning to explore the area, the rope way operates from 9 am to 5 pm, with a lunch break from 1 pm to 2 pm. It's advisable to carry heavy winter clothing, especially if traveling in winter, to stay warm in the chilly weather.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Auli is a heaven on earth, spectacular views of mighty Himalayas, snow covered peaks and this artificial lake stands right at the center of this heaven.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Currently lake is dried out and due to snowfall not much activity near to lake. There few shops who serve food. Rope way is opened 9 am to 5 pm lunch timing 1 pm to 2 pm. If traveling with toddlers carry heavy winter ❄️ clothing.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "3 months when it has snowfall, one should plan and visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visited on 14 march. Very beautiful views of mountains range",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Vridh Badri Temple",
      "rating": 4.4,
      "address": "GGJC+WJF, Auli Rd, Joshimath Army Area, Joshimath, Paini, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Old temple in line with Panch Badri, Lots of walking to do from the Road to get to the temple. The decoration of the lord is beautiful. Not to be missed in this area. Better to access this temple from the bottom route and not from the top side which takes long walking trek.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Vridh Badri is a revered pilgrimage site located in the scenic state of Uttarakhand, India. Situated at an altitude of 1,380 meters in the Animath village and around 7 kms from Joshimath.\n\nThe temple is part of the Panch Badri pilgrimage circuit, which comprises five sacred shrines dedicated to Lord Vishnu. Vridh Badri is considered the \"old\" or \"ancient\" form of Badrinath, the main and most popular Badri temple. It is believed that when Badrinath becomes inaccessible during the winter season, Lord Badri (Vishnu) is worshipped at Vridh Badri.\n\nIt is  believed that before Badrinath was designated as one of the Chardhams, Vridha Badri was the place where the idol created by Vishkarma was enshrined and worshipped. This is also the only temple amongst the Panch Badri that remains open all through the year for performing pilgrimage.\n\nAs per legend Lord Vishnu appeared in the form of a Vriddha or old man before sage Narada who performed penance here. Thus, the idol installed at this temple is in the form of an oldman.\n\nAccording to legend, the image of Badrinath was carved by the divine craftsman Vishwakarma and worshipped here. At the advent of Kali yuga, Vishnu chose to remove himself from this place, later Adi Shankara found the partly damaged image in Narad-kund pond and established it at the central Badrinath shrine\n\nThe main idol at Vridh Badri is made of stone and is seated in a meditative posture. It is believed to be more than a thousand years old and is worshipped with utmost devotion by pilgrims who visit this holy place. Vridh Badri not only attracts religious pilgrims but also nature enthusiasts and adventure seekers.\n\nIn addition to its religious significance, Vridh Badri offers a glimpse into the cultural heritage of the region. The local inhabitants of the Animath village, known as Animathis, have preserved their traditional customs and way of life, providing visitors with a chance to experience their warm hospitality and learn about their rich cultural traditions.\n\nThe best time to visit Vridh Badri is during the summer and autumn months, from May to October, when the weather is pleasant and favorable for pilgrimage and trekking activities. It is advisable to avoid the winter season due to heavy snowfall and the resulting inaccessibility of the temple.\n\nThe temple is open throughout the year. Brahmins from South India serve as chief priests in the temple\n\nFamous Tourist Attractions near Vridh Badri Temple : 1)\nAuli Hill Station - a popular hill station known for its breathtaking panoramic views of the Himalayan peaks. It offers opportunities for skiing, cable car rides, and stunning trekking trails.2)\nJoshimath - is a quaint town and a gateway to several pilgrimage sites in Uttarakhand. It is home to ancient temples, including the Narsingh Temple and the Shankaracharya Math. 3) Valley of Flowers National Park - a UNESCO World Heritage Site famous for its vibrant alpine flowers. It offers a picturesque setting for nature lovers and hikers. 4) Badrinath Temple - one of the holiest pilgrimage sites in India. Devotees visit this revered temple dedicated to Lord Vishnu and immerse themselves in its spiritual aura.5) Hemkund Sahib - a Sikh pilgrimage site situated at an altitude of 4,633 meters. It is surrounded by magnificent snow-capped peaks and features a gurudwara next to a pristine glacial lake.6) Yogdhyan Badri Temple - one of the sacred Panch Badri temples located in the picturesque state of Uttarakhand,  . Situated amidst the serene beauty of the Garhwal Himalayas, Yogdhyan Badri holds immense religious significance and attracts devotees from all over the world.7) Vishnu Prayag - a sacred confluence in Uttarakhand, where the Alaknanda River merges with the Dhauliganga River. It holds immense religious significance and is considered one of the Panch Prayag (five confluences). Located near Joshimath, Vishnu Prayag offers a serene and picturesque setting for devotees and nature lovers alike.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "#Spritual sprites #Land of God proofed there discribed No words of alfabaticlly, Sign of future lord Vishnu 🙏🥰❣️ #Meadiation #PHiysically or mentally fitness centre of lord Vishnu (Virdhbadri)🙏🥰❣️🌍👑 #Bhramine Animath gram, peoples saying any word's which decteted DEVi saraswati rewards 🙏🥰🌍 ✍️ 👑 OWN kingdom of Animath gram 👑🥰🌍❣️🙏 I pray a god all of the Nation is being protected,safe, healthy or lots of happiness comes across the country 🙏❣️🥰👑🌍 #JaiBadrivishal #jaiMataDi👏🥰❣️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Vridh Badri mandir is one of 5 Badri temples located in uttarakhand. This temple is located little bit inside from badrinadh to Rishikesh road after karnprayag. You have to walk upto 400 meters by steps to visit this temple. Very beautiful and pleasant location.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very serene and peaceful place. About 200m from road head, in a small hamlet having few houses and vegetable garden along the narrow stone pathway.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Gorson Bugyal",
      "rating": 4.8,
      "address": "GH67+J67, Auli Laga Salude, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "Mild to moderate difficult  trek but snow made it challenging to climb but the view from the top is Beautiful 😀\nMarch is a great season as snow starts melting and the path is open for trekking!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Gorson Bugyal in Auli offers a spellbinding experience with its distinctive sunrise and sunset over snow-capped mountains. The trek unveils a picturesque track, transitioning from lush greenery to panoramic views. The sunrise paints the peaks in hues of pink and gold, while the sunset bids farewell with a warm, mesmerizing glow. Gorson Bugyal is a symphony of nature, blending serene meadows with majestic snow-capped peaks, creating an unforgettable retreat into untouched beauty.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "(We went on Christmas, so snow was till ankle)\n\nBest time to visit, after Christmas to Feb, ( Snow can get as much as till knees) traffic was high so reach as early as possible to avoid queues and rush while returning.\n\nThings to brings, snacks/shops are available still you can bring your own\n\nTrekking, 2 hour long moderate difficulty trekking, bring your own trekking gear, however for snow activities, you will be provided required equipments.\n\nIf you do not want to trek to reach at top, use rope way, (up/down included) rate ~500/person, (rope way timings are strict and need to follow, you would get ~4 hours up there before you need to return) then ride mule (up/down included, 30 min each way) to reach top, rates depends on traffic.\n\nAs sun ☀️ goes down and windy weather, cold will increase exponentially, bring warm clothes and do preparations accordingly.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A good place to see sunrise and a great experience for trek lovers like me",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Spellbound by this place. The views here are unbelievable. It's an underrated destination as of now. Visit here before it gets crowded with tourist traffic. Must visit if you are travelling in Uttrakhand. You get the Swiss Alps experience right here in India.  You can either trek or take a horse ride. It's a pretty long trek to the best spot.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Jyotirmath Temple, Joshimath",
      "rating": 4.8,
      "address": "HH48+H9G, Joshimath, Uttarakhand 246443, India",
      "reviews": [
        {
          "text": "The Amnaya of Shankaracharya in the North.Raja Rajeswari is the main Deity. Very beautiful Mutt with the only kalpaka vruksham in the Bhu loka. The spatika linga was given by Adishankara and thotakacharya kuufa is very special. Not to be missed in Dev bhumi.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Narasimha Swamy temple is located here. Badrinath Uthsavamurthi resides here when Badrinath is closed for 6 months. This temple is one of 108 Divyadesams. It was nicely developed today. Adi Shankaracharya did Thapas under a Mulberry tree which has become very very large. Totakacharya, one of four main disciples of Sankar acharya established here, one Matha. One can observe many such places here. We saw here, Sankarachaarya's gadde (peetham) in Narasimha Swami temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It's a very peaceful and ancient temple at Joshimath.  If, you are planning/going not to badrinath directly, My suggestion, please must visit here.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Its a must visit for all Hindu's. This is the 1 of 4 math's established by Adi Shankaracharya. We were lucky to have a guruji there whoexplained lot of things and allowed us to click pics. It's next to Kalpravrikrsha and Narsingh temple is also not very far. Don't go walking as it is on a hillock... cars go close to this temple.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Beautiful temple and a beautiful road leading upto the temple. We spent a good amount of time here. It's so calm, so serene, you can actually spend a whole day here.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    }
  ]
}