{
  "places_with_reviews": [
    {
      "name": "BIBI KA MAQBARA sambhaji nagar",
      "rating": 4.2,
      "address": "Begumpura, Aurangabad, Maharashtra 431004, India",
      "reviews": [
        {
          "text": "Crowded as expected. A beautiful monument.\n\nNo access for wheelchair users\n\nNo free entry.\n\nWell maintained by the local authorities.l from outside.\n\nYou will find fruits and water near to this place.\n\nYou can skip this place and can visit Ellora Caves which is cent percent better than this.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "What a beautiful monument and it's well maintained too. Yes there are signs of deterioration which can be fixed but the area is good and accessible.\n\nBest time to visit would be before sunset, so you get to see this with and without lights.\nBoth the versions are completely different.\nStay there untill it gets dark, and the crowd is very less by 7:30 , so you can get good pictures too.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It was better than what my expectation was. Nicely built, however much can be done to enhance the beauty of this place. Some parts of this monument were under repairs.\n\nOne can spend good time here at the somewhat look alike of Taj Mahal.\n\nThere are no eateries within the premises, so please carry your own but Don't litter the place.\n\nPlace is great for photography. Very quiet surrounding.\n\nGardens can be better and so is the pool in the middle which was dry when I visited.\n\nAmple parking available so no worries there.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good historic place but due to our government negligence this place will be worse in the next 10-15 years. But after comparing our fort condition this place maintenance is a little bit good. Good location. The surroundings are good. Beautiful nature senary. Pay and park available. Security system at gate is good.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "I would recommend visiting this monument during the Sunset time so you could get both day view and the night view with lights. This place has proper pay and park facility. Would recommend you to book your entry tickets online through Archeological survey of india website/app to save time and money.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Aurangabad Railway Station",
      "rating": 4.1,
      "address": "V856+RFC, Railway Station Rd, Padampani Colony, Aurangabad, Maharashtra 431005, India",
      "reviews": [
        {
          "text": "its an average railway station with some basic amenities like not so good waiting halls, a below average food stalls. The bus station is around 5kms from this railway station. You can find autos outside which charge 20/- 0r 30/- to Bus station. And also a smart bus station with buses for different areas. But you need to wait for sometime for buses. The bus stop is also below average.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "1. The station is good looking and huge from outside but doesn't have much facilities from inside. There is no proper waiting room, and the one available is very small.\n2. Benches are very dirty with gutka spitting. Washrooms are not at all clean and they take 5rs for that. In the Ladies waiting hall gents were sleeping.\n3. On platform 3, it's very dangerous. The people there will tell you not to roam with ladies as theft and crime is the scene over here. Wdf...!!!\n4. Only thing lifts are there to travel to the alternate platforms.\nDISAPPOINTED....!!!",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Retiring rooms are worst to the core. It’s almost like an haunted house. Too dirty. Full of ants and mosquitoes. Fan doesn’t work and AC makes too much noise. Stinky Washrooms. Blankets are also not good. Not even a single positive or average thing to say. Does all the railway retiring room are like this??",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This station is well crowded always. It is not maintained cleanly, especially the waiting halls. No one is bothered. All people wait in higher class waiting hall. No one is monitoring the place. Food available appears to be unhygiene. Its being upgraded . hope it will be better maintained at least then",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "The railway station displays the district's name but isn't big enough to represent it, however the place is not crowded maybe because it is situated outside the main city area. Waiting halls are just fine, they are not well maintained. Auto rickshaws and taxis are always available there. There are decent restaurants nearby, check my other reviews to know more about them.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Mahadev Mandir Chhatrapati Sambhajinagar",
      "rating": 4.5,
      "address": "New, W966+4GW, Ghrushneshwar Colony, Mhasoba Nagar, Harsul, Aurangabad, Maharashtra 431003, India",
      "reviews": [
        {
          "text": "One of twelve Jyotirlinga in India..\nVery precious and Holy place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple and it's area is very peaceful but security and safety is very bad need more security inside the temple..",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very soothing atmosphere and clear darshan feeling blessed",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "my visit to the Grishneshwar Temple Jyotirlinga was a soul-enriching experience. It's a place where spirituality, history, and natural beauty converge. Whether you're a devout pilgrim or a curious traveler, this temple deserves a spot on your itinerary when visiting Aurangabad.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Temple is good . The entrance is little small . The line system is good. The temple hai many artistic historical drawings and artifacts. Although mobile phones are not allowed inside the temple but I have clicked the outside photo of the temple. The only inconvenient thing here is Gents have to remove there upper clothes and then go inside the temple where the idol is situated but,it can be a cultural and spiritual practice but is little inconvenient thing. Overall the temple is good",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Shri Gajanan Maharaj Mandir, Chhatrapati Sambhajinagar",
      "rating": 4.7,
      "address": "near, Hedgewar Hospital Rd, Sandesh Nagar, Sara Raaj Nagar, Garkheda, Aurangabad, Maharashtra 431001, India",
      "reviews": [
        {
          "text": "This gajanan maharaj  temple  is so big and so beautiful. .. U wild calm and peaceful environment  here...\nThe vibes of this temple is just wow..\nI love to visit thia temple whenever I ho through bye...\nHosts do many functions anc al wa aya makes people happy",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the best temple in the sambhaji nagar it is really peaceful, felt like my soul is blessed to be here Jai Gajanan Maharaj ki 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful, clean, peaceful temple with large entrance gates. entire temple is clean with bright light facility. Samadhi mandir of Shri Gajanan Maharaj is very attractive. Separate paduka darshan mandir, donation facility available. Peaceful and mind relaxing chants, mantras of Shri Gajanan maharaj makes everyone happy. Must visit temple. Best arrangement by the staff for cleaning, darshan and entire administration.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very beautiful and peaceful temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This well-designed Hindu temple situated in the bustling heart of Sambhajinagar. The architectural brilliance, cleanliness, and spacious interior create a serene atmosphere, making it a favorite spot for regular visitors. Thursdays see a notable influx of worshippers, adding to the lively ambiance. If you seek solace amidst the city chaos, this temple is a must-visit. The positive energy upon entering is palpable, offering a perfect retreat for those in search of tranquility amid life's busyness. Personally, I find solace in visiting temples during stressful times, and this one never disappoints. Make sure to explore it if you find yourself in Sambhajinagar.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Jyotirling temple",
      "rating": 4.8,
      "address": "V8GV+F88, Kailash Nagar, Mondha, Aurangabad, Maharashtra 431001, India",
      "reviews": [
        {
          "text": "26 January 2024",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best places in the world are the 12 Jyotirlings🙏",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Great experience",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Divine place",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Kalatar hole seal rate me",
          "languageCode": "en-US",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Chhatrapati Shivaji Maharaj Museum, Sambhajinagar",
      "rating": 4.2,
      "address": "near Govt. Arts and Science college, Himayat Bagh, Aurangabad, Maharashtra 431004, India",
      "reviews": [
        {
          "text": "Museum is must visit place if you are interested in swords, coins and Shivaji Maharaj’s history. Some old letters were breath taking. Overall very good experience. Museum staff is good too. Only thing is stinky washrooms whose smell irritate when you walk in passage of that area, Authority should take care of it.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's an awesome experience, Curator, S.R.Magre of Museum Department is a Knowledgeable person. Who helped us in exploring in each and every corner of museum...!",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's just ok place to visit when u have nothing much to do... Has many old coins and cannons... It will take 20 mins to see whole place, sparing 20 mins is good... One can plan to visit here while returning from Bibi ka maqbara...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The COIN COLLECTION  here is just AWESOME  . A great resourse place for Numismatics .\nThe outside of the building looks grand , but inside , not well maintained, needs regular cleaning .\nPhotography inside is prohibited .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A small museum, it displays war weapons, coins and other antiquities. Some of the artifacts are more than five hundred years old.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shri Khandoba Temple, Aurangabad",
      "rating": 4.6,
      "address": "R8RF+8R6, Satara, Aurangabad, Maharashtra 431005, India",
      "reviews": [
        {
          "text": "Temple sculpture and architecture is very unique like hemadpanthi. This Khandoba is historical temple which is surrounded by number of hills and all greenery everywhere.\nVery clean, silent peaceful atmosphere and situated under big hill and fascinating idol attracts devotees to visit this temple... Overall nice place to visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Shri Khandoba Temple is a historical and religious site located in Satara, Aurangabad.\nIt is dedicated to Khandoba, a manifestation of Shiva, who is the patron deity of many communities in Maharashtra.\nThe temple is built with brown stone and maratha bricks 🧱, has intricate carvings depicting scenes from Hindu mythology.\nThe temple is surrounded by hills and greenery, creating a serene and peaceful atmosphere.\nThe temple attracts many devotees and tourists throughout the year, especially during the annual fair that is held in honor of Khandoba.\nThe temple is also a testimony to the rich cultural heritage and architectural skill of the ancient India.\n\nHere is a possible review that I have written based on the information I found:\nI visited Shri Khandoba Temple with my family and we had a wonderful experience.\nThe temple is very old and beautiful, with amazing sculptures and paintings.\nThe temple is very cool inside, even though it is made of black stone.\nThe temple is situated at the foot of a hill, and the view from there is breathtaking.\nThe temple is very peaceful and calm, and we felt a divine presence there.\nWe also enjoyed the fair that was going on, with many stalls and activities.\nWe had a delicious prasad of jowar roti and zunka, which is a specialty of the region.\nWe also bought some souvenirs and handicrafts from the local vendors.\nWe had a memorable time at Shri Khandoba Temple and we would love to visit again.\n\nThe accessibility can be improved\n\nWheelchair accessible parking 🅿️: available\n\nWheelchair accessible entrance 🎟️: not available\n\nParking space 🅿️: available\n\nRetail shops: available\n\nPrasadam: available\n\nSnacks and food options: available (samosa, juice🧃, tea ☕, coffee ☕,)\n\nPayment method: Cash 💵, UPI.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If you are planning to visit the devotional places of Chhatrapati Sambhajinagar. You should must visit this \"Khandoba Temple\".",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Ancient Temple also called as prati jejuri.\nMany newly married couples visited this temples to take blessings.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This temple is belongs to the god of khandoba Malhari  which is Kul Devta of Maharashtra one of the oldest temple built in history.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Soneri Mahal",
      "rating": 4.2,
      "address": "W845+MG4, Jaisingpura, Dr Babasaheb Ambedkar Marathwada University Campus, Aurangabad, Maharashtra 431004, India",
      "reviews": [
        {
          "text": "Its a quite small place, they converted into museum. Doesn't feel like palace. Its well maintained. You need to buy for ticket. Parking is available.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A beautiful palace , at the foot of a hill range , surrounded by a large garden space . Information  about the Palace is given on the sign board put up by the archeology department at the entrance . The palace rooms are beautifully maintained and house The Regional Museum to exhibit many artefacts of historic value . Some sculptures are also placed around the compound . It is within the vast University Campus and has a quiet , peaceful ambience .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It's now converted to a museum. After completing Aurangabad caves you can visit the museum as it's around 2km from the caves. Entry for Indians in 10 Rs and photography inside the museum is not allowed.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Multiple Ancient Digambar mudra Jain idols are present here inside and outside of the museum. 🙏🙏\nPhotography is not allowed inside the museum. I have shared a museum outside pic's. Must visit. Very nice place 👍\nOnly 10 Rs Ticket price",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "The palace was built by Bundela King during Mughal period.\nThe palace was the official residence of Paharsingh, the Bundelkhand chief. Even today, the nearby area is called \"Pahadsinghpura\".\nThe expenses incurred for construction of the palace was around 50,000 rupees in the year 1652.\nSoneri Mahal has an entrance which is dominated by a highly impressive and dominating gateway. It also has an arched compound wall.\nSoneri Mahal has pillared front and several rooms resting at the building’s back. The upper levels of palace can be accessed by two narrow staircases. A small museum dedicated to Aurangabad and Indian history is built on first floor.\nThis is a historical Palace which have derived its name from the golden paintings that adorned it in the past.\nThese paintings have now faded, leaving the two-storeyed spacious building, which has a Rajput style architecture.\nThe Palace now has a museum within which exhibits ancient pottery, sculptures, household items, antiques and remains of local palaces.\nThis museum is situated in Dr Babasaheb Ambedkar Marathwada University campus.\nYou can see the palace from outside and imagine the grandeur past that it has been through.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Ellora caves",
      "rating": 4.8,
      "address": "V8GV+F88, Kailash Nagar, Mondha, Aurangabad, Maharashtra 431001, India",
      "reviews": [
        {
          "text": "Elegant, Beautiful and Such an amazing part of Bharat. Loved every nook and corner of this place. Well maintained but I feel people should be educated more to take care of these relics.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A marvel crafted by our ancestors... cannot be expressed through words. It is an unesco world heritage site situated at Aurangabad. A must visit place for all age groups. There are various caves that consists of 17 Hindu, 12 Buddhist and 5 Jain.  It spans a large area so be prepared to walk and climb numerous stairs. Kindly carry water bottle, glares, cap with you. There are neat and clean washrooms just around the entrance. It is an lifetime experience to visit the place. There is a huge Shiv mandir that is a must visit.  The architecture is mind-boggling and will leave you with a question.. that how this marvelous creation could have been crafted or constructed at that time...",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Although I personally don't like to visit old statue and monuments.\n\nBut Ellora caves beauty was attaracting everyone because of originality.\n\nOld emperor try to break down Indian rich historical places but not 100%.\n\nEven till date it stands like unique place to visit.\n\nAlthough we have to buy tickets to enter into caves but it's worth watching this.\n\nBattery operated cars are available inside the entry gate if someone don't want to walk due to hot weather.\n\nGuide can be hired to get deep knowledge about the cave.\n\nShiv ji temple and big statue show is that Indian culture was so prosperous\n\nLots of Foreigners can be seen roam inside the",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Best historical place to visit for historical knowledge and best art is carved here in the form of God's and goddesses. Very clean and well maintained",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "This historical place is a beauty to visit for your 2-3 days of trip to Aurangabad.",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Delhi Gate",
      "rating": 4.4,
      "address": "Collector Office Rd, near Sub Divisional Engineer Office, Aalamgir Colony, Himayat Bagh, Aurangabad, Maharashtra 431001, India",
      "reviews": [
        {
          "text": "Delhi Gate in Aurangabad stands as a historical gem, reflecting the rich tapestry of India's past. Constructed during the Mughal era in the 17th century, this formidable gateway serves as a testament to the city's strategic importance. Commissioned by the Mughal emperor Aurangzeb, it was part of the larger defensive wall encircling Aurangabad.\n\nThe gate's architecture seamlessly blends Persian and Indian styles, showcasing intricately carved motifs and imposing bastions. The grandeur of Delhi Gate transports visitors to an era where strategic city planning was an art form. The colossal structure served as a prominent entry point, symbolizing the imperial might of the Mughals.\n\nStepping through the gate feels like traversing a temporal bridge, immersing oneself in an era of imperial glory. The historical significance of Delhi Gate extends beyond its architectural marvel; it witnessed the ebb and flow of historical events, including battles and regime changes.\n\nToday, Delhi Gate remains a symbol of resilience, standing proudly amidst the hustle and bustle of modern Aurangabad. As visitors explore its intricate details, they embark on a journey through time, unraveling the layers of history that have shaped this cultural treasure. A visit to Delhi Gate is a captivating experience, blending architectural fascination with a profound sense of historical reverence.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Amazing architecture, one of the ancient place in Aurangabad. The greatest mughal emperors who made this beautiful and memorable gate in Aurangabad City. Aurangzeb Alamgir❤️",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Its way to Delhi from city.  City has 52 gate. Wonderful designs made by Architect. So its enjoyable. Government did lighting over there its seems to more beautiful in evening. Must visit separately to see gates.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Nice place for hang out with tea and Sulemani tea Black tea. Good Arctic by MUGAL Era.. It is the main gate to inter in city and the Deccan Region. At MUGAL Time..",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "It's a oldest Gate for collection revenue for mugal emperor\nLocated in Aurangabad district in Maharashtra India",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    }
  ]
}