{
  "places_with_reviews": [
    {
      "name": "Auroville Matrimandir",
      "rating": 4.2,
      "address": "Matrimandir, Auroville, Bommayapalayam, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "The place is very big and we need to book tickets in the early morning on online  to visit the globe.\n\nAfter the parking area you need to walk around 2 km to see all the places.\n\nThere are a lot of shops and museums inside.\n\nThere will be one free pass provided to go inside and while returning we need to hand over it.\n\nTo buy snacks many shops are there inside.\n\nWhen we come back there will be a free van to drop us at the parking lot.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Auroville Matrimandir is a true sanctuary for the soul! Stepping into this serene haven, I was enveloped in a sense of tranquility that's hard to describe. The iconic golden globe, surrounded by lush greenery, creates an atmosphere of profound peace.\n\nThe journey to reach the Matrimandir, with its winding pathways and shaded groves, adds to the anticipation and wonder. As you approach, the sheer beauty of the structure takes your breath away. The golden exterior shimmers in the sunlight, and it's like stepping into a dream.\n\nInside, the meditation chamber is a haven of silence, providing a sacred space for introspection and contemplation. The radiant crystal in the center adds a touch of mystique, enhancing the overall spiritual ambiance.\n\nWhat struck me most was the universal message of unity and peace that Auroville Matrimandir embodies. It's not just a place, it's a symbol of humanity coming together in search of a higher consciousness.\n\nWhether you're a spiritual seeker or simply seeking a moment of calm, Auroville Matrimandir is a must visit. It left me feeling rejuvenated and connected to something greater than myself, a truly magical experience that lingers in the heart.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A very peaceful and serene place. The inside of the dome is very calm and probably the best place for meditation. The meditating area has a crystal at the centre which reflects the light from the sun. Mobile phones are not allowed inside, and needs to be kept in the cloak room.\nTo get inside the dome, you need to register at least 3-4 days in advance on their website which is free.\nThey give you a slot in advance and you need to reach there at the reporting time. They showed a movie at the start which briefed us about the city of Auroville and their motive. A bus then takes us to the entry point where a guide helps with the place. They have a separate batch for first time visitors and tell everything about the history and it significance.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Our Auroville Matrimandir visit was unique. Booking tickets online 2-3 days prior is advised for entry, but we enjoyed the view from a distance without booking. A 3-4 km walk inside is needed, with transportation options available. Ensure comfort with walking and, in summer, carry an umbrella.\n\nAdditional tips:\n1. **Matrimandir Viewing Point:** Free passes at the Visitors Centre offer a vantage point view.\n\n2. **Matrimandir Inner Chamber:** Open every morning, except Tuesday & Sunday. Book individually, reporting by 8.30 am. Enhance your visit with these insights and options.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Auroville is a community designed for peace and progressive harmony, yet some may find it to be overhyped, with the influx of visitors potentially disrupting its tranquility. The Auroville Matrimandir is undoubtedly impressive, and the community's upkeep is commendable. While it's a good destination for weekend visits, it's worth considering how tourism impacts its intended atmosphere. Nevertheless, I recommend it as a notable place to visit in Pondicherry.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Auroville Golden Globe ViewPoint",
      "rating": 4.1,
      "address": "2R46+F5M Rock garden, Auroville, Bommayapalayam, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "Visiting the Auroville Golden Globe Viewpoint in Pondicherry was an awe-inspiring experience. The panoramic vistas, especially during sunset, are breathtaking. The tranquil atmosphere and well-maintained site offer a peaceful escape. Commuting by foot is recommended for a richer experience, and carrying water is essential. The architecture and natural beauty make it a must-visit gem.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "An amazing experience at this place. Even though we visited this place quite late and didn't get the chance to enter the premises of the golden globe, they had this view point for late commers like us. This place is led through a forest area which is very well manicured and has some or the other unique halts in between the trails. The trail is approximately half an HR long to walk. There are shops to buy souvenir.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Parking: The only thing you have to pay at this place, the parking area was still under renovation.\n\nThe golden globe view point is around 1.5km from parking and you cannot go near to the golden globe as the view point is around 500meters from the gold globe.\nthere is a transport arrangement to reach the view point for the elderly and mothers with kids, adults can walk which is very well maintened and lots of sight  seeing, a must try.\n\nThere is a booking you have to make in advance (atleast 2days) to go inside the golden globe and I understand there is special stone which harness sun light and spreads the positive energy insdie the globe.\n\nThe restaurant offers a very good home made meals.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Overall a good experience. A lot of thought has been gone through in setting up Auroville. There is free drinking water . No entry fee. Car parking is charged very heavily. If you can find a spot outside to park, then, that cost can be saved as well. Inside, the museum is good to visit to know the history of the place and it's vision. It's a good but long Trek to the viewing point of Mathrimandir. In between, you can find food stalls, on the way. There is an option to rent cycle, thought I didn't notice the rental counter. For the return back to the entry point, there is free bus service.\nIt's very unfortunate that one doesn't get to walk on the landscape park around the Mathrimandir and get closer outside view.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "They don't have an entry fee, instead they will charge 150 for car parking and an extra 50 rupees for entering kalashetra. The view of the golden globe is awesome. Shopping is too expensive inside Auroville. You could reach the Golden globe view point either by walk or by the free bus service provided by the Auroville. The entrance to the inside of the Golden globe is not allowed when we visit.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Panchamukha Sri jayamaruthi Anjaneya Temple(Panjavadi)",
      "rating": 4.7,
      "address": "2Q5C+XW9, Panjavadi, Acharampattu, Tamil Nadu 605109, India",
      "reviews": [
        {
          "text": "Never seen such a gigantic statue with single stone. A divine attraction of panchamukhi hanuman, having five faces a rare sight in itself.\nThe place is really good, enjoyable. Free entry, free parking.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This temple is a must visit whenever you are in this side of India...around 6km from pondicherry centre this temple boasts of one of the tallest Hanuman diety idols. The Anjaneya here has 5 faces...hence the name Panchamukha...\nThe Garuda - facing the west, Varaha - facing the north, Hayagriva - facing the sky, Narasimha - facing the south and the fifth the original hanuman, facing the east.\nA definite visit.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "**READ THIS BEFORE VISITING THIS TEMPLE**\nOne of the most beautiful temple I have visited in recent times, If you are coming to pondy by car don't miss to visit this temple such an extraordinary temple with 36 feet Hanuman statue and also less crowded. If you are coming from Chennai drive via GST Trichy road via Thidivanam and not on ECR as this is on the way to pondy. Google shows the exact location, it is on the main road you no need to travel long and also have good space for car parking.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "In the early morning, was able to have darshan of Lord Anjaneya Swamy without the clamor of the people and felt satisfied for a long time seeing the swamy in the temple.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "In this temple we can see the large stone statue of Haniman carved from  a single stone. Here the deity has 5 faces and hence the name Panchmuga. You can see  floating stone at the dront of the deity. The temple is clean and neat. The place is known as Madhya Tirupati.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Sadhana Forest",
      "rating": 4.8,
      "address": "1, Sadhana Forest Rd, Auroville, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "This is a must visit for everyone. A beautiful place to enjoy the cultures of the world. Amazing people that will give you an eye opening experience. A place to understand what reforestation is and how it creates an impact to the environment. Visit Friday to get the proper guided tour. The vegan meals are delicious, please do not miss it.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "My experience at Sadhana Forest has been wonderful! The community of volunteers is very strong, kind and generous. The most beautiful aspect of Sadhana Forest are the connections that you form with people from all around the world. The community attracts a diverse range of individuals, all who are consciousness and warm. I enjoyed living simply and spending time in the forest with my animal friends! We participated in daily volunteer work, in areas that supported the maintenance of the Sadhana Forest community (sometimes foresting, other times cooking and cleaning). Eating delicious vegan meals together was a favourite part of my day, and rewarding after challenging work. The community is very organised, and so adjusting can be difficult. However, I felt well supported and cared for. I would recommend staying for a minimum of 3 weeks to feel integrated in the community.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "My experience in Sadhana was great overall, living in the forest for 10 days away from the city and in a vegan friendly environment was amazing. I really loved that.\nIt is also a great family friendly environment. The long-term volunteers are always available to answer questions and help if needed.\nYou help around the forest for around 5 hours per day in the morning (+2 afternoons a week) and you get accomodation in private hut for couples and families, or in dormitories for single travelers. You also get three big meals a day: big breakfast with fruits, lunch and dinner.\nBeside that, I met incredible people there that I will definitely keep as friends.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Sadhana Forest is something!\nEvery time I come, I felt welcomed by the people, the flora and fauna of the place.\nThe most intriguing experience for me at Sadhana forest is how people function, the structure to structurelessness! That doesn’t take away the fun of being creative and spontaneous. Within the boundaries is the safety to be anything you want to be.\nThe deep and strong values of SEVA is the mantra I experienced.\nThe trees and the plants and the birds don’t fail to cheer you up!\nThe mud poll is a must go to dive, swim, play with clay and what not.\nOh the Tea Hut, don’t miss the spot.\n\nAnd I leave the famous quote of the place “ Let more forest grow more people “",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "It was my first time to Sadhana 🌳 I had a great experience and loved meeting amazing people! Loved how the age old traditions are being brought back, from cooking food on wood, washing dishes with wooden ash to bio composting and promoting sustainability! Loved the Goshala 🐮 and how cows are being taken care with love 🥰  All the activities are well organized. Missing the yummy chocolate pudding and ladoos 😋  Cheers to all those people who are collectively working on co-existence and empathetic living! Back from the trip but my mind is still wandering around Sadhana forest 🏕️🙃",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "SVARAM Experience - Sound Garden",
      "rating": 4.6,
      "address": "Kottakarai Road, Auroville, Tamil Nadu 605111, India",
      "reviews": [
        {
          "text": "This is around 200m from the musical centre. Entry ticket is Rs. 150 per person.\n\nThere is a tour guide who first shows you all the instruments giving instructions at the same time on what to do and how to operate them.\n\nThis place is just a master piece assembled by bright creative minds. It’s a must visit if you can appreciate it for what it is since you’ll be able to absorb more of it.\n\nDefinitely recommended ✅\n\nVisited and reviewed on 26.03.2024",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "If you like music, instruments and to explore. This is an amazing space. 150 rupees and they guide you and explain all the instruments in the garden and then let you play with them on your own. A must on your visit to Auroville. Great for kids as well!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice place and different experience. Kids too can experience and enjoy this place well. Entry fees is Rs 150 per person. First they will explain how to use the instruments and then we can handle on our own. They do have a store where we can purchase if we are interested. They do research and manufacture the musical instruments there. Snacks are available nearby. Only drawback is the route to reach the place.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "*READ THIS BEFORE VISITING THIS PLACE**\nIf you are going to Auroville don't miss this gem, such a unique place and have a tremendous collection of music instruments in which they allow us to use it, the only drawback is only two shows everyday the first show is at 10.30 AM and 2nd is 11.30 AM don't come to this place without calling them and ask if it's opened and if you are coming in Car don't ever set this location and come the google will show you some romote village insted set the location as Auroville mandir and in entrance tell security gaurd that you are visiting this place and they will ask you to call them and they will allow you. 150rs per head the road to this place is very narrow and bumpy avoid in rainy season and if you are a new driver strictly no to this place hope auroville management will lay the road soonest.\nReduced one star for poor road management.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Interest place to just hang around and experience the multiple instruments. Minimal entry chrges applicale. Recommend for poeple with kids, to have a good exposure to air instruments. You can also purchase different kinds of inhouse instruments from here. Please check timings before you go.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Matrimandir View Point",
      "rating": 4.3,
      "address": "2R46+33C, Auroville Rd, Auroville, Bommayapalayam, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "You can view the Matrimandir from here which is around 0.5 km from the main dome. A peaceful place and you need to walk around 1 km to reach here. The view is beautiful but I would recommend visiting early in the morning to avoid the heat.\nIf you wish to visit inside the dome, you need to register online at least 3-4 days in advance which is free. The inside of the dome is even more peaceful and there is a designated area inside the dome for meditation.\nThere are restaurants also available on the way that serve good quality food. Worth a visit and do try to plan your visit in advance so you can visit the dome as well.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A nice scenic trek takes you to the view point. On the trek, there are many places for a good photoshoot as well.\n\nThe trek is of around 15 minutes and can easily be done at any time of the day as it is covered by trees.\n\nOn return you can either trek back or take a shuttle bus. Bicycle is also available on rent.\n\nThere are so many places to explore on the way as well. A cafe, shopping centre and clean rest rooms also available.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "From Auroville Visitor Centre, a bus takes us closer to Matri Mandir. Then a short walk to the view point. Very enchanting to look at. Wished we could go in. But we were told that we should book our visit on line at least two weeks ahead.\nVery peaceful amidst a vast area of forest. The walk was very pleasant.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Must visit places. Avoid visiting in the afternoon. Keep the water bottle with you. A walk is a must while visiting. If you wish to do meditation under the matrimandir visit the official and book a session of 20 minutes. You have to book the slot at least 4 to 5 days before visiting. Try to get interesting information about this from staff. Must try food / icecream / beverage near the car / bus collecting point it's aashram made and very different and unique flavours.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is fully commercialised place. You can see this dome after walking for approx 1.5 km. They don't allow any private vehicle to reach there because on the walking path they have established multiple commercial activities and they ensure you pass all of those. Though it is not mandatory to buy something, but they are generating foot fall. On a sunny day, it's difficult to walk along. Interestingly they provide free shuttle bus for return. This dome can be seen from a great distance only.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sri Pratyangira Devi Temple, Moratandi",
      "rating": 4.5,
      "address": "Unnamed Rd, Puducherry 605101, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "the World's Tallest Devi Statue in Puducherry!\n\n⭐⭐⭐⭐⭐\n\nAs a spiritual enthusiast and avid traveler, my recent trip to Puducherry left me awe-inspired by the magnificent Devi Statue that stands tall as a beacon of divinity and grandeur. Nestled amidst the breathtaking landscape of this charming coastal town, the World's Tallest Devi Statue is an architectural wonder that leaves an indelible mark on every visitor.\n\n, the Devi Statue is a tribute to the divine feminine power that resonates deeply with devotees and curious wanderers alike. Its gleaming golden facade sparkles brilliantly under the sun's warm embrace, creating an ethereal sight that is nothing short of enchanting.\n\nThe statue's captivating design showcases Goddess Durga in all her resplendent glory, embodying strength, grace, and compassion. The intricate detailing of the statue's features, ornate jewelry, and flowing garments is a testament to the craftsmanship and devotion invested in its creation.\n\nApart from its artistic magnificence, the site offers a serene ambiance, providing a perfect escape from the hustle and bustle of daily life. The surrounding gardens, meticulously manicured, provide a tranquil space for reflection and introspection.\n\nVisitors can also explore the adjacent temple complex, which offers an opportunity to participate in spiritual rituals and connect with the divine on a deeper level. The soothing chants and melodious bhajans elevate the spiritual experience, leaving a lasting impression on the heart and soul.\n\nMoreover, the viewing platform at the base of the statue provides a breathtaking panoramic view of the city and the azure waters of the Bay of Bengal. It's a photographer's paradise and a memorable spot for capturing cherished moments.\n\nIn conclusion, visiting the World's Tallest Devi Statue in Puducherry was an experience that transcended the boundaries of sightseeing; it was a spiritual journey filled with reverence and wonder. Whether you're a believer or an admirer of architectural marvels, this monumental masterpiece should be on top of your must-visit list when exploring the spiritual gems of Puducherry.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice experience and happy travel for this place and devotional today .",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It was a amazing experience and little scarier too, because of the PRITHINGARA statue it was devestating. Tallest Narashimar statue and Sarabeshwar also. It was a vibrant place.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Interesting temple. Felt like Devi was Kali. Car parking isn’t a problem with a big ground nearby. On the day we went lot of devotees wearing red saree were there",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Well built temple with very poor Maintenance. Lots of garbage inside and around the temple lead to hygiene issue.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Irumbai Shri Maha Kaleshwar Siva Temple",
      "rating": 4.7,
      "address": "2Q5Q+W5Q, Auroville, Irumbai, Tamil Nadu 605111, India",
      "reviews": [
        {
          "text": "Went there for a marriage and it’s a beautiful temple with peaceful views and blessings of god. Lots of marriages happened there and large space and surrounding area and close Auroville as well. Large space is available for parking and other activities. Overall a must visit place for the family around here",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "You must visit this temple 🛕\nIt's very old and most of gods small temple present inside the temple but main famous for God's shiva 🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "its ownderfull old shivan temple with theppa kulam.3 to 5 30 special pooja done  when prethosham time. who need calm meditation visit the place normal time and do your meditation.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Nice temple to visit especially during Pradhosham.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of my favourite temples around Pondicherry. Well maintained temple and God's were well decorated.\nTemple has big open space, lot of trees and a big pond.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Auroville: The City of Dawn",
      "rating": 4.3,
      "address": "Matrimandir, Auroville Rd, Auroville, Bommayapalayam, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "Couple of days ago, I’ve had an opportunity to visit Auroville. The scenic beauty and peace just mesmerised me.\nYou can sit here for long and you won’t realise how times getting passed. We didn’t get chance to visit Matrimandir from inside since with the provided information, you need to have a booking in their affiliated guest house and once your reservation is confirmed then only you can enter.\nIf you have chance to stay in Auroville then please do it and you’ll get an amazing experience inside.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Auroville is not just a place; it’s a different way of living and experiencing the world. The main attraction for tourist visitors is the  Matrimandir viewing point. It’s a relaxed 15-minute walk from the Visitor’s Centre. You can also take a shuttle if needed. Begin your Auroville journey at the Visitor’s Centre. Spend some time exploring exhibitions and videos that provide insights into Auroville’s aims and activities. You can also shop for unique Auroville-made products at the boutiques there.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Auroville is a very peaceful place in the world you will really feel very calm while visiting their premises which is covered with a lust green garden and the path to reach Matri mandir is very beautiful, if you want to spend a few hours in nature's lap then this place  will provide you mesmerizing experience.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "One can visit auroville matrimandir from outside. First, we have to go to Matrimandir Visiting Center and collect the visiting pass. You can park your car outside. Then either you have to take a walk or you can choose to take matrimandir free bus ride. It's just 1km around from that area. Matrimandir is a quiet place, it is been created to do meditation and spiritual stuff.\nYou will enjoy the ambience and view of the mandir from outside.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Better to reach this place around 9 o'clock early morning otherwise rush will be more in weekends\nThe Reception has an Information Center where a short video of auroville history will be played. Do watch the Video to get more insights.\nAuroville is an experimental Society where people from different cultures live together in harmony with some defined set of Principles and Rules. After the Information Center u need to take a Pass for the Visit to matrimandir. Shuttle service  also will be there but trekking would be better because you have to go through the small jungle\n\nWalk  will be around 1 kms I guess towards Matri mandir. Very peaceful, through shaded vegetation.\nEnjoyed the walk. Carry water ,Cap/hats,and wear shoes to enjoy the walk.\n\nThere's a very old Banyan tree enroute,can spend some time around it. This Banyan tree is big really big and I have not seen that much Big Banyan tree in my life. Washrooms and Drinking water facilities are also available near the Matri Manthi. U can spend some time clicking photos of Matri Mantir and then return  through a free Shuttle bus.\nOverall, it's just some walk and Matri mandir, nothing more.\nThere is a shopping area, a bit expensive. A small food court also available but cost is very high.\n\nMatri Mandir is a meditation center and needs to be booked in advance for entry.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sri Maha Shanishvara Bhagavan Temple, Moratandi",
      "rating": 4.5,
      "address": "Mortandi, Pattanur, Tamil Nadu 605101, India",
      "reviews": [
        {
          "text": "It is a different temple altogether. The greatest wonder is that to enter this temple we need to pay entry fee. Hence, we feel that the place is more like a Museum rather than temple. Moreover, here the priest openly asks for dakshina, hence we lose all bakthi and feel like running away from the place before anyone asks for dakshina. Otherwise it is a very beautiful temple. We went in the morning and so it was very hot.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice temple.. They say this is the only temple with Asia's largest lord Shanishvara/Saneeswara Bagavan statue. No free entry.. They will charge some money to enter inside the temple(₹20 per head). U can see Ganesh statue, Lord Murugan, Lord Saneeswaran, Lord Siva lingam and Navagraha(Planets) with respective plants. I recently visited on Shani Peyarchi day 20/12/2023(its my 3rd time).",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit temple when your in Pondy, amazing statues and Saneswaran brass statue is just excellent 👌🏼 and you will see all the Navagrahas statue are huge and 27 nakshataras and plants 🪴 very well maintained temple.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very huge saneeswaran God statue and all other navagraha statues as well.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit Temple enroute to Pondicherry.. Peaceful atmosphere",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}