{
  "places_with_reviews": [
    {
      "name": "Ausa Fort",
      "rating": 4.1,
      "address": "Khandal Galli, Sambhaji Nagar, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Very good architecture of the fort. Bastions and walls are very much intact. Good to visit from latur. It's a land fort no need to climb.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Exploring the various sections of AUSA Fort is like stepping into a living history book. The barracks, armories, and officer quarters have been meticulously restored to their former glory, allowing visitors to envision the daily lives of soldiers who once resided within these walls. The interactive displays and artifacts further enhance the experience, offering a tangible connection to the past.\n\nIn conclusion, AUSA Fort is a gem of historical significance. Its captivating architecture, immersive experiences, knowledgeable guides, and well-maintained grounds make it a must-visit destination for history enthusiasts. Whether you're a seasoned historian or simply curious about the past, AUSA Fort will leave an indelible mark on your memory.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "This is well maintained stone structure fort situated near Latur District Maharashtra, there is some encroachment inside premises of external wall of Fort, that should be remove by local government authorities. Very nice fort tourist must visit.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "Beautiful historical place to visit if you are history lover. The fortification is really good. Of course as there are some bad people are there who have ruined walls by writing names, sitting on the canons put at the entrance. The fort is mainitained but still needs to take out bushes which are there in the courtyard. Not all visitors are history lovers and some of them throw plastic bottles in fort. If you want to visit fort and see it thoroughly then keep at least 2 hrs time with you. Fort entrance closes at 5.00 pm so you have to visit accordingly.",
          "languageCode": "en",
          "rating": 4.1
        },
        {
          "text": "There is not much info on this fort. some mentions found during 15 & 16th century. Lesser known place .  Huge fort, has a moat around, curved entry with check points, mahal and a sadar , a mosque. 50% of the fort is covered by gulmohar, imli trees but one can use the boundary wall walkway to see the fort.",
          "languageCode": "en",
          "rating": 4.1
        }
      ]
    },
    {
      "name": "Shri Keshav Balaji Devasthan",
      "rating": 4.6,
      "address": "6GPG+C8V, Road, Yakatpur, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "This temple is located near Ausa. Its around 20 Km from Latur. The temple is very neat and clean. After darshan you will get prasad and it could be Boondi. Ample parking available and its free.You will love the serenity of the Balaji Mandir in Latur.Nice shrine to visit .\nBalaji is the lord of Money so visiting him is always attached with self greed .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Clean hygienic Hindu temple of Lord Balaji. Best place to visit for the entire family. Fun for kids. Silent and auspicious time spent",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a nice temple near Latur, very well maintained and clean. Good choice for weekend trips. View at evening is so adorable.🙏🏻🙏🏻🌸🌸\nPC- Shamsingh Dahe",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "We visited the Keshav Balaji Temple several times with family members. It is a beautiful, peaceful, religious place with a central Balaji temple surrounded by some small temples, green campus. There is a Hanuman temple and a big Hanuman  statue on top floor. Recently, a function hall, a function lawn,   some rooms are added for marriage like ceremonies. It is approximately 20 kms from Latur.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peaceful and Pious place for those who are staying near Latur and who want a spiritual break with family and friends...kids can also enjoy a small horse ride... please do spend and donate generously to help keep the place running.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Balaji Mandirr",
      "rating": 4.6,
      "address": "6GPG+P63, Old Ausa, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "The peaceful temple is located in Ausa city, which is approximately 22 kilometers away from Latur. There are 4-5 temples 🛕 surrounding the main Bajali temple. This place is situated on the outskirts of Ausa. Currently, there is a lot of ongoing construction in the temple area.\n\nThe nearest attractions include:\n\nKeshav Park\nBalaji Temple\nHanuman Temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excited to share about my recent visit to the beautiful Balaji Temple Ausa 🙏 Located in Maharashtra, India, this temple is a true gem with its stunning architecture and peaceful surroundings. I was truly amazed by the spiritual experience and tranquility that I felt while exploring this sacred place.\n\nIf you're looking for a place to connect with your inner self and experience divine energy, I highly recommend visiting Balaji Temple Ausa. #TempleTravel #SpiritualJourney #SacredSites #TravelInspiration",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good place for small outing, very peaceful temple atmosphere, not much scenery around, the temple is in barren land but gardening has been developed, lot of spots to click pictures , few activities for kids like horse ride and electronic car ride.very few options to eat.\nThey are developing surrounding area in anticipation of huge commercial profit in coming years.\nBut for now, a good place to visit",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Neat & clean temple....\nClam place.....\nFood & service very good....",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Devotional place with facility of two functional halls with nice surrounding",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Ausa",
      "rating": 4.3,
      "address": "7F2X+5VV, Kazi Galli, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Best city",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good experience",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Very nice quality and Home services",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Nice 🙂",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Love it",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Gopalpur Lord Krishna Temple",
      "rating": 4.6,
      "address": "6FWR+C2J, Gopalpur, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Beautiful place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Temple surrounded by Garden",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Must visit laturkars an near by all\nRules do not touch any thing in garden as well as if you go with you frds group Mix then 10 to 15 min only they allowed\nBut temple is very attractive and garden also\n\nThis temple is back side of smashanbhumi in ausa local people anyone can tell you\nGood place, peace",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place to go with family & friends .",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Best place for tourism but always close",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "VishwaSwaroop Balaji mandir",
      "rating": 5,
      "address": "Mali galli ausa, Bhraman Galli, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Venkataramana Govinda🙏",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Govinda.. 🙏",
          "languageCode": "en",
          "rating": 5
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": 5
        }
      ]
    },
    {
      "name": "Kalika Devi Mandir",
      "rating": 3.8,
      "address": "6GW5+HP3, Nath Nagar, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Peaceful place.must visit.. proud to be Indian and latur kar ...so visit onces..",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "It's good and clean",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Better than others",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Bbbb",
          "languageCode": "en",
          "rating": 3.8
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 3.8
        }
      ]
    },
    {
      "name": "Mukteshwar Shiv Temple",
      "rating": 4.2,
      "address": "Unnamed Road, 7G52+PHC, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Very old Temple in ausa,And nice design of temple and great structure.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awsm temple it has a beautiful garden near to temple there is lake this temple is situated at corner of the city",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Spiritual environment and good garden to hangout.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice place for wedding.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Mukteshwar Mandir",
      "rating": 2.5,
      "address": "6GQ8+XHH, Ausa, Maharashtra 413520, India",
      "reviews": []
    },
    {
      "name": "HIREMATH SANSTHAN AUSEKAR MAHARAJ MATH,AUSA",
      "rating": 4.6,
      "address": "6FWW+CP3, Swami Galli, Kevalram Galli, Ausa, Maharashtra 413520, India",
      "reviews": [
        {
          "text": "Good place\nIt is the temple of Mahadev mandir there also a wedding holl.Good palace for young as well as older.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This is holy place of Lingayat samaj.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Om Namo Shivya!!!",
          "languageCode": "en-US",
          "rating": 4.6
        },
        {
          "text": "Knowledge is acquired at the right time.",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    }
  ]
}