{
  "places_with_reviews": [
    {
      "name": "Avanti Swami Temple Ruins",
      "rating": 4.3,
      "address": "W2F7+74M, National Highway 1A, Awantipora, 192122",
      "reviews": [
        {
          "text": "If you are interested in history, this is an interesting place.  Although it’s a small area, you can learn a lot from the local guide.  The moment we stepped in, we were greeted by a sardarji who started telling us about the history of the place.  The way he was narrating the incidences that took place in the past got us really interested.  It was a great experience!  Learnt a lot about the ruins!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This is the ruins of an old temple excavated in Avantipura. Such a nice and quiet place. Reminds us of old culture and civilization in this area. A must visit place in Kashmir.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The town of Avantipura was founded by Avantivarman the Kashmiri Hindu ruler,who was the first king of the Utpala dynasty and ruled Kashmir from 855 to 883 AD.Avantivarman built a Hindu temple in Awantipora dedicated to Vishnu called \"Avantisvamin\" before he became king, and during his reign he built a second Hindu temple in Awantipora called \"Avantisvara\" dedicated to Shiva. Both temples were built in spacious rectangular paved courtyards. They were destroyed in the Middle Ages.( source- Wikipedia) .I loved the place , surrounded with the beauty of Kashmir you will be amazed by the fine art one the walls . Visit once. Life is for once enjoy and explore.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Anyone who is interested in history and archaeology must visit this site on way to Pahelgam. There were a temple dictated to Lord Shiva and Vishnu. May be the temple is now ruined but the rich Indian architecture and culture can still be deciphered.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The Avantiswami Temple is an ancient ruined Hindu temple located on the banks of the Jhelum River, 28 km away from Srinagar in Awantipora, Jammu and Kashmir, India. It's ruins once consisted of two temples dedicated to Shiva and Vishnu, and were built under king Avantivarman of the Utpala dynasty in the 9th century CE. 22nd Oct 23 #AwantiporaRuins",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Avanti shovra temple(dreamffp)",
      "rating": 4.4,
      "address": "Old NH-1A, 192122",
      "reviews": [
        {
          "text": "Just take bypass from pehalgam-Srinagar. It’s on the way. Parking available just opposite. A must visit place for explorer. You will discover how beautiful it would have been when it was built. There is one more temple ruins on same road 500 mtrs ahead. Probably that also was built at the same time. In between there is a dargah. Both temples ruins are must visit.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "The place is quaint and filled with calm vibes all around and some restoration work is also going on by the efforts of ASI.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Avanti Shovra Temple or Avantisvara temple was built by King Avanti Varman during his reign 855 - 883 AD. This is a massive temple and much bigger than Avantiswami dedicated to Lord Shiva.\n\nThe temple is situated in a courtyard enclosed by a huge stone wall of which is decorated beautifully. The gateway is in the middle of this wall and it is divided into two chambers. Its walls are not decorated with sculptures as Avantiswami.\n\nThis could be a very good attraction for the tourists but unfortunately, most of the tourists are not aware of the temple. This temple is situated on the bank of river Jhelum, beautiful hills are there in the backdrop and ruins of the temple altogether will usher you to a different world.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Best historical place",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Good place Sep 2021",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "CLOCK TOWER AWANTIPORA",
      "rating": 4,
      "address": "IQBAL COLONY, W288+9QP, Awantipora, 192122",
      "reviews": [
        {
          "text": "Beautiful Clock Tower in the Middle of The Town.",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "Best selfie spot",
          "languageCode": "en",
          "rating": 4
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": 4
        }
      ]
    },
    {
      "name": "Jamia Masjid Dangerpora Noorpora",
      "rating": 5,
      "address": "Awantipora, W22R+4WV, Noorpora, 192122",
      "reviews": []
    },
    {
      "name": "KADLABAL AWANTIPORA",
      "rating": 4.9,
      "address": "V2RG+P26, Noorpora, 192122",
      "reviews": [
        {
          "text": "Awsome place",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Very useful",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "🫀",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "You should definitely visit here.",
          "languageCode": "en",
          "rating": 4.9
        },
        {
          "text": "Student",
          "languageCode": "en",
          "rating": 4.9
        }
      ]
    },
    {
      "name": "Shri Avantiswami Temple - Pulwama District, Jammu & Kashmir, India.",
      "rating": 4,
      "address": "W2C7+PH6, Awantipora, 192122",
      "reviews": []
    },
    {
      "name": "Masoleum of Hazrat Syed Hasan Mantaqi",
      "rating": 4.6,
      "address": "W2G5+2R2, NH1, Awantipora, 192122",
      "reviews": [
        {
          "text": "dargah of Syed hassan mantaqui ra\nfew meters away from  dargah there is famous BSC nursing colleage (Syed hassan mantaqui nursing colleage) which is affiliated to islamic university of science and technology from the back side of dargah the famous river jehlum flows\nThe funds collected from this dargah are used to run the Mantaqui memorial wakf higher secondary school in which about 1000 students are getting education",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Place to spread peace and brotherhood. Has a seminar hall wherein conferences are held to spread knowledge too besides interfaith harmony and peace. Loved this place!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The mausoleum of hazrat Syed Mantaqi (r.a) is a famous religious site in this area. It lies adjacent to National Highway 44. Many tourists and devotees pay their obeisance. The nearby college and school are also named after his name and fame.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "this peaceful place is called ziyarat shareef in the name of syed hassan mantaqui (RA) is situated in awantipora ...many people of all religions visit this place and donates lot of money ...there is also celebrated mela in a year many people from different places come to celebrate that day",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The shrine is of Syed Hasan Mantaqi.....\nOn its name there are various institutions like....\nMantaqui memorial...educational institution\nAnother institution is of Nursing.....\nEtc....",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Jamia Masjid Sail",
      "rating": 4,
      "address": "V2QP+FGC, Chersoo Awantipora, 192122",
      "reviews": []
    },
    {
      "name": "Jamia Masjid Awantipora",
      "rating": 4.4,
      "address": "W2F6+GVC, NH 44, Awantipora, 192122",
      "reviews": [
        {
          "text": "this beautiful mosque is located on the right side of awanti swami temple ruins , At  the national highway 44 awantipora",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beauty of this masjid on the Eidgah side",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Beautiful Mosque near Awantiwarman Temple.",
          "languageCode": "en-US",
          "rating": 4.4
        },
        {
          "text": "Eight",
          "languageCode": "en-US",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Shiekh Ul Alam Masjid",
      "rating": 4.6,
      "address": "WX4X+3QF, Awantipora Rd, Padgampora, 192305",
      "reviews": [
        {
          "text": "Good worship place having car parking and toilet facilities",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace of mind, present on main road, the Masjid Paak is very beautiful",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful masjid / mosque🔴💕❤",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "❤❤",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "God",
          "languageCode": "en-US",
          "rating": 4.6
        }
      ]
    }
  ]
}