{
  "places_with_reviews": [
    {
      "name": "Mapro Garden",
      "rating": 4.3,
      "address": "15/1B, Gureghar, Panchgani - Mahabaleshwar Rd, Mahabaleshwar, Gureghar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Mapro Garden offers a serene escape amidst nature's beauty. It's a good place to spend quality time with friends and family. The availability of snacks and mocktails adds to the experience, making it even more enjoyable. Sampling their products is a highlight, allowing visitors to taste the delicious offerings. However, the products are on the pricier side. Overall, a delightful visit.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Mapro Garden, Panchgani: A Must-Visit Destination\n\n🍦 Delightful Ice Creams and Free Syrup Tasting Indulge in delicious ice creams and explore a variety of Mapro syrups with free tastings.\n\n🌺 Scenic Beauty and Cleanliness Experience pristine cleanliness amidst vibrant flowers and lush greenery.\n\n🅿️ Convenient Amenities Enjoy free entry and parking. The restaurant, while spacious, has higher prices, but the staff's courteous service and spotless open kitchen enhance the experience.\n\nOverall, Mapro Garden offers a delightful blend of nature, treats, and convenience, making it a must-visit in Panchgani.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good place to have shopping for candies of different types even cookies here are awesome.\nStaff is helpful and area is good covered under mapro.\nHad good time roaming around and shopping.\nGood place for kids for photography and for families.\nFood served was awesome it was self service.\nIt has everything self made.  Every raw material for dishes are own baked or straight from farm.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "-This is a must visit place if you are in Mahabaleshwar. (Specially in Evening)\n\n-The entry in garden is free and it also has a restaurant inside it.\n\n-You can enjoy eating and later on shopping their exclusive products over here.\n\n-There are variety of flowers and are very well maintained.\n\n-The strawberry Farm is also quite big.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "We recently visited Mapro Garden in Mahabaleshwar and it was an absolute delight!\nThe sandwiches were superb, and the strawberries were quite tasty..\nDelicious hot chocolate brownie beyond a doubt!\nFor every chocolate enthusiast, dark chocolate shake is a real treat. It is rich, creamy, and incredibly well-balanced—a foodie treat..\nThe cream was just amazing, and the syrups were a true delight—so delicious and refreshing..\nTo top off the amazing experience, the service was perfect..\nMapro Garden is undoubtedly one of Mahabaleshwar's must-see places..\nHighly recommended!!",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Kates Point",
      "rating": 4.6,
      "address": "WPR5+J55, Mahabaleshwar, Golewadi, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Ah, Mahabaleshwar! It's a beautiful hill station in Maharashtra, India, known for its breathtaking scenery, lush greenery, and cool climate. The \"Kates point\"   is one of the popular tourist spots there, named for its rock formation that resembles the shape of an elephant's head. It offers stunning panoramic views of the surrounding hills and valleys. Have you had the chance to visit it?",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Kate's Point is not just about the views; it's about soaking in the tranquility of nature. Breathe in the fresh mountain air, feel the gentle breeze caress your face, and listen to the symphony of birdsong. This is a place to unwind, to reconnect with yourself, and to appreciate the simple beauty of the world around you.\n\nThings to keep in mind:\nEntry fee: There is FREE entry to visit Kate's Point.\nTimings: The point is open from 6:00 AM to 6:00 PM.\nBest time to visit: Early mornings or evenings offer the most pleasant weather and stunning views, especially during the monsoon season.\nParking: Parking can be crowded, especially on weekends and holidays. Arrive early to avoid the hassle.\nAlert : With Monkeys",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Exercise caution regarding monkeys; refrain from feeding them and ensure the safety of your belongings. Once these precautions are taken, immerse yourself in the unparalleled beauty of nature at this iconic spot. Mother Nature's grandeur is simply breathtaking, leaving you with an indescribable sense of happiness and an unforgettable experience",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Views are stunning so are the monkeys. Enjoyed the horse ride with my 2 year old daughter ..they charged 200 for less than 10 minutes which I think is too much. Over commercialised - unnecessary toy car rides for small children .. I mean why would you spoil such places with these gimmicks. Car parking if you are lucky to find a spot you will get. We went in last week of December 2023 so it was packed with people. Overall a good experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Review date 25th March 24\nMust visit the view point in mahabaleshwar\n\nWe went off season so there was no much greenery but yes the view point Is worth watch .\n\nLots of monkey's are there please beware\n\nAlso the fun part is some people are kept photo shoot points for plastic flower and golmal bike and making masth money 🤑🤑🤑🤑",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Lingmala Waterfall Point",
      "rating": 4.5,
      "address": "WMFV+357, Bhekavali, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Good nice trek of 800 m with family.\nEateries are available at small distances.\nYou can view waterfall from peak point. Still its far you can not reach the waterfall only can have better picture once reach there.\n20 rs. Ticket.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice view points from the top and near the small waterfall. The jungle view and the George view is amazing. Sunrise should be the ideal time to visit. Amazing walk towards the waterfall view point. Rs 25 per person ticket price at the entry, only cash is allowed. Washrooms available.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Beautiful and a must visit place for nature lovers. Though the gushing waterfalls would have been wonderful to view during the rainy season but loved it even when it was sparse.\nHave to walk around 2 km to get the perfect view. Also has a small originating fall and lake which was pleasing for the time spent.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Lingmala waterfall is awesome as it takes you in the jungle environment and view is great. Peaceful environment. You have to walk down to go there. Amazing experience. 25 Rs tickets price.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Must visit this place during July to Jan. , charge 20 rs per person, snacks counter available, Very thrilling experience and close to nature. Kids will enjoy a lot in the water stream which is not too dangerous. Road conditions are not good, need to be taken care when climbing a steep road from the car.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Wilson Point",
      "rating": 4.3,
      "address": "WMCF+CV8, Panchgani - Mahabaleshwar Rd, Mahabaleshwar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "It's not a point but a large flat area to watch the mountains.... Less crowded but good to visit in the evening or early morning..... No hawker/ eating stall available here... Taxi or vehicles can come to the end point.... One can visit with the family for relaxing time.... Boys and boys group can enjoy much here...!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "For sunrise.. v beautiful place but its difficult to go there with your vehicle due to steep slopes.. If you want to make it more interesting, you can opt for a horse ride :)",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It was a lovely experience..Wilson point is also known as sunrise point..we went there to watch the sunrise..we visited there during December, so the sunrise was at around 6:30am ...it was damn cold 🥶...but the sunrise was beautiful 😍😍..loved it...I will definitely recommend you to visit this place if you are in mahabaleshwar 🫰🫰",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "The sunrise was very beautiful and it is better if you reach there by 7 am itself. The walk to wilson point is also very green and pleasent. There are no bathroom facilities nearby and I would recommend eating breakfast and travelling here.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Wilson Point is an absolute must-visit, and I highly recommend dropping your car and taking a short 5-10 minute walk to reach this enchanting spot. The trail itself is a picturesque journey that adds to the overall experience. The beauty of the surroundings and the scenery along the way are truly captivating. Although it's just a short trail, the natural beauty of the area makes it a memorable and serene escape. Wilson Point is a gem that's best enjoyed on foot, allowing you to soak in the mesmerizing landscapes.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Venna Lake Boating",
      "rating": 4.2,
      "address": "Venna Lake, Mahabaleshwar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Beautiful place to enjoy and have boating. Two types of boat available, paddle type and rowing type. The cost varies from 600-1200. You can take professional help also. They will take inside the lake and teach rowing also. On the ticket counter area there are photo shoot area",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Beautiful man made lake in Mahabaleshwar which is popular for boating. The charges are nominal like Rs. 400 per person and more if you want extended ride. Many times of boats are available, you can even ask to try rowing yourself but its not as easy as it looks. Recommended early morning or during sunset for best views. They have horse riding also and some food stalls. Overall the place is good for one time visit for couples, families or with kids.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awesome place to visit especially at sunset. Paddle boats and row boats are available at very reasonable costs. Paddle boats were for 600/- an hour for max 6 People and row boats for 800/- I guess. It's a beautiful lake with lots of scenic views.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "It is beautiful lake no doubt in that.. enjoyed the boat ride\n\nFew points to remember -\n1. Avoid holiday and weekend\n2.Try to reach as early as possible to avoid the crowd\n3. Book online ticket if possible to avoid queue\n4. Ample of parking available near by but will still recommend to avoid crowd timing",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Amazing place for ( boating )🛶 kayaking .\nYou can get 2/4/6 person boat here.\nAlso motor boats are available for senior citizens.. visit between 4-6pm",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shiv Temple",
      "rating": 4.6,
      "address": "WMG5+CQV, Satara Rd, Mahabaleshwar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Beautiful historical place\nAnd history about\nChatrapati shivaji maharaj\nThe temple is so old and ancient\nThere is a shivling in Rudraksh form that is said to be  formed naturally\nThe pandit said us about this temple and shivling he narrated that\nThe shivling is 4000 to 5000 years old and the temple is 800 years old and in the period of shivaji maharaj it was rebuilt and the savrana tulna of Raj mata jijabai was held\nThis place is beautiful and so history with pure history\nThere is also panchganda mandir\nIn which the water of 5 rivers comes. And met at the point and comes through cow's mouth and fell into the kund\nThe water was so fresh and so cold\nI felt it when I visited the temple\nVery rich in history\nShoul visit\nThere are slo atlot of stuffs you can find to buy there\nFruits like strawberry mulberry gooseberry\nHand craft kit items of good was also there\nWe had tea there and the tea was very nice I will post the tea shop in the photos\nThere was a big shop in which all the antique things were sold made of copper brass steel and many more things they were very costly but worth the price",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A Beautiful and Serene Temple with breathtaking views. Must visit as this temple is going down inside earth slowly. Visit before it vanishes",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "There are 5-6 temples in vicinity.\nKrishnai temple. Has jyotirling. Clean temple.  Good valley point with dam.\nLess crowdy.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Beautiful small temple am must visit place if you are in Mahabaleshwar. Just visit the temple do not buy anything as the price are super hyped.\n\nYou can leave your slippers just outside the temple after you cross the shops. There are good facilities there to see his through Tv as well. Going in the early hours is best.\n\nThere is also the birth place of river Krishna there a must visit temple. Beautiful and very old. Photography is prohibited in temple premises",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very silent and beautiful place\nThis is temple of shiv\nJust 500 metar below touch in river",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Hollywood Wax Museum & Aquarium",
      "rating": 4.6,
      "address": "At : Gureghar, Panchgani - Mahableshwar Main Road Gureghar, Mahabaleshwar, Avakali, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Well organized aquarium. Simple and well maintained. Similarly, good wax museum with several famous celebrity wax statues. There is also a \"9D\" show which is fine too (while the concept was nice, the 3d glasses or projection could have been clearer though). Worth it to spend some time indoors.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Excellent aquarium experience! The diverse collection of marine life is impressive, and the well-maintained tanks provide clear views. Knowledgeable staff adds value with informative insights. A must-visit for aquatic enthusiasts!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a good place especially for kids. They also have seasonal offers. They have amazing wax sculpture only two three didn't look alike. Otherwise everything was fine. Aquarium was also good. There was also 9D show and they also had this go karting. It was fun to visit.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The aquarium was good, the wax figurines weren't the most accurate but were quite detailed. I think Jackie Chan's figurine bore the most resemblance amongst all. The 9DX show was decent, kids will probably like it more. It basically features moving seats, light, water, bubbles and particle effects. The one at Imagica was much better but for the price they charge, can't complain. Each of these activities costs 250 per person but costs 600 overall as a combo deal. Go karting and ATV riding is also available here which we did not avail.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "I think wax museum was awesome but quite disappointing about aquarium because in Rani bagh ( Mumbai) in more reasonable amount we see the animals aswell as the fishesh penguin 🐧 and all in just 50rs per person so in my opinion 250 is worth less. 9D was okok in kanheri math we saw 7D is the same one in 100 rs. But wax museum was very beautiful and details are very good so I think I referred it is full Paisa vasul wax museum.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Mahadev mandir",
      "rating": 4.4,
      "address": "WMF4+JX6, Mahabaleshwar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "\"Mahableshwar Temple: A serene oasis nestled amidst lush greenery, Mahableshwar Temple exudes tranquility and spiritual vibes. The architecture is captivating, reflecting ancient craftsmanship. The temple's sanctity and panoramic views make it a must-visit for seekers of solace and cultural enthusiasts alike.\n\nAtibaleshwar Temple:  Atibaleshwar Temple offers breathtaking vistas of the surrounding landscape. The temple's architecture is awe-inspiring, with intricate carvings and a peaceful ambiance. Visitors are drawn to its spiritual energy and the sense of calm it instills.\n\nPanchganga Temple: A sacred confluence of five rivers, Panchganga Temple is steeped in mythological significance. The temple's architecture is mesmerizing, with intricate sculptures depicting tales from ancient scriptures. Pilgrims flock here to bathe in the holy waters and seek blessings, adding to the spiritual aura of the place.\n\nOverall, exploring these temples on the Google Maps platform provides a glimpse into the rich cultural heritage and spiritual essence of Mahableshwar. Whether you seek serenity, breathtaking views, or spiritual enlightenment, these temples offer a holistic experience worth embarking on.\"",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Must visit place. In Mahabaleshwar.  About the temple\nreference to the first and second chanters of Sahradri Section (SKAND) PURAN, We get this story of the God Mat around the very ancient period ine around the period of creation of the world. During the period of Padma Kalp the two der named Atibal and Mahabal had troubled the people, maximum extent. It become very dificult for them to survive. Therefore to project the people, Shri Brahma, Shri Vishnu and Shri Mahesh had to fight with these brother. In the battle, Shri Vishnu kille Atible but the God could not defeat Mahabal as he was given such a blessing that nobody could kill him, ie. he will die of his Gods prayed Aadimaya to help in this situation. She temped Mahabal and stopped him from fighting. Mahabal was very much I he saw that Gods had surrendered him and told them to ask for any blessing. Then gods asked Mahahal for one such blessing tha could be put to death at he hands of Gods. Mahabal agreed to their demand on one condition that gods should stay with him (M at this place. Mahabalis last wish honored by the God. Since then, This place is considered as saereda mahesh in the name of I in the name of Atibal and Brahma in the name of crores of soldiers had actually started staying in the place thus, this place I Atibaleshwar and Koteshwar stood as symbol of 'trigunatmak ling'. Mahabaleshwar, a self created shiving is of a rough Rudraks This temple is built around eight hundred years ago; but the shivling side is very much old i.e. almost thousands of vear Shri chhatrapati Shivaji had arranged his mother's \"SuvernaTula' (Golden balance) in this very temple on 06 Janus",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Rudraksh shape jyotirlings. Historic place with Shivaji maharaj life incident happed here. Generally crowdy and may take 1 hour or so. Mukh darshan is available but main gabhara is deep so you don’t see anything.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Must visit the temple. Also visit the temples nearby especially PanchGanga a confluence of 5 rivers.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A peaceful place",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Connaught Peak",
      "rating": 4.3,
      "address": "WMXC+5F5, Connaught Peak Rd, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Hidden place to view paradise... One of the best sunset point. You can view the entire mahabaleshwar jungle from here. It is in the forest, so please don't go solo here. Space is small so try avoiding it with large groups.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Connaught peak is one of the best tourist place in Mahabaleshwar located an altitude of 1400m which is second highest peak in Mahablaeshwar.\n\nThis peak was initially called as Mount Olympia which was renamed as Connaught Peak in the year 1880, after the Duke of Connaught visited this spot who was cousin of British king fifth George.\n\nThis Place is quite popular among trekkers and riders and also famous as Kamal gad, Raj gad, Torna are visible in the North direction where as Panchagani, Pasarani are visible n the East direction. Pratap gad and old Mahabaleshwar are also visible from this point.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "There nothing to watch... It's just an adventures location... Very good for boys and boys group... Strictly no for family as there is nothing to see and location is very isolated.....!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "A very nice place to view both sunrise and sunset. One can enjoy the view of mountains and nature and the feel of the place is just awesome.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "This peak is on the Connaught peak road while travelling to old mahabaleshwar from Bombay point.\nThe road to the peak is unpaved so drive slowly, parking space is at the start of the trail to peak, it can accommodate around 8 to 10 cars.\nThis place is less explored by tourists but it is worth a visit especially if travelling with kids.\nThough the watch tower is closed and not in good condition, you will not be disappointed by the view it offers from the peak.\nDo visit the left side of the peak which has a pathway through the bushes, you can sit down here and absorb the fresh air and beauty of the forest.\nCarry water and some snack items but do not litter the place.\nOverall a must visit peak if you like to explore more, you can spend 30 min to an hour here.\n\nDon't forget to take a selfie, photos  AND MOST IMPORTANTLY YOUR TRASH WITH YOU, KEEP THE PLACE CLEAN SO NEXT GENERATION CAN ENJOY IT.",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Sunrise point Mahabaleshwar",
      "rating": 4.6,
      "address": "WMCG+347, Mahabaleshwar, Maharashtra 412806, India",
      "reviews": [
        {
          "text": "Good view. Reached early before sunrise and it was worth it.\nRoad can be a bit tricky.\nThere are 2 roads to reach , only 1 has driveable road to top.\nThere are multiple points here and can be visited for sunset as well.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The view of the sunrise is mind-blowing. We waited for almost half an hour for the sun to rise and the wait was worth it. On that day we have not sleeped for almost a day and were too sleepy as we dropped that night from Mumbai to mahabaleshwar. Instead of the sleepy head we decided to watch the sunrise. And this experience was worth it. We sat down at a perfect place and the weather was very pleasant,the wind was nice and cold and was pleasenty flowing , there was a positive vibe in the atmosphere. The air was very fresh and we loved watching the sunrise.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Being sunrise point this Location is best captured in Evening as you can have pictures in Moon light.Also Known as Wilson's Point and Green carpet of mountain can be seen from this location, as it is on the Top of Mahableshwar.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "The best sunrise view can be enjoyed here 😍 loved it ❤️",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice experience with sunrise in hill side area",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}