{
  "places_with_reviews": [
    {
      "name": "Ram Mandir, Karsewakpuram",
      "rating": 4.6,
      "address": "25/5/45, Parikrama Marg, Karsewakpuram, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "Ram Mandir is a captivating blend of beauty and tranquility. Amidst the bustling crowd, the temple exudes an inexplicable sense of peace that left me speechless. The experience is beyond words; the temple's serene ambiance is truly special.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very very beautiful and pious place visited with the help of VIP and had great memorable darshanam of Ramlalla, Balak Ramudu.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very nice place, Can be treated as an office of Vishwa Hindu Parishad. Many a thing to see there",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Cultural and Historical Significance:\nThe construction of the Ram Mandir holds immense cultural and historical significance for millions of Hindus. Ayodhya is considered the birthplace of Lord Rama, a revered figure in Hinduism, and the construction of the temple fulfills a long-standing cultural aspiration.\n\nReligious Unity and Harmony:\nSome view the completion of the Ram Mandir as a symbol of religious unity and harmony, emphasizing the peaceful coexistence of various communities in India. It represents a step towards resolving historical disputes and fostering mutual understanding.\n\nNational Pride:\nFor many, the construction of the Ram Mandir is a matter of national pride. It represents the fulfillment of a cultural and religious dream, and its completion might be seen as a positive development contributing to the national identity.\n\nArchitectural Marvel:\nThe architectural design and execution of the Ram Mandir are likely to showcase craftsmanship and artistry. The temple's design, sculptures, and overall architecture might be appreciated by those interested in cultural and historical aesthetics.\n\nTourism and Economic Impact:\nThe completion of the Ram Mandir could boost tourism in Ayodhya, attracting pilgrims and tourists from various parts of India and around the world. This, in turn, may lead to economic benefits for the local community and the region",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Visited here amzing and incredible place to visit newly developing Prabhu sri Ram mandir in ayodhya, usually there is maximum to reach to ramlala is 45 minutes only, there is a good arrangement of Line system and if someone is feeling problem or they are old they will get direct entry from side by the mandir staff, there is also a paid service of wheelchair available in Rs 150, and Locker facility is available in mandir and they will give you complimentary 1 small packet of prashad",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Shree Ram Janmabhoomi Mandir",
      "rating": 4.7,
      "address": "Sai Nagar, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "Ram Janmabhoomi Temple in February The temple was inaugurated just a month ago in 2024, hence a large number of devotees are coming. For those coming after February 2024, I suggest that you come here after 5-6 months, then you will be able to get a better darshan, there is a lot of crowd here at this time.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I recently visited the Shri Ram Janmabhumi Temple🛕 in Ayodhya on 09/02/24 and had a profound experience witnessing Ram Lala. It's more than a sculpture; one can truly feel the divine presence of Lord Ram. Despite the bustling crowds in Ayodhya, the temple authorities showcased superb crowd management, making my visit hassle-free. While cameras aren't allowed inside, some guests managed to carry them after stringent security checks. If you believe in God, visiting this sacred place is a must to feel the divine aura of Lord Ram.\nजय श्री राम 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I can't express my feelings. There is a proper security and check up by sensor machine. So wonderful place. One must have to visit here Ram janm bhoomi.\nJay Shree Ram 🙏🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Jeevan dhany ho gaya\nI visited on 13th feburary in evening with family.\nGood attangements for smooth visit by lacs of devotees every day",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "An international museum will use new-age technology like kinetic art, holograms, animatronics and augmented artificial reality to provide a live experience of the Ramayana and the Ram Temple movement",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Pracheen shri Gore Ram Mandir ayodhya",
      "rating": 4.3,
      "address": "R654+74C, Theri Bazar, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "There is a best thing about this place is here every year celebrate saraswati puja ( BASANT PANCHMI )",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Khushi ka aangan\nLive in India proud of Indian",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Their expertise in hair styling and color is unmatched. The ambiance is welcoming, and I appreciate the convenience of their location. Highly recommend!",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "I like so much our class",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is believed that Shri ram attained jela samadhi in Sarayu river from this place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Shri Hanuman Garhi Mandir",
      "rating": 4.7,
      "address": "Sai Nagar, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "Visited Ayodhya Hanuman Garhi on a weekday in March, luckily we just made it as the queue was building in the morning, inspite of it, it took us nearly more than an hour to have darshan.\n\nSince the entrance & steps are narrow it's challenging for the authorities to ensure a smooth experience although the security personnel there try their best and keep telling people to not push or pull, however people's emotions are very high.\n\nSince the temple premises are very compact, having darshan & getting your prasad offered to Hanuman is tricky, one just has to go with the flow, however, the experience is worth it when you see Anjaneya. Jai Bajaranga Bali!\n\nBe prepared for queue & jostling, be careful of your valuables, keep min stuff on person.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is the first place where you should bow your head in Ayodhya and seek blessings and permissions of Lord Hanuman ji to further visit Ayodhya as per rituals ,one of the holiest place for Bajaranbali  bhakts, the place and temple is still under renovation and reconstruction phase",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Very good but a highly crowded temple. The crowd can push you very hard, this temple is not for physically weak ones. Keep water bottles with yourself especially during the day when the sun becomes intense. No proper stand or locker available for shoes and bags as of 30th March 2024. Your shoes and bags can be stolen from nearby prasad shops.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This is a very famous and sacred temple of lord Hanuman. The pilgrims who come to ayodhya also visit this place to do darshan of Hanuman jee. It's always crowded with the pilgrims. You may have to wait at least one hour to do the darshan of lord Hanuman.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple Hanuman Garhi Mandir in Ayodhya is a place of immense love and devotion, nestled in the heart of this ancient city. As you approach, you'll feel a sense of peace washing over you, as if Hanuman himself is embracing you with his divine presence.\n\nThe temple is dedicated to Lord Hanuman, the mighty monkey god known for his unwavering devotion to Lord Rama. As you enter the temple grounds, you'll be greeted by the soothing sounds of hymns and prayers, filling the air with a sense of tranquility.\n\nThe main shrine is a sight to behold, adorned with colorful decorations and beautiful carvings depicting scenes from the Ramayana, the epic tale of Lord Rama's adventures. The centerpiece is a magnificent idol of Hanumanji, standing tall and majestic, radiating love and strength.\n\nDevotees from all walks of life flock to this sacred place to seek blessings, offer prayers, and express their heartfelt devotion to Hanumanji. Whether it's lighting incense sticks, offering flowers, or simply bowing in reverence, every act is filled with love and faith.\n\nThe atmosphere inside the temple is electric with devotion, as devotees chant Hanuman Chalisa and sing bhajans in praise of the beloved deity. It's a place where the boundaries between the material world and the divine realm seem to blur, allowing devotees to connect deeply with Hanumanji's divine grace.\n\nVisiting Temple Hanuman Garhi Mandir is not just a religious experience; it's a journey of the soul, a chance to immerse oneself in the boundless love and devotion that permeates every corner of this sacred place.\n\nFollow for more @jh.rider_0610",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "अयोध्या राम मंदिर",
      "rating": 4.4,
      "address": "अयोध्या धाम मार्ग, R645+57G, भारतअयोध्या का मार्ग, कथा पार्क, Ram Katha Park, Ayodhya, Uttar Pradesh 271319, India",
      "reviews": [
        {
          "text": "The beauty of the temple cannot be described in words. It is beyond imagination.\nThe management is so good that even though there is rush but still you can easily do Darshan of Ramlala.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "This is the birthplace of Lord Ram. A beautiful huge temple has been built here. Darshan is very easy. Corridor is awesome.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very well organised first time I have seen that the facilities are more than public very high security Mobile are not allowed inside not any bag allowed for that you have free locker are outside of the temple",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A place of religious and historic importance. The staff dedicated to maintaining order in the temple are very helpful and respectful to the devotees. Currently the temple is under construction, yet the arrangement for darshan is flawless. Many snacks and meal options around the temple boundary. Cell phones and cameras are not allowed inside the temple. Free of cost Locker arrangement is present at all the entry points. There are shops just outside the same that also provide locker system. Devotees are allowed to enter the temple only in Indian ethnic attire, which is good and must needed.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Excellent experience. Fortune enough to have a chance for Darshan of Ram Lala",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Ram Sabha Mandir, Ayodhya",
      "rating": 4.3,
      "address": "Q6W3+47J, New Colony, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "The entire process of Darshan is so organized that you will never feel irritated as before. There is no money to spend anywhere, no one will try to take DAKHSINA (Money) of any kind from you. Thanks to the administration, they are so helpful",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Some things will definitely touch our hearts, \"JAI SREE RAM🚩\"",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "It is most Historical  place  of Bharat.(india)",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "V-good experience 13year of electrical engineering field",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Lord ram temple is incredible 😍",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    },
    {
      "name": "Naya Ghat",
      "rating": 4.5,
      "address": "Theri Bazar, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "This ghat is 2km from Ram mandir. There is not public transportation available from mandir to ghat and one have to walk till ghat.\nGhat was neat and clean. Lots of security guards are deployed for pilgrims safety.\nWater is not so deep and fast. Older and children can easily bath in water but still need to keep watch.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Throgh narrow roads guide driving ahead in bike took us to this ghat of saryu river in ayodhya. Car can b taken allmost upto steps. Nice , quiet clean place . Great view of saryu river. All sort of boating ...1200 for 1 hour round. 200 per head also is possible. Must negotiate. Take bath if u like .Can sit upto eternity.. known as Ram ghat also\n\n.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place has been developed beautifully for the devotees to take a dip in Saryu holy water.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Amazing place here. You can enjoy a lot and have a proper light show at evening.\nThe show begins at 6:30pm onwards. Hurry up guys you must have to visit here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Such a peaceful place. We visited during daytime as well as in the evening too.\nI would recommend having bath at the ghat atleast once. Moreover portable changing rooms are also available at the ghat.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Saryu Ghat",
      "rating": 4.6,
      "address": "R664+G97, Manjha Kala, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "The ghat has been developed very well, it's neat and clean. The highlights are the laser show, depiction of Ramayan and the musical fountain. However the crowd and the hawkers need to be regulated otherwise it will become messy and dirty.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "You can have a beautiful view of the  river Sarayu, the bridges, sunset and sunrise (depending on the season.) Take a dip in the shallow waters. Don't venture far away from the banks. Recent additions like Bhajans and laser shows ( late evening hours around 6.30 pm) are very good. The daily Aarthi is a big tourist attraction.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Sarayu Ghat: Where Serenity Meets Spiritual Splendor\n\nSarayu Ghat, nestled along the tranquil banks of the sacred Sarayu River in Ayodhya, is a timeless gem that epitomizes the essence of spirituality and serenity. Having had the privilege of visiting this revered ghat, I am compelled to share my enchanting experience.\n\nFrom the moment you set foot on the ancient steps leading down to the ghat, you are enveloped in a sense of peace and tranquility that transcends the ordinary. The gentle flow of the Sarayu River, the rustle of the breeze through the trees, and the distant echoes of devotional chants create an ambiance that is both soothing and spiritually uplifting.\n\nSarayu Ghat holds immense significance in Hindu mythology, particularly as the site where Lord Rama is believed to have embarked on his final journey to Vaikuntha, the abode of Lord Vishnu. The ghat serves as a focal point for pilgrims and devotees seeking to connect with the divine and pay homage to the revered hero of the epic Ramayana.\n\nOne of the highlights of Sarayu Ghat is the mesmerizing Ganga Aarti ceremony held every evening, where devotees gather to offer prayers and witness the spectacle of flickering lamps and rhythmic chants. The sight of the illuminated riverbanks, adorned with colorful decorations and reverberating with sacred hymns, is truly a sight to behold and an experience that touches the soul.\n\nBeyond its religious significance, Sarayu Ghat is also a place of introspection and contemplation. The serene surroundings provide the perfect backdrop for moments of quiet reflection and spiritual rejuvenation. Whether you're sitting by the riverbank, taking a leisurely boat ride, or simply soaking in the ethereal beauty of the ghat, every moment spent here is imbued with a sense of divine grace.\n\nThe cleanliness and upkeep of Sarayu Ghat are commendable, thanks to the efforts of the local authorities and dedicated volunteers. The well-maintained pathways, clean bathing ghats, and lush greenery contribute to the overall charm and allure of the place, ensuring a memorable and immersive experience for visitors.\n\nIn conclusion, Sarayu Ghat is not just a physical location; it's a sacred sanctuary where the mortal transcends into the realm of the divine. Whether you're a devout pilgrim seeking spiritual solace or a curious traveler in search of cultural enrichment, a visit to Sarayu Ghat is sure to leave a lasting impression on your heart and soul. Highly recommended for anyone seeking a glimpse of spiritual splendor amidst the ancient city of Ayodhya.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Saryu Ghat in Ayodhya offers a serene and spiritual experience along the banks of the sacred Saryu River. The picturesque setting, with ghats and temples, provides a peaceful atmosphere for reflection and prayer. Pilgrims and visitors can partake in boat rides.\n\nImmersing themselves in the cultural and religious significance of the place. The cleanliness and well-maintained surroundings enhance the overall experience, making Saryu Ghat a must-visit destination for those seeking tranquility in Ayodhya.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "You can enjoy a picturesque vista of the Sarayu River, bridges, and breathtaking sunsets and sunrises (depending on the season). You can also take a refreshing dip in the shallow waters.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Kanak Bhawan",
      "rating": 4.7,
      "address": "Q5XX+6M4, Tulsi Nagar, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "My recent visit to Kanak Bhawan in Ayodhya was a deeply enriching and spiritually uplifting experience, leaving an indelible mark on my soul.\n\nSacred Heritage:\nKanak Bhawan stands as a testament to Ayodhya's rich spiritual heritage. Dedicated to Lord Ram and Goddess Sita, this magnificent temple exudes an aura of divine grace and tranquility.\n\nArchitectural Splendor:\nThe architectural splendor of Kanak Bhawan is truly awe-inspiring. The temple's intricate carvings, vibrant murals, and ornate domes are a testament to the skill and craftsmanship of ancient artisans.\n\nDivine Atmosphere:\nUpon entering Kanak Bhawan, I was enveloped in a sense of peace and serenity. The atmosphere was charged with devotion, as devotees offered prayers and performed rituals in reverence to the divine couple.\n\nSacred Legends:\nThe walls of Kanak Bhawan are adorned with depictions of sacred legends from the Ramayana, bringing to life the timeless tales of Lord Ram's love and valor. Each mural serves as a reminder of the eternal bond between the divine pair.\n\nSpiritual Bliss:\nAs I immersed myself in the divine ambiance of Kanak Bhawan, I felt a profound sense of spiritual bliss wash over me. The purity of devotion that permeates the temple's surroundings is truly transformative.\n\nDevotee's Delight:\nFor devotees seeking solace and connection with the divine, Kanak Bhawan offers a sanctuary of solace and joy. The opportunity to offer prayers and seek blessings in such a sacred space is a privilege indeed.\n\nFinal Verdict:\nIn conclusion, Kanak Bhawan in Ayodhya is not just a temple; it is a sanctuary of beauty, devotion, and spiritual bliss. A visit to this hallowed abode is sure to leave a lasting impression on the hearts of all who seek divine grace and blessings.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "I recently visited Kanak Bhawan in Ayodhya, and the divine aura of this sacred place is truly incredible. The continuous chants and hymns create a profoundly devotional environment, providing a sense of peace of mind. It's a place where spirituality transcends, and the ambiance is serene. However, it's important to note that the Bhavan is closed from 12 to 1:00 pm. A visit during other times ensures an uninterrupted and spiritually enriching experience. Highly recommend for those seeking a tranquil and devotional retreat. 🙏",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Visiting Kanak Bhawan is highly recommended to everyone who steps in Ayodhya Dham. This place has a high spiritual aura and a devotional environment.\nKanak Bihaari prabhu bless all.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Kanak Bhawan Temple in Ayodhya is a sacred haven steeped in religious significance and architectural beauty. Dedicated to Lord Rama and Goddess Sita, this temple stands as a symbol of devotion and faith, drawing pilgrims and tourists alike to its sacred precincts.\n\nThe temple's architecture is a testament to the intricate craftsmanship of ancient India, with its stunning marble facade adorned with delicate carvings and intricate designs. The pristine white exterior contrasts beautifully with the vibrant colors of the surrounding landscape, creating a serene and peaceful ambiance.\n\nInside the temple, devotees are greeted by resplendent idols of Lord Rama and Goddess Sita, adorned with exquisite jewelry and offerings. The atmosphere is filled with the scent of incense and the sound of devotional hymns, evoking a sense of reverence and spiritual tranquility.\n\nOne of the most revered features of Kanak Bhawan Temple is its association with the legendary wedding of Lord Rama and Goddess Sita. The temple is believed to have been gifted to Sita by King Janaka, her father, as a wedding present, hence its name \"Kanak Bhawan,\" which translates to \"Golden House.\"\n\nVisitors to the temple can also explore its surrounding gardens, which are meticulously landscaped and offer a serene retreat from the hustle and bustle of everyday life. It's a perfect spot for contemplation and meditation, surrounded by the natural beauty of Ayodhya.\n\nOverall, a visit to Kanak Bhawan Temple is a deeply enriching and spiritually uplifting experience. Whether you're a devout pilgrim seeking blessings or a curious traveler exploring India's rich cultural heritage, this temple is sure to leave a lasting impression of peace and serenity.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "This place have a good environment to meditate and relax here goodness and calmness in the every corner every day here 🙏🏼 paryer and offering are made to goddess Sita 🚩  it's near bhi dashrath Mahal\nEvery person that visit Hanuman gadi mandir should also visit kanak bhawan mandir 🙏🏼",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ayodhya Junction Railway Station Tiraha",
      "rating": 4.5,
      "address": "Q6Q2+R5W, Professor's Colony, Ayodhya, Uttar Pradesh 224123, India",
      "reviews": [
        {
          "text": "Felt like I was at the airport. Super clean and well maintained. Heavy security. Bag check and scan. Good working escalators. Really impressed with everything around. Best railway junction I have seen so far…\n\nRam Mandir is 500 meter walking distance. A humble request to all the devotees to keep the station clean and not to throw plastic bottles, food disposals on the platform.\n\nJai Shri Ram | Jai Shri Ram ❤️❤️❤️❤️❤️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A Newly developed railway station. Now the trains are passing through Platform no. 1 and 2 only, whereas Ptf 3 and 4 work in progress.\n* Escalator is there for going down.\n* During the Return time you have to enter through Gate No. 8 and they will scan your bags.\n* A big hall is there where you can sit and wait for your train.\n\nJay Shree Ram 🙏",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This railway station feels like an airport.  Situated very near to Shree Ram Mandir Campus and have lots of facilities.\nMandir is 500 Mtrs approx can cover by walk. Locker facility is also available at station, you can keep the bags and roam freely as well.\nHumble request to all Indians and fellow Hindus, not to make dirty neither station nor Ayodhya. Hope you find this message in good state.\nJai shree ram",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Ayodhya is my home where if you all have got a chance, then come here and enjoy and have the darshan of our Ramlal and Hanuman Lala. Okay, you will feel that it is better not to leave from here.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "I AM WELCOME TO AYODHYA PUBLIC TO MY SHOP TANU COSMETIC COLLECTION I AM SELLING COSMETIC PRODUCTS AND CLOTHES FROM MY HOME YOU CAN SEARCH MY SHOP MY SHOP NAME IS TANU COSMETIC COLLECTION OTHER WISE EVERYONE CAN CONTACT ME ON MY INSTAGRAM MY INSTAGRAM ID IS SINDHI_HARSH_24",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    }
  ]
}