{
  "places_with_reviews": [
    {
      "name": "Oachira Parabrahma Temple",
      "rating": 4.7,
      "address": "Ochira Rd, Oachira, Kerala 690525, India",
      "reviews": [
        {
          "text": "A very sacred place with unique temple without any form . The tree and nature is worshiped as God . Very serene atmosphere with greenery and water ponds . The priests do not create any hassle. the visitors are very quite and calm. Very ancient temple situated in Kollam , Kerala",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Almighty God is worshipped here, no temple no deity. All are welcome here irrespective of cast and creed. Zoom the photo and see a man with a cap. An excellent example of communal harmony.\nProud to be from Oachira.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "It's a calm, beautiful, and spacious place. It's also close to nature, has free food, and lots of parking.\nTripadvisor reviewer: This is a Shiva Shetram, but there's no temple. The place is calming and serene.\nSarath: This place has a great parking lot and serves free food for devotees.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The Oachira Temple is a truly unique and spiritually significant destination in Kerala, India. Nestled in the serene village of Oachira, this temple is unlike any other in the region. What sets it apart is the absence of a traditional temple structure, idols, or even a roof. Instead, it is an open-air sanctum where nature and divinity blend seamlessly.\nVisiting Oachira Temple is a serene and contemplative experience. The temple is dedicated to the Universal Consciousness, and visitors can witness the sacred Padanilam, a granite pathway symbolizing the feet of the Divine, surrounded by lush greenery and a tranquil pond. Devotees and tourists alike come here to meditate, find inner peace, and connect with the divine in a natural setting.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Temple is located in ochira ,A small town with full facilities. Gives peace to all devotees. Strange atmosphere unlike other temples in kerala.",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Ochira Temple Pond",
      "rating": 4.6,
      "address": "4GP6+43P, Oachira, Kerala 690533, India",
      "reviews": [
        {
          "text": "The Ochira temple is located on the border of Kollam and Alapuzha district on national highway 47 .\n\nThe temple is very unique as it practises worship without an idol, and reveres the supreme force of Nature. Unlike other temples, Oachira temple does not have any covered structure and people worship the Parabrahmam under the trees.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pond maintained very well.\nLot of lotus in this pond.\nGood",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very historic place. Also famous Ochira kali is in this pond. That inside the ochira Prabrhama temple. Peaceful atmosphere. Locted ochira Prabrhama temple. Easily identify normal traffic. Good parking facility",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Anyone can visit here . This is the place where lord Shiva belongs",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A beautiful temple. It’s not a temple actually just a tree but the atmosphere is so nice and positive.",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Valiazheekal Beach Kayamkulam",
      "rating": 4.4,
      "address": "Valiazheekal, Kerala 690535, India",
      "reviews": [
        {
          "text": "The place has changed a lot from my last visit which was 4 yrs before. Lots of eateries available in the food joints alongside the shore. Warm waters and less windy even after 6 pm makes it more enjoyable for the kids.\nJust loved the vibe.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "\"The Beach offer a stunning backdrop for evenings spent with family and friends. The Valizhikkal Bridge stands as the longest bow string bridge in South india, providing a breathtaking view of the beach, where the sea and river converge. Additionally, the pentagon-shaped lighthouse adds to the charm of the scenery, making it a truly wonderful sight to behold.\"",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "Very nice small beach.Visit the lighthouse here. It will give you a good viewpoint of the whole beach and the sea from an appealing angle.",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "If you're looking for a wonderful place to spend some time with your loved ones in the evenings, I know just the spot! This place is perfect for chilling out and having a great time together. And the best part is, it's not usually too crowded, so you can sit back, relax, and enjoy some peaceful moments with your favorite people. So what are you waiting for? Come on over and let's have some fun!",
          "languageCode": "en",
          "rating": 4.4
        },
        {
          "text": "A good time spending place at evening. Speed boat and light house are also very interesting.",
          "languageCode": "en",
          "rating": 4.4
        }
      ]
    },
    {
      "name": "Azheekal Beach",
      "rating": 4.5,
      "address": "Azheekkal, Oachira, Azheekal, Kerala 690547, India",
      "reviews": [
        {
          "text": "Beautiful small beach with stunning view of the newly built bowstring bridge and the light house.\n\nSpacious Pay and park available on the way to the beach.\n\nVerity of snacking options available at nice small food shacks and shops run by the warm welcoming locals.\n\nYou can enjoy a calm breezy sunset.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Azheekal beach is a must visit place with good vibes. beach food is awesome people are awesome peaceful, and safe for family and beautiful places. Kite flying is also a good vibe in this beach",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is a very cool beach. You can come with family or friends. A perfect place to enjoy the evenings, the view from the top of the lighthouse is a cool experience.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its a beautiful beach, It was an exquisite paradise that left an indelible mark on my soul. As I strolled along the shore, I was immediately captivated by the sheer beauty of the place. The soft, powdery black sand felt like a cushion beneath my feet, inviting me to kick off my shoes and embrace the ultimate sensation of freedom.. best experience🏖️🛟🏝️",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "A very good place to vibe many activities are available there like horse riding camel  riding quad bike riding and many more and there are so many things to eat also. In my opinion it's a very good place to vibe",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Pentagon Lighthouse , Valiyazheekkal",
      "rating": 4.6,
      "address": "Valiazheekal, Kerala 690535, India",
      "reviews": [
        {
          "text": "Good view point ...you can see the beauty of beach ,bridge .must visit here.ticket is there 20rs/- per head. Car parking available.left available.12 floor .evening time is best. 10 am to 6pm.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Spectacular views from here. A must visit. Sunsets from here are just WOW 🤩🤩. You can get a great view of the beach, the breakwater and the bridge.\n\nFew points:-\n\n° You have to take tickets there. The timing I believe is around 1000 hrs to 1800 hr.\n\n° The weekends would be crowded and particularly in the evening hours.\n\n°There are stairs as well as lifts available.\n\n° Avoid loose clothing like dupatta etc as evenings tend to get strong winds, which might cause you unnecessary inconvenience.\n\n° Don't try to climb the restricted areas as it could be highly dangerous.\n\n° There is a public washroom and locker facility.\n\nIf you are planning to visit the beach, you should definitely take this experience.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "During my recent visit to the lighthouse, I was delighted by the experience. The ambiance was simply wonderful, creating a peaceful and relaxed atmosphere. I went on a weekend, and there was no rush, allowing me to enjoy the calm and refreshing view. If you're looking for a tranquil spot with a beautiful view, this lighthouse is a must-visit!",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Enjoyed the 360 degree view of the beach Valiyazheekkal bridge and the surroundings.. The lift facility is there to reach the top... only 20/- per head.. worth visiting and spending time.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Pentagon lighthouse situated near Valiazheekal beach. Newly constructed bridge allowing to reach light house from oachira town. An exemplary view from the top. Kids will enjoy and evening visit will be  preferable. During weekend and public holiday little bit busy. Private Paid parking is available but little bit costly. Entry fee is 10 rs for adults and less than 5 years free",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Devikulangara Temple, Puthuppally",
      "rating": 4.6,
      "address": "4FXW+448, Puthuppally, Kerala 690502, India",
      "reviews": [
        {
          "text": "A devi temple with a great ambiance. A big parking space available infront of the temple. But you should be carey on parking beneath the big tree shades infront of the temple as there is chance of branches and twigs falling on your car An auditorium also available nearby. A clean well maintained temple pond adds glory to the temple.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good temple beautiful place",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "🙏",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Such a divine calming and blessed place i suggest. The goddess here is Bhadra Devi along with other Devas. The place is so peaceful and the festival season starts at April. kuthira kettukazcha is famous here. The temple is filled with positivity and takes you to a calm and positive mind.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Associated with this temple since I was a child. My family members starting from my grandpa to everyone have contributed a lot  for the functioning of this temple. There is a sitting place dedicated to my grandfather whose name was chellapan pillai",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Varanappallil Temple",
      "rating": 4.5,
      "address": "5F4P+W3R, Pularichanda Alumpeedika Rd, Puthuppally, Kerala 690502, India",
      "reviews": [
        {
          "text": "This temple is one of the most famous in onattukara. Also it is famous that Guru sree narayana study centre of University college, kannadi predima is also build by Sree narayan guru here. This temple also famous related to Kayamkulam koocbunni.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Shree Narayana Guru studied here, historical place, Siva Temple, very beautiful and charming village with beautiful trees and architecture.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Varanappallil temple is located in Puthuppalli, Kayamkulam. The place is very beautiful, filled with green paddy fields and coconut trees. The feeling of nature is amazing.\nSree Narayana guru completed his higher education here. Some old wooden building, near to the temples are also very attractive.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very old family temple maintained by Varanapally family members and devotees from the locality. Sree Narayana Gurudevan had visited and stayed here during his early years for education.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Varanapally Tharavadu is believed to be one of the places where Sree Narayana Guru stayed and completed his higher education. It holds historical and cultural significance as a place connected to the life and teachings of Sree Narayana Guru.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Parayakadavu Thanal Beach",
      "rating": 4.2,
      "address": "Parayakadavu, 3FQP+59J, Alappadu Road, Alappad, Vallikavu, Kerala 690546, India",
      "reviews": [
        {
          "text": "If you're a beach lover then this place will definitely hit your spirits. Clean, no nonsense place for just coming and relaxing, meditating etc. A part of the beach belongs to Amritapuri coz of which you will always find friendly people around.\n\nOne of the good beaches in India.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Awesome and clean beach.\nVery pleasent and calm",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A peaceful and serene environment all around and the sound of waves are so absorbing. The beach lacks light unlike other famous beaches which is why I liked this place. There are not many stalls and so its pretty empty and so lacks the hustle and bustle and thus very relaxing.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "A calm place for you to relax. There is no longer a safe and proper way for you to wash your feet in the sea, because the entire sea bed border has been filled with big rocks. But still, it is a pretty cool place to be, if you had a bad day. Students of Amrita College see this place more or less like a travel destination.😂",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "This is a private beach and we can see the difference there.\nEvery place is clean and neat.Anybody can sit there and meditate such a peaceful place with black sand all over.This is a black beach for keralites.Rocks are put on to the sea,we can walk over there and we can enjoy the sunset 😊 such a nice beach.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Vallikavu Devi Temple",
      "rating": 4.7,
      "address": "Vallikavu-Oachira road Road, Clappana, 3FVW+65J, Vallikavu, Kerala 690525, India",
      "reviews": [
        {
          "text": "Great temple under RSS...Festival photos",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "\"Don't judge a book by its cover\" is the only thing that comes to my mind while describing this temple. The deities here are divine. More than the holiness of it, the trees inside here will really mesmerize you and you will be shocked to see the majesty of them",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Beautiful temple",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Great temple with everyday pooja starting from early morning to night.Peaceful atmosphere inside temple gives calmness to mind. Nearby sacred groves and ponds are well preserved.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Clam and peaceful environment.... Priest are very pious... Rest it's god's grace",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Clappana Juma Masjid",
      "rating": 4.3,
      "address": "4F5W+GF9, Vallikkavu, Clappana, Kerala 690546, India",
      "reviews": [
        {
          "text": "The jumamasjid is hundreds of years old and was renovated several years ago. The woodwork of the old mosque is very beautiful. Very beautiful place, beautiful masjid all this is the specialty of the small village of clappana. There are many ways to reach this mosque on Ochira Vallikavu Road. Kannan pally road can also be reached at the jumamasjidh.\n\nThe famous ancient houses of pally kizhak Kannanpally  muri , Mukkadayil and Cheruthara,Perur, eravi mangal,  karipuram are  Located in clappana village. They were the ones who maintained this mosque in the early days. Since there is a lot of paddy land, they are the ones who provide food to the masjid . In the old days.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Good peoples",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Famous mosque in clappana. Nice and calm place to pray.",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "MY FAVORITE PLACE",
          "languageCode": "en",
          "rating": 4.3
        },
        {
          "text": "Juma masjid, calm and quiet divine place",
          "languageCode": "en",
          "rating": 4.3
        }
      ]
    }
  ]
}