{
  "places_with_reviews": [
    {
      "name": "Adoni Fort",
      "rating": 4.2,
      "address": "Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "It is an excellent experience to visit both Dargah Hazrat SYED THAHER SHA QADRI r.a. and the Ranamandala temple on the hill .",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "There is nothing to mention about this place as all it has are the ruins and remains of Adoni fort.No proper maintainence by the authorities.Filled with alcohol bottles,plastic and filthy waste all around.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Excellent place to explore yourself",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Historic place in ruins , lush green surroundings in the monsoon are a treat to experience...",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Place of historic importance however what remains is the ruins and dry barren. not maintained like a tourist place.govt can develop it as a tourist place.",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Ranamandala Anjaneya Swamy Temple- Adoni",
      "rating": 4.8,
      "address": "J7WF+MJX, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Ranamandala Anjaneya Swamy Temple in Adoni is a revered site dedicated to Lord Hanuman. Known for its spiritual ambiance and distinctive architecture, the temple draws devotees seeking blessings and a peaceful space for prayer and reflection, contributing significantly to Adoni's religious landscape.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Super place to visit, u have shelter to rest on the way to top of the hill. Senior citizens can also attempt as the steps are suitable for their climb. Vehicle can be parked near the arch from wr step starts.\nMay your wishes come true after ur visit!",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "A must visit pilgrimage destination in Adoni. One can reach the temple via Yellamma Konda road and take steps the reach the shrine on top of the hill. The view from the Hilltop is mesmerising and perfectly picturesque. The temple has great historical importance and is very powerful.  Devotees from neighbouring villages also visit the temple during Shravana Maasa. The main deity doesn't have a roof overhead. The Anjaneya Swamy murti is 6feet tall and is covered by sindhur.There are small temples of Ayyappa, Rama, Lakshmana, sit a and Shiva on the hilltop.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "One of the best places to visit if you are a lord Hanuman devotee.. The lord the journey and the surrounding will give much needed boost to your mind... Peaceful, beautiful and devotional place located in Adoni.",
          "languageCode": "en",
          "rating": 4.8
        },
        {
          "text": "Must visit in the early morning open air with family and friends. Hanuman lord blessing ❤️",
          "languageCode": "en",
          "rating": 4.8
        }
      ]
    },
    {
      "name": "Sri Mahayogi Lakshmammavva Temple",
      "rating": 4.7,
      "address": "J7GF+CGC, near to Linga and Bam Bam jewellers, Havanapet, Shakthi Gudi, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "This Devi is powerful we worship heartedly.Avva lived decades back. This temple located in schroff bazar and near 2vegitable market",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "A remarkable sacred place where all the desires get fulfilled",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "Good temple in Adoni, Andhrapradesh. Every one can must visit once in a life.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "The peaceful atmosphere inside the temple and divine aura of Lakshmamma avva makes one visit the temple again n again.The temple is clean and well maintained by the authority.This place is situated in heart of Adoni in busy market.",
          "languageCode": "en",
          "rating": 4.7
        },
        {
          "text": "One of the famous temple in adoni. Heaven and peace blessed with lakshmavva devi 🙏❤️",
          "languageCode": "en",
          "rating": 4.7
        }
      ]
    },
    {
      "name": "Urukunda Eranna Swamy Katta",
      "rating": 4.2,
      "address": "J7FC+VPF, LB Street Rd, Havanapet, Old Town, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Mukunda Eranna Swami\nIf you want to visit Swami, Swami is located here in Urukunda Village, Kauthalam Mandal, Kurnool District, Andhra Pradesh.\nPeople come from different states to visit Swami, so everyone should visit and be well\n\nOm Namo, Narayana Lakshmi Narasimha Swamy Temple",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Had a good Darshan. Suggestion to temple management to facilitate comfort to piligrims during summer. No need to put a long line in hot sun when there is no season, provide parking facility.",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Nice temple",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good place peace full place",
          "languageCode": "en",
          "rating": 4.2
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": 4.2
        }
      ]
    },
    {
      "name": "Shahi Jamia Masjid - شاہی جامع مسجد",
      "rating": 4.6,
      "address": "shahi jamia masjid, PN Rd, Old Town, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "This place I visited on 4/Apr/2022(Roja ramjan time)when I went inside the masjid every one is busy in cleaning and sweeping,\nIn praying hall on top sealing paintings and crafting of walls are good, freely praying hall capacity is around 500 devotees.when iam watching the masjid interrior suddenly one of the person came and asked my name(I told my name),after knowing my name he  asked me to leave the namaz place in polite manner(I asked why),he indicated his for head( it's because I didn't wear any cap),and he suggested that those who pray namaz should enter to prayer hall.then I understand the situation and left the masjid quitly with disappointment and took some of the pictures from outside\n\nMost importantly walls of the masjid out side looks like walls of old temples.\nwhen you entering into masjid on left side I saw some of the pillers resembles hindu temple pillers ,when I went into the structure i saw hiden doors and closed wall back side of the structure.\nThat structure alloted to storing some old utensils\nMost shoking thing is when I try to go inside temple like  structure, some of the workers' restricted me to go to inside the structure.\n(i concluded that this place is not visitable for all relegion and cast,if you want to visit go by walk ,no place for parking and walking)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It is the oldest mosque in Adoni (AP) and one of the most beautiful masjid which is very unique in style with very good architecture truely well maintained.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "This place Shahi Jamia masjid since 1667 in era of hazarth Aurangazeb radiallahu anhu and it is built by siddi Masood khan sab beautiful architecture, more over first imamat is sarkar Taher sha khadri rehmatula alaih which was rested in out of town' - Taher sha khadri dargah way(ranmandala konda road) thankful for these companions for Adoni pride and peaceful\nMostly proud to be Muslim Ummah (Sunni) this is our SHAAN",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Amazing architecture and well maintained place of worship. Visited during the year 2012.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "One Of the Most Beautiful mosque in Adoni\n#Historical mosque Constructed by Siddiq masood Kha",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Sri Yellamma Avva Temple",
      "rating": 4.5,
      "address": "M73J+QG6, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "The temple of EKAVEERA MATHA, LORD PARASHURAAMA 's mother RENUKA YELLAMMA.\n\nVery powerful dity in Hindu mythology, treated as Avatar of GODESSES PARVATHI & her husband JAMADAGNI as LORD SHIVA.\n\nAnd son PARASHURAAMA as AVATARA of LORD VISHNU. Trinity in one family.\n\nLORD PARASHURAAMA is an disciple of GURU DATTATREYA, who is an TRINITY himself in an single person.\n\nLORD PARASHURAAMA is because he is one of the SAPTA CHIRANJIVI, who will live little the beginning of the next KALPA.\n\nHe will be the master of KALKI, the forthcoming DASHA AVATAR.\n\nAs per the SHALIVAHANA SHAKA ERA in 1976 LORD PARUSHU RAAMA will find KALKI.\n\nJAI GURU DATTATREYA MAHARAJ JI KI.",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This is privileged place to visit and once in a year in July month huge number people of vist here and we can find trains from guntakallu junction",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "This place is with good atmosphere and temple....Lots of people are visited during weekends",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "It is famous temple in adoni,it is placed in hill area,we can experience good with nature",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "One of famous temple in Adoni.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Amba Bhavani Temple",
      "rating": 4.6,
      "address": "J7MF+9PJ, Amba Bhavani Pet, Marati street, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Super nice temple This is a marriage special temple",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "No separate review needed, It is my home town and been visited temple many times for major ocassion. Jai Bhavani",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "No words to describe the beauty and glory of this old magnificent temple.The main deity Amba Bhavani accompanied by Shiva, Ganesha, Rukmini sametha Panduranga, Jiveshwara Maharaj Dattatreya, Ram Lakshmana Sita with Hanuman, Garuda,Navagraha and Krishna makes this a spiritually special place. Located in the Forest area of Adoni town, this temple has great significance for Swakula Sali community.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Good and peaceful place to deities",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "It's a beautiful place where goddess Tuljabhavani  recieves Poojas, Abhishek etc....",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "41 feet Hanuman statue",
      "rating": 4.6,
      "address": "Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Hanuman statue gives a good attraction to adoni. It is located little far away from town. Still, people come here and worship hanuman ji.\n\nThey have developed little park just beside the temple. Children can spend some quality time here.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Hanuman statue gives a good attraction to adoni. It is located little far away from town. Still, people come here and worship hanuman ji..🙏..🚩",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Bajrang Bali\nStatue stands tall and can be noticed from far.. has become an attraction.\nSmall childern play area (+)\nLittle plantation (+)\nBeside the road (+)\nParking may be problem in future (-)\nSurrounding maintenance less (-)",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Nice Hanuman Statue. Caught our attention to capture shots.",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "That place amazing..big statue of Hanuman (temple ) when i ever i go my village..i  visit that place",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    },
    {
      "name": "Raja Rajeshwari Temple.",
      "rating": 4.5,
      "address": "J7P9+G22, Unnamed Road, T.G.L.K.Nagar, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Ts best temple.. very famous....nd Kalyana mandapam .... function hall..also hear... very peaceful..nd always good.. positive.. energy....\nJAI MATA...DI...",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Very powerful temple in this area and besides the temple marriage function hall also is there but root from the main rod very difficult to reach this place",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Its a good place for devotees and for every Full moon day there is bajana in temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "very good peaceful temple",
          "languageCode": "en",
          "rating": 4.5
        },
        {
          "text": "Nice Temple very cool place.",
          "languageCode": "en",
          "rating": 4.5
        }
      ]
    },
    {
      "name": "Jamia Masjid Ahle Hadees Ghodkar (Markaz)",
      "rating": 4.6,
      "address": "near post office, Bharpet, Aranjyothi Nagar, Adoni, Andhra Pradesh 518301, India",
      "reviews": [
        {
          "text": "Not idea",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Very Good Mosque",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "A majid adoni ki shan hai aur a majid. 350+ years of old majid",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Peace full place for all belivers",
          "languageCode": "en",
          "rating": 4.6
        },
        {
          "text": "Prayer Namaz place Mosque",
          "languageCode": "en",
          "rating": 4.6
        }
      ]
    }
  ]
}