{
    "places_with_reviews": [
        {
            "name": "Shri Kapileshwar Swamy Temple",
            "rating": 4.7,
            "address": "VG28+Q99, Kaplieshwar Rd, Shastri Nagar, Shahapur, Belagavi, Karnataka 590001, India",
            "reviews": [
                {
                    "text": "Kapileshwar Devasthan is a beautiful Shiv mandir located in Belgavi. As we were passing through that area, we went there for quick 5 minutes to seek blessings and ended up being there for over an hour.\n\nThe temple premises is extremely clean and well maintained. The Shiva lingam here is self incarnated and temple is believed to be built sometime in 1000 AD. It is also referred to at the inscription in Kamal Basadi located in Belgavi fort. This place is also called as Dakshin Kashi and it is believed that the 12 Jyotirlingam Darshan Yatra is incomplete unless you start it from here.\n\nThe temple is adorned with beautiful murals and psintings from puranas. Also there are small temples of other deities as well. A must visit place to seek Bhagwan Shiv's blessing while in Belgavi.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Believed to be one of the oldest and most revered temples of Chennai, Kapaleeswarar Temple is a shrine of Lord Shiva. In the temple, the wife of Lord Shiva, Goddess Parvati is worshipped in the incarnation of Goddess Karpagambal. She is believed to be the 'Goddess of the Wish-Yielding Tree'. Built in the 7th century AD by Pallavas and was destroyed by Portuguese..",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "One of the oldest Shiva temple in Belgaum. Also Ganpati काळभैरव देवी temples  inthe complex parking available. Shiva thrath kunda along temple complex.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Peace ☮️\nLord shiva temple\nAnd also 3D wall paint work and statue of shiva life …",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "I'm from north India and I have visited this place countless times. I still remember the first time when I visited this divine temple and the positive energy which I got inside the temple is still with me.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "adorned beautiful dakshin hour deities ad incomplete quick devasthan basadi shiva inscription small kapileshwar extremely darshan premises kamal fort belgavi blessings believed minutes passing shiv built also maintained located referred called must unless psintings murals mandir went temple area ended sometime kashi blessing temples bhagwan shivs jyotirlingam self well yatra lingam visit clean seek puranas incarnated start",
                "revered worshipped karpagambal wife portuguese parvati ad destroyed lord shiva century th wishyielding tree pallavas chennai oldest built believed temple kapaleeswarar incarnation temples one is shrine goddess",
                "kunda temples thrath one belgaum ganpati along temple complex available parking oldest also inthe shiva",
                "peace wall statue paint work temple life lord shiva also",
                "countless north visited remember im india inside times first temple got divine positive time energy still"
            ]
        },
        {
            "name": "Sri Kalavathi Devi Temple",
            "rating": 4.7,
            "address": "734, Angol Main Rd, Hindu Nagar, Angol, Belagavi, Karnataka 590006, India",
            "reviews": [
                {
                    "text": "Neat and clean. Vibrations felt. Self imposed discipline, cleanliness. Atmosphere charged with devotion. Visitor transforms to goodness in life.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Wonderful abode for peace of mind. Just forget the Universe and you will be part of it. Great experience. ,",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This place is a meditative place . They have maintained the place years . A sense of tranquility is experienced without spending a penny.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "A place where devotees worship Kalavathi Aai. It is their main temple situated in Belgavi. Disciplines are maintained over here and you should once visit over here.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Peaceful place. Do take a bottle with you if you want to carry back teertha",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "atmosphere imposed felt self charged visitor goodness vibrations cleanliness discipline clean transforms life devotion neat",
                "peace forget abode experience wonderful part mind great universe",
                "maintained tranquility sense years meditative experienced spending without penny",
                "belgavi maintained kalavathi worship aai situated temple disciplines visit main devotees",
                "take carry want teertha back peaceful bottle"
            ]
        },
        {
            "name": "Kamal Basadi - Belagavi",
            "rating": 4.6,
            "address": "VG5C+6H4, Belgaum Fort Area, Belagavi, Karnataka 590001, India",
            "reviews": [
                {
                    "text": "Kamal Basadi is an ancient Jain temple in Belgavi fort area. It has stone structure in the shape of lotus at the temple ceiling, hence the name.\nIt's usually open during the day. It very well maintained and one feels calm upon visiting it. We loved our early morning visit.\nNote: As this is a religious place, please respect people's sentiments, wear appropriate clothings and maintain decorum of the place.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beautiful historically loaded place. Well maintained neat & clean premises. Lot of open space & lawn is available outside to relax. Plenty of parking space is available. Situated inside Belagavi fort. Auto available to this place. Appeal to the visitors is that please do not litter inside the premises. You take a walk along the compound wall (time ~1hr). Architecture of the temple is astounding & marvelous.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beautiful 10th century Jain monument in a serene surrounding. Marvelous granite construction. Makes one wonder how the artisans carved such intricate and smooth pillars without modern technology at that time.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "It is a Jain temple carved out of stone. A must see for architecture and history enthusiasts. Ramkrishna Mission Ashram is just besides this place, so you can cover 2 places on a single road.\n\nAs for the place, it is surprizingly bleak. It looked like a place where people come to read paper, or watch FB stories loudly. The interior of stone temple so pleasant and cold, but the exterior is mangled by the humans. There is so much intricate stone work, but you need to know your history to admire it. But if a person like me can be amused, then the experts are going to go gaga over this place. But, there is interference there as well. At one place, I saw ghastly blue doors (which are normally seen on toilets) added to temple architecture. It frankly looked hideous. This place made me sad.\n\nIf you ask me, you can avoid visiting. If you are a tourist like me, it is fine if you don't go here.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very peaceful temple complex.. a 20 min stopover is worth here.. lord neminath's statue is calming..\nThe lotus style temple makes for some peaceful sitting place and a great photo location..\nIt's a small structure.. the guard was very helpful in telling us about the history etc.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "feels day name calm wear loved decorum shape usually basadi respect open kamal fort religious please belgavi upon maintained jain lotus visiting clothings ceiling temple appropriate area ancient sentiments one hence well morning early maintain visit stone note peoples structure",
                "lawn relax loaded space along beautiful inside historically time compound hr belagavi premises open fort please architecture visitors parking marvelous maintained situated temple outside litter walk neat auto appeal wall take well available plenty clean lot astounding",
                "artisans beautiful time intricate without century th carved monument marvelous serene jain technology modern smooth granite makes one pillars wonder construction surrounding",
                "people gaga cover interference come dont ashram interior exterior blue ramkrishna amused ghastly watch bleak intricate hideous sad ask admire single history work besides architecture carved see read saw must frankly paper stories jain humans surprizingly pleasant added need visiting tourist temple fb made mission road avoid normally cold one mangled doors loudly much know going well toilets places person looked stone like fine enthusiasts go experts seen",
                "style guard sitting complex stopover helpful lord neminaths small great statue calming history us worth lotus photo temple telling makes location etc min peaceful structure"
            ]
        },
        {
            "name": "Military Shri Mahadeva Shiva Temple",
            "rating": 4.5,
            "address": "Congress Road (NH- 4A, Hirekodi, Velguem, Camp, Belagavi, Karnataka 590001, India",
            "reviews": [
                {
                    "text": "It was a heartwarming experience visiting this place. To be honest it is one of the best place to spend time with family specially along with the kids. This place is well maintained and clean,sunsets are beautiful here .",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This spiritual and devotional place dedicated to Lord Mahadev is managed by the Maratha Life Infantry, showcasing military discipline. Visitors can explore a small zoo featuring deer, emus, rabbits, and other animals, as well as a children's park for kids. Additionally, the site offers views of many forts associated with Shivaji Maharaj.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Best place in Belgaum for sure.. Very calm and nice environment..",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Welll maintained shiv temple. Has beautiful garden and playground. Has beautiful Statue of Chhatrapati Shivaji Maharaj. Also there is replica of different forts in Maharashtra.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Military Shri Mahadeva Temple Best Place In Belagavi, Children's Park & Mini Zoo Include",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "honest heartwarming one maintained best along cleansunsets experience visiting well beautiful kids spend family time specially",
                "rabbits emus many animals additionally offers devotional dedicated forts lord small managed kids views spiritual shivaji mahadev site visitors associated infantry explore discipline showcasing featuring maharaj zoo park well childrens military maratha deer life",
                "belgaum best calm environment sure nice",
                "playground garden maintained statue maharaj different beautiful maharashtra chhatrapati temple welll shivaji forts also replica shiv",
                "best park zoo belagavi mahadeva temple childrens military shri mini include"
            ]
        },
        {
            "name": "ISKCON BELAGAVI",
            "rating": 4.8,
            "address": "211, Srila Prabhupada Marg, Shukrawar Peth Rd, Shivaji Colony, Tilakwadi, Belagavi, Karnataka 590006, India",
            "reviews": [
                {
                    "text": "Iskon temple is the best place for peace and divinity. You will find real happiness in this temple. Must visit place for all age group 5/5",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "ISKCON Belgav is the oldest and a very beautiful temple I visit it every time whenever I come to belgav, a must visit place for the devotees.\nThe kirtan ,Bhajan and pravachan timings vary from time to time but basically it is on sunday from 12:30 pm to 2:30 pm followed by mahaprasadum.\n🌺हरे कृष्ण🌺",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A very beautiful and serene ISKCON temple located in Tilakwadi area of Belgaum.\nThe temple is big, accommodates 500-800 people at a time, with peaceful ambience, rustic interiors. Many dioramas, paintings depicting Lord Krishnas pastimes are also present inside.\n\nThe main deities are Sri Sri Radha Gokulananda, Sri Jagannath Baladev Subhadra and Sri Sri Gaur Nitai. Everyday, many aratis are performed beginning at 4:30 AM in the morning. The best thing about ISKCON temples is how beautifully they decorate the deities with clothes, ornaments and fresh flowers!\n\nMany programs are held in the temple, everyday there are discourses on Scriptures like Srimad Bhagavatam, Bhagavad Gita and so on. festivals like Janmashtami, Ram Navmi etc are celebrated in big scale. On every Sunday there is a special feast for general public and everyone can attend it for free, and they also serve free lunch prasadam after the discourse. They have a special program in the temple on every Ekadashi too.\n\nThey also have various other projects like food for life, a Gurukul and Goshala, book distribution marathons and much more. IYF (ISKCON Youth Forum) is quite active too.\nThe temple also has a dedicated restaurant called 'Govindas', just a little ahead. Also, a gift shop called 'Matchless Gifts' has been started where you can get everything spiritual - from books to murtis, incense, Arati items, eatables, paintings and clothes.\n\nAmple of parking space available too, doubt if there is an wheelchair arrangement but the staff can assist in any such situations too. 0\nA must visit temple for some peace of mind and improving spiritual life",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The ISKCON temple is a wonderful spiritual haven, offering a serene atmosphere for devotees. The deities exude divine energy, creating a profound experience. The caring and welcoming devotees enhance the sense of community, making the visit truly uplifting. The Govindas at the temple serve delicious prasadam, and the added bonus of free Sunday feast prasadam makes it a delightful place to seek blessings and immerse in spiritual bliss.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Hare Krishna, peace of life and we'll maintain a place. Congested for four wheeler, physically challenged people will get issue to climb the steps, for senior citizens they have chairs to sit",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "peace divinity find best happiness temple group visit iskon age must real",
                "beautiful come pravachan whenever time followed every pm vary oldest mahaprasadum bhajan must sunday temple basically belgav iskcon timings kirtan visit devotees",
                "ample free radha gokulananda ram lord ambience public doubt mind gurukul srimad situations food serene wheelchair peace located goshala paintings bhagavad youth arati started incense improving aratis lunch peaceful main eatables people sri festivals beautiful everything various active held assist beginning book gaur krishnas everyday everyone fresh ahead every attend nitai called sunday jagannath celebrated arrangement temple gift area depicting iskcon belgaum iyf projects baladev ekadashi visit scriptures shop best gifts many general space restaurant big special deities time dedicated subhadra clothes interiors must govindas navmi performed ornaments temples beautifully feast discourses distribution morning dioramas like prasadam little matchless inside forum staff janmashtami decorate serve rustic accommodates scale present items murtis spiritual parking quite gita also marathons tilakwadi discourse books thing get flowers pastimes bhagavatam etc much program available life programs",
                "free experience delightful immerse divine deities caring offering profound serve spiritual welcoming creating truly energy blessings serene community govindas sunday added wonderful temple exude iskcon makes enhance feast making atmosphere uplifting bliss delicious sense visit seek prasadam bonus devotees",
                "people congested hare issue physically challenged krishna steps peace climb wheeler citizens senior get four well maintain chairs sit life"
            ]
        },
        {
            "name": "Shri Paramartha Niketana",
            "rating": 4.7,
            "address": "Shriharimandir, 734, Angol Main Rd, Bhagya Nagar, Angol, Belagavi, Karnataka 590006, India",
            "reviews": [
                {
                    "text": "This Holy Shrine of ParamPujya Shri.Kalavati Aai in Angol, Belgao is where one can easily feel the divine presence. Anyone practicing Meditation can easily understand the value of this place.\nThere are 3 daily Nitya Upakram of Daily Prayers held at this Shrine that one must attend to understand the Culture better. Dedicated to devotion of God's via Bhajans written by many Hindu Saints and learning from their teachings is one of the temples many principles.\nChanting of the Mantra *Om Namah Shivay* is practiced in the premises beyond which one is barred from talking or making loud noises. The sanctity of this place is Heavenly and thus this must be experienced by all whenever possible.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "It's very holy place good for upasana",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "I am very fortune to have Kalavati Aai as my guru , My 3 days stay over here was best experience in d life. It's a life changing event for me. If you believe in the principals of Aai a must place to visit. A truly divine place.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Peace.. spiritual.. recommended to visit everyone",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Salutations to Kalavati Amma, her thoughts are very intriguing and mesmerizing.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "shivay om talking many practicing saints teachings thus bhajans principles angol divine held dedicated nitya prayers loud whenever possible beyond written presence anyone premises holy attend learning mantra chanting barred must belgao via aai daily experienced gods sanctity namah hindu meditation better temples one value parampujya making heavenly understand practiced upakram feel shrine devotion culture noises shrikalavati easily",
                "upasana holy good",
                "kalavati stay best aai experience changing principals must guru visit event truly divine life fortune days believe",
                "peace everyone spiritual visit recommended",
                "salutations kalavati intriguing thoughts mesmerizing amma"
            ]
        },
        {
            "name": "Shri Hindalaga Ganapati Temple",
            "rating": 4.6,
            "address": "Hindalaga road ganesh temples banjara colony, 1st Cross, Camp, Belagavi, Karnataka 591108, India",
            "reviews": [
                {
                    "text": "An absolutely divine experience at Hindalga Ganesh Temple! The ambiance is serene and spiritually uplifting, creating a peaceful atmosphere for prayers and reflection. The temple’s mesmerizing idol of Lord Ganesh is truly captivating. Moreover, the temple premises boast a spacious park with playing items for children, making it an ideal destination for families. The presence of this park adds an extra dimension of joy and relaxation to the visit, allowing families to enjoy quality time together in a serene environment. Whether seeking solace, admiring the beauty of the temple, or enjoying family time in the park, Hindalga Ganesh Temple is a must-visit destination in Belgaum. Highly recommended for its spiritual significance, tranquil surroundings, and family-friendly amenities.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Ganapati Bappa Morya ❤️♾️\nThis is the Most Famous Ganapati Temple in Belagavi. here it's last Night View of the Temple.\nDo Visit in Morning For Bappa Darshan & in Night U will Full Peace here.\nThis has Kid Friendly Gardens n All\nYou can take Family here n Kids also Here.\nFeeling Blessed when I came Here.\nTake Bless Of God To get Purity of a Blessings.\nMust Visit Once in Weekend",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "This Ganpati mandir is quite well maintained  as it is taken care by the army personnel. The mandir has beautiful infrastructure. Also, there is a huge garden/park space for spending you weekends with your kids or have leisure time. One can have a great  soothing time here. There is a separate parking space available across the road. Overall, a lovely temple to pay your visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice temple with garden. Lots of things for children to play. All are free of cost. You can take food from home n have there under trees.4 water ponds are there.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "This is really nice temple....ganesh temple.\nPeace and really very nice place to spend with family.as it has garden with it.\n\nYou can visit here with the food (for lunch) with family and can have enjoyment as well as gods blessing.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "ganesh significance admiring experience s dimension captivating tranquil surroundings destination divine time prayers solace lord idol quality environment presence joy premises hindalga items ideal adds relaxation spiritual creating truly serene extra familyfriendly beauty whether boast ambiance families temple spacious together reflection family highly mesmerizing enjoy seeking mustvisit enjoying recommended playing amenities spiritually making uplifting atmosphere moreover park belgaum children visit peaceful allowing absolutely",
                "last kid u n ganapati full god friendly bappa belagavi darshan kids came view feeling blessings weekend must also peace gardens famous morya temple family night get purity bless take morning visit blessed",
                "army space beautiful infrastructure time lovely great kids pay taken care parking quite also maintained leisure personnel soothing gardenpark mandir temple road weekends separate across spending ganpati one well huge available overall visit",
                "garden cost home take free water trees temple children lots ponds play food things n nice",
                "peace garden enjoyment really blessing well familyas temple visit spend food lunch templeganesh family gods nice"
            ]
        },
        {
            "name": "Sharqat Park",
            "rating": 4.2,
            "address": "P 112/1, Queens Garden Rd, Laxmi Tek, Camp, Belagavi, Karnataka 590001, India",
            "reviews": [
                {
                    "text": "It's a beautiful park with various swings and other gaming equipment for children to play and walking tracks for adults to stay fit. Beautiful fountains, cascade waterfalls, water streams with wooden bridges are also part of Sharquat Park.Hence, many people can be seen coming during mornings and evenings for walks. There is no entry fee. Park timings are 6am to 9pm . The Park commemorates the heroic act of 114 maharattas, who sacrificed their life to capture the heights of Sharquat which is in Iraq now. One can park their 2 wheeler or 4 wheeler at the road side.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Such a beautiful and small park made in the memory of warriors of Maratha LIRC who fought world war and conquered the heights of sharquat in Iraq. This park is made for commemorating those warriors. Well maintained and the greenery is good for a fresh walk. There is a small kids play area too.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Really Wonderful garden for keep calm and manage stress. Fully green and silent place. Love to go with kids and families.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "The place is so clean.The air is so fresh.Kids have many games over there.clean and neat rest rooms.No food facilities available.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Nice garden. It is dedicated in memory of the battle of sharqat. There is one artillary gun on display which was used in battle field by Indian army.",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "fountains people act stay many beautiful swings various wooden adults sharquat gaming heroic parkhence water bridges side heights tracks entry pm also sacrificed commemorates evenings equipment waterfalls coming streams iraq wheeler road fee capture walking one maharattas fit park timings children part play cascade life mornings walks seen",
                "beautiful greenery commemorating sharquat small memory fresh kids heights war fought maintained conquered iraq made area walk warriors lirc world park well good maratha play",
                "silent garden really calm love wonderful green go kids families keep fully manage stress",
                "games roomsno many cleanthe facilities rest available freshkids air thereclean food neat",
                "battle garden gun one army sharqat memory artillary display used dedicated indian field nice"
            ]
        },
        {
            "name": "Kolhapur Circle Belgaum",
            "rating": 4.3,
            "address": "VGG7+VQ5, Kolhapur Circle, Ayodhya Nagar, Sadashiv Nagar, Belagavi, Karnataka 590010, India",
            "reviews": [
                {
                    "text": "This place is popularly known as Kolhapur circle. But recently it has been renamed as Krishnadevaraya Circle Belgaum. Way towards states to  Maharashtra and Andra Pradesh. And towards taluka to Chikodi and Athani.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Busy area during weekdays",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Beautiful circle",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Nice place",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "popularly known athani belgaum maharashtra kolhapur andra states pradesh renamed circle towards recently chikodi taluka krishnadevaraya way",
                "busy area weekdays",
                "beautiful circle",
                "good",
                "nice"
            ]
        },
        {
            "name": "Ramakrishna Mission Ashrama (Belagavi Kote)",
            "rating": 4.7,
            "address": "Fort Rd, Fort Area, Belagavi, Karnataka 590016, India",
            "reviews": [
                {
                    "text": "Divine location. Very peaceful and calm. One can pray here for hours with out getting disturbed. More over, there is a small garden with rose and marigold plants with full of blooms",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Quaint and Peaceful place. A space where Swami Vivekananda stayed for a few days.\n\nThe large mediation hall. The cosy stay place which is now an exhibition gallery of Swami Vivekananda.. and the campus is beautiful..",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "If peace of mind is needed through spiritual knowledge visit this place.spiritual Books, programmes and workshops for the youth will provide proper guidance and decision making power\n\nVery artistically designed complex. Calm and quiet and the statue of Swami Vivekanand, the pictures depicting events from his life are impressive.\nVery clean restrooms are provided for the visitors.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Calm and peaceful area. Home where Swami Vivekanand stays there for 9 days. There is one mediation centre. Also there is one book shop as well which includes all Hinduism, Mediation and Ramkrishna Mission related books.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This is located within Belgaum fort premises and maintained by the Indian Military. Loved visiting the place. Swami Vivekananda is said to have stayed in one of the houses within Belgaum Fort for some time and land was granted by the Karnataka Government to the Mission for constructing an ashram.  There is a meditation hall where you can meditate, buy books at a book stall or read them there.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "location disturbed one garden full calm plants pray getting hours rose divine blooms peaceful marigold small",
                "quaint hall stay cosy space exhibition beautiful campus vivekananda mediation stayed large gallery peaceful days swami",
                "restrooms provide calm decision complex impressive provided pictures knowledge swami events needed statue artistically quiet mind spiritual visitors peace books youth workshops depicting proper making vivekanand guidance visit clean power placespiritual life programmes designed",
                "calm includes ramkrishna book swami related mediation home hinduism also centre books area mission days one vivekanand well stays peaceful shop",
                "government houses ashram loved land time karnataka book swami vivekananda premises within stayed stall fort constructing read maintained located visiting said books mission indian meditate meditation hall one belgaum granted military buy"
            ]
        }
    ]
}