{
    "places_with_reviews": [
        {
            "name": "Shree Sant Dnyaneshwar Maharaj Samadhi Mandir, Alandi",
            "rating": 4.7,
            "address": "MVGW+QMW, Bhosale Nagar, Alandi, Gaon, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Shree Sain Dnyaneshwar Maharaj Alandi exudes a serene spiritual ambiance. The sacred atmosphere, coupled with the historical significance, makes it a profound pilgrimage destination. The temple's architecture and surroundings enhance the overall spiritual experience, inviting devotees to connect with the divine in a tranquil setting",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Good place to visit. Currently temple is bit crowded due to recent “Ekadashi”. On normal day you can complete your Darshan in 10-15 min.\n\nTemple area is good. But the area which is near river need to maintain.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Sant Dnyaneshwar Maharaj Samadhi in Alandi, Maharashtra, is a spiritually significant and tranquil place. The simple yet spiritually charged architecture provides a serene retreat for devotees. Pilgrims visit to pay respects to the revered saint, seeking solace and spiritual connection. Surrounded by peaceful landscapes, the Samadhi offers a harmonious environment for introspection and prayer. A visit here is not just a religious experience but also an exploration of Maharashtra's cultural and spiritual heritage.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "⭐⭐⭐⭐⭐\n\nAnandi in Devachi Alandi is truly a gem nestled just 25 km away from Pune. Stepping into this sacred site feels like entering a realm of tranquility and spirituality. The ambiance is serene, with the aura of divinity palpable in every corner.\n\nThe highlight of Anandi is undoubtedly the samadhi and temple dedicated to the revered saint-poet Dnyaneshwar. As a devotee, being in the presence of such sacred relics and the spiritual energy they exude is profoundly moving. It's awe-inspiring to contemplate the legacy of Dnyaneshwar and his monumental contribution to literature through the Dnyaneshwari, the Marathi translation of the Bhagavad Gita.\n\nMoreover, the historical significance of this site, dating back to the 13th century, adds an extra layer of reverence. The architecture and ambiance transport you to a bygone era, allowing for a deeper connection with the rich cultural heritage of Maharashtra.\n\nOverall, Anandi in Devachi Alandi is not just a place; it's an experience—a sanctuary where one can find solace, introspection, and a profound sense of spirituality. I highly recommend this destination to anyone seeking peace and enlightenment in Maharashtra.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This temple is divine and you will have a spiritual experience. The view inside the temple is awesome. It's always a crowded place because so many devotees visit this temple.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "significance experience surroundings tranquil destination divine setting profound spiritual architecture dnyaneshwar inviting serene shree alandi ambiance makes temples enhance sacred maharaj atmosphere connect coupled sain overall exudes pilgrimage historical devotees",
                "day normal near currently complete darshan bit crowded recent need temple area river due good min maintain visit ekadashi",
                "revered retreat experience respects connection tranquil offers exploration solace saint environment sant harmonious maharashtra samadhi simple introspection pay spiritual maharashtras yet architecture provides religious dnyaneshwar serene also alandi charged cultural seeking surrounded prayer landscapes spiritually maharaj significant pilgrims visit peaceful heritage devotees",
                "significance nestled km profoundly rich architecture site serene moving peace ambiance bhagavad exude devotee moreover sense overall historical find aweinspiring connection destination solace century divinity introspection every truly back dnyaneshwar devachi extra bygone corner legacy gem temple anandi seeking layer contribution dnyaneshwari era one monumental heritage highlight relics spirituality revered experience deeper dedicated profound th maharashtra palpable samadhi anyone energy entering alandi a highly sacred undoubtedly like recommend feels translation reverence presence tranquility saintpoet realm adds transport spiritual dating sanctuary gita cultural literature away aura marathi pune enlightenment stepping contemplate allowing",
                "awesome always many experience inside temple spiritual visit divine crowded view devotees"
            ]
        },
        {
            "name": "Shree Gajanan Maharaj Sansthan",
            "rating": 4.8,
            "address": "MVCQ+WJP, Branch of Shri Gajanan Maharaj Sansthan - Shegaon. Located on Moshi Road, Devachi, Dehu - Alandi Rd, Tapkir Nagar, Alandi, Dehu, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "The Gajanan Maharaj Temple in Alandi is a divine sanctuary, offering a serene and spiritually enriching experience. The temple's beautiful architecture and well-maintained surroundings reflect deep reverence for Gajanan Maharaj. Climbing 112 steps to reach the top, visitors are welcomed by positive vibes and a clean, tranquil environment.\n\nThe temple serves as a place of prayer, meditation, and relaxation, providing a beautiful and serene atmosphere. Despite limited parking, the spacious and clean surroundings make it a perfect destination for a spiritual retreat. The canteen offers delicious snacks, enhancing the overall experience. For devotees seeking accommodation, rooms are available, adding to the convenience.\n\nGajanan Maharaj Temple stands out as a must-visit gem in Alandi, offering not just a place of worship but a picturesque and peaceful setting for those in search of spiritual solace. The road-touch accessibility makes it easily accessible, making it an attractive destination for devotees and photographers alike.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "I'm recently visited Shree Sant Gajanan Maharaj Temple Alandi. This temple is so beautiful and having peaceful environment. Really Beautiful Architecture and Facilities for Devotees are also Good. Must visit place. Gives Calmness and peace to mind. The staff is very good and there is available drinking water and a restroom facility. You can stay here as long as you want.\n\nThe temple also provides delicious food (Prasad), and there is a Dhyan Kendra for meditation. Parking available outside temple area. 1Km away from Sant Dnyaneshwar Maharaj Temple. Calm place with such a positive energy.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Very beautiful and huge architecture. Rooms are available which under control of the trust.\nThe thing makes this place unique is this located on small hill top.\nThe \"Murti's\" of Gajanan Maharaj, Dnyaneshwar Maharaj, Tukaram maharaj are fabulous beautiful.\nThey are maintained cleaning very well.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The only best place in alandi ... With a beautiful and calm temple. The surrounding here has a positive atmosphere and one feels quiet stress free here.\nThe rooms are available here for the stay. For rooms you have to wait for 2-4 hrs and  the rooms are preety descent and good. Outside the temple there are various street food and dine in restaurants options at a very affordable rates.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Here is a Gajanan Maharaj temple.Best place to visit. Very calm and peaceful place.The view of the temple is very attractive and beautiful. Also a good place for Meditation ,Readers, Writers. It is  located at Dudulgaon 👉Moshi to Alandi road. Once Visit.....",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "retreat surroundings reach offering setting environment architecture visitors serene despite search top mustvisit prayer atmosphere alike serves overall peaceful devotees accommodation beautiful offers destination welcomed solace providing relaxation climbing snacks deep gem temple gajanan adding attractive seeking making experience tranquil roadtouch divine steps reflect alandi make positive accessible convenience wellmaintained temples spiritually maharaj worship delicious photographers clean vibes accessibility reverence stands canteen enhancing perfect spiritual sanctuary parking enriching spacious picturesque meditation makes available rooms limited easily",
                "visited stay calm beautiful gives staff km prasad drinking environment sant im facilities restroom water mind want kendra architecture provides food parking dnyaneshwar energy must also alandi shree peace dhyan temple gajanan outside area positive away meditation really maharaj delicious good available visit calmness facility peaceful recently long devotees",
                "beautiful fabulous control small trust murtis architecture dnyaneshwar maintained located tukaram gajanan unique top thing hill makes maharaj well huge available cleaning rooms",
                "feels wait stay best calm free descent beautiful various options quiet food alandi rates temple preety outside affordable positive restaurants stress dine hrs one atmosphere good available street rooms surrounding",
                "calm beautiful writers placethe view also alandi located moshi temple gajanan dudulgaon road attractive meditation maharaj readers good visit peaceful templebest"
            ]
        },
        {
            "name": "Shirdi Saibaba Mandir Alandi Pune",
            "rating": 4.7,
            "address": "Alandi Rd, Laxmi-Narayan Nagar, Wadmukhwadi, Charholi Budruk, Pune, Pimpri-Chinchwad, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "OM SAI RAM 😊❤️🥰..Must visit with family and experience the serenity and divinity.\n\ncleanliness is maintained throughout the campus and sign boards are displayed.\nEasy accessibility for all age groups. 🚩",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Very calm and soothing temple. Very nice organised. Great darshan of saibaba. Gets blessed with the love. Careful for parking and footware.\nCar parking is tricky as roads are small.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This place is really good. They have changed the whole look of the mandir. I had visited this place before COVID. But now it's completely changed, they have made it more beautiful. As the traffic is increasing on this road they now do not allow to keep vehicles along this road, although people on foot can still use the old entry. They have made big entry gate on the other side along with shops. They have created ashta Vinayak ganpati small mandirs, Ram Lakshman Sita mandir, Vitthal Rukmini mandir, within Sai Baba mandir. They made the whole Mandir very grand and it's looks very beautiful.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This temple is located on Alandi Road. There is no ample space for parking your four wheeler however there is limited space to park your bike. This temple is very reachable by public transport like buses or rikshaw or taxi. Along with Sai baba this area has various other temples of other gods like Shiv, Ganesh, Ram, Datta and others.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "An oasis of serenity for family outings! Shree [Temple Name] offers a peaceful retreat with its diverse temples within the expansive premises. The paid thali (150/-)is a delightful addition, completing the culinary experience alongside the divine prasad.\n\nWhile some sections are undergoing construction, it doesn't overshadow the tranquility. A must-visit for those seeking spiritual solace and a family-friendly atmosphere. Kudos to the staff for maintaining the sanctity of the place. 🕊️🙏",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "sai experience serenity ram campus divinity groups must maintained boards displayed family age throughout cleanliness visit easy accessibility om sign",
                "footware organised calm tricky soothing darshan love roads temple careful gets parking car blessed nice small saibaba great",
                "people grand visited along sai beautiful allow vinayak sita big rukmini keep ram gate mandirs small use changed lakshman whole baba within side entry foot old ashta looks vehicles created shops mandir traffic look vitthal made road still really ganpati covid although good completely increasing",
                "ganesh along ample space sai various bike ram reachable baba public transport parking shiv alandi located temple wheeler area road gods however rikshaw four temples buses park others taxi datta like limited",
                "name retreat experience peaceful offers staff completing serenity delightful divine prasad thali solace oasis tranquility premises within spiritual overshadow kudos sections shree familyfriendly culinary temple alongside outings diverse family undergoing seeking addition mustvisit temples paid atmosphere doesnt expansive maintaining sanctity construction"
            ]
        },
        {
            "name": "Shree Sant Jnaneshwar Maharaj Sanjeevan Samadhi Mandir",
            "rating": 4.7,
            "address": "Mahadwar Chowk, Main Road, Alandi Devachi, Tal, Alandi, Khed taluka, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Go with a pure and clean mind. Yes, the crowd is too much, and the line will be long, but have patience. If you have devotion, it will be clear and simple. I recommend going on weekdays and going early. However, buying something from street vendors nearby is very costly, so bring your prasad from home. It's a very good experience. The place is calm, yet not calm, amid the chaos of the queues.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Devachi Alandi, meaning god’s place, is situated 25 km from Pune, and was built in the 13th century. There is a samadhi and a temple dedicated to the saint-poet Dnyaneshwar here. The saint-poet wrote the Dnyaneshwari, the Marathi translation of the Bhagavad Gita. There are several other temples in Alandi including the Vitthal-Rakhumai temple, Ram temple, Krishna temple and Muktai temple. Pilgrims carry the Palkhi from Alandi to Pandharpur in the month of Ashadh (June/July). There is also a wall from which saint Dnyaneshwar is said to have flown to meet Chandev, the mystical yogi-turned saint. The Indrayani river charts a course through this small but peaceful town, and is considered sacred by the residents. It is on the banks of this river that the samadhi of the poet rests.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This the place where Shree Sant Dnyaneshwar Maharaj took samadhi (total self-collectedness) which means the highest state of mental concentration that people can achieve while still bound to the body.\nIt's a very popular place for the \"Warkari Community\" people in Maharashtra which belongs to the devotees of Vittal & Rakhumai.\nYou feels positive energy and peace there.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Shree Sant Dnyaneshwar Maharaj Sanjeevan Samadhi Mandir is located in Alandi in Maharashtra state on the bank of river Indrayani. It is 22km away from Pune by road. Gnyneshwar was Hindu, Marathi saint of 13th century. He undertook Samadhi at Alandi in 1296.  Since than this place became holy & spritual pilgrimage and people visit this temple from all-over Bharat for darshan and to offer their prayer to the saint. Gnyaneshwar was a saint, poet, philosopher and Yogi of Nath and Varkari tradition. He wrote Dnyaneshwari and Amrutanubhav in Marathi. I had opportunity to visit the temple in December, 2023 with my son. Blissful environment and presence of divine in the temple gave me an unique feeling. When all devotees chanting..\nहरे कृष्ण हरे कृष्ण, कृष्ण कृष्ण हरे हरे\nहरे राम हरे राम राम राम हरे हरे ll\nthis made an atmosphere of pure divinity in the temple. It was great experience for me and my son. You must visit this secred place in the life time.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "It's the Temple of Sant Dnyaneshwar Maharaj aka Dnyaneshwar Vitthalpant Kulkarni. He had written Spiritual books and also did lot of things that spread awareness among people along with Spirituality. He was very Clever at very less age . Must place to visit. This place gives peace to mind and gives energy.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "calm experience prasad line pure vendors amid bring simple mind crowd yet home something costly yes queues go chaos patience however nearby weekdays much going early clear buying good street clean recommend devotion long",
                "translation residents s km including krishna dedicated yogiturned ram small century th junejuly saintpoet carry saint god flown samadhi chandev palkhi mystical rests poet dnyaneshwar devachi built indrayani gita also alandi course bhagavad said situated temple muktai charts ashadh river considered temples dnyaneshwari wall sacred town meaning marathi pilgrims pune several vitthalrakhumai pandharpur month meet banks peaceful wrote",
                "people feels highest means popular rakhumai took achieve bound sant warkari samadhi maharashtra concentration dnyaneshwar vittal total energy community shree peace positive still mental maharaj state selfcollectedness body belongs devotees",
                "people blissful opportunity experience december tradition undertook gnyaneshwar km divine became time bharat pure century great divinity saint th environment presence sant maharashtra samadhi darshan gave holy pilgrimage poet dnyaneshwar spritual feeling bank indrayani shree philosopher alandi chanting must located secred mandir temple made river road unique hindu allover nath offer prayer away amrutanubhav dnyaneshwari maharaj state atmosphere sanjeevan marathi pune gnyneshwar varkari visit yogi life since wrote son devotees",
                "people spirituality along gives among kulkarni written awareness sant mind spiritual things dnyaneshwar energy vitthalpant must also peace books temple spread age maharaj clever aka visit less lot"
            ]
        },
        {
            "name": "Wagheshwar maharaj temple",
            "rating": 4.8,
            "address": "MW34+9JW Wagheshwar Temple, Gaon, Wagholi, Charholi Budruk, Pune, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "A nice hill top temple. An early morning visit is recommended. There is ample space for parking. Local dhabas are there down the hill for refreshments. Nice place to have peace of mind.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Sunday 1 pm To 4:30 pm temple is closed for cleaning.The main pujari here is rude, he was speaking rudely even after informing one of the person with us is paralyzed and can't wear full pant. Still he kept on speaking rudely. Temple is nice.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A beautiful temple dedicated to Bhagwan Shiva located on the top of a small hill at Charoli Bd., Pune, is believed to have been built in the 18th century.The temple is built using solid black stone, which creates a vibration inside the temple. I felt the vibration when I started chanting Om Namah Shivaay. The energy of the temple is unexplainable, so Devine's architecture is so beautiful.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Very huge area on the hill also cleaned & well maintained place.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "PEACEFULL PLACE ..! OM NAMAH SHIVAY ❤️\nONE OF THE FAMOUS TEMPLE IN CHARHOLI PARKING IS AVAILABLE,SCENERY👌,",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "hill peace ample space morning local early temple mind visit dhabas refreshments parking top recommended nice",
                "closed pujari rudely wear cant nice full informing pant pm us speaking paralyzed cleaningthe sunday temple still one rude even person main kept",
                "beautiful inside devines black creates dedicated small shiva th centurythe using vibration architecture charoli solid built believed chanting energy unexplainable located temple namah top bd started hill bhagwan shivaay felt pune stone om",
                "hill maintained well huge area cleaned also",
                "parking one shivay peacefull famous availablescenery temple charholi namah om"
            ]
        },
        {
            "name": "Jalaram Mandir - Alandi Pune",
            "rating": 4.8,
            "address": "MWG2+Q82 Santoshi Mata Mandir, Alandi, Pune, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Very Peaceful Darshan.. Got Parking easily inside the premises..",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Very neat clean and peaceful place of worship of 'Jalaram Bapa'\nVery good facility of staying overnight for devotees\nNo one goes empty stomach from bapa's mandir",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "I have been visiting this sacred place since decades now. The temple is also popular as \"Shri.Santoshimata temple\" amongst the locals. There are beautiful idols of other Gods and Goddess. The temple management provides free food and accommodation to the visitors but the rooms and dining area needs to be more clean and staff bit more courteous. Parking lot is very small.\nThe temple management also undertakes number of social activities and donations to the mandal are given tax benefits U/S 80 G of the income tax act.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Sukoon.. Very peaceful place and you can have delicious prasaad (Lunch/Dinner) which is available daily for everyone. (Free of cost)",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The Jalaram Temple in Alandi is created in memory of Sant Jalaram bapa of Virpur village in Gujarat. It has been created by Jalaram Bapa devotees from Mumbai and Pune. It has a nice mandir that celebrates all festivals including Jalaram Jayanti annually. In addition to Jalaram , there are idols of Ram, Sita, Mataji, Ganesh and Shiv bhagwan. There is prasad available for devotees every day. People can offer donations for multiple charitable causes. It is a nice weekend getaway. Do visit and enjoy the peaceful village environment",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "inside darshan premises got parking peaceful easily",
                "one jalaram goes worship staying bapas mandir good bapa empty clean facility overnight stomach peaceful neat devotees",
                "act social free accommodation beautiful popular g staff decades donations since small number amongst undertakes tax locals bit dining provides food visitors courteous parking given us also visiting temple benefits area gods management sacred idols needs shrisantoshimata mandal rooms clean activities income goddess lot",
                "cost sukoon lunchdinner delicious daily everyone free prasaad available peaceful",
                "people ganesh day festivals village sita gujarat including prasad donations ram charitable nice mumbai jayanti environment sant memory every virpur celebrates weekend shiv alandi created mandir mataji temple bapa enjoy annually addition offer getaway bhagwan jalaram idols causes pune available multiple visit peaceful devotees"
            ]
        },
        {
            "name": "Shri Gajanan Maharaj Mandir, Alandi",
            "rating": 4.7,
            "address": "MVCQ+H8F, Tapkir Nagar, Dehu Phata, Pimpri-Chinchwad, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Really nice place for the Gajanan Maharaj Bhakts.\n\nIt has very positive vibe the moment you enter. You can see the mandir straight on the top of the hill with a long walkway surrounded by multiple bakt niwas along the way. It clean through and through. Also it had no shops selling flowers and Prasad, which was a welcome change.\n\nMandir itself has three levels. On the first level you have the Abhishek and Denagi Kaksh, on the level above that you have Dhyan, Jap and Parayan Kaksh (here they had volunteers continuously monitoring and making sure that there was absolute silence) and the level above that is the Mandir.\n\nThe entire place is well kept with lawns, plants and flowers all around. Most of the places had carpets on the floor to protect from the daytime heat.\n\nParking is an issue here since it is right on the road and the reserved parking is only for bhakt niwas and not for daily visitors.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Shri Gajanan Maharaj Mandir is a serene and spiritually enriching place that left a lasting impression on me. The calm atmosphere and the beautiful sculptures adorning the temple created an ambiance of tranquility and devotion. One should definitely visit this place to experience its spiritual essence. I was fortunate to attend the 7 pm aarti, and it was a truly uplifting experience, filled with divine chants and positive energy. The devotees' devotion and the melodious sounds of the aarti created a sense of peace and serenity. The temple provides a wonderful opportunity to connect with spirituality and find solace. I highly recommend visiting the Shri Gajanan Maharaj Mandir for a soulful and memorable experience.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "When I miss home (Vidarbha) most time I visit this place, it gives me a home town Fill ( Mini Shegaon)🙏❣️ गण गण गणात बोते 🙏",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Well maintained, calm & beautiful mandir.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Most beautiful temple located in alandi pune , very clean and positive atmosphere in temple, architecture of temple is amazing",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "kaksh absolute along walkway volunteers issue bakt continuously niwas prasad moment nice kept three vibe heat plants first sure change abhishek entire levels parking right monitoring visitors see way also dhyan parayan floor welcome denagi shops daily jap mandir daytime gajanan around positive road top surrounded bhakt selling hill silence flowers really making maharaj reserved enter straight well bhakts level places carpets multiple protect clean since lawns long",
                "find lasting spirituality calm opportunity beautiful experience fortunate melodious serenity divine solace aarti chants soulful tranquility left sculptures spiritual attend pm truly sounds provides energy serene peace filled created enriching ambiance visiting mandir wonderful temple gajanan positive definitely highly essence one spiritually maharaj atmosphere adorning uplifting connect sense impression memorable visit shri recommend devotion devotees",
                "home shegaon town fill vidarbha gives visit mini time miss",
                "maintained calm beautiful well mandir",
                "alandi located amazing atmosphere beautiful temple pune architecture clean positive"
            ]
        },
        {
            "name": "Moshi chowk",
            "rating": 4.3,
            "address": "MRGX+MXH, Moshi Gaon, Moshi, Pimpri-Chinchwad, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Ok",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": ",❤️😍",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Most beautiful 😍",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Padmaram Kumawat",
                    "languageCode": "en-US",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "ok",
                "",
                "good",
                "beautiful",
                "padmaram kumawat"
            ]
        },
        {
            "name": "Dnyaneshwari Mandir",
            "rating": 4.6,
            "address": "MVHR+8VM, Gopalpura, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Shree Dnyaneshwari Temple is a very beautiful temple. The entire Dhnaneshwari chapters are engraved on the marble floor on the walls. Various idols of nine Naths, Shiva, Vishnu, Vitthal, Dnyaneshwar, Tukaram, Balaji, Hanuman and Navagraha are installed below. The temple is very beautiful and amazing.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "New Construction going on of Dnyaneshwar Maharaj Mandir.\nWhole Dnyaneshwari is Enscripted on Walls of Temple.\nA Beautiful peace of Art and Serene place to Visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "So beautiful So aligant Just looking like wow 😍🤩",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\nGatha Mandir is a beautiful temple located near the Dnyaneshwar Samadhi Mandir in Apegaon, Maharashtra. It is dedicated to Sant Dnyaneshwar, a revered saint and poet of the Bhakti movement. The temple holds immense significance for devotees who seek to connect with Sant Dnyaneshwar's divine wisdom.\n\nGatha Mandir is adorned with intricate carvings and architectural beauty, creating a serene and spiritual atmosphere. Inside the temple, one can find sacred scriptures and sculptures depicting the life and teachings of Sant Dnyaneshwar. Devotees visit the temple to pay homage, seek blessings, and immerse themselves in the peaceful ambiance.\n\nSurrounded by the enchanting landscape near the Dnyaneshwar Samadhi Mandir and located in close proximity to the beautiful Indrayani River, Gatha Mandir offers a perfect blend of natural beauty and spiritual serenity. It is a must-visit place for those seeking solace, inspiration, and a deeper connection with Sant Dnyaneshwar's teachings.\n🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Best spiritual temple",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "naths amazing installed beautiful marble hanuman various balaji shiva vishnu entire chapters dnyaneshwar shree walls floor navagraha temple tukaram vitthal dnyaneshwari idols engraved dhnaneshwari nine",
                "peace whole dnyaneshwari maharaj serene going beautiful new mandir temple visit dnyaneshwar art enscripted construction walls",
                "beautiful looking wow aligant like",
                "bhakti find significance adorned revered natural life beautiful apegaon near inside teachings homage peaceful offers serenity immerse deeper divine connection dedicated architectural solace inspiration intricate saint wisdom sant maharashtra samadhi sculptures spiritual pay close poet creating enchanting perfect dnyaneshwars dnyaneshwar blessings serene indrayani beauty located ambiance proximity mandir temple gatha river depicting seeking surrounded mustvisit immense one sacred connect atmosphere carvings movement landscape blend visit seek scriptures holds devotees",
                "spiritual best temple"
            ]
        },
        {
            "name": "Nageshwar Mandir Temple",
            "rating": 4.5,
            "address": "Pune - Nashik Highway, MRCX+3CP, Bhim Nagar, Moshi, Pimpri-Chinchwad, Maharashtra 412105, India",
            "reviews": [
                {
                    "text": "Best mahadev temple in moshi, I visited various times. Really a peaceful place highly recommended to visit",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Shree Nageshwar temple is one of the largest temple in Moshi area, pimpri Chinchwad Pune.  This Shiva temple is a famous temple in Maharashtra. It is also considered to be one of the jyotirling in India. The mythology says that the MahaNaga or Mahasarpa which have the nag mani is said to leave it's mani in this place hence the Nageswar name. There is big grand festival happens here annually at Shivratri which lasts for 3 days around Shivratri. I am attaching here photos of the festival at Shivratri. If you are in Pune it is a must visit place if you like to explore religious places in and around Pune.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Visited during my long trip from Rajkot with friends. This is one of total 12 Jyotirling. Meditation inside premises makes you feel  peace. A long statue of God shiva makes it a must place to visit. It falls beside one of our four Dham names  #Dwarkadhish.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Nageshwar maharaj temple is an important place in Moshi. People is Moshi village are have a great devotion. There is a big event organised every year at the temple.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Great ride and pleasant experience.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "visited really best times moshi temple various mahadev visit highly peaceful recommended",
                "grand nag festival name photos big happens shivratri shiva nageswar india maharashtra largest religious mahanaga shree also nageshwar must famous mani said moshi temple leave says around explore area pimpri considered attaching mythology lasts annually days chinchwad one hence mahasarpa places pune visit like jyotirling",
                "rajkot visited inside shiva beside statue god premises friends total must peace dham trip meditation makes four one dwarkadhish falls feel visit names jyotirling long",
                "people maharaj organised moshi temple village big every year great devotion event important nageshwar",
                "ride experience pleasant great"
            ]
        }
    ]
}