{
    "places_with_reviews": [
        {
            "name": "Gandhi Ghat",
            "rating": 4.3,
            "address": "Cantonment, Barrackpore, Barrackpur Cantonment, West Bengal 700120, India",
            "reviews": [
                {
                    "text": "Good place to day out. But the main Gandhi Ghat right now is lots of terms and conditions. The picture is prohibited. U may restrict sitting over there. U can't touch the Ganges.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Not a picnic place. You can just visit it for a tour or hike. No Entry fee required, it's a free public place. Police are also there, so beware, don't throw trash here and there. They will fine you. If you want a full view of the Ganga River, it would be the best place. If you visit Jawahar Kunj Park, do visit here too, it's just beside the Jawahar Kunj. Toilets are there but closed.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Great place to spend some time with famlily and friends. However you can't go near to the water, its prohibited also you have to take your shoes off.\n\nLocation is good for clicking photos.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A Memorial of Mahatma Gandhi on the bank of river Hoogly in Barrackpore. A lush green garden dotted with 120 varieties of roses, exquisite plants and trees, a perfect picturesque sunset and an exciting riverfront.\nThe location is 30 km from the heart of the city and is easily connected both by roadways and railways.\nIt was built in 1948 (father of the nation died on that day), the monument on the banks of the river Hoogly and the sprawling garden, Jawahar Kunj  maintained by the state forest department. It can offer a day's respite to city dwellers. It was inaugurated by Pt. Jawaharlal Nehru.\n\nNote: The park is open from 9 am to 5 pm on all days, except Sunday.\nAmple parking space is available outside the place, where both bikes and cars can be kept.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Jaharkunja Park in Barrackpore Gandhi Ghat is an okay place ... good for picnic purpose .. garden area was well maintained but the kids play area was not at all.. There is nothing much to see or enjoy if you are not there for picnic with your group... The entry fee is too high ..  Rs35/person including kids above 3 yrs .. 😮 Eco-park has entry fee of 30 Rs .. better go there ..",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "restrict day sitting u cant prohibited gandhi may touch lots right picture good ghat terms conditions main ganges",
                "would closed best free dont hike beside full tour public ganga want trash entry kunj view also picnic police throw beware river fee required park visit fine jawahar toilets",
                "photos near cant spend time prohibited great water friends also however shoes location take good clicking famlily go",
                "roses day ample space bikes memorial varieties km gandhi jawaharlal sunset hoogly garden nehru mahatma inaugurated plants green open perfect riverfront pm parking kunj monument built bank forest nation died father maintained cars sunday barrackpore picturesque exciting city outside river roadways offer days location heart state respite park lush dotted exquisite railways trees sprawling pt except available department banks dwellers note jawahar kept connected easily",
                "rs rsperson including gandhi garden high kids entry yrs okay see group picnic maintained barrackpore area enjoy fee better much park well ecopark good ghat purpose jaharkunja play go nothing"
            ]
        },
        {
            "name": "Annapurna Temple",
            "rating": 4.6,
            "address": "P9X8+MCQ, Park Rd, Titagarh, Barrackpore, West Bengal 700120, India",
            "reviews": [
                {
                    "text": "A hidden treasure in Barrackpore. The temple looks so similar to Dakhineswar Kali temple. The environment was  quiet and u can feel the calmness in the air.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "The Annapurna Temple, besides being a place for pilgrimages is also a tourist attraction. Dedicated to Goddess Annapurna, the deity of food the temple also houses the shrines of Sivan, Hanuman and Kalabhairava.\n\nThe entrance of the temple is adorned with four-life size statues of elephants, and the architectural splendour of the temple makes it a must-visit for all tourists.\n\nAnnapurna Temple was built on 12 April 1875, by Jagadamba Devi, youngest daughter of Rani Rashmoni. She was married to Mathur Mohan Biswas, who after the death of his first wife Karunamoyee, married Jagadamba Devi. Their son Dwarikanath Biswas made all the arrangements for the establishment of this temple. The temple was opened to devotees by Ramakrishna. Inside the temple complex there is a Natmandir, six Shiva temples and two Nahabatkhanas\n\nAnnapurna, Annapurneshwari, Annada or Annapoorna (Sanskrit: अन्नपूर्णा, IAST: Annapūrṇa, lit. filled with or possessed of food) is a manifestation of Parvati and is known as the Hindu goddess of food and nourishment. Worship and offering of food are highly praised in Hinduism, and therefore, the goddess Annapurna is regarded as a popular deity. She is a manifestation of the goddess Parvati, the consort of Shiva and is eulogized in the Annada Mangal, a narrative poem in Bengali by Bharatchandra Ray. The Annapurna Sahasranam is dedicated to the goddess and praises her one thousand names, while the Annapurna Shatanama Stotram is dedicated to her 108 names.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "A hidden treasure in Barrackpore. The temple looks so similar to Dakhineswar Kali temple. The environment was  quiet and u can feel the calmness in the air. U don't need ticket to enter the temple though u have to buy coupon for Mahaprasad, i couldn't get it.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very peaceful place. Additionally the Ganga ghat! We visited in the evening. There were very few people present at the temple premises as it was evening. You can feel the calmness and peacefulness of the place. It's very near to Barrackpore railway station, hardly 2 km. You will find toto. Though the toto fare is actually Rs.20/- per person but during going to the Mandir you have to reserve the toto, during returning you will get many toto easily. You can also visit Gandhi ghat as well which is near Annapurna temple.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "One of the best temple near kolkata. The pujo process is simple. Many people do not know about this temple. This Temple was built on 12 April 1875, by Jagadamba Devi, youngest daughter of Rani Rashmoni. The temple is similar to the Bhavatarini temple at Dakshineswar.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "looks environment treasure hidden similar temple barrackpore quiet kali u feel calmness air dakhineswar",
                "adorned popular therefore offering shiva poem rashmoni food built stotram deity shrines made hindu mustvisit youngest annada mathur natmandir sivan daughter devotees bengali goddess parvati architectural sanskrit praised possessed size first dwarikanath splendour annapurneshwari temple elephants opened fourlife one annapoorna narrative tourists thousand hanuman wife ramakrishna kalabhairava dedicated rani regarded two r annapurna arrangements besides hinduism tourist lit mangal a highly biswas pilgrimages karunamoyee temples mohan worship iast son known ray annap manifestation inside houses complex april six eulogized jagadamba bharatchandra also attraction establishment death filled consort sahasranam nourishment makes praises married nahabatkhanas names entrance devi shatanama statues",
                "couldnt dont u ticket though environment similar quiet kali dakhineswar looks need temple barrackpore air coupon get treasure hidden enter feel calmness buy mahaprasad",
                "people find visited rs many near additionally station km gandhi though returning annapurna ganga premises present railway actually reserve evening also hardly toto mandir temple barrackpore fare get going per well person ghat feel calmness peacefulness visit peaceful easily",
                "people best many near april rani jagadamba kolkata rashmoni similar simple built temple pujo youngest bhavatarini one know process daughter devi dakshineswar"
            ]
        },
        {
            "name": "Serampore Raj Bari",
            "rating": 4.3,
            "address": "Chatra, Serampore, West Bengal 712201, India",
            "reviews": [
                {
                    "text": "I love to know and listen to my history, even more so if it is at hand or in front of my camera lens. I had been going for a long time but could not go despite being next to the house. At the insistence of my wife, I arrived at the Rajbari of Srirampur. This Srirampur Rajbari is much more beautiful than what I had imagined on Google. It is as if the guest is still carrying the history of the house inside the house as if he is still standing in the house with a beautiful smell of the past. Inside the Tagore Dalan is also very beautiful where the nearly 600 year old Radha Madhav is still enshrined with people looking after her and she is worshiped daily and given prasad. But the nat temple here is in a very dilapidated condition which I feel very sad to see. The Bengal government should join hands with some of the families who have heritage buildings in Bengal so we can know the history and see it with our own eyes .",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "This place RAJ BARI feels like a love nest, The fresh air and bird sounds feels comfortable like you can have a peaceful sleep 💤😴\nIt was a good experience. Loved this place",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Shreerampore Raj Bari stands as a testament to Bengal's rich history, nestled in the heart of Hooghly district, India. This majestic heritage site, dating back to the colonial era, echoes tales of opulence and grandeur. Its regal architecture, adorned with intricate carvings and sprawling gardens, transports visitors to a bygone era of royal splendor. Once the residence of the Shreerampore Raj family, it now serves as a cherished landmark, preserving the cultural legacy of Bengal. With its ornate halls, courtyards, and timeless charm, Shreerampore Raj Bari continues to captivate admirers and historians alike, offering a glimpse into the region's illustrious past.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Visited with lots of expectations, it failed. Maintenance is low. Hope some private company will took the control & converted into a resort like Bawali Rajbari.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "The ambience inside is very heartwarming. Big pillars, high roofs,   old broken architecture, mandir all had the smell of the past glory of Raja Kishori Lal Goswami. No entry fee is needed. Camera (dslrs, mirrorless) is not allowed without prior permission. If you reach there and find the entrance gate is closed, you may try your luck by calling the caretaker with the provided phone number on the main entrance.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "people bengal government beautiful inside hands radha wife nearly tagore prasad looking time sad srirampur madhav guest listen carrying standing history heritage worshiped buildings given old could dalan dilapidated condition see also eyes house despite daily love enshrined go temple families imagined still smell year lens rajbari google past know camera going much even front feel nat join insistence next long arrived hand",
                "feels bird experience love fresh bari comfortable good nest sounds air sleep loved like peaceful raj",
                "bengal adorned transports echoes nestled regal timeless raj offering intricate district shreerampore preserving stands india hooghly history residence rich dating architecture site back visitors royal landmark cherished grandeur bygone colonial gardens legacy admirers cultural halls opulence tales regions family majestic testament ornate era heart courtyards charm glimpse continues bengals alike past splendor bari carvings sprawling serves historians captivate heritage illustrious",
                "company rajbari visited converted private low took lots hope maintenance control bawali like expectations resort failed",
                "find closed permission try inside raja big prior reach provided gate may without number ambience needed allowed phone high lal roofs architecture entry old luck kishori calling mandir glory fee smell mirrorless caretaker dslrs heartwarming past camera pillars goswami broken entrance main"
            ]
        },
        {
            "name": "Mangal Pandey Park",
            "rating": 4,
            "address": "beside Surrendarnath College, Cantonment, Barrackpore, Barrackpur Cantonment, West Bengal 700120, India",
            "reviews": [
                {
                    "text": "Small Park, nothing special, Satisfying natural view of ganga river. There is a restaurant so no worry about food but costly, rest room, water available, entry fees is 50 rupees per head which is too high for this kind of park, 10 to 20 rupees would have been fine for this. Think twice if you want to visit with children and family, it's a small lover's point.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Small Park, nothing special, Satisfying natural view of ganga river. There is a restaurant so no worry about food but costly, rest room, water available, entry fees is 50 rupees per head which is too high for this kind of park, 10 to 20 rupees would have been fine for this.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "The experience was great. You get great view of the river Ganga from there. Best time to visit the place is I believe in the evening. Great place to hangout with friends and family. There's an eating joint too inside the park if you're interested.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Rs. 50 per person is being charged for entry in the park. Entry fee is very high.  Peaceful, seating arrangements on the bank of River Hooghly. Small restaurant.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Mangal Pandey Park offers a serene escape from the hustle and bustle, with lush greenery and well-maintained paths creating a peaceful atmosphere. The park's landscaping is commendable, providing a perfect setting for relaxation and leisurely strolls. However, it's worth noting that the entry fee is relatively high, which might deter some visitors. Despite the cost, the park's beauty and tranquility make it a worthwhile experience for those seeking a premium outdoor retreat.",
                    "languageCode": "en",
                    "rating": 4
                }
            ],
            "preprocessed_reviews": [
                "would natural restaurant special head small point ganga water high want think entry food view satisfying twice costly fees room rest river family lovers park worry per rupees kind children available visit fine nothing",
                "would natural restaurant special head small ganga water high entry food view satisfying costly fees room rest river park worry per rupees kind available fine nothing",
                "best experience inside hangout time interested great joint ganga friends theres view evening youre river family believe get eating park visit",
                "rs charged per park restaurant high person seating arrangements hooghly entry river peaceful fee bank small",
                "cost might leisurely retreat experience worthwhile offers greenery premium noting setting relatively commendable tranquility landscaping hustle providing deter relaxation high perfect creating entry visitors strolls serene beauty worth pandey despite make mangal seeking however fee wellmaintained parks atmosphere park lush bustle paths peaceful escape outdoor"
            ]
        },
        {
            "name": "Mangal Pandey Ghat",
            "rating": 4.2,
            "address": "Q963+45H, Barrackpore, Barrackpur Cantonment, West Bengal 700120, India",
            "reviews": [
                {
                    "text": "\"Mangal Pandey Ghat is a charming riverfront green space, cherished by young couples for its romantic ambiance. Perfect for picnics and leisurely boat rides, it offers a serene escape from the city hustle. A must-visit destination in Barrackpore for unforgettable experiences",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Excellent View highly recommended, you get a newly open restaurant called Rasoi King, A part of West Wing Restaurant & Boutique beside the park. You love the place the way they place all the things inside. Tea ☕ was affordable 10₹ , place is well clear and hygiene, food was delicious. Good place to hangout with friends and family.A nice place. The park beside it is well maintained and the scenic beauty is intensified after a little rain. It has a couple friendly environment. If you're walking from the main road to reach the ghat, you can see the well maintained barrack areas and the greenery.... have a good day!\n\nOne of the best place to hangout with your friends and loved ones in Barrackpore. If you are visiting Barrackpore for first time then this place is a must visit. Ask any Toto for this place when you arrive in Barrackpore railway station and they will take you here for 20 rs per person. Must come here and enjoy the exquisite Ganges.\n\nIt's an amazing place to visit with family . We love sitting beside the river side . There's a shiv mandir which means a lot to me , they do Ganga Aarti every Monday which is amazing . We love the boat ( NOUKA ) ride too .\n\nAn amazing place to be at. Got my first chance of viewing the force of water. We call it 'baan' in Bengali. We were suddenly given warning by a screaming local man. I was wondering why was he asking us to leave the Ghat asap. Looking at his pointed finger I could see the dashing waves at a distance. But within a couple of minutes it was a couple of meters away from our spot. I almost screamed in terror looking for my daughter....God bless that man! May he live a happy and healthy life for saving our lives.\n\nMangal Pandey was an Indian soldier who played a key part in the events immediately preceding the outbreak of the Indian rebellion of 1857. He was a sepoy (infantryman) in the 34th Bengal Native Infantry (BNI) regiment of the British East India Company. In 1984, the Indian government issued a postage stamp to remember him. His life and actions have also been portrayed in several cinematic productions. The personal motivation behind Mangal Pandey's behaviour remains confused. During the incident itself he shouted to other sepoys: \"come out – the Europeans are here\"; \"from biting these cartridges we shall become infidels\" and \"you sent me out here, why don't you follow me\". At his court-martial, he stated that he had been taking bhang and opium, and was not conscious of his actions on 29 March.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good place for organising picnics. Large area with greenery all over. Children's park. Entry fee Rs 35 for adults.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Beautifully maintained park with ghat. It has an unmatched view if the river and houses a restaurant and picnic amenities.\n\nEntry fee is INR 50.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "View of river Ganges is beutiful specially during sunset. Enjoy quality time with special one. But the entry fee 50 rupees is little high as the park is not maintained well, no flower garden, jungle not cleaned regularly, overall total park lacks maintenance.",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "space young leisurely offers destination rides charming hustle green perfect riverfront cherished serene pandey ambiance romantic mangal picnics barrackpore city unforgettable couples mustvisit boat ghat escape experiences",
                "government amazing day force sitting played europeans reach looking nice aarti beside almost environment ganga sent food things given wing view see king terror shouted maintained live stamp warning march confused mandir leave affordable recommended enjoy indian courtmartial happy bless conscious well familya bni main lot bengal boutique bengali remember come got cartridges sepoy become loved east distance may nouka call remains india friendly first side every meters could called way ride company pandey stated love toto lives barrackpore postage pointed scenic monday daughtergod one ones asap park native clear person bhang visit dashing best motivation rain restaurant key dont greenery station sepoys time asking ask th water within saving screamed friends healthy theres us minutes must man rebellion infantry infidels mangal youre preceding family river highly west screaming finger walking take boat behaviour delicious taking good ghat outbreak rasoi several portrayed incident chance waves areas ganges cinematic little means rs inside couple hangout british shall behind baan events productions hygiene suddenly open issued biting tea railway shiv also beauty barrack visiting regiment viewing infantryman road arrive local newly get away soldier personal excellent per exquisite part immediately intensified opium spot life wondering follow actions pandeys",
                "fee park rs picnics good greenery childrens area entry organising adults large",
                "picnic beautifully unmatched maintained park houses restaurant ghat inr entry river fee view amenities",
                "little special time jungle sunset garden quality high entry view total specially flower maintained regularly beutiful river enjoy fee cleaned one park well rupees overall maintenance lacks ganges"
            ]
        },
        {
            "name": "Mahesh Lord Jagannath Temple",
            "rating": 4.8,
            "address": "Mahesh, Serampore, West Bengal 712202, India",
            "reviews": [
                {
                    "text": "It is a historical place, older than any other Jagannath temple. Very calm and organized place. A medium sized \"Nat Mandir\" make the place unique. Devotees are also gentle, they respect the tourists. Pujaries are also very helpful, they make your visit smooth. I had prayed and took blessings from the lord Jagannath, Suvadra and Balaram.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "One of the nice place in Srirampur. You should definitely visit this place and you will love this place.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Mahesh is famous for the oldest rathyatra festival of West Bengal. It is the second oldest in the world after Puri. 'Mahesh er Rathyatra' is one of the renowned activities which introduces Hooghly as a famous place.\nThe Rathyatra of Mahesh is as old as 627 years. A populous fair is held on every rathyatra utsab. It stays for 3-4 weeks. People visit there from different places. There are no religious boundaries between the people who visited there. At Rathyatra utsab the great 'Rath' is brought in the road with large ropes in which Lord Jagannath Balaram and Subhadra are reside. After 8 days in 'Ulto Rath' the 'Rath' again comes back from Jagannath dev's 'Masir Bari' to the temple. People visit here to touch the rope for blessings and the place is being chanted with  'Jay Jagannath'.\n\nThis place is easily accessible. Anyone can visit this place by auto or toto from Shrirampur station. Transportation facilities are good and the location is very busy. But inside the temple the situation is totally opposite. The temple is very pleasant and a good place for meditation. Here is a long veranda with hanging lanterns from where people could see the idol of Lord Jagannath Balaram and Subhadra.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Place of Lord Jagannath. One can feel mental calm to come here.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A place where serenity blends with you to provide a positive energy. Where the Lord Jagannath reside, where the peace reside- Mahesh Temple holds a historical value on its own. With the recent renovation this 650+ year temple got more grandeur. Thus, the immense popularity of this place needs no explanation.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "tourists calm took helpful prayed lord organized sized respect gentle blessings also make jagannath mandir temple suvadra older unique smooth pujaries medium visit balaram nat historical devotees",
                "one love visit definitely nice srirampur",
                "ropes opposite lord brought hanging see pleasant famous mahesh reside large auto location rathyatra activities people bengal visited boundaries festival lanterns rath held touch facilities every back old could blessings introduces jagannath toto temple ulto chanted er busy days rope one fair shrirampur visit balaram weeks different station comes utsab totally great subhadra puri anyone masir accessible west veranda world bari jay good stays second inside idol hooghly populous religious oldest renowned situation transportation years road meditation places devs long easily",
                "one calm jagannath come feel lord mental",
                "provide thus got serenity lord popularity energy recent grandeur peace renovation jagannath temple mahesh reside positive explanation year immense value needs blends holds historical"
            ]
        },
        {
            "name": "Kali Temple",
            "rating": 4.4,
            "address": "98, Strand Rd, Nawabganj, North Barrackpur, West Bengal 743144, India",
            "reviews": [
                {
                    "text": "A place where one can be completely energized. One of the best place to visit in kolkata.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "The Kalighat temple in its present form is only about 200 years old, although it has been referred to in Mansar Bhasan composed in the 15th century, and in Kavi Kankan Chandi of the 17th century.\n\nOnly two types of coins of Chandragupta II, who incorporated Vanga in the Gupta Empire, are known from Bengal. His Archer type coins, which became the most popular type of coinage with the Gupta rulers after Kumaragupta I, have been found in Kalighat. This is evidence of the antiquity of the place.\n\nThe original temple was a small hut. A small temple was constructed by King Manasingha in the early Sixteenth century. The present temple was erected under the patronage of the Sabarna Roy Chowdhury family of Banisha. It was completed in 1809. The Haldar family claims to be the original owners of the temple property. But this was disputed by the Chowdhrys of Banisha. In the nineteen sixties a committee was formed for the administrative management of the temple with representation from the Government and the Haldar family.\n\nIt is necessary to know the history of the temple to understand the practices which are prevalent today. There is a complex organization involving Sevaiyats, Phaledars, Mishras, and Sathi Brahmins.\n\nThe Government of West Bengal has taken a lot of interest in improving the temple which is also one of the biggest tourist attractions. They have sanctioned funds for improving the temple. An office cum guest accommodation was constructed at a huge cost some years back. The building is now being run by the Tourism Development corporation as a guest house. Accommodation is available for pilgrims here\n\nSome Devotees have approached the courts over the years for improving the temple. The courts have taken a keen interest in improving the temple. New construction is continuing inside the temple and a lot of improvements have been brought about.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "A decent place to sit and witness golden hour with your loved ones.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "A very good temple to visit you can visit it everytime and you will feel the energy of being in a temple you should anytime go alone with your freinds or with your family it would be amazing",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Most powerful goddess Kali Devi and your prayers are answered immediately. Here don't get in touch with any priests of temple inside as well as outside because they money snatchers and only money minded and extortion of money nothing else. So beware of the temple priests !",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "one best kolkata energized visit completely",
                "government chowdhrys popular improvements involving attractions rulers form kalighat coins chandi brought sanctioned type owners nineteen haldar claims history administrative found antiquity keen cum sixties necessary biggest king house committee original improving composed mansar tourism coinage kavi lot erected property organization devotees bengal cost accommodation office sathi became corporation small century mishras chandragupta funds manasingha patronage back old temple one approached continuing building evidence huge development sabarna new construction today types brahmins two th gupta taken banisha referred completed archer tourist phaledars family west sevaiyats interest management know hut vanga empire although kankan bhasan kumaragupta run incorporated known constructed prevalent inside complex guest representation present chowdhury also formed disputed ii years sixteenth roy practices understand courts early pilgrims available",
                "ones decent sit hour witness loved golden",
                "alone would amazing everytime temple good visit feel family anytime freinds go energy",
                "inside dont answered prayers snatchers priests touch powerful kali money extortion minded devi else temple beware outside get well immediately goddess nothing"
            ]
        },
        {
            "name": "Serampore Battala More",
            "rating": 4.3,
            "address": "P8XW+WM6, Battala Rd, Khash Bagan, Serampore, West Bengal 712201, India",
            "reviews": [
                {
                    "text": "I go through this place everyday. A busy place in serampore. Well connected. But the traffic problem is paramount. Needs betterment.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Battala is main heart of serampore. It has 5 route road connectivity. It’s crowded place. You can get toto bus auto all services from here. Battala is connecting to  Seaorafuli, Rishra and serampore main market",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "The decription itself says, historic landmark.\nAnd yes, it is.\n\nThis five roads leads to-\n1) Sheoraphully.\n2) Serampore Holy Home School/ Serampore Court/ Serampore Ferry Ghat\n3) Dey Street/ BSNL office/ Serampore College\n4) Serampore Girl's High School (Aakhna School)/ Serampore Stadium\n5) Towards Rishra, Konnagar etc. You can reach to Dakhineshwar also from here.\n\nThis five point is too busy during weekdays. Traffic Police are always here to manage everything.\n\nYou can also get toto/Auto/ Bus from here to reach to your destination.\n\nIf you want to reach Dakshineswar, take 3 No.Bus, 2No.Bus, 285 Bus from the traffic police side.\nIf you want to go to Sheoraphully, take 2no Bus in from the opposite direction. (NONI shop will be there) Or ask anyone for the same. Other bus are also there.\n\nThis five point also have many shopping destinations like- resraurant, shopping building, jewellry shop, medicine shop, temple, street food centres etc.\nBrands like Mio Amore, Bancharams, Dhanvantari, Frank Ross, Apollo Pharmasy, Titan world etc are also here.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A busy 5 way crossing and a major hubs and junctions in Serampore. Too many unruly Totos and Autos create unwanted traffic jams.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "No one really cares about traffic rules here. It’s a major junction on GT Road, but didn’t spot single WBP traffic guard on Sunday evening!!",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "everyday well traffic needs paramount serampore problem betterment busy go connected",
                "route s it crowded connectivity toto serampore bus road get auto heart seaorafuli battala market connecting rishra services main",
                "opposite reach school direction food towards police says konnagar ross shopping ferry dey leads everything girls destination office college side want holy titan destinations court apollo temple historic noni manage busy aakhna building dhanvantari shop decription many five bsnl dakhineshwar ask anyone high landmark bancharams frank mio jewellry centres stadium serampore amore weekdays nobus take resraurant world ghat sheoraphully street rishra like brands go dakshineswar roads point always medicine home totoauto also pharmasy yes traffic bus get etc",
                "many junctions traffic jams serampore crossing totos autos unwanted create busy unruly hubs major way",
                "guard s t cares junction didn major gt it single wbp evening sunday traffic road one really spot rules"
            ]
        },
        {
            "name": "GANDHI MEMORIAL MUSEUM",
            "rating": 4.3,
            "address": "14 Riverside Road, Barrackpore, 24 Parganas (N), Cantonment, Kolkata, Barrackpur Cantonment, West Bengal 700120, India",
            "reviews": [
                {
                    "text": "An important historical place located by the Hooghly river in Barrackpore. Lots of historical photos of Gandhi jee and the Indian freedom struggle. The souvenir shop outside has a good collection of literature on Gandhijee and paraphernalia. Must visit during a Barrackpore trip.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Gandhi Memorial Museum  is located at Barrackpore, on the banks of River The Ganges.Various things, photographs and books used by Gandhiji are stored in this museum.Besides, there is arrangement to show a documentary film on the contribution of Barrackpore in freedom struggle.It is opened everyday form 11 a.m. to 5 p.m. except Wednesday. Entry fees is Rs 10 per person. Ones must visit to know our freedom struggle.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Beautiful place where Gandhi memories are preserved. Entry fee 10 rupees. Timing 10am - 5pm.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A very peaceful, nice place just beside Ganga, barrackpore. You can get a lot of information about Mahatma Gandhi.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "This place is very quiet and clean. Those who are really interested to know more about indian history can visit this museum. A beautiful gem of Barrackpore. This place gives me goosebumps.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "photos gandhijee gandhi important souvenir hooghly jee lots must located barrackpore outside literature paraphernalia collection river freedom indian trip good visit struggle shop historical",
                "rs memorial form gandhiji stored gandhi gangesvarious show museumbesides film photographs documentary everyday pm entry things must located fees books barrackpore used arrangement museum river freedom contribution ones know struggleit per except person visit wednesday banks struggle opened",
                "timing beautiful memories rupees preserved pm entry gandhi fee",
                "gandhi information mahatma ganga barrackpore peaceful lot nice get beside",
                "really know beautiful gem gives quiet history barrackpore visit clean museum goosebumps indian interested"
            ]
        },
        {
            "name": "Henry Martin's Pagoda Temple",
            "rating": 4.2,
            "address": "88, Maniktala, Serampore, Hooghly, West Bengal 712201, India",
            "reviews": [
                {
                    "text": "Henry Martin's Pagoda, is a ruin Temple With Verious Handcraft Terracotta Works.\nThis place is located next to Serampore Waterworks (Jol Kol).\nThe origins of the temple which became a home for Henry Martyn, was the original Radha Ballav Temple.\nA Great Scenario is there, You Must to Visit.\nFor Coming this Place You have to cross a small jungle Road..\nSo, Visit This at Day Time.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Henry Martin's Pagoda, also known as Peace pagoda is situated just behind the Serampore Jolkol. Basically it is a ruin, near the Hooghly river bank. The natural visuals are very good. You have to reach there through a rough patch of jungle. One can visit for outings with friends and all.You have to careful while go through tha jungle.visit in day time .",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Peaceful place beside the Hooghly.perfect for picnic.Road is not good.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Henry Martin's Pagoda, also known as Peace pagoda is situated just behind the Serampore Jolkol. Basically it is a ruin, near the Hooghly river bank. The natural visuals are very good. You have to reach there through a rough patch of jungle. One can visit for outings with friends and all.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Nice place, no ticket needed, soothing place, must visit with your friends and loved ones❤️",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "martins day jol kol radha martyn verious became time jungle small great ruin henry cross origins home must located scenario coming temple works serampore original road ballav waterworks handcraft pagoda terracotta visit next",
                "known martins natural rough day tha near junglevisit reach time behind jungle allyou visuals ruin henry patch hooghly friends bank jolkol peace also situated basically serampore outings river pagoda one good careful visit go",
                "good picnicroad peaceful hooghlyperfect beside",
                "known martins natural rough near reach behind jungle visuals ruin henry patch hooghly friends bank jolkol peace also situated basically serampore outings river pagoda one good visit",
                "needed ones soothing friends visit loved nice ticket must"
            ]
        }
    ]
}