{
    "places_with_reviews": [
        {
            "name": "Tiger Falls",
            "rating": 4.6,
            "address": "Kanaser Range, Chakrata, Kanaser Range, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Tiger Waterfall in Uttarakhand is a hidden gem waiting to be discovered by adventure seekers. After a scenic trek of over a kilometer, visitors are rewarded with the sight of this majestic waterfall cascading from a height of 50 meters. The journey to reach the waterfall adds to the excitement, with lush greenery and refreshing streams along the way. Once there, tourists can't help but marvel at the sheer beauty and power of the waterfall, making it a memorable experience for all who visit. If you're in Uttarakhand and craving a dose of nature's splendor, Tiger Waterfall is a must-see destination.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "I always dreamt to visit such place without crowd & I still can't believe that the dream came true. There was even not single person except me & my friends. We enjoyed the waterfall & the nature in the lap of the Jungle.\nChirping of little birds🐦 & soft sound of falling water made our trip to Chakarata worth. It is an another one of awesome memories in the mind not only the photo in call call phone📱 & camera📸.\nThere are many good options to stay near the waterfall in circle of 100m to several KMs.\nWe visited in middle of April 24, & the weather was little warm in day & chilled in the  night. We recommend people to visit this place with friends & family but with a special note, remember that do not spread leftovers, don't make the place dirty & help keep the nature & the environment neat & clean.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Had an amazing time at the Tiger Falls( Largest Direct Falling Waterfall in India ). The roar of the falls is truly the exciting part as it falls from over hundreds of feet high.  If you’re Lucky you would see Rainbows forming nearby adding to the beauty of the place.\nMake Sure to go in an off season or when it’s less crowded as it spoils the Fun and experience to Relax peacefully. Sit on the rocks nearby and experience the beauty of nature🦋",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Fall is really beautiful and height is around 30-40 feet. Nearly 90km from Dehradoon. Roads were good and crowd was decent. You can either go with diwn hiking or can go in your car. Limited parking facility with first come first serve. Food options were there too like Maggie, omelette, sandwich etc. You can take bath in the fall.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Waterfall is stunning, but it's quite far from Chakrata Hill Station, making it more of a one-time trip because of the distance. Plus, if you're used to hills, it might not be as exciting since there's nothing else around besides the waterfall.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "tourists along experience sight greenery cant destination reach seekers tiger adventure discovered waterfall journey refreshing adds excitement uttarakhand visitors meters natures craving way marvel beauty gem streams rewarded waiting youre scenic majestic mustsee dose making hidden lush cascading splendor memorable height visit power sheer trek kilometer help",
                "people visited little birds stay many day memories remember near dont weather cant special keep april options jungle without call awesome always falling environment phone true waterfall dream kms middle water single mind crowd friends came chirping lap worth soft photo make dreamt spread made another family night trip still sound believe chilled neat one warm chakarata camera enjoyed leftovers even except person good several dirty visit circle clean nature recommend note help",
                "would amazing relax s experience rainbows fun time re tiger peacefully falling feet waterfall india it lucky sure high hundreds largest truly crowded spoils see forming beauty make season rocks exciting direct adding you nearby falls roar part less sit nature go",
                "diwn beautiful come roads nearly km options hiking feet either serve bath first fall crowd food parking maggie sandwich dehradoon around omelette car really etc take decent good height facility like limited go",
                "might station distance hills waterfall besides theres plus quite stunning else used exciting youre around trip hill chakrata making far since onetime nothing"
            ]
        },
        {
            "name": "Chirmiri Peak/Top",
            "rating": 4.7,
            "address": "Thana, Uttarakhand 248196, India",
            "reviews": [
                {
                    "text": "Chirmiri Peak top in Uttarakhand offers a breathtaking sunset experience that's truly unforgettable. As the highest peak in the area, it provides panoramic views of the surrounding hills and valleys, creating a picturesque setting for nature lovers and photographers alike. Tourists flock here to witness the mesmerizing colors of the sunset painting the sky, making it a must-visit destination for anyone exploring Uttarakhand's natural wonders.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "The best Sunset Experience I’ve ever had!! The silence of the place and gushing sounds of Tibetan Flags make it a mesmerising experience.\n\nJust this place needs a little cleaning and maintenance.\nCarry your Tea/Coffee and Snacks with you and enjoy the Vibe.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Don't miss this if you are visiting Chakrata, nice place ot be with yourself, timed it well so that you can enjoy sunset or sunrise, avoid afternoon. The wind is very strong and it is bit colder than the town area, so come prepared. No shops, no water vendor, please carry them. At least water is must, you wil have to walk uphills for about 300 meters to reach the place and in summer the first thing you will look for after reaching the top is water. I have experienced the Sun set and it was awesome.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This place has to be the highlight of Chakrata with gorgeous sunrise and an even amazing sunset. There's an open field about 150m long good enough for picnic/spending time together. Cows graze during the day.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Chirmiri Peak top (also known as Sunset Point) is a great place for photography. However, you need to carry water bottle or snacks with you as there are no Shop within 3 KM area. This is not a Crowded place.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "chirmiri breathtaking highest tourists painting natural experience valleys uttarakhands offers destination hills setting sunset colors anyone views peak uttarakhand truly provides creating sky exploring panoramic unforgettable picturesque area flock lovers witness top mesmerizing mustvisit wonders making thats alike photographers nature surrounding",
                "little best flags experience gushing mesmerising sunset carry teacoffee vibe snacks sounds ever make tibetan enjoy silence ve i needs cleaning maintenance",
                "set ot come dont reach miss nice sunset awesome afternoon least carry water first bit please meters must summer prepared uphills vendor shops visiting sunrise look experienced area walk enjoy avoid thing top chakrata colder town wil well reaching timed sun wind strong",
                "highlight amazing day time field sunset picnicspending open cows theres gorgeous enough together chakrata even graze good sunrise long",
                "chirmiri known km photography point sunset great carry water within snacks peak crowded also need area top however bottle shop"
            ]
        },
        {
            "name": "Sunset point",
            "rating": 4.5,
            "address": "MVPF+J88, Vikasnagar - Chakrata Rd, Kaliana, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "The sunset point near Tiger Falls in Chakrata, Uttarakhand, is an unparalleled experience. The Moila viewpoint offers a picturesque setting for witnessing nature's dance, with swirling clouds and snow-capped mountains painting a breathtaking scene, particularly in January and February. Throughout the year, the mesmerizing views of the mountains and captivating sunsets create unforgettable moments. A must-visit destination for those seeking serene beauty and natural wonder.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Genuine review by Mr.e\n\nIn Chakrata , you need to have your own vehicle 'coz you won't find any public transport , however this place is the perfect for sunset and offers the best view in Chakrata, there are no shops around , so come here watch sunset and leave for your next place, parking is not a problem here, its an open area",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This is a beautiful place in Chakrata. Although I couldn't witness the sunset or sunrise but the sheer beauty of this place is breathtaking. It was pleasant, calm and simply beautiful.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Beautiful place❤️❤️you can spend few hours in morning or in evening here...",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Best place for camping and picnic, amazing view of the Himalayas and Sunset.\nBut people from Haryana and Delhi come here to drink alcohol. Authorities should give more attention to this and alcohol shouldn't be allowed here.\nAlso, my humble request to fellow travelers & tourists. PLEASE DO NOT LITTER HERE & THERE. KEEP THESE TOURISTS SIGHTS CLEAN FOR OUR FUTURE GENERATIONS.\n\nBE A RESPONSIBLE TOURSIT.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "breathtaking painting natural clouds experience near witnessing scene offers captivating moments destination tiger setting point sunset viewpoint january dance views uttarakhand create natures mountains particularly snowcapped serene swirling beauty unforgettable moila picturesque mesmerizing seeking february mustvisit year chakrata throughout sunsets falls unparalleled wonder",
                "find best come offers review watch wont vehicle sunset public open transport perfect genuine parking mre view shops need around coz leave problem area however chakrata next",
                "chakrata beauty breathtaking pleasant calm couldnt beautiful although simply witness sheer sunrise sunset",
                "beautiful morning hours spend you evening",
                "people drink authorities amazing tourists best travelers come delhi keep sunset camping allowed alcohol future shouldnt himalayas haryana please toursit view attention also picnic litter fellow sights generations give request clean humble responsible"
            ]
        },
        {
            "name": "Dhar snow view point",
            "rating": 3.4,
            "address": "MVV3+RJ6, Hoda, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Love",
                    "languageCode": "en",
                    "rating": 3.4
                },
                {
                    "text": "So beautiful neck and San set point",
                    "languageCode": "en-US",
                    "rating": 3.4
                }
            ],
            "preprocessed_reviews": [
                "love",
                "san set beautiful neck point"
            ]
        },
        {
            "name": "Sun set point/chirimiri Top",
            "rating": 4.6,
            "address": "MV8M+HH3, Unnamed Road, Thana, Uttarakhand 248196, India",
            "reviews": [
                {
                    "text": "Went to see sunset, couldn't because of the fogg, but the place is superb, hilltop lots of space plus beautiful scenery and jungle nearby",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Sunset / Sunrise point at Chirmiri Point is a Very Nice, Calm, picturesque place. Must Visit Place if you are in Chakrata, Uttrakhand",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beat place to see sunset and sunrise.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Ultimate place at such a height. You can drive upto this point. A vast view of valley and snow capped mountains..",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Better location to visit, a open natural mountain ground without any shop ,only with natural beauty of himalyas ,so request you to please don't litter the place.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "jungle superb space couldnt beautiful scenery went lots hilltop fogg plus see nearby sunset",
                "chakrata chirmiri calm picturesque must uttrakhand visit sunrise nice point sunset",
                "beat sunrise see sunset",
                "vast snow point valley height mountains upto drive capped view ultimate",
                "better location mountain beauty natural himalyas dont open request litter visit please shop ground without"
            ]
        },
        {
            "name": "Jadi Waterfall",
            "rating": 4.8,
            "address": "PRXQ+3JV, SH1, Luhari, Jadi, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Proud of be the first outsider to reach here. This seems to be the Highest known waterfall of Uttrakhand. Explored this place with help of locals of Sijla Village. The trek is around 3 Kms and difficulty level is moderate. DM me on my instagram (@ramtajyogi), if you need a guide and help to reach this place.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Really I like it\nJadi is really a \"Haven\"💜\nLike pleasing.....",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Uttarakhand",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "So",
                    "languageCode": "en-US",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "highest known outsider village uttrakhand dm reach kms waterfall locals first instagram sijla seems need proud around moderate guide explored ramtajyogi level difficulty trek help",
                "really pleasing jadi haven like",
                "uttarakhand",
                ""
            ]
        },
        {
            "name": "Chinta haran mahadev temple",
            "rating": 4.5,
            "address": "MVPF+7HC, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "The biggest shivling present at this mahadev temple\nMust visit place in chakarata\nThe way is from Chakrata market\nWalking distance around 500 m steep down\nSimple quite place\nAmidst the greenary",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Biggest shivling present at this mahadev temple\nMust visit place in chakarata\nThe way is from Chakrata market\nMind free please",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "One of the largest shivling i have seen so far and infact u have to climb decent number of stairs but after looking at shivling it give you immense pleasure .....God bless everyone ....om namo shivaye",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Very peaceful place with scenic view of chakrata hills",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This is the lord shiva  temple near korwa village,Chakrata,Utttrakhand.Very peaceful environment and scenic view surrounded by trees.Birds murmuring soothes the mind.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "greenary steep distance shivling simple present mahadev quite must amidst biggest way temple around walking chakrata chakarata market visit",
                "chakrata shivling chakarata free present temple market must mind mahadev visit please biggest way",
                "infact stairs u looking number shivling namo god everyone largest pleasure climb shivaye immense one bless decent far give om seen",
                "chakrata scenic peaceful view hills",
                "environment korwa villagechakratautttrakhandvery near treesbirds temple scenic mind peaceful surrounded view lord soothes murmuring shiva"
            ]
        },
        {
            "name": "Diversion GAWASA Bridge",
            "rating": 4.2,
            "address": "PV38+4J6, Chakrata, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Go there by booking online room else you may have to spend hours to search....\nBeautiful weather, awesome place.... I loved it",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good place for visit in the winter season🙂. Mainly for Shownfall in specially january month. Suggest to carry your own food. There is not good hotel for food.😔",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good place for visit in the winter season. Mainly for Shownfall in specially january month. Suggest to carry your own food. There is not good hotel for food.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good tourist spot but not much facilities",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good place in winters.. mid January to mid February",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "awesome else search beautiful room hours weather booking spend loved online go may",
                "winter january suggest carry season month good visit mainly shownfall food hotel specially",
                "winter january suggest carry season month good visit mainly shownfall food hotel specially",
                "much facilities tourist good spot",
                "january winters good mid february"
            ]
        },
        {
            "name": "Lower Sunset Point Chirmiri",
            "rating": 4.6,
            "address": "MV9J+Q2M, Thana, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Visiting the sunset point in Chakrata, Uttarakhand is an absolute must for nature lovers. Located around 7-8 hours from Delhi by car, this tranquil spot offers breathtaking views, serene surroundings, and a peaceful atmosphere. With only a few locals residing in the area, you can truly immerse yourself in the natural beauty and enjoy the soothing weather while witnessing a mesmerizing sunset.\"",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "What a fantastic location, the temperature dipped to 9 degrees at the end of April, quite 🥶",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Awesome and attractive place to watch sunset without giving too much efforts to your legs. You have to take a U turn(if coming from vikasnagar side) from toll naka chakrata and then keep driving for 5-6 kms. Then you will reach your beautiful destination.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice place, picturesque view",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Cool and peaceful place.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "breathtaking absolute natural witnessing tranquil offers surroundings weather immerse delhi point sunset locals views uttarakhand truly serene must beauty located visiting soothing hours around area lovers enjoy mesmerizing car chakrata atmosphere nature spot peaceful residing",
                "location degrees end fantastic april temperature dipped quite",
                "beautiful u legs destination keep reach giving toll watch sunset without awesome kms side driving coming vikasnagar efforts attractive chakrata take much turnif naka",
                "picturesque view nice",
                "peaceful cool"
            ]
        },
        {
            "name": "Mahasu devta temple",
            "rating": 4.7,
            "address": "MVR4+WWM, Hoda, Uttarakhand 248123, India",
            "reviews": [
                {
                    "text": "Jai jai Mahasu devta...\nThis place is almost 4hrs drive from Chakrata because of uphill drive it will take time.. very scenic beauty around the temple..will visit again sometime.\nTemple doors close at 4pm sharp for Puja and then reopen in 45mins but darshan can be done only after 6pm because of the evening Puja at mandir. Temple has ample amount of parking space.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "❤️",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Beautiful",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "This is mahashu devta temple in our village.\nMahashu devta is ..maharaja ...of Jaunsar bawar' people",
                    "languageCode": "en-US",
                    "rating": 4.7
                },
                {
                    "text": "Jai Mahasu Maharaj 🙏",
                    "languageCode": "en-US",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "reopen puja ample space drive time uphill almost jai darshan templewill close pm parking evening beauty done amount mandir temple around scenic sometime hrs chakrata devta doors mahasu take sharp visit mins",
                "",
                "beautiful",
                "jaunsar people devta bawar village temple maharaja mahashu",
                "jai maharaj mahasu"
            ]
        }
    ]
}