{
    "places_with_reviews": [
        {
            "name": "Shri Tarkeshwar Dham Mandir, Lansdowne",
            "rating": 4.8,
            "address": "TADKESWAR MAHADEV CHKULIYAKHAL, RQQV+W7P, Lansdowne, Malara Bara, Uttarakhand 246155, India",
            "reviews": [
                {
                    "text": "Its such a peaceful tranquility amidst mother nature, and a visual treat for eyes. The 500m walk to the temple itself is so refreshing. You need to be there to experience in real time. Many people come here for picnic sort of to spend good quality time with friends and family.\n\nPeople who studied Indian philosophy may not find anything spiritual here, but people who just believe in some story or the other can go through information board here that talks about an unknown person about 500 yrs ago who used to watch fellow villagers and keep them aligned on the right path.\n\nThe road from Lansdowne to here is very narrow and takes at least 1.5 hr to reach one side. Parking arrangements are there. Washroom is also there - though not much maintained. Rest you're on your own amidst mother nature.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The temple is in the middle of pine forest,, very quiet and beautiful  though you need to walk alot to reach the temple it's worth the walk..it's altogether a different world..and yes there are lots of monkeys you can feed them by hand they won't mind!",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A temple amidst the tall deodar trees…what beauty! The path to the temple is a walk down the hill into the valley…not too down but still a 15 min walk for a regular person…but once you reach you start seeing deodar trees surrounding the temple n it’s mesmerising….ths path to the temple has bells on both sides n it’s just a wow feeling n blessing already with the energies of the bell…it’s a small Mahadev temple but quiet, peaceful n surroundings r just too enchanting…a must visit",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Cherasmatic beauty Tarkeshwar Mahadev Dham 🙏 Freezing 🥶 experience but mesmerizing spiritual. Hare Krishna please must visit this place but one request don't throw plastic and beer bottles here very shameful I have found roadside wherever I stopped I have found these non sense things please my beloved countrymen don't do this it's our heritage beauty Himalaya we have to protect it. It is protecting us always. Hare Krishna 🙏",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "✍️Such a peaceful tranquility amidst mother nature. The 🚶to the temple itself is so refreshing 👍😎💯. U need to be there to experience in real time. Simply awesome & serene atmosphere😎🥳🙏😘 A mesmerisingly dhinaku dhin dhaa experience. Just be alert & beware of the 🐒who can grab your prasad covers in a jiffy 😁👍👍👍👍👍👌",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "people find information many experience come keep spend reach time washroom watch may ago though philosophy quality least tranquility narrow hr refreshing arrangements side spiritual friends talks board treat parking yrs right eyes unknown lansdowne amidst also picnic maintained path need used temple youre rest mother villagers family road walk indian story fellow believe one much sort anything takes good visual person aligned nature studied peaceful go real",
                "pine different beautiful monkeys reach wont though middle altogether worldand walkits quiet mind lots forest worth yes need temple alot walk feed hand",
                "s surrounding surroundings seeing reach n what mesmerising small bells r it quiet ths valley sides mahadev enchanting feeling must amidst beauty path tall already temple not but a walk wow deodar still hill blessing bell regular energies trees person min visit peaceful start",
                "wherever experience dont stopped beloved krishna cherasmatic always freezing bottles beer spiritual plastic found mahadev please things us must beauty countrymen roadside throw non tarkeshwar dham mesmerizing one shameful protecting sense request protect himalaya visit hare heritage",
                "who such experience u prasad time awesome tranquility refreshing grab serene amidst alert jiffy mesmerisingly need dhin temple beware mother covers to dhinaku atmosphere dhaa simply nature peaceful real"
            ]
        },
        {
            "name": "Tarkeshwar Mahadev Mandir",
            "rating": 4.9,
            "address": "RQQV+H74, Tarkeshwar Road, Malara Bara, Uttarakhand 246155, India",
            "reviews": [
                {
                    "text": "A days trip from Lansdowne. You can visit here by taking a shared cab. Plan to visit in morning and you can take a bath in the kund and then visit the temple if you want. And please wear proper clothes, shorts middies etc are not allowed inside the temple. The temple is around half a kilometre from the cab drop off point. You need to trek here to reach the temple. Outside temple you can sit in the beautiful surroundings of pine trees and click some pictures.",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "What a place. It is about 35 km from Lansdowne and takes about one and half hours each way.  Road is narrow but is more or less okay. Traffic is not much. The scenic beauty of way to Tarkeshwar is awesome.  Once you reach temple there is a small treck of about 400 meters. Temple is located in thick forests of pine trees. Its worth visiting if you visit Lansdowne.\nCaution : Person driving the car should be expert in driving in hilly areas. Though the route is not very steep but there are blind curves and being narrow road chances of mishap are there.",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "I must say that this temple has an aura, a different type of energy can be felt, the moment you enter the temple area, fragrance of incense sticks will clear up your mind and you'll start feeling calm, at peace.\nAs you'll walk your way to the main temple, the sound of different sizes of bells will make your mind unruffled.. and the Lord Shiva idol performing tandava which is worshipped there also has something in it\nThere's an ashram also, just near the temple. One should spend 1 night there atleast, and go to the temple early in the morning.\nThough the way to reach the temple is tough but I must say it's worth it.\nOm namah shivay!\nOh oh and and the Maggie outside the temple also tastes very good! Go for it !",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Full of natural beauty, greenery, you must go there\nDon't skip this point saying that it is far\nWhole road and the point are scenic\nThis is first point in Lansdowne\nIf you skip other points and visit this point and santoshi mata temple it's worth\nBut skipping this point is not worth",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "This is 600 years old Shiva temple near Lansdowne (38 kms from main market). The temple is beautiful and is located in serene, secluded place amidst hills. The drive up there is very calming as there is not much crowd on roads but be careful while driving.",
                    "languageCode": "en",
                    "rating": 4.9
                }
            ],
            "preprocessed_reviews": [
                "shared pine kilometre click beautiful inside half wear surroundings reach pictures point allowed clothes bath shorts want please drop plan lansdowne cab need temple around outside kund trip proper days etc take morning taking trees visit sit trek middies",
                "pine thick route half blind km steep reach small though awesome caution meters okay treck lansdowne way driving beauty located worth visiting traffic hours tarkeshwar temple expert curves road scenic hilly car one much takes trees person chances forests visit less mishap narrow areas",
                "fragrance shivay different calm maggie worshipped near ashram spend reach moment lord idol bells shiva though sticks tandava type mind theres tastes say energy feeling something must way peace sizes also worth make tough temple performing go outside area walk night namah oh sound unruffled incense one felt enter atleast aura early clear youll morning good main om start",
                "natural dont greenery skipping mata points point full whole first santoshi skip lansdowne must beauty worth temple road scenic saying far visit go",
                "beautiful near roads drive hills shiva kms calming crowd old secluded serene lansdowne amidst driving located temple years much careful market main"
            ]
        },
        {
            "name": "Tarkeshwar - Siddh Peeth Tadkeshwar Dham Mandir",
            "rating": 4.7,
            "address": "RQQV+H74, Gundalkhet, Malara Bara, Uttarakhand 246155, India",
            "reviews": [
                {
                    "text": "Peaceful, positive aura, One can spend hours at this place, I did not know about Tarkeshwar dham unless I came here and got to know it's significance, Temple is surrounded by lots of trees.   If some one is coming around Lansdowne one must come to this place and feel nature's beauty at its best along with aashirvaad of this holy place, there were few people who were selling Pooja flowers and other puja samagri there. Overall I would come again and again to visit this wonderful.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "A beautiful, serene place surrounded by huge deodar trees. It give not only outer peace from noise n polluted city life but gives one inner peace. U just forget the time mesmerized in the simple but memorable place. The place says NO to plastics but at the same time provide steel utensils to devotees or travelers as an alternative to plastics. Well done the temple authorities",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Om namoh shivay...peaceful place..if you are going lansdowne thn plzz must go tarkeshwar temple its 35 km from lansdwone nd travel time 2hours..the temple is within a valley of old beautiful trees..very calm and peace one of mah bestest experience indeed..nd its 1500year old shiva templw..must visit guyss..",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "If you want peace of mind visit Tarkaiswar mahadev,Very nice place ,must visit.. 67 km away from kotdwar. Located in pauri district",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Wonderful experience... Not just in the temple area but also during the road journey from Lansdowne to Tarakeshwar. Peace, serenity, divinity, and oneness with Nature... All rolled into one... The temple committee maintains Dharamshalas or dormitories for letting travelers spend a night or two. But this requires advanced booking. There is a useful parking area for buses and cars. But travelers need to walk some distance from the parking area to reach the temple. Beware of naught monkeys in the vicinity... I think they have a special liking for chips and Maggie!",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "people would significance best along puja come got spend aashirvaad lots holy came natures lansdowne must beauty unless coming wonderful hours tarkeshwar temple around dham positive pooja surrounded selling flowers one know aura trees overall feel visit peaceful samagri",
                "provide authorities travelers beautiful gives u n time alternative forget polluted simple steel devotees mesmerized serene peace done temple city says surrounded deodar one well give huge trees inner utensils memorable noise life plastics outer",
                "om calm beautiful experience travel shivaypeaceful km placeif time lansdwone thn shiva hoursthe within treesvery namoh valley old must lansdowne peace temple tarkeshwar indeednd guyss mah year templwmust one nd going bestest visit go plzz",
                "peace located away kotdwar tarkaiswar pauri mind want must km visit nice mahadevvery district",
                "travelers experience naught monkeys advanced serenity special liking oneness spend reach distance two requires divinity dharamshalas journey think parking maggie lansdowne also peace letting committee cars vicinity need wonderful chips temple beware area road useful night maintains walk one buses dormitories rolled tarakeshwar booking nature"
            ]
        },
        {
            "name": "Neelkanth Mahadev temple",
            "rating": 5,
            "address": "Pauri Garhwal, Kamargarh, Uttarakhand 246129, India",
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Maheshwari ashram Tarkeshwar mahadev",
            "rating": 4.5,
            "address": "RQRV+273, Malara Bara, Uttarakhand 246155, India",
            "reviews": [
                {
                    "text": "It doesn't matter how good the photo is, but it has a different feel in reality.... Must be here once in life, you will find a lot of peace here ☮️ 🫀",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Peaceful place🙏",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "You ho",
                    "languageCode": "en-US",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "find reality peace photo different good doesnt feel life lot matter must",
                "peaceful",
                "ho"
            ]
        },
        {
            "name": "Rithakhal Nandoli",
            "rating": 2.5,
            "address": "WR76+686, Nandoli, Pali Malli, Uttarakhand 246131, India",
            "reviews": [
                {
                    "text": "my dress boys",
                    "languageCode": "en-US",
                    "rating": 2.5
                },
                {
                    "text": "Meru gaon",
                    "languageCode": "en-US",
                    "rating": 2.5
                }
            ],
            "preprocessed_reviews": [
                "dress boys",
                "gaon meru"
            ]
        },
        {
            "name": "भुवनेश्वरी देवी मंदिर",
            "rating": 3.6,
            "address": "WR39+RF6, चैधार, Naidharmalla, Uttarakhand 246172, India",
            "reviews": [
                {
                    "text": "It is a calm and lovely place near Chaidhar village (Chhoti Kashi)",
                    "languageCode": "en",
                    "rating": 3.6
                },
                {
                    "text": "Maa Bhuneshree temple built in Chaudhar$",
                    "languageCode": "en-US",
                    "rating": 3.6
                },
                {
                    "text": "This is Kamalpur",
                    "languageCode": "en-US",
                    "rating": 3.6
                }
            ],
            "preprocessed_reviews": [
                "chhoti calm near village chaidhar lovely kashi",
                "maa chaudhar temple bhuneshree built",
                "kamalpur"
            ]
        },
        {
            "name": "KALINKA DEVI MANDIR",
            "rating": 5,
            "address": "HILL TOP VILLAGE BARETHA, VVF4+454, Kolagad, Sald, Uttarakhand 246169, India",
            "reviews": [
                {
                    "text": "Very nice",
                    "languageCode": "en",
                    "rating": 5
                },
                {
                    "text": "Beautiful place",
                    "languageCode": "en",
                    "rating": 5
                },
                {
                    "text": "Jai Maa Kalika Devi",
                    "languageCode": "en-US",
                    "rating": 5
                }
            ],
            "preprocessed_reviews": [
                "nice",
                "beautiful",
                "maa devi jai kalika"
            ]
        },
        {
            "name": "Jhal mahadev",
            "rating": 4.6,
            "address": "RVW8+8F4, Bheladi, Uttarakhand 246155, India",
            "reviews": [
                {
                    "text": "Love this place",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "My hometown",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "love",
                "hometown"
            ]
        },
        {
            "name": "Koteshwar Temple",
            "rating": 4.2,
            "address": "VVX3+H8F, Sanglakoti, Uttarakhand 246172, India",
            "reviews": [
                {
                    "text": "The breeze is amazing",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Old Temple of lord Shiva",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Great experience",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Peaceful 🙂",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Beautifull",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "amazing breeze",
                "old lord temple shiva",
                "experience great",
                "peaceful",
                "beautifull"
            ]
        }
    ]
}