{
    "places_with_reviews": [
        {
            "name": "ARAKU VALLEY",
            "rating": 4.5,
            "address": "Araku - Visakhapatnam Rd, Araku Valley, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "Araku Valley is an amazing travel destination in India that I highly recommend visiting. The picturesque valley is located in the Eastern Ghats and is surrounded by lush green hills and coffee plantations. The journey to Araku Valley is also quite scenic and enjoyable.\n\nOnce you reach there, you can explore the beautiful Borra Caves, which are situated deep in the valley. You can also take a ride on the Araku Valley Railway that offers breathtaking views of the surrounding landscape.\n\nThe local food is also something that you must try while you are there. The bamboo chicken, a local delicacy, is a must-try. The hospitality of the locals is also quite notable, making your trip even more memorable.\n\nOverall, Araku Valley is a must-visit destination in India that offers a unique and unforgettable experience.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Araku valley is one of the beautiful spot in the visakha district. The view of araku valley is very beautiful and very peaceful. It's a famous tourist spot everyone can have a beautiful view at here. Araku valley we can buy spices and coffee powder,tea powder which was which was cultivated by the tribal people. The araku valley is located between the mountains so we can have a beautiful view.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Araku is a beautiful place to visit, 100 km from Visakhapatnam. Best place to spend a  weekend. The shiny look of the valley is lost due to the lack of yellow flowers which covered the whole valley from October to December. Valley missed the last star due to this.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "A crowdy but peaceful place. There's somewhat betterment in and around this place compared to my previous visit. There's an adventure sport, Zip line, which is having a ticket price of ₹500 but it's completely worth it and is completely encouraged by the visitors. The Borra Caves has an entry ticket of ₹60 for adults which is of course a good experience (be careful with the steps inside). The view of the nature is a complete bliss if you reach there early in the Morning especially in the winters.Bamboo Chicken is the most available dish which we don't get anywhere but the taste is just as normal as the ones we get in regular restaurants.We can try it for once as we won't go there everyday.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Amazing view points, wonderful places to visit and can be spent there our precious time in winter season Dec - March. Weekends and holidays are crowded but that crowd makes you feel good to enjoy and can make friends. We had a great time there and wonderful memories. Thank you Araku.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "amazing breathtaking try beautiful experience caves offers enjoyable travel destination reach hills eastern notable india journey plantations locals green views valley coffee musttry food railway borra quite something must also ride deep located visiting ghats situated picturesque unforgettable explore delicacy unique highly scenic surrounded hospitality trip local mustvisit making take chicken lush even landscape bamboo overall memorable araku recommend surrounding",
                "people beautiful tribal powder district everyone valley coffee visakha view mountains located famous tourist powdertea cultivated one spices araku buy spot peaceful",
                "best beautiful last december km spend lack whole valley missed weekend shiny look due yellow star flowers covered lost visakhapatnam visit araku october",
                "anywhere try experience inside dont caves zip normal reach line adventure adults ticket complete wont wintersbamboo crowdy somewhat steps everyday previous especially entry visitors theres borra view course restaurantswe worth taste around compared dish get bliss chicken ones encouraged morning price early good careful betterment available regular visit completely nature peaceful go sport",
                "amazing precious memories points time great dec holidays crowd friends crowded view winter make march wonderful season weekends thank enjoy spent makes places good visit feel araku"
            ]
        },
        {
            "name": "Tribal Museum Araku",
            "rating": 4.1,
            "address": "Araku Valley, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "Amazing tribal museum that depicts the culture around Araku valley. Must visit place, if you do not have any idea of the tribal culture. They have made some nice replicas of the culture and created entire show cases for the same. You can spend at least two hours or so, if you want to see things it. There is also a shopping place there to buy items that are more hand made.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "It was a must visit place, and there are many activities like zip lining, boating and many more. this museum reflects the life of tribal people . Dinsa dance will be performed in evening time. You can do shopping and you can buy the organic products made by the tribal people at low cost. Visit this place in the evening time with your family. definitely you will enjoy this place.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "My teen cousins had a blast using the swings and the see-saw and just for that - the visit to the Tribal Museum was worth it. I got to be a kid again with them too :D\n\nOur grandfather enjoyed looking at the life-sized models built to show how indigenous people go about their daily lives in their villages.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "Situated in the heart of Araku City, presenting life and workstyle of native tribal people in the region. Well maintained and decorated. Ethnic shops are available inside the museum premises with food stall, playgrounds and other events. Recommended for kids. Just for museum, 1 hour is enough.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "We spent around an hour to have a glance at the beauties of the tribal museum.\nWorth every penny of the ticket.\nThe museum has everything that embeds the tribal people's lifestyle.\n.",
                    "languageCode": "en",
                    "rating": 4.1
                }
            ],
            "preprocessed_reviews": [
                "amazing tribal spend show nice two least items valley want entire things idea see must also created hours around made museum depicts cases shopping visit araku buy culture replicas hand",
                "people cost many tribal zip products time dance organic lining reflects evening must boating low performed museum made family definitely enjoy shopping visit buy activities dinsa life like",
                "people tribal swings kid got looking teen show using villages built worth daily lives blast museum cousins seesaw enjoyed visit models go grandfather lifesized indigenous",
                "people tribal presenting inside hour workstyle playgrounds events premises kids stall food ethnic region maintained shops situated enough city museum recommended decorated heart native well available araku life",
                "glance worth lifestyle ticket tribal everything around every hour museum embeds spent peoples beauties penny"
            ]
        },
        {
            "name": "Coffee Museum",
            "rating": 4.2,
            "address": "Araku - Visakhapatnam Rd, Araku Valley, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "Authentic place for coffee lovers. This place shows you about history of coffee brewing. Process of coffee brewing from fresh and local plantations. Here you can buy different type of coffees and chocolates. This place has also show cased different sculptures related to coffee. But only gap is maintenance and cleanliness which is not good.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Okay, this museum is pretty small and wasn't in the best shape, but we had fun and the coffee was great!\nI had arabica coffee, while my younger cousins tried the hot chocolate and the classic cold coffee - everybody was happy with their orders. The hot coffees come with separate sugar, so I was happy to mix it exactly how I like it.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Coffee Museum Overview\n\nOne of the places to visit in Araku Valley is the Coffee Museum. In 1930, a migrant by name Prakash Rao had set up a catering service for tourists to highlight the uniqueness of the Arabica Coffee. In 1954, he started a Coffee house, which catered to foreign delegates and coffee traders. However, it is now open to all.\n\nThe museum manned by educated tribal staff showcase a series of pictures detailing the origin and history of coffee. They market 60 varieties of coffees and an array of 600 coffee-chocolates. Visitors can satiate their hunger and appease their craving by indulging in delicacies such as chocolates, sandwiches, brownies, mousses, tarts, etc and savor stimulating coffees.\n\nLocation: Visakhapatnam Road, Araku, Andhra Pradesh.\n\nPrice: Entry Fee is Rs. 10 per person.\n\nTiming: Monday-Sunday from 09:00 a.m. to 08:00 p.m.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "It is an okish coffee museum. Not maintained well.  Has decent info about history of coffee.  Very poorly maintained portraits, lights and other things.  Two small rooms with some exhibits.  You won't miss much if you skip it.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "The Coffee Museum in Araku Valley was a charming stop. The entry fee was very reasonable and it was fun to learn about the history of coffee cultivation in the region. The exhibits with the tableaus were informative and engaging.",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "different coffees show related chocolates type plantations fresh history sculptures coffee also authentic lovers cased local gap process shows good brewing cleanliness maintenance buy",
                "best hot come arabica coffees fun shape small orders great exactly coffee okay mix chocolate younger museum classic separate pretty cold happy cousins sugar tried everybody like wasnt",
                "highlight tourists series timing overview set name detailing tribal rs delegates manned varieties traders staff coffeechocolates arabica coffees sandwiches array brownies pictures andhra chocolates open history valley coffee pm delicacies entry visitors craving rao educated tarts stimulating house mondaysunday catered origin prakash pradesh service hunger museum road showcase appease however indulging fee mousses started location one etc visakhapatnam satiate per price places person market visit araku catering migrant foreign savor uniqueness",
                "portraits miss two wont small okish info exhibits history coffee things poorly skip maintained museum lights decent much well rooms",
                "engaging charming informative exhibits cultivation history tableaus valley reasonable coffee learn araku museum entry fun fee stop region"
            ]
        },
        {
            "name": "Padmapuram Gardens",
            "rating": 4,
            "address": "Padmapuram village, Arakuvalley, ITDA Paderu, 8VPH+MX6, Araku Valley, Andhra Pradesh 531151, India",
            "reviews": [
                {
                    "text": "We visited in January. The gardens looked faded and unkempt. For four of us, we spent Rs 480.00 (Rs 60 entry + Rs 60 for toy train). Nothing great to see here at this time of year. No roses at this time of the year and not much time. All in all a rather dull experience. If you like a quiet place to picnic (just lie down and relax) and have a lunch this will work. There are plenty of quiet spots under the shade. Suggest you do your home work and Find out which is the best time of the year to visit or consider another spot on the Araku visit list.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "I wish we had packed a picnic lunch for visiting this garden, since it's a great spot to just walk around and then sit under some trees with a picnic basket, have conversations, play board games/cards. Or for the readers - read a book.\nThere's a toy-train which is fun for kids.\n\nSince we visited in Jan, the weather was fantastic. But if you plan to visit in summer months and make a picnic out of it, you should pack a huge umbrella/parasol.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Wouldn't recommend it to people who are visiting it just coz they were told to visit.\nWe visited this because in our Araku package they had this as a stop. There's a 60 rupee fee, and we didn't find it worth it at all.\n\nNo doubt, they have well maintained garden but there are better gardens in Vizag(where we came from) which are free as well...",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Padmapuram Gardens is also called Botnical Gardens. Must visit in the morning hours and spend at least an hour or 1 and half an hour to see completely. It is well and cleanly maintained. Also, it's a good place for photoshoot. We can choose to walk around Gardens , or we can choose toy train to cover.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Huge garden. Totally not maintained.Very minimalistic maintenance going on. Could have been an amazing place. Has a toy train which works though. Costs 60 INR per person. Free parking available",
                    "languageCode": "en",
                    "rating": 4
                }
            ],
            "preprocessed_reviews": [
                "faded roses find visited relax lie best rs experience list unkempt time consider spots great dull january toy work quiet entry home us rather see gardens train picnic spot another spent year four suggest much shade looked plenty visit araku like lunch nothing",
                "visited wish gamescards months weather fun book great pack garden conversations kids board theres packed toytrain read plan summer picnic make visiting around jan fantastic umbrellaparasol walk huge trees readers visit sit basket play spot lunch since",
                "people find visited free package wouldnt garden doubt theres came vizagwhere gardens maintained worth visiting coz fee better well didnt visit told araku rupee recommend stop",
                "cover padmapuram half botnical hour spend least toy see called choose must also gardens maintained photoshoot train hours around walk morning well good visit completely cleanly",
                "amazing free totally though minimalistic garden toy inr parking could train works costs maintainedvery going per huge person available maintenance"
            ]
        },
        {
            "name": "Rana Jilleda Water Falls",
            "rating": 4.1,
            "address": "9V7M+XX6, Visakhapatnam, Andhra Pradesh 531151, India",
            "reviews": [
                {
                    "text": "Waterfalls is beautiful. Very pure water and best place for photography. But little danger here for children. Because of short edge of the hill. We are enjoyed a lot here at morning. We got Beautiful view from here.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "Very good place especially the road leading to waterfalls i stunning",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "Very nice waterfall with tricking experience you will enjoy a lot",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "No tickets needed as it's very basic spor, can be skipped as well. Parking available. Not clean at all",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "I have been enjoying a lot with this location Full of Enjoy with ur family members as well as....❤️‍🩹👌",
                    "languageCode": "en",
                    "rating": 4.1
                }
            ],
            "preprocessed_reviews": [
                "hill short little best waterfalls beautiful enjoyed water morning children got edge view danger photography pure lot",
                "waterfalls leading good especially road stunning",
                "lot waterfall experience enjoy tricking nice",
                "skipped needed basic well available clean parking tickets spor",
                "location full well members as ur family enjoy lot enjoying"
            ]
        },
        {
            "name": "Giri grama darshini",
            "rating": 4.4,
            "address": "8WCF+HH6, Unnamed Road, Rampalle, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "It was a must visit place with your family or friends. Don’t think that it was far from araku Valley, just go for it. You will not regret. you can get dressed up in local tribal attires. They were maintaining this place very neat and clean. If you want they can arrange a marriage in their tribal tradition way. This place shows that how tribal people live they cook and they do their daily work. parking facility was available.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "This is the place in its fullest life. It will make you live in your older times. You can feel your old golden days. The people here are tribals. They are very polite and well mannered.\nI personally had a very good experience.\nI bought the tickets for the attire and dhimsa dance. But i requested the staff to play the original dhimsa music for our dance. But the person having the music had gone for lunch. I got a little upset because the staff were also getting ready for lunch. But i insisted on the music because we were also getting late to return to our resort for which we have to go through a ghat section before getting dark.\nSuddenly i noticed something, that all the staff were moving fast and making arrangements for dhimsa as the person having music came back.\nI literally thank the dhimsa dance crew for leaving their tiffin boxes and food open and started to prepare for dance. They performed the dhimsa dance with original dhimsa music for 25mins.\nHere now i really want to say sorry to the staff and dancing crew that i got upset and insisted on music and dance. They were very humble and did not utter a word and danced for us even though they were hungry and were about to eat. They just sacrificed hunger for me.\nWe were also very hungry and exhausted.But the raagi puttu they served us which was a very less quantity and in leaves. Believe me, that little quantity when we ate, we felt completely active and got good strength. We lost al our restlessness. I asked for more and they served me another cup happily.\nI felt very sorry for the staff and dancing crew.\nThey are very very humble and polite and all were smiling beauties. May God bless them with all success. I request all the tourists to visit this place for sure when visiting araku. These kinds of places will make you get to know our age old tribal customs and rituals.\nI suggest all the tourists to reach this place by the first hour of the day.\nNote: There is no food arrangement near this place. You have to go to araku town for food.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Giri grama darshini,\nLocation wise is awesome this December 15 to 31..\nWe are staying here at a villa price of 2500/- per day.\nYou need to enjoy it here in a very pleasant nature.. must visit..",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Happy,,, enable to express words about the please .Atmosphere, surroundings ect,,, beautiful Nature .The trible employees (both male and female) are very polite and honest. We advise all the people (specially urban people) to visit this place (Giri grama darshini) and spend some time, lots of mind relief available (some of mental physical deceseges will automatically reduced).",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Nice place to visit... we don't have anything to enjoy in araku except weather till now... now we have this... charging 250/- for female dressing.. I feel it is a bit expensive other than that entrance tic for adults is 50/- per head and for kids 20/-... overall nice place to take pictures in village style...   and one more attraction is the sun rise point in araku... nearby viewpoint, so many attractions are there like  local dance, pot making, breakfast, araku coffee, hills, greenery, and open cradle. everything is so good... do visit these places without fail...",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "people attires tribal cook t tradition work valley friends think want parking arrange must way live daily dressed family local get neat shows far marriage available don visit araku regret clean facility maintaining go",
                "late day insisted tribal ate fast raagi requested polite literally reach quantity sorry food puttu gone say moving beauties sacrificed live kinds leaving original attire tiffin tribals started exhaustedbut bless well ready dancing less araku completely lunch note people got section active strength may hungry first want rituals back old fullest bought prepare dhimsa arrangement older boxes days age believe really making suggest town leaves person feel visit restlessness golden return tourists experience near danced served though cup eat al dance getting arrangements sure smiling us make times word performed another thank dark know good ghat mannered customs play humble go resort tickets little utter staff personally hour noticed success happily god suddenly open asked came something also crew visiting hunger upset get music felt lost even places request mins life",
                "giri location awesome villa pleasant day staying per need december price darshini wise visit grama nature enjoy must",
                "people relief beautiful surroundings darshini employees polite ect spend time express physical mind lots please trible specially male honest advise giri female enable deceseges grama urban mental happy atmosphere available reduced visit words nature automatically",
                "style cradle many fail everything dont weather village attractions greenery head dressing adults nice pictures point hills without viewpoint dance open bit kids coffee attraction female expensive breakfast charging enjoy local nearby one making take tic anything except till per good sun places overall visit araku feel pot like entrance rise"
            ]
        },
        {
            "name": "Madaguda",
            "rating": 4.6,
            "address": "8VGH+W2J, Araku Valley, Andhra Pradesh 531151, India",
            "reviews": [
                {
                    "text": "Visitors often praise Madagada Viewpoint for its mesmerizing vistas and tranquil ambiance. The panoramic views of the lush valleys and rolling hills are awe-inspiring, providing a serene escape from the hustle and bustle of daily life. The viewpoint's beauty is heightened during sunrise and sunset, making it an ideal spot for photographers and nature enthusiasts. However, some suggest caution due to the narrow roads leading to the viewpoint. Overall, it's hailed as a serene and picturesque destination worth exploring.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Exlent view visit only mrng 5 am to 8 am",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Peaceful place",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "aweinspiring valleys often hailed roads vistas tranquil destination madagada hills sunset heightened viewpoint providing hustle narrow caution views ideal praise visitors serene exploring panoramic beauty worth ambiance daily sunrise picturesque mesmerizing however due making suggest lush bustle leading viewpoints overall rolling photographers nature spot life enthusiasts escape",
                "mrng view visit exlent",
                "peaceful"
            ]
        },
        {
            "name": "Church of Christ Araku Valley",
            "rating": 4.5,
            "address": "8VGM+CXJ, Araku Valley, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "Magnificent and surreal beauty. This church gave me goosebumps. I found divine peace and the songs played could be heard from far places in the valley. Very well maintained church in the most prominent location.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Overrated church\nNot a tourist place\n\nThey won't allow you cams, and there is no parking as well",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This is not what you think . The correct church is sankkarmatta church around 13km from here\nDo not visit here . Waste of time .",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It's beautiful place for photo shoots",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "wrong location folks",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "played divine church songs surreal gave valley found magnificent could prominent peace beauty maintained heard location well far places goosebumps",
                "overrated allow well tourist church parking cams wont",
                "waste correct sankkarmatta around think km visit time church",
                "beautiful shoots photo",
                "wrong location folks"
            ]
        },
        {
            "name": "Museum of habitat",
            "rating": 4.6,
            "address": "8VFH+374, Araku Valley, Andhra Pradesh 531149, India",
            "reviews": [
                {
                    "text": "Amazing 😍",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Overall, worship in this  church is wonderful",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice place to know about how is their living life",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Good Experience🌿💒🌱🕍",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "amazing",
                "worship overall wonderful church",
                "living know life nice",
                "experience good"
            ]
        },
        {
            "name": "బోద్ఢవొర వాటర్ ఫాల్స్",
            "rating": 3.9,
            "address": "road, boddavara, 53GR+H54, road, Araku Valley, Andhra Pradesh 535145, India",
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}