{
    "places_with_reviews": [
        {
            "name": "Golu Devta Temple (Bell Temple), Ghorakhal",
            "rating": 4.8,
            "address": "Ghorakhal, Uttarakhand 263156, India",
            "reviews": [
                {
                    "text": "Lord Golu is the local God of the Kumaon region of state of Uttarakhand. his temple is situated between the mountains the weather of this place is awesome and you can get a proper view of Nainital from here. The temple has uncountable bells put by people who worship to fulfill their dreams and complete their wishes. Here people keep a letter of dreams or what they want written there",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The Golu Devta Temple, known as the \"The Bell Temple\". Thousands of Bell from gate to all over around. It is a unique temple with full of several sizes Bells and hand-written prayer letters. It is widely believed that devotees prayers are fulfilled. several devotees in the temple for darshan and puja. The ambience was serene. It was a blissful visit to the temple. The temple is adorned with countless bells donated by devotees. Parking area approach road isn't very great and broken on multiple places ...",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Golu Devta Temple\nGhorakhal, Nainital\n\nThe deity worshipped in this temple is called 'Nyay Golu Devta' and is believed to impart instant justice to his devotees.\n\nThe temple is located at a height of about 6,600 ft above sea level, and is also known to tourists & devotees as the 'Bell Temple', due to the MILLIONS of bells tied there by eager devotees in the pursuit of justice. These millions of bells tied on each side of the temple, inside, outside, along the corridors and in every available vacant space within & without the temple signify the faith of the devotees in 'Golu Devta' as he is known in these parts.\n\nMany of these bells are accompanied by hand-written requests by devotees to dispense justice, of which also there are several thousands that can be seen tied to every available support...\n\nThis is one location that literally oozes belief and divinity...\n\nThere is also a belief that a newly married couple who comes here for darshan, ensures that their relationship endures for seven births.\n\nThe temple is also home to the idols of several other Gods & Goddesses, each of which is surrounded by thousands of bells. It is quaintly believed that the size of the bell is directly proportional to the magnitude of the prayer that has been fulfilled!\n\nThis famous temple is easily accessible from Nainital, Kathgodam & Haldwani",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The place is peaceful and serene. Never seen any temple like this before. Here the belief is that with every wishe you have to tie a bell in the temple. People have also noted down the date of completion of there wishes. The views from the temple are amazing. Must visit on your trip to nanital.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Peace, calm, positive vibrations, power, there are so many adjectives to be added here. The place is magical. Definitely a must visit temple. It’s not very commercialised hence remains untouched. A definite visit during Aarti time the places becomes magical.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "people weather kumaon keep nainital wishes lord complete bells awesome written god put want uttarakhand dreams fulfill view mountains region situated temple proper local get uncountable letter state worship golu",
                "blissful known adorned widely puja isnt prayers gate bells ambience donated full great darshan parking believed serene sizes letters temple around area road unique prayer countless devta approach bell handwritten places several multiple thousands fulfilled visit broken golu devotees",
                "literally belief darshan parts ghorakhal located famous deity prayer location tied idols impart fulfilled directly devotees divinity size side every corridors called eager temple vacant due faith devta one bell handwritten magnitude instant requests seen tourists along space many worshipped millions nyay comes support pursuit without within believed relationship goddesses accessible kathgodam ft births signify sea haldwani proportional level several thousands height golu known inside couple nainital seven bells dispense home also ensures quaintly outside gods surrounded endures newly oozes accompanied married available justice easily",
                "people amazing wishes belief tie nanital completion every never views serene must also wishe date temple trip noted bell visit like peaceful seen",
                "calm many s vibrations time commercialised remains aarti it adjectives definite must peace magical added temple becomes positive definitely untouched hence places visit power"
            ]
        },
        {
            "name": "Naukuchiatal",
            "rating": 4.6,
            "address": "naukuchiatal, Siloti Pant, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Take a risk, go off road as the view is really worth. Recommend going there towards the evening when there's breeze and the feel is more relaxing. Make sure your driver knows that it's off road and the Car is safe to go there.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Amazing boats. Decorated like kashmir boats. This lake is beautiful surrounded with mountains. Must visit. Enjoy boating with your family and friends. Starting price is Rs 600 varies according to the boat size and look. You can share the price with more people if you are less people.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "It's Dal lake of Bhimtal...\n\nSikara ride is must here.\nRs. 500 per ride for 30 min.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "A beautiful place to spend time with your family and loved ones .Many activities are also there like kayaking , boating etc . Definitely a fun place to be",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Crowd wise better than Nainital, also here are so many aesthetic cafes",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "breeze relaxing knows sure safe towards theres view evening driver risk worth make road car really take going feel recommend go",
                "people amazing boats rs beautiful starting size lake friends mountains according must boating varies look family enjoy surrounded decorated kashmir share boat price visit less like",
                "ride bhimtal rs per lake min sikara dal must",
                "kayaking boating etc ones many beautiful loved spend family time activities definitely fun like also",
                "better many crowd wise nainital aesthetic cafes also"
            ]
        },
        {
            "name": "Ghorakhal mandir",
            "rating": 4.9,
            "address": "9HJ3+Q85, Gorkhakhal - Shyamkhet Rd, Uttarakhand 263156, India",
            "reviews": [
                {
                    "text": "Golu Devta ( goljyu devta) a famous deity of kumaun. Golu devta is also known as the incarnation of lord shiva.  This Temple is famous for its justice policy. People write their wishes on paper and tie it there. When there wish is completed then they offer bells in this temple. That's why there sare soo many bells in this temple.",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "This place ❤️ vibe is just so pure & magical. 1000% must visit.\nRecommend to visit in morning around 7:30 for Aarti & you would treat yourself such a Divine experience. The way everyone involves you in the pooja & the temple staff, Poojari ji & regular people are so good, sweet & helpful would treat you so good. Everyone around you creates such a positive, happy environment that it adds so much to the vibe. Would try to come here atleast atleast once every year.",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "The vibe of the mandir is just so great. The mandir is of Golu Devta. Golu Devta, is said to be an incarnation of Lord Shiva and the temple is one of the main attractions in Ghorakhal.\n\nThousands of bells are their in the mandir. Such a great vibe and location. From the stairs of the temple u can see bhimtal lake. The view is amazing.\n\nFrom the bells hanging all around and the vows written on the papers of the devotees, it can be clearly inferred that Golu Devta is worshiped as a just deity in the Devbhoomi.\n\nThousands of bells tied all over the temple are a symbol of people's faith in Golu Devta.\n\nWhile Ghorakhal is famous for its natural beauty, it is a spiritual and important religious place.\n\nThere is a crowd of devotees throughout the year.\n\nThere is a lot of activity in the temple during Navratras and Shravan month.",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "It's a beautiful temple I ever visited... Neat and clean temple... No irritating priest ....  must visit in nainital",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "very nice Temple with few steps to climb and maybe 1 crore bells, some being really huge. Definitely worth the visit.\nwe had started from Nainital at 10am with same driver and car we used earlier day (Kanta Sah, great guy from uttarakhand travels) visited Kainchi Dham, Ghodakhal temple, Tea garden and Apple orchard, even saw the beautiful house where Sri Rabindranath Tagore stayed.",
                    "languageCode": "en",
                    "rating": 4.9
                }
            ],
            "preprocessed_reviews": [
                "people known many wish wishes tie lord soo shiva bells kumaun sare completed also paper famous goljyu deity temple policy incarnation offer devta thats write justice golu",
                "poojari people would ji try experience come creates staff sweet divine pure helpful aarti environment vibe everyone adds every treat must way magical involves temple around pooja positive year happy much morning regular atleast good visit recommend",
                "amazing stairs bhimtal natural u attractions devbhoomi clearly lord important bells shiva great written vibe hanging lake spiritual crowd religious worshiped view see symbol ghorakhal beauty inferred famous mandir said temple around deity navratras incarnation year faith location devta one throughout tied papers activity month shravan thousands vows main lot peoples golu devotees",
                "visited beautiful irritating temple priest must visit clean nainital ever neat",
                "sri visited day beautiful travels tagore nainital sah nice bells great garden steps guy apple stayed uttarakhand tea maybe kanta orchard saw driver worth house crore climb used temple rabindranath dham definitely car started kainchi really earlier even huge visit ghodakhal"
            ]
        },
        {
            "name": "Naukuchia Tal Lake",
            "rating": 4.8,
            "address": "8HCM+VF8, Nainital, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Another lake in Nainital. It gets its name from the nine corners it is supposed to have. If you are travelling all the way from Nainital to visit it the question that could haunt you is ' was it worth it?",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Awesome experience of boating in naukuchiatal lake, less crowded and clean.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's famous for adventure sports where one can try kayaking, zipline, waterbouncing, air bouncing, climbing, boating etc but one thing I'ld like to say is that it depends upon how you bargain like he asked for 800rs per person and finally we gave 200rs for three so you need to ask from many  boatmen for that and  if you are coming with friends do enjoy it",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Great place to spend some quality time with your family or friends. There are a number of adventure sporting activities that one can experience here including kayaking, water zorb, lake crossing, etc. Apart from that there are shikara and paddle boats available for a calm boating experience.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Best place to visit during your stay in Bhimtal    The lake is huge and has many different types of boating facilities. Be it solo partner or with your family. Avoid a famous cafe beside the lake called Colonels cafe. It only looks good.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "way haunt worth name lake visit gets another question nainital travelling could corners nine supposed",
                "awesome boating naukuchiatal experience lake less clean crowded",
                "try rs many boatmen adventure three ask climbing gave friends asked depends say upon kayaking zipline boating famous need coming waterbouncing bargain sports air enjoy thing bouncing one etc finally per person like ild",
                "boats apart calm experience including spend time adventure number great sporting quality water lake paddle friends kayaking boating zorb family one etc available activities shikara crossing",
                "stay best bhimtal many different types cafe beside facilities lake partner called solo looks boating famous colonels family avoid huge good visit"
            ]
        },
        {
            "name": "Sattal Water Fall",
            "rating": 4.5,
            "address": "8GX9+PJ3, Sukha, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Set amongst dense forests of oak and pine trees, Sattal waterfall is one of the few unspoiled places to visit in Uttarakhand. The place is a paradise for bird watching.\nA hike of around 1.5km will take you to the fall. Carry something for munching as you would not find any shop once you start the hike.\nThe best time to go is early morning or before the sunset.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Wonderful trek, really an offbeat destination",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Amazing.... Refreshing... Scenic... This is the Best Waterfall I have ever been to and The Best place in recent times that I have visited... So Fresh.... Clicked a lot of Beautiful birds... The Water is so Pure.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "A perfect escape in nature with your family and friends.\nA lovely hike of 1-2 kilometres to this waterfall from sattal lake.\nEntry fees to this reserve is 10rs per person.\nOn long weekends it gets densely crowded, however if you want this fall just for yourself visit on weekdays.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Nice place to visit around Nainital, those who couldn’t visit Nainital due to overcrowding, can easily visit here to explore this beautiful place/lake/activities.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "pine find would best set munching km time hike sunset amongst carry waterfall bird fall paradise sattal oak uttarakhand something dense watching around one take morning unspoiled trees places early forests visit go shop start",
                "really wonderful destination trek offbeat",
                "amazing visited best birds waterfall beautiful refreshing times fresh water ever clicked scenic pure lot recent",
                "rs densely gets hike lovely waterfall lake fall perfect sattal friends want entry crowded reserve fees family weekends however weekdays kilometres per person visit nature escape long",
                "beautiful t around due overcrowding explore visit placelakeactivities nainital couldn nice easily"
            ]
        },
        {
            "name": "Hanuman Mandir Bhakti Dham Hindu Temple",
            "rating": 4.7,
            "address": "8HJP+4CC, Naukluchiatal, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "This temple and ashram is in the way to Naukuchiyal lake . A large hanuman statue is the main attraction. Temple carvings and minars are great and beautiful.\n\nA cave passage is here. Decorated with colourful stones. Inside the building there is a prayer hall and yoga hall. Maunimaa photo is installed here. This premises is belonging to the Bhakti dam Asram.\n\n#hanumanmandirbhaktidamtemple",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Oh My God. What great place this is. We were just passing by this Temple and we couldn't move further without visiting this. The tall God Hanuman Murti is so beautiful. Apart from the temple, this is a great scenic place. It offers an awesome hill view. Since paragliding place is nearby, you'll get to see people flying from there.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Devine Destination • Peaceful • 22ft Hanuman idol\n\nThis is a famous temple of Lord Hanuman. It is highly peaceful and divine place and a must visit for every tourist. Unlike other temples, this temple despite being famous, remains less crowded and peaceful. Surroundings are clean and the temple is well maintained. It is near Naukuchiyatal lake. It houses a 22 feet idol of Lord Hanuman. One can visit this temple on the way to Naukuchiyataal lake.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Very beautiful Hanuman Mandir near Naukuchiatal lake with a huge Hanuman statue. The view from this temple is just awesome with a lot of greenery, parachutes flying in the sky and the mountains touching the clouds.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Its a beautiful Hanuman temple with very big statue and cave-like entry",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "bhakti dam minars installed beautiful inside hanuman ashram great statue asram lake yoga premises colourful belonging stones way attraction photo naukuchiyal temple passage large prayer decorated hall cave building carvings maunimaa hanumanmandirbhaktidamtemple main",
                "people apart couldnt beautiful hanuman offers murti move without great awesome god flying view see passing tall visiting temple paragliding oh scenic nearby get hill since youll",
                "near houses hanuman surroundings devine destination divine lord idol remains feet lake every crowded naukuchiyatal must way maintained despite famous unlike naukuchiyataal tourist temple highly ft temples one well visit less clean peaceful",
                "clouds beautiful near hanuman greenery touching awesome statue lake flying sky mountains view naukuchiatal parachutes mandir temple huge lot",
                "statue beautiful cavelike hanuman temple big entry"
            ]
        },
        {
            "name": "Bhim Taal Lake",
            "rating": 4.4,
            "address": "8HW5+7P8, Bhimtal, Harinagar Chanddeva, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Good as much as naine lake , i visit here first time with my car , even if you having 10 15k kilometres driving experience , you can go their with own vehicle. Also this spot having one advantage of activities like paragliding. So must visit place.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Bhimtal Lake, nestled in the serene landscapes of Uttarakhand, emerges as the perfect refuge for those seeking a peaceful and picturesque getaway. During our exploration of the lakes in Uttarakhand, Bhimtal stood out as not just a destination but a serene base camp offering tranquility, accessibility, and budget-friendly accommodation.\nOne of the key advantages of choosing Bhimtal as a base is its strategic location. Positioned amidst the cluster of lakes in Uttarakhand, it serves as a perfect hub for exploring the nearby lakes, including Nainital. The ease of access to various lakes makes it a convenient choice for those wanting to soak in the beauty of multiple destinations without the hassle of constant travel.\nLike its counterparts, offers the enchanting experience of boating on its serene waters. Additionally, the presence of a small island with an aquarium museum adds a unique touch to the overall charm of the place. Exploring the island and its attractions is a pleasant diversion from the routine boating experience.\nWhile the food options around Bhimtal may be fewer compared to more bustling destinations, the simplicity of the meals offered by our hotel, Treebo Trend Vista Lago, was a delight. The combination of simplicity and deliciousness added to the overall charm of our stay, making it a satisfying culinary experience.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "This lake is so beautiful. You will get an amazing life time experience here, once miss Nainital but should not miss this.\n\nAlso you will get different food here.\n\nMain attraction point is Bhimeshwas Mandir and Kechuli Devi Mandir.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Mesmerizing View of Nature.\nYou must definitely go for the Boat Ride.\nWeather is pleasant in most parts of the year.\nAvoid Rains.\nIt is the second largest lake of Uttarakhand by surface area after Tehri Lake. Lot of wildlife can be seen nearby.\n\nThe fish species found in the lake are common snowtrout, catla, rohu, silver carp (Hypophthalmichthys molitrix) and grass carp (Ctenopharyngodon idella).\n\nOverall excellent plant to calm oneself.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "A nice and upscale place with beautiful cafes, and restaurants and hotels. One can enjoy boating in the Tal, in country boats. Life jackets are compulsory for everyone.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "experience naine time vehicle lake first advantage driving also must paragliding car kilometres one much even good k visit activities spot go like",
                "stay meals offered additionally attractions nestled travel treebo exploration island advantages offering fewer positioned uttarakhand food serene exploring amidst boating pleasant emerges compared landscapes location charm trend strategic choosing serves overall soak peaceful access bhimtal ease accommodation diversion offers various destination including small may camp cluster touch lake destinations satisfying vista museum seeking choice nearby one making refuge wanting base experience key combination without enchanting constant counterparts culinary around deliciousness delight routine hub waters lago like accessibility bustling hassle lakes options nainital presence tranquility simplicity adds perfect beauty added picturesque unique stood aquarium getaway makes convenient budgetfriendly multiple hotel",
                "amazing different beautiful experience bhimeshwas kechuli nainital time miss point lake food also attraction mandir get main life devi",
                "hypophthalmichthys wildlife calm surface weather molitrix species silver lake tehri largest parts found uttarakhand carp view must ride fish snowtrout pleasant ctenopharyngodon idella catla area definitely mesmerizing avoid common year nearby rohu boat rains excellent oneself grass overall nature go lot second plant seen",
                "country hotels compulsory one boating tal boats beautiful life everyone upscale restaurants enjoy jackets nice cafes"
            ]
        },
        {
            "name": "Bhimeshwar Hindu Temple",
            "rating": 4.6,
            "address": "Bhimtal, Daa, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Very peaceful temple. The shiva linga is very glorious. But temple sides are dirty quite. Free entry. Jai bholenath",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Simply divine! A peaceful temple situated beside the Bhimtal lake.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "If you are planning to visit Bhimtal, so must visit this temple.\nYou will get positive vibes there.\n\nHar Har Mahadev",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "This is a beautiful serene temple of huge devotion and spiritual connection. Clean, full of positive vibes and one can pay respect while listening to bells and prayers.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Peaceful and serene. This is historical temple where Pandavas worshipped God Shiva. It is located along Bhimtal lake. Enough space to pray and worship. There is facility for shoe rack, hand wash and benches to sit. The fresh air from lake makes the atmosphere more religious and pure. Must visit if one goes to Bhimtal.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "jai bholenath linga free temple glorious sides dirty entry peaceful quite shiva",
                "bhimtal lake situated temple divine simply peaceful beside",
                "planning har bhimtal temple visit mahadev get positive vibes must",
                "full one listening beautiful respect huge connection temple pay spiritual clean positive vibes prayers devotion serene bells",
                "along bhimtal space shoe worshipped pray pandavas pure shiva goes god lake fresh benches religious serene must located temple enough air makes one atmosphere worship wash rack visit sit facility peaceful historical hand"
            ]
        },
        {
            "name": "Water fall",
            "rating": 3.9,
            "address": "8GVH+FGW, Suriyagaon, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Best place to visit",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "I was suffering from psoriasis and didnt get any relief even after visiting many doctors. Finally it was Dr Karan's treatment that got me relief from this ailment.",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Amazing place to see the roadside waterfall and greenery",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "It is near the bhimtal lake",
                    "languageCode": "en",
                    "rating": 3.9
                }
            ],
            "preprocessed_reviews": [
                "visit best",
                "treatment relief many finally visiting suffering psoriasis even didnt doctors got karans dr get ailment",
                "amazing waterfall roadside greenery see",
                "near lake bhimtal"
            ]
        },
        {
            "name": "Kumaon Mandal vikas Nigam Ltd. Parichay Resort Tourist Lodge/ Naukuchiyatal",
            "rating": 4.5,
            "address": "लोकल मार्ग, Naukluchiatal, Uttarakhand 263136, India",
            "reviews": [
                {
                    "text": "Good location, very peaceful. Food is like home food. It has a private area from where you can directly access the lake. It has ample parking. The rooms are spacious and have views of the lake though obstructed by trees.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "We stayed at KMVN Parichay for New Year Celebrations, and it turned out to be a good decision. We liked the property located by the lakeside, perfect setting in a serene environment. They have a private jetty, providing easy access to the lake. The food was good and fresh. The hotel staff was very courteous and friendly.\nThis hotel is ideal for peaceful relaxation where you can sit idle for hours. We were sitting idle, soaking in the winter sun. We had a lot of fun during our stay and had bonfires in the night with lots of snacks to eat and drinks.\nWe booked rooms in 3 different categories Cottage, Royal Premium, and Super Deluxe rooms for our family and friends, and we were not disappointed with any of these.\nI would recommend KMVN Parichay for a peaceful stay in a serene environment with a lake view. However, if you’re looking for luxurious amenities, this might not be the right place. I hope this helps!",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "I recently stayed at Parichay KMVN lodge in Naukuchiatal and had a great experience. The hotel is a basic property with a beautiful location and a serene environment. The hotel has its private jetty, and all the rooms are lake-facing, providing an excellent view of the lake. The food served at the hotel is homely and good. However, the hotel has limited food options. The hotel staff is good, and the service is satisfactory.\nI met a fellow traveler who mentioned that the hotel is ideal for peace lovers who want to relax and sit idle for hours reading books or just lazing around. They also mentioned that the hotel is nearby Nainital and has a beautiful lake of nine corners. They had a lot of fun during their stay and had bonfires on both nights with lots of snacks to eat and plenty to drink.\nOverall, I would recommend Parichay KMVN lodge to anyone looking for a peaceful and serene environment with a beautiful view of the lake. However, if you’re looking for luxurious amenities, this might not be the right place for you. I hope this helps!",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "We stayed here for 2 nights from April 1st to 3rd, 2024. We just wanted to relax, vegetate and stroll around the lush greenery and forest paths inside and outside the property during our stay. The property had a very low occupancy during this time, which actually helped us relax better and get more personalized service. The property location, greenery and the prime viewpoint of the lake is simply exceptional. Everywhere you look around, you'll be awed by the lush greenery, well maintained lawns and flower beds. The view of the lake during early mornings and evenings is magical. The property when lit up at night with the lovely lake backdrop, looks enchanting.\n\nRoom: We opted for the largest room on the ground floor of the colonial heritage bungalow, and it felt amazing. The room is massive and required as many as 5+ tubelights to light up the entire space. The wooden furniture was also well appointed. The stone paneled walls, high ceiling with antique wooden beams and fireplace (ornamental) took us back in time to the colonial bungalows of yore.\n\nFood: The food was reasonably priced and the in-room service was efficient, probably due to low season. The room charges are on MAP, which means that breakfast and dinner was included. Both the menus were decently varied, well presented and served and tasted good to our palate. The preparations were homely and lightly spiced.\n\nService: As already mentioned, the service was prompt and efficient during our stay. The resort manager was very cordial and warm in dealing with us both on calls during booking and in-person during the stay.\n\nJetty: The resort has it's own private jetty where you can order a boating service in advance. We availed a very relaxing private boating service from here.\n\nThe only issue that we faced was some dust and cleanliness niggles when we checked in our room. However within 10 minutes of calling the reception with our concern, one sweeper came and cleaned our room properly. Overall we really loved staying at this property and highly recommend it to others. Will definitely return again...",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "By far the best experience in UK.  We had stayed earlier near Bhimtal but this is a hidden gem.\n\nLoved our stay at Parichay, we had a cottage facing the lake.  The staff was very courteous and friendly.\n\nMr.Naresh the manager was very accommodating and supportive.  The help staff Mukesh and team were very welcoming.\n\nBest part, the stay includes breakfast and dinner at a nominal room cost.\n\nThe rooms were spic and span, bathroom were very neat and tidy, heating is there.  TV is provided along with heating kettle.\n\nWe went for boating from the hotel itself as it's lake facing, pick up and drop for boating (600) was available.\n\nWill be coming soon to see our friends at Parichay and spend a good time\n\nSharing some memories from our trip :)",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "access ample private obstructed though lake views food home parking spacious area location trees good rooms like peaceful directly",
                "would access stay might different decision categories private sitting staff premium soaking helps fun looking re jetty setting new super environment eat providing friendly lake fresh stayed liked perfect ideal relaxation lots snacks kmvn parichay food courteous royal friends booked view serene lakeside right winter located turned hours bonfires idle disappointed cottage drinks night family however you lot year amenities good sun celebrations hope sit rooms easy luxurious peaceful recommend hotel property deluxe",
                "would stay reading helps looking re basic environment ideal lots food view serene peace however location overall nights luxurious peaceful lot property drink relax beautiful private providing lake want snacks right lazing hours service lakefacing nearby plenty sit experience jetty satisfactory served great eat anyone stayed kmvn naukuchiatal around bonfires lovers amenities homely good recommend recently traveler corners nine mentioned might staff options nainital fun parichay also books idle you fellow lodge met excellent hope rooms limited hotel",
                "amazing stay properly menus reasonably probably dealing food dinner actually checked view faced looks maintained evenings boating fireplace antique room definitely light however ground bungalows paneled location required priced well exceptional overall nights map booking personalized property youll dust relax decently private loved backdrop lake largest back walls magical st staying season palate look service occupancy due cleaned one really lush opted availed ornamental order stone mornings heritage massive lawns return space many everywhere took greenery concern time wooden jetty relaxing served cordial included high stayed within appointed enchanting yore us forest minutes flower vegetate floor tasted inperson calling already lit ceiling low around lightly manager efficient breakfast highly homely others good cleanliness prompt recommend resort mentioned wanted prime means issue inside preparations april varied spiced niggles stroll lovely viewpoint advance beams charges tubelights entire inroom came colonial also furniture awed calls outside night rd reception get better beds warm helped bungalow felt paths early simply presented sweeper",
                "cost stay best bhimtal along experience memories near tv includes staff tidy loved pick spend provided time soon heating friendly lake facing stayed friends welcoming drop dinner parichay courteous see boating mukesh gem coming room went accommodating manager breakfast cottage spic kettle trip nominal neat sharing uk bathroom hidden earlier supportive far team span part good available rooms mrnaresh hotel help"
            ]
        }
    ]
}