{
    "places_with_reviews": [
        {
            "name": "Redmoon Bekal Beach",
            "rating": 4.3,
            "address": "railway station, behind Bekal fort, Pallikere, Kerala 671316, India",
            "reviews": [
                {
                    "text": "One of the most pristine beaches I have ever been to - the beach is clean and well maintained with lots of activities. I went around sunset time and it was magnificent! 😍",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "I happened to visit Red Moon bekal beach on a weekday  . To my surprise, it's really a must visit spot for beach lovers . There are many kids play area sections and a good variety of eatery outlets as well . Weekends there is a chance of the place getting over crowded . To my surprise , while parking the car, they charged some fees for per head basis on top of the car parking fee. I asked about it but didn't get any proper response. Since it's just 30 rs per head it's not a big deal .\n\nOver all, my son and I really had a great time . Will definitely go again .",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Nice and calm weather. Beautiful place .\nCleaned atmosphere. At the entrance , there are statues and wall is decorated by painting meaningful stories on it.\nThere are a lot of rides to enjoy especially for kids.\nZip line is available. Varieties of foods are here.\nYou can enjoy horse and camel ride too. Looking onto the right side of the sea, we can see bekal fort and it's border.\nEntry fee is 20 per person and 25 per parking a vehicle. 6.30 is the closing time.\nLast but not least sunset view is amazing.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It was a wonderful experience with plenty of activities to enjoy, making it the perfect way to spend quality time with your family. While it can get crowded in the evening, our time there was definitely well-spent.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A Good beach in Kasargod District. Bekal Fest helding here is a grand function in KSD.🏖️🩴",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "beach maintained one well time went around lots clean pristine activities ever magnificent beaches sunset",
                "happened many rs deal big head time red great getting kids basis asked sections parking crowded must eatery variety charged fees go area surprise weekday lovers weekends top fee definitely moon proper car outlets beach get really per well good bekal didnt visit play spot chance since response son",
                "meaningful amazing painting calm horse beautiful last varieties zip weather border looking time line nice vehicle sunset rides least kids side especially fort entry parking right camel see closing view ride stories onto enjoy fee cleaned decorated sea wall atmosphere per person bekal available entrance lot foods statues",
                "quality making experience wonderful perfect plenty crowded spend activities time enjoy family evening definitely wellspent get way",
                "beach grand function fest ksd good bekal helding kasargod district"
            ]
        },
        {
            "name": "Trikkannad Tryambakeshwara Temple",
            "rating": 4.6,
            "address": "Kasargod - Kanhangad Road, PO Bekal, Kottikkulam, Trikkannad, Pallikkara II, Kerala 671318, India",
            "reviews": [
                {
                    "text": "Lord Shiva is the deity. The idol is decorated with a human like face, which differs from most other Shiva temples in the region. The temple is located on the main highway between Kanhangad and Kasargod-nearer to Kanhangad. Devotees who come here are mostly those who wish to do the final rites of their departed ones.\n\nThe usual procedure is to\n\nCollect booking receipts to do the required poojas.\nBuy betel leaves and arecanuts from nearby.\nTake a dip in the temple pond.\nSubmit one portion of betel leaves and arecanuts at the temple entrance door.\nProceed to do Bali tharppanam area and do the rites, this is within the temple enclosure.\nTake the small Roopams which you may have brought from your home after Thila homam. Take a dip in the sea nearby, release the part of the offering you got from Bali tharppanam earlier. RETAIN the Roopams with you.\nSubmit the Roopams at the special hundi at temple entrance.\nTake a dip in the temple pond. Change clothes. Complete  all other poojas you may have after entering the temple.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Abode of Lord Shiva. A place where Tharpana for the expired soul will be performing with rituals. Om Namah Shivaya 🙏",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beautiful temple located on the shores of the Arabian Sea. It is located in Kasaragod district and is easily accessible on the Edapally Panvel highway. Parking spots are available next to the temple. Be sure to visit this temple and read the legends associated with this temple online. This temple is known as a place for performing last rites for our beloved ones who have departed.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Located between Kanhangad and Kasaragod, thos beautiful Lord Shiva temple is right on the Kasaragod Panvel highway, facing the majestic Arabian sea on the opposite side. This is my 2nd visit to this temple. Last visited in 1994 and now, yesterday. This temple is also known as Dakshin Kasi temple. People come here to offer prayers for peaceful resting of departed souls of family members. Very peaceful place.\nOm namah Shivaya namah",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Trikkanad Thrayambakeshwar Temple is located on the shores of Arabian sea, temple faces the beach and at Edappally - Panvel Hwy. The temple is popularly known as Dakshina Kashi. This temple is devoted to Lord Shiva. Balitharpanam (hindu ritual for the souls of ancestors) is performed at this temple.\nFebruary and March are the months for festivals. The annual temple festival lasts for one week. Kodiyettam (flag hoisting) marks the beginning of the festival. The celebrations include performances of Theyyam and Thidambu Nritham, a ritual art form of North Kerala more than 700 years old. Ashtami Vilakku and Pallivetta are the two rituals associated with the festival. Pallivetta or the hunting expedition of the Lord takes place on the last day of the festival. This hunt is symbolic of the destruction of Kama (desire), Krodha (anger) and other such evils that plague us in our life. Thousand of devotees from all over the district attend the festival. The temple is also unique for the fact that it is one of those rare temples that faces the west.The temple is is around 2.5km  from Bekal Fort. Nearest Railway station -  Kotikulam, Kanhangad.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "portion wish come collect proceed dip got special hundi homam enclosure arecanuts lord betel idol small shiva may brought offering complete final clothes within change release rites departed poojas home retain kasargodnearer receipts region entering submit located differs temple deity area face kanhangad highway human nearby roopams decorated thila temples required one procedure sea ones take leaves tharppanam earlier bali part pond booking usual buy like entrance main door mostly devotees",
                "abode tharpana shivaya performing rituals namah expired lord om soul shiva",
                "known beautiful last beloved panvel spots district kasaragod legends sure parking rites online edapally departed read located associated arabian temple performing accessible highway sea shores ones available visit next easily",
                "people known visited beautiful last come opposite dakshin kasi prayers lord panvel shiva kasaragod facing side yesterday right departed also thos located arabian shivaya members temple family kanhangad namah highway majestic offer souls sea nd resting visit peaceful om",
                "day km nearest form lord hwy panvel shiva symbolic marks nritham devoted evils theyyam located march arabian hindu hunting flag beach shores bekal celebrations destruction devotees hoisting thidambu festival festivals last hunt beginning edappally kotikulam attend rituals week anger old kerala fact associated temple trikkanad ashtami include vilakku one annual popularly kodiyettam thousand plague months station art two fort us expedition north around performed krodha kanhangad lasts february kashi sea temples takes performances ritual kama known faces balitharpanam district ancestors thrayambakeshwar railway also years unique desire souls dakshina pallivetta life westthe rare"
            ]
        },
        {
            "name": "Bekal Fort beach",
            "rating": 4.5,
            "address": "Unnamed Road, 92RJ+PCX, Kerala 671316, India",
            "reviews": [
                {
                    "text": "Beautiful place, worth visiting. It opens at 8, yet its very hot in the day time to walk over and enjoy. Please carry an umbrella without fail and stay hydrated.  I would suggest visiting the place after 4:30pm.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "One of the biggest and best fort in Kerala, which is a must visit for anyone interested in history and archaeology.\nFort is very huge vast and beautiful. The whole circuit around the fort would take around 1 and half hours. So plan your trip accordingly.\n\nP.S: Do carry water with you before entering the fort.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This is a Beautiful fort. One should visit this place during morning or evening to experience the charm of this place. This place will get closed by 6. One can witness the sunset in this beach. You can see the beautiful beach from this fort",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "The fort holds the essence of the history,clean,well maintained and managed. They charge 25 rupees a ticket for age above 15 and the beach is not accessible for safety reasons which was saddening but overall worth a visit.All u see is brick structures.I tried sneaking in but the life gaurd will pulled me back.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Have to visit this Fort. Actually all tourist spots, in Kerala, are so well maintained and clean.\nBekal Fort is a medieval fort built by Shivappa Nayaka of Keladi in 1650 AD, at Bekal. It is the largest fort in Kerala, spreading over 40 acres.\nThe view point , jutting into the sea is just ethereal.\nWe are on a drive from Bangalore to Kannur to Murudeshwar, so stopped for a visit. You will really enjoy your experience.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "would stay hot day opens beautiful fail time without carry yet please pm worth visiting walk enjoy hydrated suggest umbrella",
                "would vast best beautiful half accordingly interested whole carry anyone water history fort plan kerala must biggest entering hours around trip circuit one archaeology ps take huge visit",
                "beach one charm closed beautiful morning experience fort visit get witness sunset see evening",
                "u historycleanwell sneaking gaurd brick structuresi ticket managed pulled reasons saddening fort back see charge maintained worth accessible safety essence age beach visitall tried rupees overall life holds",
                "experience spreading bangalore stopped drive ad spots point keladi medieval largest kannur fort murudeshwar actually view built kerala maintained tourist enjoy nayaka sea acres really jutting well bekal visit clean shivappa ethereal"
            ]
        },
        {
            "name": "Chandragiri Fort",
            "rating": 4,
            "address": "F293+X7H, Kasaragod, Kalnad, Kerala 671317, India",
            "reviews": [
                {
                    "text": "17th century fort built by Shivappa Nayaka lying next to the Chandragiri or Payaswini river. It is just 5 kms from Kasaragod town. This is a small fort when compared to Bekal and can be covered in a short time. The fort is not open to the public officially but you can come visit from 9:00 am to 5:00 pm. The is some parking available just down the road. The place looks decent now as opposed to how it looked before, overrun with grass and weeds. There is still some cleaning up left to be done by the Government so that this beautiful piece of history doesn’t get ruined.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Built along with Bakel Fort in 17th century by Shivappa Nayaka , near the Chandragiri river. This is a small fort when compared Berkeley and there is nothing much to see. Not that easily accessible and have a steep climb to the fort too.The fort is open from 9:00 am to 5:00 pm. except on Mondays, when it remains closed.The is some parking space available just down the steps to the Fort. It gives a good view of the neighbourhood, especially the Chandragiri river. But it is not worth the effort, so better to skip the place.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "A abandoned small fort not maintained by the government or private enterprise, around a kilometre from melparambu bus stop, no entrance fee anyone can go not a must visit place in Kasaragod like Bekal Fort, there is zero facilities available near the Fort, a deserted place, away from the public, unnoticed by the government and the public",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "Old fortress protected by the Archeological Department. Open to public on all days except Monday from 9 to 5. No entry fees. Except the structure of the fort, there is nothing specific to see inside. When we visited, it was full of grass with some goats roaming around. But, if it's leisure in your mind, your family or your group can take some pictures of Fort as normally there is no rush. You will be able to view the River, Railway Bridge and the Ocean from the Fort and it's a good sight especially if you happen to see a train passing through the bridge. There is a Security Guard come caretaker in case you need to clarify something.  Coming from the main road, the parking is down the line and not in front of the fort. From parking, you will have to climb the stairs, so it will be good idea to leave the passengers in the entrance and park the vehicle down. If you go down that road further, you can have a good view of the river and can see the village around.",
                    "languageCode": "en",
                    "rating": 4
                },
                {
                    "text": "One of the underrated fort in kasargod.. Spectacular l views of Arabian sea and Chandragiri river can be seen from the fort..Stumps and large plants inside the fort are a disadvantage",
                    "languageCode": "en",
                    "rating": 4
                }
            ],
            "preprocessed_reviews": [
                "government beautiful come t chandragiri payaswini time overrun small doesn century kasaragod th kms public open left history fort pm officially parking built looks done opposed compared river road lying piece still weeds nayaka get short covered town decent bekal looked available grass visit cleaning shivappa next ruined",
                "along berkeley space near gives chandragiri steep small remains century th steps open effort especially fort pm mondays parking view see built skip toothe worth closedthe climb bakel neighbourhood compared river accessible nayaka better much except good available shivappa nothing easily",
                "government kilometre near private melparambu small kasaragod unnoticed public facilities anyone fort abandoned zero must maintained deserted around bus fee enterprise away bekal available visit like entrance go stop",
                "goats visited able guard stairs inside sight come village happen line pictures case vehicle full public fortress specific open mind especially fort entry structure railway clarify old view see group something passing parking idea train leisure fees bridge climb need roaming coming go around protected archeological leave family river road ocean normally days monday caretaker passengers take main park except good front grass department rush entrance security nothing",
                "one seen l arabian inside underrated plants views chandragiri disadvantage spectacular fort river fortstumps large kasargod sea"
            ]
        },
        {
            "name": "Bekal Beach Park",
            "rating": 4.3,
            "address": "92QR+C8M, Pallikere, Kerala 671316, India",
            "reviews": [
                {
                    "text": "Bekal beach is a very organized beach. Bekal beach as got staffs issuing tickets and guiding you to the parking lots. The beach entrance is through the park which is very beautifully constructed. Beach is neat and clean but beach doesn’t look like shallow. The gradient is very steep. In the beach you will find people selling balloons, kites, ice creams. There are some 4-5 camels giving rides on per head costs. There is one horse cart and a horse also giving rides for the tourists. There is huge crowd on normals days and holidays that is even more. Apart from that there are lots of rides for kids and adults. There is a giant wheel, Zip lines a giant swing , floating bridge to sea and lots more. Over all this place is awesome.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "So spacious. Enough to park a vehicle.\nEntry fee is around 30 per person. Parking fee 30 for car.\nThere are shops inside the park so you can have snacks\nVast area. Different rides are available\nA sea floting bridge is built.\nLoved the place. You can spend a day here.\nChildren friendly park\nA small children's park is built here. So they can enjoy it. Wait for the evening that is the proper time to enjoy.\nOtherwise scorching sun heat creates a problem.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "The beach is good but the way they are managing the washroom and changing rooms is really pathetic, smelly, no water, and a single room for changing clothes. So if you are going with family please please make proper arrangements for changing clothes and for washrooms.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Its just a kilometer away from Bekal Fort.\nWent on morning and it was a bad decision. No activities were there in the morning. Children's park was open; so we spent time there. Better do visit the place at the evenings.\nParking provided. Food stalls are there.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Nice ambience. A must visit place for a sunset view. Entry fee of Rs.30/- and a lot of beach activities are there. A floating bridge is there, horse, camel rides, boating etc.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "find people tourists constructed apart horse floating normals t zip got steep head kites giving giant adults doesn organized rides awesome gradient kids holidays crowd lots creams wheel guiding parking issuing camels also bridge look costs shallow selling days neat lines beach staffs beautifully one sea park balloons per even huge cart bekal clean ice swing like entrance tickets",
                "wait vast different day inside floting creates loved spend time vehicle small rides heat friendly snacks entry parking built evening bridge shops enough spacious around problem area enjoy fee proper car sea park per person children childrens available otherwise scorching sun",
                "washrooms smelly washroom changing clothes water single arrangements pathetic please way make room family proper beach really going good rooms managing",
                "decision time provided open fort food parking evenings went spent away better stalls park bad morning childrens bekal visit activities kilometer",
                "rs floating horse nice sunset ambience rides entry camel view must boating bridge fee beach etc visit activities lot"
            ]
        },
        {
            "name": "Poochakkad Masjid (Hydros Juma Masjid)",
            "rating": 4.4,
            "address": "93H2+8GW, National Highway 17, Pallikere, Kerala 671316, India",
            "reviews": [
                {
                    "text": "Relaxing. Neat and clean.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Most famous masjid in Kasaragod.The Makbara of  Kazhi Hassainar (N:M)",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Wonderful masjid having beautiful atmosphere...\nOnce in every year there is Uroos in the name of kaaali Hasainar.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Good facilities for prayers.Cool feeling ambiance and peaceful atmosphere",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Juma is provided... Special room for travelling women",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "clean relaxing neat",
                "famous kazhi hassainar makbara nm masjid kasaragodthe",
                "kaaali uroos atmosphere name beautiful wonderful every masjid year hasainar",
                "atmosphere ambiance facilities good prayerscool peaceful feeling",
                "room special women provided travelling juma"
            ]
        },
        {
            "name": "Bekal Beach Festival",
            "rating": 3.9,
            "address": "92QR+47W, P.O, pallikera, Bekal, Pallikere, Kerala 671316, India",
            "reviews": [
                {
                    "text": "They are preventing people from entering the beach by saying they have leased the beach  , (private people making money from poor public, having some employees to block the public beach ) . Beach is public property where private people cannot block and make money . If they are providing some entertainment near me beach they can enclose their giant wheel  and keep ticket. Not from everyone who come to the beach . Shame on you Bakel fort festival",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "One of the best experiences I had! Had a lot of fun… visit during the night you can experience the best lighting, warmth and vibe✔︎",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Overall it was ok ...But then i saw a Bengal cat inside the cage and it was unable to bear the heat..suffering.There was no one around to help. Can some one look into this?",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Worst beach festival. Very dirty place. No parking place.\nUnhygienic place",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Bakel beach festival 2023. Fun food , shopping,enjoyment.",
                    "languageCode": "en",
                    "rating": 3.9
                }
            ],
            "preprocessed_reviews": [
                "people festival come near private employees keep poor giant ticket block preventing providing public everyone wheel fort money entering make enclose bakel shame leased saying beach making entertainment property",
                "warmth one best experience vibe visit fun night lot experiences lighting",
                "bengal one inside cat around help overall bear ok cage look heatsufferingthere saw unable",
                "beach festival unhygienic dirty worst parking",
                "beach festival bakel shoppingenjoyment food fun"
            ]
        },
        {
            "name": "Palakkunnu kazhakam Shree Bhagavathi Temple",
            "rating": 4.6,
            "address": "C2FC+CWP, NH 17, Palakkunnu, Bekal, Pallikkara II, Kerala 671319, India",
            "reviews": [
                {
                    "text": "A renowned cultural and spiritual landmark in Kerala's Kasaragod district, Palakkunnu Sree Bhagavathi Temple stands out for its unique blend of tradition and inclusivity. Situated just 50 meters from Kottikulam Railway Station and 3 km from Bekal Fort, the temple is easily accessible.  The Kasaragod-Kanhangad State Highway runs beside it, offering convenient connectivity.\n\nEnshrining the Mother Goddess Bhagavathy in two forms, Mootha (Durga) and Elaya (Saraswathi), the temple welcomes devotees from all faiths and backgrounds.  Other deities worshipped here include Vishnu, Ghantakarnan, and Dhandan Devan. The temple's vibrant festivals are a true community celebration, drawing active participation from everyone.  This openness extends to its daily worship, where there are no restrictions based on caste or race.  The temple is especially known for its unique and rare traditional rituals and ceremonies.\n\nEvery February or March, the temple comes alive with Bharani Mahotsvam, its annual festival. This vibrant celebration coincides with the festivities at Trikkannad Sree Shiva Temple. Dazzling fireworks and colorful processions from various localities are the festival's highlights.\n\nAnother key feature is the Poora Mahotsavam, a traditional spectacle showcasing Poorakkali, a unique northern Kerala art form. Throughout Poora Mahotsavam, skilled Poorakkali Panikker performers enact Poorakkali daily.  The festivities also include interludes of Marathukali, a competitive performance traditionally executed by renowned Poorakkali masters. Representing the temple's three provinces - Melthara, Keezhthara, and Perumundithara - three masters compete, with the winners receiving prizes.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice temple and yearly festival occurs in month of february which is known as Palakkunnu Bharani utsava where lots of people come to witness.\nTrucks Tablos cultural and chande will be the most attraction during procession and bursting of firecrackers is also very famous. During these festival it is heavly crowded and people from distant places visit temple to worship god.\nThe  procession starts around 9.30 and it reaches temple premises around 11.00 pm and it ends till 3.00 am. Full of grand procession lakhs of people visit to witness the procession.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Palakunu Temple is a divine sanctuary that radiates serenity and spiritual bliss. The temple's serene ambiance, nestled amidst lush greenery, instantly soothes the soul. The intricate architecture and intricate detailing of the temple showcase the artistry and devotion of the craftsmen. The sanctum sanctorum, where the deity resides, emits a divine aura, instilling a sense of tranquility and reverence in devotees. The temple's surroundings offer a peaceful retreat for meditation and introspection. Palakunu Temple is a sacred haven that offers a profound spiritual experience for all who visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Awesome experience in the time of Bharani festival. Lakhs of people from all over the Malabar area and manglore area are coming to witness the festival and get blessed by the mother goddess bhagavathi.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Peacefulll Hindu Temple",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "kottikulam based prizes km form keralas offering faiths beside shiva enact keezhthara enshrining bhagavathy colorful especially poorakkali executed provinces receiving backgrounds march skilled dhandan processions showcasing melthara welcomes performers bekal drawing elaya ceremonies bharani devotees festival festivals highlights performance various active northern participation sree true celebration vishnu everyone every rituals meters community kerala bhagavathi localities temple ghantakarnan festivities include highway competitive extends annual palakkunnu marathukali dazzling kasaragodkanhangad race worshipped key station devan comes deities art two perumundithara fireworks fort traditionally traditional alive winners landmark feature openness another accessible mahotsavam february temples throughout state worship blend runs vibrant known poora inclusivity tradition coincides forms mahotsvam spectacle interludes district three kasaragod stands panikker representing spiritual saraswathi railway renowned durga also connectivity daily situated cultural mother unique mootha caste restrictions convenient masters trikkannad goddess compete rare easily",
                "people grand known festival come nice firecrackers full trucks god premises lots pm crowded also attraction utsava heavly famous starts temple cultural around lakhs distant reaches witness chande procession february ends occurs worship till month tablos places visit yearly bursting palakkunnu bharani",
                "palakunu detailing retreat experience surroundings greenery nestled serenity reverence offers divine artistry resides intricate soothes profound tranquility introspection spiritual sanctuary architecture emits serene amidst sanctum ambiance temple deity showcase offer soul meditation temples sacred craftsmen bliss lush sanctorum sense aura visit instantly peaceful instilling devotion radiates devotees",
                "people awesome bhagavathi manglore festival experience coming malabar lakhs mother area goddess witness time blessed get bharani",
                "hindu temple peacefulll"
            ]
        },
        {
            "name": "Thrikkannad",
            "rating": 3.6,
            "address": "C26F+93H, Edappally - Panvel Hwy, Kottikkulam, Bekal, Pallikkara II, Kerala 671318, India",
            "reviews": [
                {
                    "text": "Thrikkanad  teample  is  a  shiva temple.. Many  people  came  here  everyday. The  atmosphere in  the  temple is  very  peaceful. Every  year  their is  aratte festival  conduct this  temple.",
                    "languageCode": "en",
                    "rating": 3.6
                },
                {
                    "text": "Popularly known as the Dakshina Kashi the Thrikkanad temple is located on the shores of Arabian sea, about 1km from Bekal.  The temple is devoted to Lord Shiva and is known for its various customs and rituals performed for the well - being of the souls of the dead.on the shores of Arabian Sea near Bekal, situates the Thrikkanad or Trikkannad temple",
                    "languageCode": "en",
                    "rating": 3.6
                },
                {
                    "text": "There is a famous Hindu  temple here. There is a beautiful beach",
                    "languageCode": "en",
                    "rating": 3.6
                },
                {
                    "text": "Nothing interesting to explore",
                    "languageCode": "en",
                    "rating": 3.6
                },
                {
                    "text": "Temple and fishing area",
                    "languageCode": "en",
                    "rating": 3.6
                }
            ],
            "preprocessed_reviews": [
                "people conduct teample atmosphere many thrikkanad aratte everyday festival peaceful temple every came year shiva",
                "popularly known near various km lord deadon shiva devoted rituals situates located thrikkanad arabian temple performed souls kashi sea shores dakshina well bekal customs trikkannad",
                "beach famous beautiful temple hindu",
                "explore interesting nothing",
                "fishing temple area"
            ]
        },
        {
            "name": "Pallikare Beach",
            "rating": 4.2,
            "address": "92QQ+MJF, Pallikkara Beach Road, Kerala 671316, India",
            "reviews": [
                {
                    "text": "I found many reviews suggesting it as clean. Unfortunately when I visited there it was not.\nThey are charging ₹20per head which I didn't find reasonable from what experienced.\nYou will get a great view of sunset with Bekal fort in one frame.\n(I have visited many beaches like Kovalam, Shankhumukham,etc. before but never seen tickets to enter a beach)",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "The Pallikare Beach is right next to Bekal Fort and is an excellent beach to unwind after the hectic walking about in the Bekal Fort. It has lifeguards and is very clean. The entrance fee of ₹10 per head is also quite reasonable. An ideal place to be with family and friends. The sunsets from here are incredible with the sun setting over Bekal Fort. Overall, a wonderful beach to go to.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Clean beach.. We can enjoy with family and kids.My son enjoyed very much.. Snacks and eateries available in the park.. Guards are available.. they won't allow us after 6.30pm..",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Very clean. Good place to hangout",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good and well maintained beach.restrooms and childrens park is there.food and snacks are available .good parking facility.located near to bekal fort.pleanty of areas different rides are available.",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "find visited reviews many frame head sunset great unfortunately never found suggesting fort kovalam view shankhumukhametc experienced charging beaches get beach one per enter didnt bekal reasonable clean like tickets seen",
                "pallikare head setting hectic ideal friends fort right quite incredible also wonderful family fee walking beach sunsets excellent unwind per lifeguards bekal sun reasonable overall clean entrance go next",
                "beach us kidsmy much park enjoyed guards allow snacks available pm clean family enjoy son wont eateries",
                "hangout clean good",
                "facilitylocated maintained rides different park well near beachrestrooms good childrens snacks available bekal fortpleanty parking areas therefood"
            ]
        }
    ]
}