{
    "places_with_reviews": [
        {
            "name": "Sarangpur Hanuman Mandir, Ahmedabad",
            "rating": 4.7,
            "address": "2JG2+G3V, Kalupur Rd, Suodagarpole, Laxmi Bazar, Khadia, Ahmedabad, Gujarat 380001, India",
            "reviews": [
                {
                    "text": "Excellent Lord Hanuman temple with best infrastructure & facility at the temple area. Stay at White House is very good with neat & clean rooms. There is a big tall Lord Hanuman Murty near White House. Prayer gives peace of mind & positive wibes.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "जय श्री राम\nजय हनुमान\nMust visit temple of Hanuman dada.\nAccomodation facility is good, as well very large area parking for vehicles.\nVery vast campus. Very neat and clean also. Prasadam very satvik. Take home Prasad packing sukhdi , in packing of 25₹, 50₹ , 100 ₹.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Excellent mandir with big lord Hanuman status  here and it's very famous place. If you want to stay here it has very nice and clean rooms and other facilities. It's a very popular temple.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Shree Kashtabhanjan Dev Hanumanji Temple is a renowned Hindu temple dedicated to Lord Hanuman, located in the village of Sarangpur, Botad district, Gujarat, India. It is one of the most prominent temples of Hanumanji in the region, revered for its unique idol and miraculous stories associated with it.\n\nThe Idol of Kashtabhanjan Dev:\n\nThe temple enshrines the idol of Hanumanji in the form of Kashtabhanjan Dev, meaning \"crusher of sorrows.\" The idol is depicted standing tall, holding a mace in one hand and a mountain (representing Lanka) in the other. This form signifies Hanumanji's power to vanquish all troubles and anxieties of his devotees.\n\nHistory and Significance:\n\nThe temple belongs to the Vadtal Gadi of the Swaminarayan Sampradaya. The idol was installed by Gopalanand Swami, a close disciple of Swaminarayan, in 1856. According to legend, when the idol was touched with a rod during the installation ceremony, it miraculously came alive and moved. This event cemented the temple's reputation as a site of divine blessings and miracles.\n\nHealing Rituals and Practices:\n\nDevotees visit the temple seeking relief from various ailments and misfortunes. A unique ritual called \"panch dava\" is performed here, where five holy substances are applied to the idol and then offered to devotees. This ritual is believed to possess immense healing powers and bring solace to troubled minds.\n\nOther Attractions:\n\nThe temple complex also houses a gaushala (cow shelter), a dharamshala (guest house) for pilgrims, and a serene garden. Devotees can participate in daily prayers, attend religious discourses, and immerse themselves in the spiritual atmosphere of the temple.\n\nVisiting the Temple:\n\nThe Sarangpur Hanumanji Temple is easily accessible by road from major cities like Ahmedabad and Surat. It is open throughout the day, with special pujas and ceremonies held on Tuesdays and Saturdays.\n\nIf you are planning a visit to Gujarat, make sure to include the Shree Kashtabhanjan Dev Hanumanji Temple in your itinerary. It is a truly magnificent and spiritually uplifting place that is sure to leave a lasting impression.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "The Sarangpur Hanumanji mandir is must visit palce for devotees in Gujarat. This temple holds great historical significance. There are numerous temples that you can visit, and the temple area are large and lovely. There is excellent parking available. Although a bit pricey, the canteen's food is generally excellent.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "stay best near gives hanuman infrastructure big lord mind wibes peace house tall murty temple area positive prayer neat white excellent good clean facility rooms",
                "vast dada hanuman satvik prasad packing campus sukhdi parking home must also accomodation vehicles temple area large neat take well good visit clean facility prasadam",
                "stay famous excellent status facilities popular mandir hanuman temple big want clean rooms lord nice",
                "signifies significance day offered attractions gujarat form rod lord swami troubled garden sampradaya history site applied ceremony according serene prominent holding located house anxieties touched healing leave moved hindu ahmedabad surat minds atmosphere uplifting swaminarayan misfortunes power crusher ceremonies belongs devotees lasting installed miraculous gopalanand panch easily village various powers held solace prayers india gadi holy attend rituals truly blessings called shree region pujas associated sorrows temple seeking include shelter legend one sarangpur enshrines visit revered five hanuman cemented troubles special divine dedicated lanka reputation tuesdays saturdays standing bring sure close dava alive hanumanjis believed miracles make tall cities performed accessible mace planning temples immense mountain throughout botad spiritually discourses meaning installation like disciple ritual substances dharamshala relief houses participate complex immerse event idol major district guest gaushala itinerary vadtal open spiritual kashtabhanjan religious came magnificent renowned depicted also stories cow daily miraculously visiting possess road unique practices ailments dev hanumanji vanquish pilgrims impression representing hand",
                "significance generally gujarat lovely great numerous bit food parking must mandir temple area canteens large temples palce sarangpur hanumanji excellent although available visit holds pricey historical devotees"
            ]
        },
        {
            "name": "ISKCON Temple, Ahmedabad",
            "rating": 4.7,
            "address": "Satellite Road, Sarkhej - Gandhinagar Hwy, Bodakdev, Ahmedabad, Gujarat 380015, India",
            "reviews": [
                {
                    "text": "Visiting the ISKCON Temple in Ahmedabad was a serene and spiritually uplifting experience. The temple's architecture is breathtaking, and the atmosphere is peaceful. The temple complex is well-maintained and clean, providing a sense of tranquility amidst the bustling city.\n\nThe temple's sanctum is a sight to behold, with beautiful idols of Radha and Krishna. The devotional music and chanting add to the spiritual ambiance, making it a perfect place for meditation and prayer.\n\nThe temple also offers delicious vegetarian food at its restaurant, which is a must-try for visitors. Overall, the ISKCON Temple in Ahmedabad is a must-visit for anyone seeking spiritual solace and a glimpse into Indian culture and traditions.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "ISKCON Temple in Ahmedabad is a magnificent spiritual landmark known for its stunning architecture, serene atmosphere, and vibrant cultural activities. Dedicated to Lord Krishna and Radha, it offers a peaceful sanctuary for meditation and reflection. The temple hosts various events and festivals throughout the year and features a vegetarian restaurant and a gift shop. Whether you're seeking spiritual solace or cultural enrichment, a visit to ISKCON Temple Ahmedabad promises a memorable experience.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Chant the Hare Krishna mantra and immerse yourself in the peaceful vibes of the ISKCON temple.\n\nSurrender to Lord Krishna's divine love and experience eternal bliss at the ISKCON temple.\n\nSuch this place is a heaven. ❤️🫶🏻✨🙇",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "ISKCON Temple in Ahmedabad is a lovely spot. It's peaceful and calming, perfect for prayer or quiet reflection. The temple itself is stunning, and there are often events going on. Whether you're looking for a spiritual experience or just want to take in the sights, it's worth a visit.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Captivated by the ethereal beauty and profound spirituality of ISKCON Ahmedabad, my journey transcended mere sightseeing to a soul-stirring experience. With each step, I felt drawn deeper into a realm where time seemed to stand still, and the air resonated with the echoes of ancient chants. Surrounded by majestic architecture and the serene ambiance, I couldn't help but marvel at the palpable sense of peace that enveloped every corner. Truly, ISKCON Ahmedabad is more than a mere monument; it's a sacred haven where one can embark on a journey of inner exploration and spiritual discovery.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "add breathtaking experience beautiful sight restaurant radha offers complex devotional krishna traditions solace vegetarian tranquility providing anyone perfect spiritual musttry architecture food visitors chanting serene amidst also sanctum ambiance visiting temple city seeking indian ahmedabad mustvisit prayer meditation iskcon temples wellmaintained spiritually making uplifting atmosphere idols music delicious sense glimpse behold overall clean peaceful culture bustling",
                "known festivals experience restaurant radha offers promises various krishna dedicated solace lord vegetarian events spiritual sanctuary architecture magnificent landmark serene stunning whether hosts temple cultural youre gift reflection seeking ahmedabad year meditation iskcon throughout atmosphere enrichment memorable visit features activities vibrant peaceful shop",
                "hare chant experience immerse divine krishna lord eternal krishnas mantra love temple iskcon bliss surrender heaven vibes peaceful",
                "experience often looking lovely events calming quiet perfect spiritual want stunning worth whether temple youre reflection ahmedabad prayer iskcon sights take going visit spot peaceful",
                "discovery spirituality sightseeing couldnt experience deeper echoes exploration captivated embark time mere chants profound journey realm palpable every spiritual architecture truly drawn monument serene marvel peace beauty corner ambiance air ancient soulstirring transcended ahmedabad surrounded still majestic iskcon one sacred felt resonated stand sense inner help step enveloped ethereal seemed"
            ]
        },
        {
            "name": "Law Garden",
            "rating": 4.4,
            "address": "Netaji Rd, Maharashtra Society, Ellisbridge, Ahmedabad, Gujarat 380009, India",
            "reviews": [
                {
                    "text": "It's a good plenteous place to hang out with your own self or also with a bunch of peeps. One can really find and feel nature's love there also there is no chaos only one can hear birds chirping. Places like this are much needed in the crowded areas.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It's a really great place to find peace and calmness. A very big garden in fact with lots of trees and surroundings with green lawns everywhere,when you visit the place you will definitely get answers to many questions also the timings are great so you can visit at night also.Must visit place if you are in Ahmedabad",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It's a fantastic city spot for everyone. Kids love the playgrounds, while young and old enjoy the calm atmosphere. There are good toilets available. Paid parking is also available.\n\nNext to the park, there's a great traditional market for shopping. You'll find an amazing variety of food stalls and restaurants around the park for delicious meals.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "The garden is very good and well maintained. It is well lit for night walks too. The market next to the garden is only for women and you have to be careful from pickpocketing. It mostly sells traditional Gujarati clothes and imitation jewellery. There are some good food stalls in the street. It is well connected by city BRT bus service as law garden is the station.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Law Garden in Ahmedabad is a must-visit destination, especially on a Sunday morning. The vibrant atmosphere, filled with colorful handicrafts, delicious street food, and friendly locals, makes it an unforgettable experience. Don't miss out on the opportunity to immerse yourself in Gujarat's rich culture and connect with the heart of the community at Law Garden. Highly recommended!",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "find birds hang peeps bunch needed natures crowded areas chirping also love chaos hear one really much self places good feel like plenteous",
                "find questions many alsomust surroundings big great garden green lots everywherewhen fact also peace answers definitely night ahmedabad get really timings trees visit calmness lawns",
                "find amazing young calm meals playgrounds great everyone kids food parking theres old traditional also variety love around fantastic city restaurants enjoy paid stalls atmosphere shopping park delicious good market youll available spot next toilets",
                "sells station jewellery garden clothes pickpocketing imitation walks food gujarati traditional maintained brt lit city service bus night law stalls well good market careful street women next mostly connected",
                "opportunity experience dont destination immerse miss garden colorful friendly locals rich especially food handicrafts gujarats community filled sunday unforgettable highly recommended mustvisit ahmedabad law makes heart connect atmosphere delicious morning street vibrant culture"
            ]
        },
        {
            "name": "Atal Bridge",
            "rating": 4.5,
            "address": "Sabarmati Riverfront Walkway W, Narayan Nagar Society, Kocharab, Paldi, Ahmedabad, Gujarat 380007, India",
            "reviews": [
                {
                    "text": "The bridge and the riverfront park is a must visit because it is visually stunning once the sun is down and it is a feast for your eyes. There is an exquisite beauty to the bridge and the park. It is a place which is simply beautiful, filled with many many activities you can try and enjoy. Also the bike riding, skating activities with delightful river visuals is a must try. Important point to note is its cleanliness even after these many people are visiting everyday. Every inch of the place is neat, clean and spot on!",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It is an Engineering Marvel.\nOne of the best spot to spend time with Family and Friends.\nBest time to visit is in the Evening, with lighting it becomes even more beautiful.\nThere is a Flower Garden too where you can sit and relax.\nTicket price is ₹ 40 per person.\nFood shops are also there. There are lots of places available to click awesome photos.\nIt's one of the cleanest and most beautiful places I've ever seen. Very well managed and clean place.\nIt is highly recommended to visit. I would love to visit again.\n............................................................................................................................",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Such a wonderful bridge on the Sabarmati River.\n\nOne of the best bridge ever seen.\nEspecially in night such amazing view of this bridge.\n\nFood items too costly.\n\nParking facilities too good.\n\nMuch visit this place.\nHighly recommended.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Great construction on Sabarmati river\nGood place... Exciting place..\n30₹ ticket price.\nOn Atal bridge you can enjoy ice cream by buying it for self...\nKindly note that don't throw waste in the river..",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Beautiful. Go see the sunset from the bridge.  Flower park is just next door, buy ticket for the bridge as well as flower park in f you plan to visit both the places. Kids friendly. Wheelchairs are available in the flower park if needed.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "people try many beautiful visually delightful bike important point visuals everyday inch every riverfront eyes skating must stunning also beauty filled bridge visiting riding river enjoy neat feast park exquisite even sun cleanliness visit clean simply activities spot note",
                "would seen relax best photos click beautiful engineering spend time ticket managed garden awesome friends lots food ever evening flower marvel also shops love becomes family highly recommended one per ive even price places person cleanest well available visit sit clean spot lighting",
                "amazing best sabarmati facilities items especially food parking ever view costly bridge wonderful river night highly recommended one much good visit seen",
                "dont ticket great sabarmati waste cream bridge throw exciting atal river enjoy self price good buying ice kindly note construction",
                "beautiful ticket sunset needed friendly wheelchairs kids see plan flower bridge go park well places available next buy visit f door"
            ]
        },
        {
            "name": "Sabarmati Ashram",
            "rating": 4.6,
            "address": "Gandhi Smarak Sangrahalaya, Ashram Rd, Hridaya Kunj, Old Wadaj, Ahmedabad, Gujarat 380027, India",
            "reviews": [
                {
                    "text": "The ashram offers a serene and well-preserved environment, showcasing pivotal moments from Gandhi's life that effectively capture his contributions and personality. It's not just a historical site but also an excellent space for personal reflection. The calm and cleanliness, coupled with the natural beauty of the river and trees, create a tranquil atmosphere. The Gandhi museum within the ashram is a treasure trove of historical movements, documented through compelling photos and illustrations, making it a universally enjoyable experience regardless of one's ideology or religion. A visit provides both a historical insight and a peaceful retreat.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "There is no entry fee for the ashram and parking is also available for free. The ashram is well maintained and really clean. One can easily spend over an hour in the ashram.\nThe whole life of Gandhi and his ideology is well explained in the ashram. The view of Sabarmati river from the ashram is beautiful.\nDrinking water and clean washrooms are available within the ashram premise. There are also many books related to Gandhi that one can find in the ashram library and the book shop.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Peaceful getaway amidst the city. The museum is quite beautiful and informative. Ell maintained, clean and quite cool because of the greenery\n\nThe best spot is the riverfront promenade which is secluded, less crowded and peaceful . You can spend hours here.\n\nBest thing, its for free!",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Good:\n- Serene and peaceful ambiance, perfect for meditation and reflection.\n- Well-maintained grounds with lush gardens and scenic views of the Sabarmati River.\n- Informative museum with exhibits detailing Mahatma Gandhi's life and the history of India's independence movement.\n- Knowledgeable guides who provide insightful tours and share interesting anecdotes.\n- Opportunity to see Gandhi's living quarters and the simple lifestyle he led.\n- Regular cultural programs and events that promote Gandhian principles and Indian culture.\n- Clean and well-kept facilities, including restrooms and drinking water facilities.\n\nBad:\n- Limited parking space, which can be challenging during peak hours or events.\n- Some areas may be crowded, especially on weekends or holidays.\n- The museum and ashram grounds can get hot during the summer months, so visiting early in the morning or late in the evening is recommended.\n- Accessibility for elderly or disabled visitors may be limited in certain areas.\n\nOverall, Sabarmati Ashram is a must-visit destination for anyone interested in Indian history, culture, and the legacy of Mahatma Gandhi.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very clean  and well maintained place with free entry. If you are interested to know about Gandhi it will provide you good info, they have good collection from that era with real structures. Also it's on the shore of sabarmati river so good view from the place",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "regardless space calm natural photos experience retreat moments illustrations offers ashram tranquil enjoyable peaceful ideology gandhi environment gandhis within wellpreserved religion universally movements site provides create serene also contributions personality beauty pivotal museum reflection river documented capture showcasing effectively trove making personal atmosphere excellent treasure ones coupled trees compelling cleanliness visit life insight historical",
                "find free many beautiful washrooms ashram premise hour spend ideology gandhi drinking book whole sabarmati related water within entry parking view explained also maintained books river library fee really one well available clean life shop easily",
                "best free beautiful greenery spend ell informative riverfront crowded secluded quite amidst maintained hours city museum cool thing getaway promenade clean less spot peaceful",
                "late provide sabarmati exhibits led history holidays especially visitors elderly lifestyle see serene evening ambiance reflection recommended indian mustvisit living overall peaceful principles destination including indias may gandhis mahatma facilities peak quarters crowded legacy hours tours museum scenic certain share challenging lush regular insightful culture space detailing opportunity months promote disabled interested water anyone views gandhian grounds river wellkept weekends wellmaintained independence bad morning good movement clean accessibility areas restrooms hot ashram gandhi drinking knowledgeable events simple informative perfect anecdotes parking guides summer gardens visiting cultural get meditation interesting early life limited programs",
                "provide free gandhi interested info sabarmati entry view also maintained collection river era know well structures good shore clean real"
            ]
        },
        {
            "name": "Science City Ahmedabad",
            "rating": 4.4,
            "address": "Thaltej, Ahmedabad, Gujarat 380060, India",
            "reviews": [
                {
                    "text": "You need a full day to enjoy each and every place in Science city ! Wear comfortable shoes because you have to walk around! Different packages are available according to your interest you can choose from the packages !\nBest package according to me is of 349/person and it has 8 places to visit ! That too requires full day !\nThe bestest part is aquatic gallery and robotic world which takes you to future advancements ! A very nice place according to all aspects ! Worth the price ! Good for every age group from a child to a old aged person !",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "We had experienced only the Aquarium but it was worth going .my 2.5 year old enjoyed it a lot..\nDo plan in advance by reviewing the map and things to do from their website..it will help to decide which ticket to buy..\n\nWell maintained and well planned..",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Spectacular Revival of Science City's Musical Fountain\n\nI recently had the pleasure of experiencing the reopened musical fountain attraction at Science City, and let me tell you, it was nothing short of mesmerizing! The addition of fire, laser, and water effects elevated the entire experience to a whole new level of entertainment and story telling\n\nThe coordination between the music and the visual effects was impeccable, creating a symphony of sights and sounds that captivated everyone in the audience. The combination of fire, laser beams, and dancing water choreography added an element of excitement and wonder that left me in awe throughout the entire show.\n\nKudos to the team behind this spectacular revival - you've truly outdone yourselves!",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "I visited Science City when i was in Ahmedabad. There is nothing much in Nature and Energy park to see. But the Aquatic galley is purely astounding. They have collection of all kinds of fish with beautifully made aquatic life scenery and well maintained. And added to that Shark tunnel is top-notch it will make us think like we are part of the Aquarium. It is one of the best place to visit in Ahmedabad.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Good place for kids. However lots of walking is required. Ample parking for vehicle is available. Ticket can be purchased on site. Different food courts are also available. A good tour of this requires full day.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "best day different packages robotic package wear gallery nice requires aspects aquatic full science future comfortable every aged old choose according group worth advancements child need around city walk enjoy age shoes interest world takes price places person part good available visit bestest",
                "ticket advance planned things old plan maintained worth experienced decide aquarium year websiteit going reviewing enjoyed well map buy lot help",
                "experiencing fountain experience outdone spectacular combination captivated behind show elevated choreography youve whole impeccable science reopened everyone water beams excitement left sounds kudos entire creating awe truly musical laser recently citys attraction pleasure added symphony city telling let mesmerizing story addition revival sights short throughout coordination music element effects level wonder visual dancing team audience tell entertainment fire nothing new",
                "visited best aquatic tunnel shark scenery science purely think us topnotch see energy maintained fish make added kinds city made collection ahmedabad aquarium galley beautifully one much park well part visit nature like life nothing astounding",
                "ample different day ticket vehicle purchased requires full tour kids lots site food parking also however walking required courts good available"
            ]
        },
        {
            "name": "Riverfront Flower Park",
            "rating": 4.5,
            "address": "Riverfront Rd, Ellisbridge, Ahmedabad, Gujarat 380006, India",
            "reviews": [
                {
                    "text": "I visited this place with my friends. the ticket was 40 rupees (this includes the atal bridge too). This place is full of colourful flowers and plants. There was next to no rush in the garden. There are plenty of places to take pictures and to just sit and chill. There is a big lake too. Overall the place was very beautiful and quiet. I visited this place in the afternoon so I could not see the lighting. The restroom was at the end of the garden. Must visit this place. If anyone is coming here I will surely suggest going here in the evening and enjoy the lighting around the place.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "my admiration for the exceptional flower show organized recently. The captivating display of diverse international flowers truly made the event a delightful experience for attendees of all ages.\n\nThe meticulous arrangement of flowers showcased a vibrant palette of colors and an exquisite variety of blooms. It was evident that a great deal of effort and creativity went into curating such a visually stunning exhibit. The inclusion of different international flowers added a unique and fascinating touch to the overall display.\n\nI particularly want to commend the organizers for creating an environment that not only appealed to adults but also provided an educational and enjoyable experience for children. The diverse selection of flowers surely captured the imagination of young minds, fostering a love for nature and appreciation for global floral diversity.\n\nthe atmosphere was filled with joy and fascination as visitors explored the enchanting world of flowers.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Experience is really mesmerizing.\nEntry fee is 50/ for the west side and for the East side it is 90/.\nThere are so many varieties of flowers.\nEatery shops were also there.\nDrinking water and a washroom facility is also available.\nTry to visit during evening hours for better view.\nNursery is also there to buy plants.\nFree parking facility is available.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Amazing flower show organized by government. Unique designs. Must visit. Lighting decoration as well. Entry fees on weekends is high for public. It's 50 on weekdays n 75 on weekends. It is remaining very crowded and will take 2 hours at least to complete the entire show.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "The Riverfront Flower Park offers a serene and beautiful setting for nature lovers and flower enthusiasts alike. With its well-maintained pathways, vibrant flower beds, and scenic views of the river, it provides a tranquil escape from the hustle and bustle of city life. Strolling through the park allows visitors to immerse themselves in the colors and fragrances of various flowers and plants, making it a perfect spot for relaxation and photography. The park's proximity to the river adds to its charm, creating a peaceful atmosphere conducive to quiet contemplation. Overall, the Riverfront Flower Park is a delightful destination for anyone seeking a rejuvenating experience surrounded by nature's beauty.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "visited beautiful includes big pictures ticket garden full afternoon restroom plants lake anyone quiet friends colourful could see must evening bridge coming around atal surely enjoy flowers take chill end suggest going rupees places overall plenty sit rush visit next lighting",
                "fascinating captivating delightful attendees global organized floral environment joy fascination colors visitors particularly showcased inclusion made imagination explored minds atmosphere exceptional overall evident enjoyable commend provided meticulous touch want truly stunning love arrangement palette nature ages different appealed experience organizers show great display effort enchanting curating flower captured variety diversity world blooms vibrant recently young deal appreciation exhibit visually event adults fostering admiration creating international also filled creativity added selection went diverse surely unique flowers exquisite children educational",
                "try many free experience varieties east washroom drinking plants water side nursery entry parking view evening also eatery shops hours west mesmerizing fee better flowers really available visit buy facility",
                "government amazing designs remaining n show complete organized least public high entry entire crowded must flower decoration fees hours unique weekends weekdays take well visit lighting",
                "beautiful conducive experience peaceful offers tranquil various immerse delightful destination photography setting contemplation hustle colors plants adds relaxation views perfect quiet anyone riverfront allows provides visitors pathways creating natures serene fragrances flower beauty spot proximity city rejuvenating river lovers scenic seeking surrounded wellmaintained beds flowers making parks charm atmosphere park alike bustle overall strolling nature vibrant life enthusiasts escape"
            ]
        },
        {
            "name": "Lambha Baliyadev Temple",
            "rating": 4.6,
            "address": "1, Lambha, Ahmedabad, Laxmipura, Gujarat 382405, India",
            "reviews": [
                {
                    "text": "This temple like any other provides a serene and tranquil atmosphere, radiating positive energy. Despite the significant crowd, the management ensures orderly lines. One of the highlights is the delicious prasadi, adding to the charm of the visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "u will love to watch this vlog of this temple.\nhttps://youtu.be/ljkINGukOlU\n\nthis place has improved a lot.\nthere is huge Parking space.\narea is very clean and descent.\noutside temple food is not recommended.\nthere is small park for children near parking area.\nphotography is allowed inside temple.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "A very big and specious temple of Badiya Dev.\nOne of the famous temples of Ahmedabad.\nMost loved Prasad - laddu and Chawanu",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Lambha Baliyadev Temple is a peaceful sanctuary with a rich cultural ambiance. The serene surroundings and well-maintained premises make it a worthwhile visit for those seeking spiritual tranquility.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice place to visit. Only avoid sundays. Prasad and shrifal is available there so one can avoid  to bring along with them.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "highlights tranquil crowd radiating provides energy serene ensures despite temple prasadi positive adding orderly lines management significant one atmosphere charm delicious visit like",
                "descent space inside near u photography watch small vlog httpsyoutubeljkingukolu allowed food parking love temple outside area improved recommended park huge children clean lot",
                "temples one famous dev laddu temple chawanu big badiya ahmedabad loved prasad specious",
                "baliyadev wellmaintained make tranquility ambiance worthwhile premises temple lambha rich cultural sanctuary surroundings visit seeking spiritual peaceful serene",
                "shrifal one along bring available visit prasad avoid nice sundays"
            ]
        },
        {
            "name": "Sabarmati Riverfront",
            "rating": 4.6,
            "address": "2HFG+9MJ, Sabarmati Riverfront Walkway E, Old City, Lal Darwaja, Ahmedabad, Gujarat 380001, India",
            "reviews": [
                {
                    "text": "The riverfront is nice but the accessibility is a bit hectic. If an old person wants to visit the place there are no amenities one has to walk a long distance. There is a facility of using bikes. But what's the point if one has to return the same place after the ride.it would have been better if the bike points have a linkage from one to others . There's a boat rides too which follows the same facility as bikes.Overall its nice place to visit but when one has spent so much on the development of waterfront. Its better to overlook the accessibility in the development too.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very nice Place to visit With Friends and Family.  the Ahmedabad Flower Show has become one more unique attraction of the city people look for. This annual event was started in 2013 with an aim to make people aware of horticulture, nature, and environment. Citizens are educated on the subjects like how to do roof top gardening, prepare garden in office, net house, kitchen gardening etc. Must visit the 2024 New Year celebration.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Best place in Ahmedabad to sit alone or with your family and friends. Looking at the Sabarmati river are different and cute feelings...! You can rent a bicycle here .",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "The Sabarmati Riverfront, a splendid 11km concrete promenade, offers a captivating view of the Sabarmati River. Its daytime ambiance is a harmonious blend of Brutalist and Modernist architecture, punctuated by the verdant greenery of Neem trees, adding a touch of nature to the urban landscape.\n\nDuring weekdays, the Riverfront is typically less crowded, making it an ideal spot for tranquil walks or leisure activities. The weekends attract more visitors, yet the expansive space ensures there's room for everyone. With no entry fee, it serves as a perfect weekend retreat for families.\n\nThe Riverfront stretches across various localities, some of which may not be safe at certain times. Therefore, if you plan to explore the entire length of the Riverfront, either on foot or by bicycle, it's advisable to do so in the company of others.\n\nThe atmosphere here is positively vibrant, particularly during winter mornings. It's a sight to behold as the cityscape is bathed in the warm glow of the rising sun. I highly recommend a visit to the Sabarmati Riverfront for anyone seeking to experience this beautiful spectacle.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Best public hangout spot in Ahmedabad!\n\nUnfortunately, the country's infrastructure is moving in a way, where malls have become hangout spots and gardens and green covers are diminishing. Its good to see riverfront breaking the trend and offering something different :)\n\nI've been in multiple cities of the country, but the riverfront is unparalleled for what it has to offer.\n\nThe scenic night view of Ahmedabad from Sabarmati is magnificent.\n\nA cool run by the banks of Sabarmati in early hours of morning is refreshing.\n\nI can't wait to see how beautifully it evolves once the GIFT City extension gets connected to the main one",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "would whats bikes wants points distance bike nice hectic point rides overlook using linkage bit riverfront rideit bikesoverall theres old waterfront walk spent amenities follows better one boat much others person visit facility development accessibility long return",
                "people kitchen horticulture net become office event show nice garden environment celebration friends educated prepare must flower attraction house make roof look city citizens family unique subjects top gardening ahmedabad year started one aim etc visit annual aware nature new like",
                "alone sabarmati best different rent cute feelings friends sit family looking river ahmedabad bicycle",
                "retreat captivating km therefore sabarmati ideal architecture visitors view particularly leisure ambiance room fee atmosphere trees serves less activities verdant beautiful brutalist offers modernist various punctuated may touch harmonious everyone safe riverfront yet concrete entry foot crowded winter company localities explore adding urban seeking certain making positively visit stretches nature typically mornings walks advisable space experience sight tranquil greenery length neem either cityscape anyone theres glow weekend bathed times river weekends highly splendid weekdays others sun blend rising vibrant expansive recommend bicycle attract spectacle perfect entire plan ensures daytime families across warm promenade landscape behold spot",
                "wait best different infrastructure cant hangout become gets offering diminishing spots unfortunately extension sabarmati malls public refreshing green riverfront countrys magnificent view see moving something way country gardens evolves hours city cities gift night scenic cool ahmedabad offer beautifully one trend breaking ive morning early unparalleled good multiple banks spot main run connected covers"
            ]
        },
        {
            "name": "Delhi Darwaja",
            "rating": 4.3,
            "address": "2HQQ+458, Mirzapur Rd, Old City, Halim Ni Khadki, Shahpur, Ahmedabad, Gujarat 380004, India",
            "reviews": [
                {
                    "text": "Delhi Darwaja, nestled in the heart of Ahmedabad, is a fascinating glimpse into the city's rich history and culture. As the old city, it proudly stands as a testament to Ahmedabad's architectural legacy. The market at Delhi Darwaja is a bustling hub for wholesale dealers, with a special charm during seasonal markets. Among these, the kite markets during the vibrant Uttrayan festival add an extra layer of excitement.\n\nThe historical significance of Delhi Darwaja is enhanced by its splendid old architecture. The place exudes a timeless charm that captivates visitors. However, the charm extends beyond its historic value. Daily life at Delhi Darwaja is a bustling spectacle with a constant influx of people, creating a lively atmosphere.\n\nWhile the vibrancy is invigorating, it is important to note the challenges presented by the heavy footfall. The rush of the public, combined with various modes of transportation like AMTS, BRTS, and rickshaws, can result in substantial traffic. At times, the absence of traffic police officers poses challenges, leading to instances of rule-breaking by some individuals. It is suggested that enhanced traffic management measures be considered during peak hours to ensure a smoother experience for both locals and visitors.\n\nIn summary, Delhi Darwaja is an iconic destination, steeped in history, and a must-visit for those seeking a taste of Ahmedabad's cultural tapestry. The energetic vibe, coupled with its historical significance, makes it a unique and memorable experience.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "This place has historical significance and is due to its locality. Delhi door is a get-away towards seasonal and essential marketplace. although it is a crowded place where the number of vehicles can create a massive blockage of traffic as the land is very narrow in width.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Delhi darwaja is the one of the most antique gate of four gates of ahmedabad which was arrange by the king of ahmed. It is situated near the dariyapur it is called dilli chakala near it's a brt stop is available many people are come four tour",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A Historical Dilli Darwaja boldly narrates the history of the City's ancient glory and stands tall till date.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Lal Darwaja, located in Ahmedabad, India, holds significant historical and cultural importance. The name \"Lal Darwaja\" translates to \"Red Gate\" in English, referencing the prominent red-colored gate that once stood at this entrance to the walled city of Ahmedabad during the Mughal era.\n\nThis area bustles with activity, serving as a vibrant commercial hub where locals and tourists alike flock to explore its bustling markets, narrow alleys, and historical landmarks. The marketplaces near Lal Darwaja offer a diverse array of goods, from traditional textiles, jewelry, and handicrafts to spices, street food, and household items.\n\nBeyond its commercial significance, Lal Darwaja is steeped in history. It stands as a symbol of the city's rich heritage, having witnessed the ebb and flow of centuries of trade, culture, and architecture. The surrounding buildings showcase a blend of Mughal, British colonial, and traditional Gujarati architectural styles, reflecting the city's multicultural past.\n\nMoreover, Lal Darwaja is a testament to Ahmedabad's resilience and adaptability. Despite undergoing modernization and urban development, it has retained its charm and essence, attracting visitors seeking an authentic glimpse into the city's soul.\n\nThe area around Lal Darwaja also hosts various cultural events, festivals, and religious gatherings, further adding to its dynamic atmosphere. Visitors can immerse themselves in the sights, sounds, and flavors of Ahmedabad, experiencing the city's vibrant energy firsthand.\n\nIn essence, Lal Darwaja stands as more than just a gateway; it serves as a living embodiment of Ahmedabad's storied past, bustling present, and promising future.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "fascinating instances add significance iconic energetic nestled among timeless public history rich architecture visitors citys police officers influx amts however ahmedabad mustvisit brts poses value heart charm glimpse atmosphere combined coupled wholesale exudes note historical people result festival various destination captivates architectural important kite rickshaws excitement suggested peak smoother old extra legacy markets darwaja hours city historic considered absence seeking enhanced modes layer market extends dealers culture measures experience tapestry special delhi uttrayan substantial beyond vibe rulebreaking footfall constant times taste splendid vibrancy testament summary management heavy hub leading proudly challenges memorable like vibrant bustling invigorating spectacle ensure stands locals creating ahmedabads lively daily traffic cultural transportation unique individuals steeped makes rush life presented seasonal",
                "significance delhi land number blockage create towards crowded vehicles door width traffic due getaway locality although essential narrow marketplace massive historical seasonal",
                "people many come near delhi gate tour arrange called chakala king brt darwaja antique situated ahmedabad ahmed dariyapur four one gates available dilli stop",
                "stands tall date darwaja till boldly history narrates glory ancient dilli historical citys",
                "styles significance goods trade alleys redcolored commercial bustles dynamic red future adaptability history modernization lal rich sounds architecture food visitors prominent citys located despite importance textiles ahmedabad soul living household charm moreover glimpse atmosphere alike marketplaces serves promising narrow historical resilience referencing experiencing festivals serving various flow architectural translates india attracting firsthand markets darwaja reflecting city explore area centuries urban seeking adding offer storied sights era flavors spices development heritage culture retained tourists name near jewelry array beyond ebb witnessed gujarati traditional english energy around undergoing showcase testament essence walled past hub multicultural blend street vibrant bustling gatherings immerse landmarks british gate events stands locals items present embodiment gateway religious buildings handicrafts symbol colonial ahmedabads also hosts authentic cultural flock diverse mughal stood steeped significant activity entrance holds surrounding"
            ]
        }
    ]
}