{
    "places_with_reviews": [
        {
            "name": "Shree Khatu Shyam Ji Temple",
            "rating": 4.7,
            "address": "HC8V+28J, Jaipur Dungarpur Bypass Rd, Banswara, Bari Daylan, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "Great place for peace and great front view as the colonies are taking place there.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Great place to visit with your Parents and Grandparents ..\nHoly Vibes with Peaceful Environment\n..\nYou can Visit here during day time or Evening time ..\nIt's mostly open during the day .\nThe temple is well maintained and cleaned regularly ..\nNeed more places like this in City ..",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Mental peace devotional",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Khatushyam ji temple so beautiful 😍",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Situated near main road. Have parking also",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "peace colonies taking front view great",
                "day time great environment open parents holy evening maintained grandparents regularly need temple city cleaned well places visit vibes peaceful mostly like",
                "peace devotional mental",
                "khatushyam beautiful ji temple",
                "near situated road parking main also"
            ]
        },
        {
            "name": "Banswara Fort",
            "rating": 4.4,
            "address": "GCVW+HJ2, Nagarwada Rd, Banswara, Banswara Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "Historic place\nIt would be good to have it as a museum for the coming generations to learn the history of Banswara.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Amazing experience, wonderful.\nIt must be a tourist place .",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Banswara Fort is looking great but fort is not maintain properly. I feel still have time for saving this fort.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Need some renovations but biggest one in area in Rajasthan, and we are proud of our haritage architecture",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It's really good but for its historical perspective",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "would generations coming good history learn historic banswara museum",
                "amazing experience tourist wonderful must",
                "saving banswara properly maintain fort feel looking time still great",
                "one haritage need proud rajasthan renovations area architecture biggest",
                "really historical good perspective"
            ]
        },
        {
            "name": "Mahi dam",
            "rating": 5,
            "address": "GCWM+FX5, Subhash Nagar, Banswara, Banswara Rural, Rajasthan 327001, India",
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Shankh Mandir",
            "rating": 4.3,
            "address": "GCRC+WQ8, Sector Number 4, Amardeep Nagar, Banswara, Kevalpura Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "One of the best place for Devotees to see heaven on earth by visiting This temple - radha krishna, hari Krishna, gopal bolo..\n\nShank temple was more covers with their decorations and design to attract visitors for peace.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "One of the best Krishna temples in the town of Banswara. Great infrastructure, very relaxing and stress relieving location. Jai shree krishna.🤲🏻🙏🏻",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "The temple is in the shape of shankh\nThat's why the name shankh temple\nMain idol of the temple is SHREE KRISHNA alongside there is a p.o.p statue of MAHADEV\nhas a nice garden",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Great architecture",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "this temple is to good for spend time with god we pray for better lyf",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "best radha krishna attract shank devotees visitors see peace gopal visiting temple bolo decorations earth one hari heaven design covers",
                "temples location one jai best town banswara infrastructure krishna stress relieving relaxing shree great",
                "garden pop statue name thats temple alongside shankh mahadev krishna shape main nice idol shree",
                "architecture great",
                "better lyf god pray good temple spend time"
            ]
        },
        {
            "name": "Mohan Colony Chauraha",
            "rating": 4.5,
            "address": "HC3W+H4R, Mohan Colony, Banswara, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "It is a very nice place, there is shade from the trees and the road is wide.",
                    "languageCode": "en-US",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "wide shade trees road nice"
            ]
        },
        {
            "name": "Vaneshwer mahadev",
            "rating": 4.7,
            "address": "GFW3+9MM, Vaneshwar, Banswara, Bhandariya Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "Morning 5 30 experience fantastic 😍",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Har Har Mahadev ...Very big And Epic place with Natural Environment for worship and Enjoying",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Beautiful temple of Mahadev and nice place",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "A large premise of temples.\" Vaneshwar Mahadev\" temple is the largest temple in this   premise.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "fantastic experience morning",
                "har environment natural worship big mahadev epic enjoying",
                "good",
                "beautiful temple mahadev nice",
                "temples premise temple largest mahadev vaneshwar large"
            ]
        },
        {
            "name": "BADA RAM DWARA CHOWK, BANSWARA",
            "rating": 4.8,
            "address": "GFW2+843, Banswara, Banswara Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "It's very peaceful place for worship.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Jay shri ram 🙏",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Situated in old city area of banswara. Unable to reach here in four wheelar",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "My home",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Jay shree ram",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "peaceful worship",
                "ram shri jay",
                "four situated banswara wheelar city area reach old unable",
                "home",
                "ram shree jay"
            ]
        },
        {
            "name": "Shani Dev Mandir Banswara",
            "rating": 4.9,
            "address": "4, Pala Rd Teliwada, Khandarwadi Banswara Rural, Pala Rd, Teliwada, Najmi Bagh, Khandarwadi, Banswara Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "The only temple of shani dev in city",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Jay sani dev",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Prince",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Good Temple\nAnd 2 more temple here 1 Saraswati Mata\n2 Shiv ji (Mhakaleshwar)",
                    "languageCode": "en-US",
                    "rating": 4.9
                },
                {
                    "text": "Om Sham Shanicharyaya Namah should be written not that\nॐ Shanicharyaya: Namah",
                    "languageCode": "en-US",
                    "rating": 4.9
                }
            ],
            "preprocessed_reviews": [
                "city shani dev temple",
                "dev sani jay",
                "prince",
                "ji temple good saraswati mata mhakaleshwar shiv",
                "sham written shanicharyaya namah om"
            ]
        },
        {
            "name": "Baba ramdev ji",
            "rating": 4,
            "address": "GCWQ+8C7, NH927A, Harijan Colony, Subhash Nagar, Banswara, Banswara Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "Ok so this mandir is just before the famous mangalam complex if you go from costum circle towards college ground. Or just opposite the famous Ambamata mandir or LIC Building at Banswara. It's on a private property and managed by the family living there. They told me it's there ancestral property and this mandir came into existence in the year 1964. Since then it's renovated several times but at present the looks is very different. The way it's made is kind of artistic. It's also very different in many ways. Umm the private property thing , is quite visible. It's not like a normal mandir as anywhere else. It's differently different. I can't explain this but while i was there i felt it, i felt very uneasy, very uncomfortable, may be i am not used to this kind of atmosphere. The atmosphere looked very old, that uncanny feeling, i felt kind of fear in some parts of this mandir. The main reason being it's really old , i mean the way the art work on all over the wall, all though the mandir, that's very best work of art but it's very old way of painting. Umm though it's not like it's on private so you can't visit, it's free for all to visit during visiting hour. Yes it could be visited for sure. Well not a very popular mandir though, just opposite to it is Ambamata mandir which is way more popular compared to this mandir. See the pictures and videos and decide for yourself.",
                    "languageCode": "en",
                    "rating": 4
                }
            ],
            "preprocessed_reviews": [
                "uncomfortable free popular opposite mean managed visible parts towards see looks famous fear mandir compared made explain costum ground living atmosphere well main property uneasy visited painting mangalam private cant ancestral may college videos work uncanny differently old could way else used year really thats building banswara visit told since best lic different many normal existence art though sure ok feeling reason times family decide wall several looked like go artistic anywhere complex renovated hour pictures ways present came quite also yes visiting ambamata thing umm felt kind circle"
            ]
        },
        {
            "name": "MG Circle",
            "rating": 3.5,
            "address": "Surpur House, Najmi Bagh, Nai Abadi, Banswara Rural, Rajasthan 327001, India",
            "reviews": [
                {
                    "text": "👑",
                    "languageCode": "en",
                    "rating": 3.5
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": 3.5
                },
                {
                    "text": "Mg sarkal one thing is going there",
                    "languageCode": "en-US",
                    "rating": 3.5
                },
                {
                    "text": "Meladi goga Maraj",
                    "languageCode": "en-US",
                    "rating": 3.5
                },
                {
                    "text": "Photography & photo studio Saliya",
                    "languageCode": "en-US",
                    "rating": 3.5
                }
            ],
            "preprocessed_reviews": [
                "",
                "nice",
                "mg one going thing sarkal",
                "maraj meladi goga",
                "photography studio saliya photo"
            ]
        }
    ]
}