{
    "places_with_reviews": [
        {
            "name": "Jim Corbett National Park",
            "rating": 4.4,
            "address": "Uttarakhand, India",
            "reviews": [
                {
                    "text": "It's a must-have experience. I didn't get to see a tiger, but I saw many other animals. It's mostly like a luck factor. But the forest itself is really beautiful. Even though I've been to other national parks too, this was a different experience. The staffs are also friendly and everything is well organized.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It was an amazing experience.Though jungle Safari was a disappointment as we barely saw any animals. But the scenic beauty is amazing. Its good if you want a break from routine. River near Garjia Temple is amazing.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "We had visited on jan 7 /2024 , so much cold weather , open safari,  scary vibes all good.. It was like Forest of deer's, monkeys , peacock , hen only... We have not found there any other animal  but we can see their presence by their footprints told by the guide of there. But overall it was fun .. According to me it's a one time visit that's it...",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "One of the most beautiful serene places I’ve ever been to. Only Jim Corbett authorised jeeps and canters are allowed to enter the park. Jeep safari is around 7000-10000 depending on which agency you book with. You can take up to 6 people in this jeep. We saw many deer, monkeys, a jackal, elephants, and last but definitely not least a massive tiger. The entire park is so massive, that you shouldn’t even call it a park. It’s basically a jungle ecosystem.\nEven if they were charging double for the jeep safari, this place would still be worth it. Once in a lifetime experience if you’re a nature lover.\nIf you’re going in the winter months, be sure to layer up because you go around 7-8 kilometres to the park gate in the jeep at around 60 kmph, and it is freezing out there.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "You can its a wonderful experience of jungle safari\nYou need to book safari on gov website.\nDont go with much expectation to tiger. Enjoy the nature wildlife and see animal habitats.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "different many experience beautiful animals everything tiger organized national though friendly luck forest see saw also factor get musthave staffs really parks ive even well didnt like mostly",
                "beauty amazing break routine animals disappointment near good temple barely want experiencethough garjia river scenic jungle saw safari",
                "visited hen monkeys weather vibes fun time footprints presence open found see forest according scary jan peacock cold guide animal one much thats good deers overall visit told like safari",
                "people lover would jeeps many beautiful monkeys last t s experience months depending re tiger gate jungle book call lifetime allowed least freezing it agency sure shouldn jackal entire ever serene saw winter worth elephants corbett jim around basically definitely charging you still layer kilometres one jeep canters take going authorised ve enter i park places even double ecosystem deer nature kmph go massive safari",
                "wildlife experience dont tiger jungle book habitats website see need wonderful enjoy animal much gov expectation nature go safari"
            ]
        },
        {
            "name": "Jim Corbett National Park Uttarakhand India",
            "rating": 4.6,
            "address": "Jim Corbett National Park, Corbett Tourism Office, Shivlalpur Pandey, near Reliance Petrol Pump, Ramnagar, F-3, Uttarakhand 244715, India",
            "reviews": [
                {
                    "text": "Awesome place to visit in uttarakhand. Situated in ramnagar district Nainital. Forest is full of wild animals and various species of tree. Full of beautiful landscapes. Different resorts provide special views in their ambience. Perfect place for weekends, for people who want to stay away from cities full of noises for a while.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "🌳🐉🦌🦣🐅 *Jim Corbett National Park, Nainital - Uttarakhand - India* Established in 1936, Jim Corbett National Park is the oldest national park spread over more than 500 square kilometers. This is First tiger reserve in India with the highest number of tigers. The park has an abundance of flora and fauna, which makes it perfect for safaris. In the park, you can catch sight of animals like Royal Bengal Tiger, Deer, Indian Hog Deer, Sambar Deer, Otter, Asiatic Black Bear, Sloth Bear and aquatic reptiles. Very well connected by rail / road and nearest airport is Pantnagar.\nGood hotels/guest houses/safari cottages and tour operators are available. Leaving peak summer months, light winters are the best to enjoy  Flora n Fauna of Jim Corbett. Area is quite big and park is decided in 6 zones, namely:\n1.Bijrani Safari Zone :Bijrani Zone is very popular tourist's hub because of its abundant natural beauty and open grasslands. The entry gate of the zone is located at only 01 Km from Ramnagar city.\n2.Jhirna Safari Zone :Jhirna is another important tourist zone in the Jim Corbett National park that is open for tourist round the year. Jhirna Gate is located at 16 km from Ramnagar city.\n3.Dhela Safari Zone :Dhela is a new eco tourism zone in Corbett National Park included in tiger reserve zone in November 2014. This is the only area in the reserve's buffer zone open to tourists in CTR. The zone is retaining the attention of large number of tourist because of its wealthy flora and fauna, open throughout the year, located at an approximate distance of 13 Km from Ramnagar City.\n4.Dhikala Zone :Being the largest and most jungle-safarivaried zone in Corbett, Dhikala is famous for its abundant natural beauty as well as offering the best sight for exotic fauna. The entry gate is 18 km away from Ramnagar city. Night stay inside the Dhikala Tourism Zone is highly recommended for the hard core wildlife enthusiasts.\n5.Durga Devi Zone :Located on the north-eastern boundary of the Jim Corbett National Park, Durga Devi zone is the heaven on planet earth for those who are fond of bird watching. Entry gate is located at an approximate distance of 36 km from Ramnagar city.\n6.Sitabani Buffer Zone :Sitabani Zone doesn't fall under the Corbett Tiger Reserve area. If you are fond of serene ambiance of the natural beauty, must visit Sitabani area.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "If you are coming for safari it's waste of money and time. You can have a look elephant ,dear,  monkey and sambar in such big safari...",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Jim Corbett National park is very well known national park in ramnagar it is famous for tiger. You can find many species of flora and fauna in this park. The environment around this forest is very\nrefreshing and good. You can find different types of bird also. It name is very famous and people come from foreign country to visit this national park. You can also visit with you parent for good memories. Thanks!",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "This Unique tiger territory is best known as the father who gave birth to Project Tiger in India to safeguard the most endangered species and the Royal wild animal of India called Tigers",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "people provide stay different beautiful resorts animals various special nainital district ambience awesome full species views perfect want wild uttarakhand forest ramnagar situated cities weekends away landscapes visit tree noises",
                "jhirna stay cottages abundance sloth popular black km nearest grasslands boundary n safaris offering sambar hog tour ctr fall uttarakhand serene located hard famous reptiles ambiance watching corbett jim hotelsguest leaving northeastern enjoy indian light dhikala large recommended eco retaining sitabani well tourism housessafari connected bengal winters distance rail important number core wealthy india bird first decided largest peak operators entry royal attention city area earth november square year park planet namely abundant visit new tourists best sight animals months big dhela otter national included kilometers zone reserves flora must ramnagar tourist spread bijrani another highly catch throughout hub tigers good round heaven established like deer enthusiasts approximate highest airport natural wildlife inside asiatic bear nainital tiger gate junglesafarivaried aquatic open exotic perfect oldest reserve pantnagar quite durga summer beauty buffer road night away makes zones fauna doesnt available devi fond safari",
                "waste coming look big money elephant dear time monkey sambar safari",
                "find people known different many name memories come parent types tiger national environment species thanks bird refreshing forest flora also country ramnagar famous corbett jim around park well fauna good visit foreign",
                "known father birth best species animal india tigers gave project wild endangered unique safeguard royal tiger called territory"
            ]
        }
    ]
}