{
    "places_with_reviews": [
        {
            "name": "Kadyawaril Shri Ganapati mandir Anjarle",
            "rating": 4.7,
            "address": "V32R+JWM, Murdi-Anjarle Khadipulmarge Kadyavaril Ganapati Mandir Marg, Anjarle, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "Very beautiful temple. First footsteps of Ganpati bappa is here. The backyard pond had 1000+ turtles which age back to decades.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Kadyavaril Ganapati is a charming and ancient temple, creating a pleasant atmosphere for devotees. The adjacent Ganapati first step in stone enhances the spiritual ambiance. The temple offers a nice view from the top, contributing to an overall good experience.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Kadyawaril Shri Ganapati Mandir in Anjarle, highly recommended by my Konkani friend, is not only deeply spiritual but also impressively clean and well-maintained. Dedicated to Lord Ganesha and perched atop Anjarle hills, it offers a serene atmosphere and a unique feature: the footprint of the deity near the temple. With captivating stories shared by the poojari, this sacred site promises a spiritually enriching experience amidst pristine surroundings.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "One of the famous temples of the Dapoli Taluka. It is about 30 km from Dapoli city.\n\nThis is the oldest lord Ganesh temple located in Anjarle village. Not only is the temple beautiful but also the surrounding nature is so amazing.\n\nThe story of this temple is that, the ganesh lord came from the Arabian sea to here. The Lord took the first step on the hill from the sea, there is a small footprint 👣 printed and locals built one small temple there. On the second foot they built one temple.\n\nI have been here so many times in every season. Such a great nature and climate here is. Also we can see small anjarle khadi. And the other side is the arabian sea and anjarle beach.\nIn short such a great place it is.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Nice little temple. At the top of a hill, road is nice n steep. Ample parking. Clean washrooms are available. Temple is calm, we got laddoo each as Prasad maybe because of Diwali. There is a small walk to see foot print of Ganesh as well. From there city view can b seen. Small Shiva temple is also in same premises. A big well is present there too . Few stalls to sell sherbat or kokan based stuff is also available outside in parking",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "ganpati backyard beautiful bappa first temple footsteps pond decades back age turtles",
                "contributing experience adjacent kadyavaril offers nice ganapati enhances charming first spiritual creating view pleasant ambiance temple ancient top atmosphere good step overall stone devotees",
                "shared poojari kadyawaril friend experience near promises deeply offers captivating surroundings dedicated lord ganapati atop hills spiritual footprint site pristine serene also feature amidst stories ganesha anjarle enriching mandir temple deity impressively unique highly recommended wellmaintained perched sacred spiritually atmosphere konkani shri clean",
                "ganesh amazing many beautiful village took km lord dapoli small printed great locals first side every footprint oldest came foot built see also located famous anjarle arabian times season temple khadi city story taluka sea hill temples beach one short step nature climate second surrounding",
                "ganesh little ample calm based washrooms got big steep prasad n kokan nice small sell shiva premises present maybe parking foot sherbat view see also temple city outside road walk top hill print stalls well laddoo b available diwali clean stuff seen"
            ]
        },
        {
            "name": "Suvarnadurga Fort",
            "rating": 4.2,
            "address": "Suvarnadurg Fort, R38M+9QM, Dapoli, Maharashtra, India",
            "reviews": [
                {
                    "text": "This fort is located inside arabian sea, 3 km away from Harne village (Dapoli). Fort is good and has historical significance. Place is not much crowded but its worth to visit the spot in winter. Do not visit this place individually (Visit in group). On the south side of fort thier is one view point from where w'll get the panaromic view. Boat will take charge of 150-200 Rs per person.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "This is a  beautiful place to visit . Try going early in the morning so that you can see the fort without the heat . The boatman will charge 200 Per Person . Luckily for us a group of 5 men joined us which made it a Quick trip without any waiting in the start point.\n\nOnce you reach the fort , they give you 30 mins time for you to sèe the fort which I feel is very very less . To go & see around will take atleast 60 mins .\n\nTry taking a certified guide with you who can tell you about the historic past . We clicked some pics in the sea area at the starting of the fort which is a good place for people to take Pics . The place is not maintained at all beacuse of which you need to be extra careful at some of the spots as it can be slippery & there are no safety walls . So climb & go down carefully by being in the group .\n\nYou can also collect sea shells in the beach area 😎",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "The fort is located near Harne Bandar.\nThe Suvarndurg fort is located in Arabain sea. The ferry is available to reach the fort, it take 10 to 15 Minutes to reach it.\nOnly protective wall of the fort I. E. Tatbandi is in place, we can see the some evidence of inner construction of the fort.\nIt ia little risky to go by ferry since ferry boats are not customise for the passengers.\nThe charges of ferry is 200 per person.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Awesome fort. Amazing to see what enormous structures were constructed during those times. The fort is big and walkable. The problem for people with knee issues and senior citizens as steps inside the fort are huge. Nevertheless one can see the fort and move around inside the fort. The boat ride from jetty to fort and return is also nice. Kids enjoy it. It takes around 15-20 minutes to reach the fort from the jetty. Must visit. Highly recommended.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "One of the best coastal fort with great view and boat ride is worth your time",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "significance rs inside village panaromic km dapoli point side south fort wll crowded harne view group charge winter individually located worth arabian thier away sea get one boat much take per good person visit spot historical",
                "people try carefully beautiful s luckily men collect slippery reach time starting quick point without spots certified shells heat pics fort joined us boatman see group charge extra walls also maintained climb need waiting around historic made area clicked safety e trip guide sea beach take going past per morning give early atleast person taking good careful beacuse visit feel less mins tell go start",
                "little protective boats near tatbandi reach since customise risky charges ia fort harne see minutes bandar located go e sea passengers wall take per evidence inner person available ferry suvarndurg arabain construction",
                "people amazing constructed inside big reach move jetty nice awesome steps kids fort see minutes must walkable ride also enormous times around problem citizens highly enjoy recommended senior one issues boat structures knee huge takes visit nevertheless return",
                "ride one worth best boat fort coastal time view great"
            ]
        },
        {
            "name": "The Ridley’s Beach",
            "rating": 4.5,
            "address": "V3CH+98, Tadachakond, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "Amazing clean beach.. The drive from Mumbai to come to a beach like this is worth it!",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "beach mumbai amazing worth come clean drive like"
            ]
        },
        {
            "name": "Anjarle Lighthouse",
            "rating": 4.5,
            "address": "Tadachakond, Maharashtra 415717, India",
            "reviews": [
                {
                    "text": "Great panoramic view. Visit after 4pm but before 5.30. Small play garden for kids. Senior citizens have to climb lot of stairs.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "We recently visited the light house. The place is still under construction, however the light house is operational. There are a total of 150 steps to climb. Charge per person is 10 INR and for camera 20 INR. Specifically note that the timing is from 4.00pm to 5.30 pm ONLY. The authorities are very stringent about it, however there is no clearcut timing written anywhere in the property. The view from the top is breathtaking. People with heart condition and Asthama could reconsider their climb to the light house tower.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It was closed due to maintenance. I have visited three weeks back. The campus was very well maintained. I wish I was able to visit thr lighthouse from inside.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Amazing place. Nicely maintained. Must visit when you are visiting this area. Kids will love it. Timing is important. It was from 4 to 5.30 pm when we visited. Scenic views all around. The beach is very nearby. You can walk to the beach. Approximately 600 meters from the beach. Nice view at night also. The steps up the light house are a little demanding, but worth it.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Lighthouse gate may be locked, but do ask someone inside lighthouse, and you can enter by getting Rs10 ticket.\n\nTiming: 4:00PM to 6:00PM\nTicket charge: Rs 10 per person\nStairs : 10 floors",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "garden panoramic stairs climb kids visit pm play citizens view lot senior small great",
                "people timing authorities visited anywhere breathtaking tower operational reconsider written steps stringent inr asthama pm condition view total could charge house clearcut climb top however specifically light still property heart camera per person recently note construction",
                "three closed visited weeks maintained able lighthouse wish well inside maintenance visit back thr due campus",
                "timing amazing visited little approximately important nice steps kids views pm meters view must also maintained house worth visiting love around nicely area walk scenic night light nearby beach demanding visit",
                "timing ask stairs ticket someone lighthouse locked inside enter getting rs per person floors pm gate charge may"
            ]
        },
        {
            "name": "Anjarle Beach",
            "rating": 4.3,
            "address": "V35M+8G, Anjarle, Tadachakond, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "Simply amazing experience. spread across the openness of nature, beautiful clear sky and you can spend hours on the site.\nTetrapods adds an edge to your photography cravings",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A paradise during low tide.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Perfect place to enjoy sunrise and sunset..every calm clean and peaceful",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Beautiful beach. Great place to visit with your friends.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Awesome beach with a great view. The lighthouses is main attraction.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "photography amazing tetrapods cravings experience beautiful adds spread clear hours edge openness simply nature across spend sky site",
                "tide low paradise",
                "calm sunsetevery peaceful sunrise perfect clean enjoy",
                "beach beautiful friends visit great",
                "beach awesome attraction main lighthouses view great"
            ]
        },
        {
            "name": "Anjarle village (dapoli )",
            "rating": 4.8,
            "address": "V34W+PJ9, Anjarle, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "Chinese hotel",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Too good place",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "hotel chinese",
                "good"
            ]
        },
        {
            "name": "Anjarle Turtle Festival",
            "rating": 4.5,
            "address": "Anjarle, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "You can witness the most incredible experience here. This is the most natural and organic process hence not sure whether you will definitely see when you go. But it is worth trying.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Great initiative by nisarga Mitra NGO,\n\nArjerle is the second place in Maharashtra to watch baby turtle hatching! One must definitely visit this place!\n\nTimings : 7 am in morning & 6 pm in the evening\n\nThey charge 100 rs pp , ticket are valid for 4 days\n\nBiggest highlight of this place is the beach is super clean & uncrowded unlike velas where during every weekend more than 4,000 tourist come!\n\nDon't miss this place!\n\nSaw 17 🐢 hatched!\n\nIt was awesome",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It all depends on your luck weather you will get to see hatching or not! But the beach is very beautiful and clean!\nTiming for turtle festival is 6:30 am and 6:30pm",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Awesome experience to see newly born baby turtles. Captured their first movements. It’s really great to see them crawling towards Sea. The people involved in the team of preserving the eggs, bringing them to life & sending them back to the sea are really doing great work. Please let us know your official website for commercial contributions.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Anjarle beach is one of the beaches in konkan, known as breeding ground of olive Ridley turtles. Best season to go is March to April. Daily twice, morning 7 am and evening 6 pm, hatcheries are checked and new hatchlings are guided to sea. Baby turtles are adorable. Not much facilities in area, mostly homestay. Beaches are clean and have basic facilities.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "trying worth whether natural process experience hence sure organic witness definitely go see incredible",
                "highlight pp rs come dont arjerle hatched miss watch ticket great super awesome maharashtra every velas pm second turtle weekend charge must evening nisarga biggest saw unlike ngo hatching tourist definitely days beach one uncrowded valid morning timings initiative visit clean mitra baby",
                "beach timing festival luck beautiful hatching weather pm clean depends turtle see get",
                "people experience s commercial sending great turtles awesome preserving eggs it first involved work movements please back towards us website see captured contributions bringing let newly sea really crawling know official team born life baby",
                "known homestay best ridley olive april hatchlings turtles konkan basic guided facilities mostly pm adorable checked breeding evening twice anjarle march daily season area ground beaches sea beach one much morning hatcheries clean go baby new"
            ]
        },
        {
            "name": "Sunset view point, Pajpandhari",
            "rating": 4.6,
            "address": "Pajpandhari, Pandhari, Maharashtra 415713, India",
            "reviews": [
                {
                    "text": "Best put to see sunset over the ocean. This point is on a slope. On the foot of the slope may be a village and beyond that its all ocean. You'll be able see Harne on the cleared out. Take care in case you're with the kids in spite of the fact that since the assurance railing put by the government was broken and stolen by local people. Oh",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "The view in the evening is excellent, more relaxing, couples can enjoy seating there",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "This is a point to view the sunset and the town below. Good thing is there is plenty of parking space for four wheelers and a platform from where you can see the view.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Must visit if you are on the way to dapoli or staying nearby , You can have panoramic view of villege based at shore . It gets crowded during sun set so I decided to go in the afternoon though it was sunny and hot but I got to have whole place to me for the time I was there ( but i believe sunset would be great choice ) Roads are not great not bad either so it's manageable.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Best place to view sunset over the sea. This point is on a hill. On the foot of the hill is a village and beyond that its all sea. You can see Harne on the left. Be careful if you are with the kids though because the protection railing put by the government was broken and stolen by locals.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "people government able best village railing spite may case point sunset beyond assurance stolen kids put care foot harne see fact youre cleared oh ocean local take broken since slope youll",
                "excellent seating couples enjoy view relaxing evening",
                "four platform town space good wheelers plenty parking thing view see point sunset",
                "would set hot based roads got gets time dapoli sunset though great whole afternoon either decided crowded view must way panoramic staying choice villege nearby believe bad manageable sun visit shore go sunny",
                "government best village railing point sunset beyond though stolen locals left kids put foot harne view see sea hill careful protection broken"
            ]
        },
        {
            "name": "Fattegad Fort",
            "rating": 4.1,
            "address": "R36Q+XRF, Fattegad, Harnai, Maharashtra 415713, India",
            "reviews": [
                {
                    "text": "Fattegad Fort is very Beautiful place❤️ if you are a non vegetarian fish lover you must visit this place you will love this place. The fort is amazing and view is really very beautiful. If you are traveling to Harne Beach or Harne port must visit this place too. Best time to visit is in summer 🌞⛱️ season or in winter ❄️ season too. Lots of places nearby to visit and enjoy with family or friends or with loved ones.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "Though its fort but there are no remains of the fortification on fort. Its a lighthouse now. The best time to visit here is after 4pm as you will get good photos. This place has good flow of air flowing from sea and you  can sit and relax here with family and friends till dawn as it can also be called sunset point. There is harnai fish market very close where you can purchase fish at very cheap rates.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "Fattegad is walk able distance from the jetty. Small steps takes you to the top. There are around 4 water tanks on the fort.\nIt has the nice view of the harnai jetty on one side, while Suvarnadurg lie to the other side.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "It is beautiful and secluded and a boat takes you there, but the inside of the fort is not very interesting. It is all in ruins with a lot of dry grass growing. It looks very creepy too. It has a few beautiful spots though, with good views. There are a lot of bats inside the fort. But near the entrance of the fort, you will find a small beach with extremely white sand and blue waters. That makes the whole trip worthwhile.",
                    "languageCode": "en",
                    "rating": 4.1
                },
                {
                    "text": "There is nothing left in the fort to see. Sunset can be enjoyable near the beach. Added photos of nearby Suvarnagarh Fort.",
                    "languageCode": "en",
                    "rating": 4.1
                }
            ],
            "preprocessed_reviews": [
                "lover amazing best beautiful loved time vegetarian fattegad lots friends fort harne view must summer winter fish port non love season family enjoy traveling nearby beach really ones places visit",
                "relax best photos flowing flow time remains sunset though point harnai purchase friends close fort pm called fortification also fish rates air family get sea dawn lighthouse till good market cheap visit sit",
                "able lie distance fattegad jetty small nice harnai steps water side fort tanks view around walk top one takes suvarnadurg",
                "find sand beautiful inside near worthwhile blue dry ruins spots small though whole extremely views bats fort secluded looks growing trip creepy beach white makes interesting boat waters takes good grass entrance lot",
                "beach photos added near left enjoyable suvarnagarh fort nearby see nothing sunset"
            ]
        },
        {
            "name": "Padale Village",
            "rating": 4.6,
            "address": "Mukkam Padle, Post Aade, Taluka Dapoli, Ratnagiri, V3JG+7G7, Dapoli, Padale, Maharashtra 415714, India",
            "reviews": [
                {
                    "text": "If you are a true nature lover: this is a place to visit. Don't believe anything that's said on Google! Visit and experience first hand!",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very nice place.. Neat and clean beach...",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very remote beach white sand beach not a lot of visitors this one does not activities or stall or shops near good for take out picknic",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "It's a beautiful place to visit with family and friends. Beaches are lonely and peaceful. Food is delicious here. Shardashree lodge is a great stay here. You must visit this place at one. I am gonna come here again with my friends.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Get away from Russian tourists and find out what the authentic MH lifestyle is like.\nBeach is quite clean, water not that inviting. However, you can camp on the beach or choose between 2 rather basic guest houses. Local food cooked by Mama Jadhav will leave you drooling.\nRecommend if you want to get off the beaten track!",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "lover google true thats anything dont said experience first visit nature believe hand",
                "beach clean nice neat",
                "beach white one sand take shops near good stall remote visitors activities lot picknic",
                "stay lonely beautiful come great friends food must family na beaches lodge one delicious shardashree gon visit peaceful",
                "find tourists houses drooling beaten mh camp guest basic water cooked want food rather inviting lifestyle choose quite authentic leave mama however local get away beach track russian jadhav clean like recommend"
            ]
        }
    ]
}