{
    "places_with_reviews": [
        {
            "name": "Shri Sidhbali Baba Dham Mandir, Kotdwara",
            "rating": 4.8,
            "address": "QG5Q+6GX, Shri Sidhbali Marg, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "Great experience one of the oldest hanuman temple will surely visit again. Crowded on weekends try to be early. You can also have langar organised here by help of local governing authority of the temple.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Jai Bajrang Bali ki Jai 🙏🙏🙏🙏, Jai shree Ram🙏🙏🙏🙏\nJai Ho Shri Sidhbali Baba ki Jai\nAwesome temple\nBajrang bali will complete all your wishes...\n\nParking facility available..\n\nDrinking Water facility available...\n\nShoes store available...\n\nLift facility also available...\n\nWashroom available....\n\nBhandara for bhakt is also available...\n\nKho river is very beautiful...\n\nBe Aware of monkeys....\n\nPrasad available...\n\nYou can also book for bhandara here....\n\nSitting facility available...\n\nNearby food shops available....\n\nDharmshaala facility is also available nearby...",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The Hanuman idol in this temple is one of the most beautiful idols I have ever seen. The place is neat and clean but at some height. You have to climb stairs to explore the area.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Pleasant Temple Peaceful Location before Mountain Valley Starts!!!\nBhandara(Free Meal) available for all. Sweet is must try, in meal.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Serene environment, divine experience, no long waiting in lines despite a mild crowd. The temple is situated atop a hill and one has to climb a number of stairs to reach there. Holy, divine and beautiful experience (the view and the bhandara is a plus plus)",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "try experience hanuman authority great governing oldest crowded also organised temple surely weekends local one early visit langar help",
                "dharmshaala beautiful monkeys sitting prasad washroom wishes ram drinking complete book baba awesome jai water food parking shree also ki ho shops temple river bajrang bhakt nearby lift shoes store kho bali available bhandara shri facility aware sidhbali",
                "one stairs idols beautiful climb hanuman temple explore height clean area ever idol neat seen",
                "location mountain try pleasant bhandarafree starts temple valley available sweet peaceful meal must",
                "stairs experience beautiful divine reach atop number environment crowd holy plus view serene despite climb situated waiting temple lines mild hill one bhandara long"
            ]
        },
        {
            "name": "Kalagarh Tiger Reserve Safari Booking",
            "rating": 4.5,
            "address": "Division, Kotdwar - Lansdowne Rd, Dugadda Range, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "This is the other side of Corbett park which is also called Kalagarh. One of the most thrilling safari ride I ever took. I would rate it better than any other safari ride that I have taken on Ramnagar side of Corbett Tiger Reserve. The terrain goes up and down the mountain and many river crossing which made is much thrilling as compared to Ramnagar corbett drive which is usually plain. Animal sighting is hard I would say as compared to Ramnagar side as this side has much dense forest and rugged terrain. Please book through official website only and in advance as there is much less number of safari permits in a day if I compare with Ramnagar side. No food options available inside the park.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This was a wonderful safari! Our tour guide Anil was very educated and knew every bird in the park! We saw multiple different species of flora and fauna. The tours were conveniently set up and I would recommend to anyone looking to get out into Jim Corbette National Park!! If Anil is your guide, your in wonderful hands!!",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "The sunset view was amazing and we enjoyed it to the fullest amidst cacophony! All around greenery is a big plus here. Surely enjoyable!\n\nBeautiful view with nice weather. You can only take your car up to a poiint before army men stop you. Take your car till you can go as the walk uphill is very exhausting. Once you park your car, you will walk the final mild which is at least a km . The view is spectacular and you can spend time. Be safe a enjoy the sunset !!!",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Almost raw jungle nice natural vibe spent night in guesthouse, just amazing",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Absolutely amazing place for nature lovers. I was able to see a beautiful group of deers and sambhar deer, wild fox, various species of birds. The elephants are the biggest fear here as they are very moody. Not able to see any tiger, will try again next time.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "would day many inside took plain drive options tiger usually book rate number compare goes sighting advance side taken permits please website food ever reserve say called forest also ride ramnagar hard kalagarh dense rugged corbett compared made river terrain better animal one mountain much park official available thrilling less crossing safari",
                "would different set looking knew national conveniently species tour bird anyone every anil educated flora saw wonderful tours jim guide get corbette park fauna multiple recommend hands safari",
                "army amazing beautiful exhausting men weather greenery big enjoyable km spectacular spend time uphill nice sunset final least safe plus view fullest amidst go around surely walk enjoy car mild take park enjoyed till cacophony stop poiint",
                "raw amazing natural vibe guesthouse night spent jungle nice almost",
                "amazing able birds try beautiful various time moody tiger species sambhar wild see group biggest fear elephants lovers deers nature deer fox next absolutely"
            ]
        },
        {
            "name": "Hanuman Mandir",
            "rating": 4.6,
            "address": "PGVC+R6R, Jhanda Chowk, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "Most spritual please I love it south facing Hanuman mandir ♥️♥️♥️",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beautiful views my village Naugaon  Pauri Garhwal",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very good temple in hill top at Kotdwar . peaceful area.this temple's name is sri sidhabali temple",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very beautiful place ... surrounded by hills.. wonderful view from the top .....",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Beautiful view. The history of the temple says it all.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "love mandir facing hanuman south please spritual",
                "naugaon beautiful garhwal pauri village views",
                "hill temples sri kotdwar name sidhabali peaceful temple good top areathis",
                "beautiful wonderful top surrounded view hills",
                "beautiful temple history says view"
            ]
        },
        {
            "name": "Shri Siddhbali Dham Mandir, Kotdwar, Uttarakhand",
            "rating": 4.8,
            "address": "QG2G+XQ6, Mohabewala Industrial Area, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "Beautiful place and nice view",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Very Powerful & Siddh Place.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "There is no reason to meet Baba, just go when he calls you.",
                    "languageCode": "en-US",
                    "rating": 4.8
                },
                {
                    "text": "I have gone here for the first time. I found the temple very beautiful.",
                    "languageCode": "en-US",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "beautiful view nice",
                "siddh powerful",
                "baba reason calls meet go",
                "beautiful first temple found time gone"
            ]
        },
        {
            "name": "St. Joseph's Cathedral Church, Kotdwara",
            "rating": 4.4,
            "address": "Bishop House Rd, behind Govt Hospital, Mohabewala Industrial Area, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "We went there on Christmas Day. This church is one of the famous churches of Asia",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Beautiful Church. Neat and clean campus. Peaceful atmosphere for prayer and meditation and refreshing the soul.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "I have visited many churches but this is really quite unique! A must see even if you are not religious, but just for the very interesting structure, it is worth the visit Kotdwar ♥️",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Supposedly, it's the 2nd largest church in Asia. Since we like to explore all kind of places of significance so we decided to visit it on our way from Landsdown to Haridwar. It's certainly a massive structure surrounding by a well maintained garden and lawn. However, church opens at 5pm and one of the staff was very rude to us when we entered in the wrong gate by mistake.\n\nOverall, nothing great to visit.. you should rather visit St. Johans and St. Marrys church both built more than 100 years ago.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "One of the best and biggest Church in Asia considered one of the top in top 10 church of Asia. Beautiful Church and visited by many people of all communities. Must visit place if you visit Kotdwar, Uttrakhand.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "churches one christmas day famous asia went church",
                "soul atmosphere beautiful refreshing church clean prayer peaceful campus neat meditation",
                "churches visited really interesting worth many kotdwar even religious visit unique see quite structure must",
                "lawn certainly significance supposedly opens johans staff gate landsdown church great ago garden wrong nothing mistake marrys decided largest pm us rather built entered way maintained st years explore haridwar however one rude nd well asia kind places overall visit like since massive structure surrounding",
                "people one visited best many communities beautiful kotdwar asia uttrakhand must visit considered top church biggest"
            ]
        },
        {
            "name": "Sidhpeeth Sukhro Devi Mandir, Kotdwar",
            "rating": 4.4,
            "address": "PGV4+8PM, Balasaur, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "It is the oldest temple present in Devi road, Kotdwara. The road also took its name from the temple itself. Inside the temple there is the Devi Mata statue and Shivling along with Radhe Krishna bhagwaan.\nOn the backside there is a banyan tree which is interconnected with a peepal tree also for Shani bhagwan Puja and Hanuman ji Murti also located in the front of The Tree.\nThis place is easy to commute and you can park your vehicles outside the temple on the other side of the road.\nJai Mata Di",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It's not ment for review bcoz these places are divine it's depends on the seeker that what he or she can seek from the place ...",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Jai Mata Di..... Give your little time from busy schedule to this peaceful environment of Devi Mandir and tell Devi Mata about what you did today and what will you do tomorrow.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Sacred place with good library and good vibes for students...\nThanks to Mandir Samiti for providing the hall for students",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Kotdwar itself is a peaceful place and Sukhro Devi Mandir is one of the most famous place in kotdwar.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "ji along puja name inside hanuman took murti mata krishna backside statue jai tree shivling present side radhe oldest also di located vehicles interconnected temple outside road banyan peepal bhagwan commute park front bhagwaan shani kotdwara easy devi",
                "bcoz places seeker review divine ment depends seek",
                "today di jai little environment tell schedule give mandir mata time peaceful busy devi tomorrow",
                "hall sacred thanks providing mandir good students samiti vibes library",
                "one famous kotdwar mandir peaceful devi sukhro"
            ]
        },
        {
            "name": "Buddha Park, Kotdwar",
            "rating": 3.9,
            "address": "QG4G+F6W, NH 119, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "One of the good parks located on the way to Sidhabli temple. You can go for a brisk walk there and enjoy open gyms also. Municipal corporations should reestablish this park as it is situated at the perfect place for kids to play and swing there",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "It is onw of the oldest park of kotdwara and is now popular by the name of buddha park. Best place for kids picnic area and is surrounded by nature.",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "A statue of Lord Buddha has been established in the park and the park lot of amenities and full of greenfield.",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Good location... nice hill view.. but not for couples 😁😁😂",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Nice park for morning vibes",
                    "languageCode": "en",
                    "rating": 3.9
                }
            ],
            "preprocessed_reviews": [
                "brisk open kids perfect also way located situated temple municipal walk enjoy parks one sidhabli park good reestablish play corporations swing go gyms",
                "picnic onw best name park popular kids area kotdwara nature oldest surrounded buddha",
                "full statue lot park greenfield established lord amenities buddha",
                "hill location good couples view nice",
                "park morning nice vibes"
            ]
        },
        {
            "name": "Siddhbali hanuman temple",
            "rating": 5,
            "address": "QG4Q+XH7, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "It is always a pleasant experience to go to the feet of God🙏🚩 Jai Shri Ram🙏 Jai Hanuman 🙏💐🚩",
                    "languageCode": "en-US",
                    "rating": 5
                }
            ],
            "preprocessed_reviews": [
                "always feet pleasant jai experience god hanuman shri ram go"
            ]
        },
        {
            "name": "Charak danda",
            "rating": 4,
            "address": "QG2G+XQ6, Mohabewala Industrial Area, Kotdwar, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "It is a very beautiful place to spend our time to cows .",
                    "languageCode": "en",
                    "rating": 4
                }
            ],
            "preprocessed_reviews": [
                "beautiful cows spend time"
            ]
        },
        {
            "name": "Garhwal Tanki",
            "rating": 4.3,
            "address": "QF4X+7CC, Padampur Sukhro, Uttarakhand 246149, India",
            "reviews": [
                {
                    "text": "It's have some good atmosphere.\nThe people of the area are very soft hearted 🙂",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good place see nature and environment great\nAnd it is free without any boundation or charge...... great 😃",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Nice place and it's in the name of Veer Chandra Singh",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "This tanki is from the time when Chandra Singh ji was in the British Army, and this tanki is also known by his name. Chandra Singh Garhwali Tanki.And some people also call this place by his name as Chandra Singh Garhwali Tanki.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Fantastics not so far from market area",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "people soft atmosphere good area hearted",
                "boundation environment free good nature see charge without great",
                "name veer chandra singh nice",
                "people army known ji tankiand name chandra singh garhwali british time tanki call also",
                "area far fantastics market"
            ]
        }
    ]
}