{
  "places_with_reviews": [
    {
      "name": "HOTEL SANJAY",
      "rating": [
        3.9
      ],
      "address": [
        "Grand Trunk Rd, Guru Nanak Pura, Beas, Punjab 143201, India"
      ],
      "reviews": [
        {
          "text": "Very nice hotel beas near dera beas good staff and great service neat and clean room good for family 😌",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Great experience overall. A little far away from Beas dera market. Sanjay and Surjit ji are very welcoming and provide good rooms and service",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel sanJay Good interior and  a kind staff",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "No hot water during winters",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very Poor service. Bad quality in everthing.  No good food,  bad room ambience nd very irritating smell in the rooms.  Allover worst hotel in that area.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel gold crown",
      "rating": [
        4
      ],
      "address": [
        "NH1, Grand Trunk Rd, Beas, Punjab 143201, India"
      ],
      "reviews": [
        {
          "text": "I m from Delhi. Rooms are nice but small rooms. Hygiene wise its really good hotel but the problem is staff I don’t know why they do this i am writing this review while staying in this hotel only, i booked my room on call day before today and its happening 3rd time that when we reach hotel they say there is no room booked by your name or they give room in which their manager stays, today also they gave us small room and they are arguing that you have to still pay the same amount which is the one big room and this is world’s first hotel which asks for room rent before check in. Please I request manager to look after this issue",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel is good but staff is not cooperative",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Value for money ..although a bit far from station but worth to stay .\nFood was very good although serving takes good time .better to order an hour before you start dinner. Being on the highway traffic noise may bother you during night. Rooms are small but it's ok if plan to stay for couple of days",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Door handles not working properly.\nIf you ask for any room service, then you will get that after so many hours.\nFor complimentary breakfast, you have to wake up before 8 am in the morning :D post that you've to pay for it.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice place to stay at ! Pleasant rooms with clean bathrooms. Rooms could be a little bigger but it was alright. The service was nice, but can be improved. It was located on the highway so full marks for the location. The beas railway station was 5 mins away and was easily accessible through auto rickshaws and cabs.\n\nRecommended for an overnight stay!",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "OYO 44155 Hotel Villa Sixteen",
      "rating": [
        4.4
      ],
      "address": [
        "16, Sant Enclave, Beas, Wazir Bhullar, Punjab 143201, India"
      ],
      "reviews": [
        {
          "text": "Never ever expected such a poor service considering the rates they are charging. They will not even serve water forget any meals..it says breakfast included but we were told that my staff is not picking phone, that's why there is no one to cook..pathetic services you will ever find even after paying 4 star rates. 3 days we were served no breakfast when they included the charges.\nWill never recommend anyone to stay here",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hotel is good for those persons who doesn't wants to stay in dera beas, it's negative is that the property is slightly outside the main city center and you didn't get the direct public transport facility so you have to depend upon the caretaker of the hotel who will arrange 3 or 4 wheelers for you..so if you have your own vehicle then this property  is more suitable for you and you will rech dera beas with in 20 min.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Just concluded our trip at Beas with a great experience at Villa Sixteen Guest House. It is a home away from home with very caring owners. Did not expect such a wonderful accommodation at an urgent hour of our booking. Villa Sixteen scores well because of its location, which is quite near to the Dera Beas and hardly half an hour from Golden Temple as well. The food offered was yummy, especially the North Indian cuisine and mix pakoras. This is THE place to stay, when in Beas or Amritsar.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It was a good stay, felt the most comfortable staying at villa sixteen. Super amazing service Would staying there whenever we’ll visit beas.\nNo words can describe how wonderful , amazing it was\nFeel like our own house. #Speechlesss\n#fiveplus #Maggiespecially",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Comfortable stay with hospitable owners and awesome food. Rooms were clean and comfortable. Their in-house library with a great collection of books for grown ups and kids was a good surprise. Plenty of indoor games for the kids too.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Dhaliwal Grand",
      "rating": [
        3.9
      ],
      "address": [
        "NH - 1, Near Baba Balaka Mor VPO - Umra Nangal, Rayya, Umra Nangal, Punjab 143112, India"
      ],
      "reviews": [
        {
          "text": "The place is horrible. I ordered a Philly cheesesteak and the thing was not edible. I am giving the place a 1 star because I couldn’t give it a 0 (zero) star. Don’t spend your money there. Street vendors foods are much tastier.\n\nSAVE YOUR MONEY AND DO NOT EAT HERE.\nOwner & Staff are TERRIBLE. Food is always off, food that is delivered GETS YOU SICK.\nDO NOT EAT HERE!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Dear all\n\nI had the worst experience with this hotel. Actually, I am working with an apparel company, and I used to visit Amritsar and Jalandhar. On March 10th, I stayed here with my office subordinates. We required a hotel bill for expenses, so I asked the staff if they would provide a bill; they agreed while we checked in, but in the morning they denied it and told me they would share the bill through WhatsApp and email, but till now they haven't shared any bill and are just sharing fake bills. I have submitted one bill provided by the hotel staff, but my finance section rejected it due to wrong and fake GST. Now the company has hold  salary and expenses. I shared the same with the hotel staff, but they are not responding. So plzz do not Evan think to stay hear worst hotel",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I had vry good experience of this hotel the staff's behavior is vry polite and have good sence of humar. The food quality is best as well as they provide delicious food to their customers. You can easly park their cars on there you will not face any problem about parking and that hotel is safe for everyone.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I have great experience of this hotel.Rooms are vry beautiful you can safely stay there as well as parking area is also safe and they provide large space for park their vehicles.They provide best food to their costumers.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I have stayed here 3 times....my allover experience was nice...nice staff ...and owner itself take care n very cooperative...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Randhawa Restaurant And Hotel",
      "rating": [
        3.6
      ],
      "address": [
        "Baba Bakala, Chhapianwali, Punjab 143202, India"
      ],
      "reviews": [
        {
          "text": "\"The staff at this hotel were so friendly and helpful. They made our stay so enjoyable and comfortable\".\n\nRooms\n\n\"The rooms were spacious, clean and well-maintained\". \"The rooms are well equipped and comfortable\"\n\nHotel Owner Kulwant Singh ji is a very nice person and great 👍\nI liked the hotel stay..\nStay between 16 Feb 2024 to 19 Feb 2024.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "The hotel has a hall in its basement where small functions can be held. We conducted a corporate event here which was conducted very well due to the professional team of the hotel especially its owner Sh Kamaljit. The food and other arrangements were superb.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Wastage of money !\nWe did event on 28 May 2022 recent …\nDisrespectful staff + the manager or owner of this ownership …. No attiquetes to talk with females ,\n\nOur professional event has been died or basted due to the behaviour !\n\n2nd time we did !\n\nCongratulations you have lost your permanent customer due to the all things you did today\n\nDon’t book for yourself in future !🙏🏻\nChoose another recommended better option",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "No service.....\nNo food after 10 pm...\nEven to don't serve you tee also in morning..\n\nNo staff for hospitality....\n\nIt just like guest house...\nYou have to do everything on your own.\n\nLike to take water...\nNo towel...\nNo charging port near bed...",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Waste of money zero quality as compared to rate.. Better eat at some road side thela atleast you will get value for money you spent...(review is for restaurant only ate burger and pizza both were yukk)",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Jamba Hotel and Restaurant - Best Hotel in Beas, Best Family Restaurants in Beas",
      "rating": [
        4.2
      ],
      "address": [
        "Grand Trunk Road, Baba Bakala More, Amritsar Rayya, Cheema Bath, near to N.K.Dhaba, Beas, Cheema Bath, Punjab 143201, India"
      ],
      "reviews": [
        {
          "text": "Incorrect address updated on google map. Store is located at MBD MALL GROUND FLOOR.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good vibes and rooms are neat and clean",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Not so fantastic",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good to repeat after long time",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "👌",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "J K Resort",
      "rating": [
        4
      ],
      "address": [
        "H67Q+5MC, Dhianpur, Punjab 143202, India"
      ],
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel paradise",
      "rating": [
        4.8
      ],
      "address": [
        "Rayya, Cheema Bath, Punjab 143112, India"
      ],
      "reviews": [
        {
          "text": "The rooms were clean, and the atmosphere was great. Highly recommended.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent experience\nClean rooms",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Contact no pl. for booking.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Good food clean room",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "OYO Home Green View Appartments",
      "rating": [
        "Unknown"
      ],
      "address": [
        "Grand Trunk Rd, santenclave, Beas, Wazir Bhullar, Punjab 143201, India"
      ],
      "reviews": []
    },
    {
      "name": "Nippy Guest House",
      "rating": [
        3.5
      ],
      "address": [
        "Baba sawan singh nagar beas, Beas, Punjab 143204, India"
      ],
      "reviews": [
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Average place to stay. Rooms divided by board walls. ACs not working most times. Cramped bathrooms with improper placement of WC & wash basin. Decent pricing though.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Comfortable place to live.\nExcellent staff and  service.\nSafe place to live for women.\nWell cleaned rooms  home like enviornment.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Staff behavior, tasty food and overall the room is Excellent ,clean so I give this hostel 5 star rating",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    }
  ]
}