{
  "places_with_reviews": [
    {
      "name": "Hotel Golden Fortune",
      "rating": [
        4.1
      ],
      "address": [
        "Hotel Golden Fortune Near Roadways Bus Stand, Road, Civil Lines, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "This is a beautiful and clean hotel with great rooms. The bathrooms and toilet commodes are neat and clean. Ample of hot water supply during winters makes it really worth it.\nThe restaurant serves great cuisine and has good staff.\nWe booked a couple of rooms and were given complimentary breakfast in the morning.\n\nThe parking space outside the hotel makes it easier to access if you are traveling from other city.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's located near the Bus stand hub and\nEasy access to the expressway.\nPlenty of free valet parking available in front of the hotel.\nVery good welcome by the staff and hotel crew.\nThe rooms are neat and clean. Hygiene well maintained. Hot water available in all rooms and passage well equipped with fire and safety accessories,\nVery quick room service available.\nThe restaurant is located at the ground near the reception. The restaurant offers good service and the food is awesome. The staff and hotel support staff is awesome and great.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I am sharing my experience in behalf of my 3 times stay in this hotel durin my official tour which was pretty good.The rooms were clean and well setup 💕.The food was awesome specially the Punjabi combo ❤️ which I love most.\nThe breakfast categories was enough good 👍.\nI would like to recommend this hotel to my connection for official tour. 🤝\nOnly one thing I like to add which need to take care from Hotel side that is , atleast a welcome drink🍷 can be offered to the guest after check in.🙂It can be expected from this category of hotel.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's the top on the list of best hotels in Azamgarh. The location is very prime as it's just located on the side of the main road near the bus stand. The railway station is also very nearby. The parking facility is so apt but monkeys are a major problem for vehicles. Check in was smooth but this hotel is only for married couples and family. The rooms are good and spacious. Food is average as usual. Overall if you are in search of accommodation in the range of 2.5-3k, it's the best.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Clean place, sufficiently spaced to accommodate small gatherings.\n\nFood quality is satisfactory, however slightly over priced menu considering the location and place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "HOTEL GRAND SR",
      "rating": [
        4.6
      ],
      "address": [
        "Teacher's Colony, Rahul Nagar, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "The Hotel is in the close proximity if everything jn Azamgarh, the rooms were clean and the overall service is great.\n\nHighly recommended for anyone who wants to enjoy their short stay in Azamgarh and want to cover all the places in short span of time.\n\nWe booked 3 rooms with 9 people including 2 kids, it was an unforgettable experience and out of our expectations, specially for a small town like Azamgarh.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Visited the place for Family dinner.\nThe food quality is excellent, except for the quantity of Rice, usually the rice is being served on a big plate here the plate size  was quite little.\nService is outstanding.\nAmbience is pleasant.\nLike to greet the service staff Ms. Savee Singh for her outstanding courtesy towards customers.\nThe way she served the food proved us of the traditional values of UP East, how we sit in the pangat during functions and food was being served by the host.\nOverall quite pleasant evening experience.\nHope the team SR will maintain the standards to schedule the next visit soon.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Pleasant Stay at Hotel Grand SR, Azamgarh\n\nRating: ⭐⭐⭐⭐\n\nI recently had the pleasure of staying at Hotel Grand SR during my visit to Azamgarh, and I must say, it was a delightful experience.\n\nFirst and foremost, the room provided was exceptionally nice. It was clean, well-maintained, and offered a comfortable ambiance that made me feel right at home. The amenities provided were sufficient, and the bed ensured a restful night's sleep.\n\nOne of the highlights of my stay was undoubtedly the food. The meals served at the hotel were not only delicious but also showcased a variety of flavors that catered to different tastes. Whether it was breakfast, lunch, or dinner, every dish was prepared with care and attention to detail. The culinary experience truly exceeded my expectations.\n\nFurthermore, I was impressed by the level of service offered by the staff. From check-in to check-out, they were attentive, courteous, and always ready to assist with any inquiries or requests. Their professionalism contributed significantly to making my stay enjoyable and hassle-free.\n\nOverall, my experience at Hotel Grand SR was excellent. The combination of a pleasant room, delicious food, and commendable service made for a memorable stay. I would highly recommend this establishment to anyone visiting Azamgarh, and I look forward to returning in the future.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The bed was extremely comfortable. The room was spacious and clean. The vintage aesthetics were awesome.  Love the charm of this hotel. Does not give you the routine chain hotel vibe at all.  i want to tell you one thing is that the hotel have a best gym its food was so delicious and staff beahvior is too good\nAnd I got a uood gym\n\nthank you GRAND SR",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This place is good for the place to stay or for booking of banquet Hall for Marriage/Birthday/Anniversary ceremony. They can get 5 star but I think there is some place where they need some improvement.\n\nI am bound edit my previous review because I their management stuff are not very co-operative, we recently book their venue for a birthday party. But at the last I was very surprised to see the final bill, they have added some nonsense amount (for adding one lamp) in final bill, once I trying to reach the management they never responded my call. I never expected such behaviour from them.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "OYO 6908 Hotel Royal City",
      "rating": [
        3.7
      ],
      "address": [
        "Kratalpur Baipas Road, Kartalpur, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel walkable from railway station. Amazing for small seminars,  workshops staffs are supportive. Ambience is very good. Overall nice experience with them.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice Hotel with good food and parking space. Veg and non veg items were good. Dosa was very tasty and crispy. Had a comfortable night stay on way to home. Very reasonable and near the highway. Location is good as you don't have to enter the town and you can continue with your journey on the expressway. Has good power back up. Both AC and non AC rooms available. However, there is no elevator. Good and cooperative staff.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I enjoyed resturant it's good 👍",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "TA needs a consistent approach to dealing with such useless, pointless reviews. I hate reading the beginning of a review and clicking on \"More,\" and not finding, well, more. I understand that not every reviewer is going to hit every detail and that no single review should account for one's complete research of a property. I also feel a little weird about repeating word for word what someone else wrote just a couple of reviews ahead of me. If someone describes a property's decor in complete detail, I'm not going to do the same when my review will be posted on the same page as theirs. I can still focus on my experience and easily meet the minimums without talking aimlessly.\n\nAll kidding aside, I think TA needs to update the automatic filters to curb the \"mmm mmmmmmmmmmm mmmmmm!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\" type of posting. TA needs to warn reviewers, perhaps right on the review submission page, that such reviews will not be tolerated. This should be included in the \"relevant content\" guideline as well. It might be a good idea to include links to sample reviews that show members what a useful review looks like (I know, not everyone who needs it will read it, but it can't hurt). If it takes more than 48 hours to get my review posted, so be it. Maybe I'm too long-winded, but I take great care in writing reviews that will help someone evaluate a property, and I think others should do the same.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "So beautiful Oyo room",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Shri Sai Hotel",
      "rating": [
        4.2
      ],
      "address": [
        "Near Roadways bus stand, Civil Lines, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Its a nice property to stay if you're in azamgarh. The price of the rooms are genuine. The service is decent. The ambience of their restaurant is good. I must say the food is really delicious and quite cheap..the staff is very polite and courteous",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Food prices are good...\nStaff found cooperative\nCleanliness and hygiene maintained while serving...\nI like this hotel...",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It's a hidden gem hotel, service and everything is good. They maintain hygiene as well",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It's good, they provide good service. Rooms are quite tiny but comfortable, room service was also good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I recently booked my room in shri sai hotel .i think they provide the best service.so i recommend to visit there if you are finding hotels",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Tarun Inn",
      "rating": [
        3.8
      ],
      "address": [
        "Thandi Sadak, near Gandhi Ashram, Rahul Nagar, Marhaya, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Last night I stayed at Tarun Inn, and my experience was far from satisfactory and was very disgusting.The food provided was of poor quality, perhaps the worst I've ever encountered during my travels. Additionally, there was a glaring lack of basic amenities such as blankets and pillows, making my night uncomfortable and sleepless.  I urge potential guests to reconsider choosing Tarun Inn to avoid a similar disappointing experience and loss of money. It's crucial for the management to address these issues promptly to maintain the reputation and trust of their customers.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Is this a pet-friendly hotel? Please let me know as I am looking for a pet-friendly stay in Azamgarh on February 2024. Pls do revert.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are standard with basic facility. They don't have restaurant so all items mentioned in menu card not available to them. Very limited food options they have. Room tariff was quite high as per such a small and backward city like Azamgarh. Staff was cordial. They have very limited parking space. Very homely kind of hotel😄, all outside noise coming in  the room. People talking in reception area, and we are listening in room🙄. Wifi working well there.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I was staying here for the 4th Azamgarh International Film Festival. The staff here are very helpful and always ready to serve. Felt just like home. All the guests were happy with the service and food here. Dessert is very special and delicious.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's okay type... Staffs are good... Don't expect professional behaviour. But they are simple people... Parking available.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Raj Palace Azamgarh",
      "rating": [
        4.2
      ],
      "address": [
        "Sahar Bypass Road, Harbanspur, Kol Baj Bahadur, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "This hotel is amazing! The staff are super friendly and helpful. The room was really clean and comfy, and the view was beautiful. The food at the restaurant was delicious too. I had a fantastic stay and would definitely come back again!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very good hotel. I stayed for two nights and I had to come and go at odd times such as middle of the night or early morning.\nThe staff was always there to help and attend. The location is very good on the highway itself and one positive addition is ample space for parking.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice property with location and G.M of. Best behaviour and all staff is good",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent hotel near the Purvanchal Expressway.. we never expected such an ambience and service at Azamgarh..\n\nRoom was super cozy and comfortable. We opted for the room with window.... no noise from highway vehicle.. we had an excellent sleep at night after 14 hr drive...\nHot water is available all the time. They share the hotel Wifi if needed.\n\nAmple space for parking cars and bikes.\n\nThe best part was the food. Prices were nominal but the taste was beyond our expectation. The ambience of their dining area is quite intriguing.\n\nOne of the best place for delicious meal and comfortable and affordable stay.\n\nLastly, the hotel team members are polite and supportive. They try their level best to give their guest a comfortable stay.\n\nKeep up the good work team Raj Palace",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Service  and staff behaviour are really good.\nI visited there at 11:30PM but still they served better.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Green Palace & Ujala Resturant",
      "rating": [
        3.7
      ],
      "address": [
        "Civil Lines, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Good Service and People's have good behaviour.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Hotel green palace is like my home, The manager Mr. Mukesh Shukla Ji is so good & the restaurant is good too.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This is my true experience.....\n\n1.room was no so good\n\n2.food was Good enough with decent price...no hifi price...\n3.cooler was not working properly\n4.staff was cooperative\n5.prace and no disturbance\n6.tv was not recharged with any pack\n7.room service was good\n8.room was clean enough",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Absolutely a bad place for staying. AC can't make the room cool. Darty.\nFoods won't be served after 10 pm.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good place to stay.\n\nGood hospitality.\n\nWonderful food and cheapest food.\n\nGood service must try.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Deep Continental & Restaurant",
      "rating": [
        3.9
      ],
      "address": [
        "353G+2MV, Civil Lines, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Hotel employees are too rude behaviour with coustmer and other person. I suggest everybody is not good to stay or eat food because food they serve with misbehave.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I celebrated my birthday there and it's so satisfying to have a place like this party that celebration. Staffs are Very Cooperative out there. Service is also good. Hygiene is 10 on 10 and neat and tidy place place. Overall Great Experience ❣️",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is a good hotel for the city. Tariff is reasonable, & though room service was a bit slow, overall decent..Good overall. I'd suggest staff to maintain clear communication among themselves, so you don't keep guests waiting..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Facilities very good but stops not behaviour discipline.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "An unprecedented service in an unpredictable place. The service was very hospitable and the people were genuinely nice. They were accommodating of all our requests, and quite helpful. The location is also very convenient, hardly a 10 min drive from the Purvanchal Expressway, making it an ideal location for overnight stops between long drives. We travelled as a family, but it's quite safe even for single women. The room was also quite cozy and we really enjoyed the stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Srimann Mangalam",
      "rating": [
        4
      ],
      "address": [
        "Ghazipur - Azamgarh Rd, Krishna Colony, Jamalpur Baz Bahadur, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Everything was good but there is 1 thing that is parking issue makes the taste bitter",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Excellent banquet here in azamgarh\nAs well good facility and well behavier staff\nM very satisfied with their services",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "1. This place is good if you're alone.\n2. Dinner must be ordered well in time, like around 7:30 pm\n3. Room is nice, only default is whenever the hotel gets electricity cut, the ACs turn off. In the room you'll get one neat and clean double bed, one table chair, one TV, Cupboard, Mirror, etc\n4. The staff is very co-operative, decent. You may feel that staff is not as per hotel norms but as human beings, they're excellent.\n5. Large car parking space is available.\n6. Location is little bit difficult to find.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A small sized marriage hall is good for 300-400 people.\nDecoration is good we can think of more creative decoration as per requirement and budget.\n\nLocation: It's way in from under the overbridge but the road is enough to pass vehicles.\n\nAs a hotel rooms are good and in budget due to under overbridge",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "nice room and staff on time services\n\nHotel is good and nice location\n\nsubscribe for service and review",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Devam Hotel",
      "rating": [
        4.7
      ],
      "address": [
        "Kartalpur, Azamgarh, Uttar Pradesh 276001, India"
      ],
      "reviews": [
        {
          "text": "Devam is One of the best banquet hall in Azamgarh. With best catering I have ever experienced, they have tasty foods even for kids. My kids enjoyed a lot.his favorite was cake Keep it up Devam..",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Good service, food was tasty, ambience best campare to any other hall in azamgarh, we started with starters all were very delicious and tasty mine favourite was paneer chilli & malai chaap,in drinks kiwi mojito cocktail was just wow.. 👌🥝 for dinner everything was just outstanding everything was best including catering and staff was cooperative  enjoyed it. would recommend to all searching best hall for  marriage, birthday party and many more in Azamgarh  to enjoy your party... Keep it up devam.. 👍💕",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Sucha stunning location for weddings and parties! I went for my friend's wedding recently. The food was so good and the interior has my heart🫶🏻 One should definitely consider this place.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "State of art facilities available in. Azamgarh. This is one the Best in uttar pradesh . The staff is polite and responsive. The place is hygienic.\n\nCatering is world class covering both Indian and continental cuisines... Desert are also out of the world... Service is right up there\n\nBest in purvanchal",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Attended a friend wedding....and it was one of the best experience i had. Arrangements and decoration was on point 🤩. As well as delicious food with excellent service of hotel staff...... Highly recommended.👍🏻",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}