{
  "places_with_reviews": [
    {
      "name": "Amritara The Avadh, Badrinath",
      "rating": [
        4.7
      ],
      "address": [
        "Plot No 834, near Helipad, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Excellent and services is exceptional. Sundar Singh stands out. The only issue is the distance to the temple. Charged heavily by cab operators for pickup and drop. It would be a big plus if the hotel can arrange a shuttle for pick up and drop as it would a big relief for guests. Safety from cab operators is an issue.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The entire Hotel staff were extremely courteous and always taking care of our requirements with a big smile. The food was generally good especially given the challenges of logistics. The rooms were clean, fresh and very comfortable. I wish to make a special mention of Ashish(trainee manager) about his keenness to serve us. We wish the very best and hope to visit again.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Hotel and our room was very good.  Food was excellent.\nOne suggestion I would like to give them that they should provide electric blankets and powerful heater. When temperature is -4, these things are really needful.  Otherwise everything was fine.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I had the most incredible experience during my stay at Amritara The Avadh Badrinath. From the moment I arrived, I was truly captivated by the beauty and serenity of Badrinath. The hotel's exceptional service, luxurious accommodations, and breathtaking views made my visit unforgettable. Every detail was meticulously taken care of, ensuring a comfortable and relaxing stay. The staff went above and beyond to make me feel welcome and cater to my needs. The delicious food served at the restaurant was a gastronomic delight, offering a taste of the local cuisine. The location of the hotel is perfect, providing easy access to the sacred Badrinath Temple and other attractions. I can confidently say that this was the best experience I've ever had in Badrinath, and I would give Amritara The Avadh Badrinath a well-deserved five-star rating. I can't wait to return for another extraordinary visit!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice stay.\nBathroom entry steps edges and position are dangerous. Especially at night.\nPlease setup room heaters like The Tattva Joshimath. Current Room heaters are not efficient for low temperature at this place.\n\nAll other things are good. Especially the view.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "New Hotel Snow Crest",
      "rating": [
        4.3
      ],
      "address": [
        "Main Road Badrinath Dham, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "We had a delightful experience during our stay at New Hotel Snow Crest Badrinath. This hotel offers top-notch amenities such as 24/7 hot water, in-room heaters, complimentary toiletries, and a fantastic on-site restaurant. The staff here are exceptionally courteous and extremely knowledgeable about local attractions. They even provide a comfortable dormitory for drivers with meals included. The hotel's proximity to the temple, just 800 meters away, makes it a convenient choice. If you're planning a visit to Badrinath, I highly recommend choosing New Hotel Snow Crest for your stay!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Lovely hotel. Very well maintained. Great food. All essential amenities provided at the height of 10000 odd feet. Makes one feel warm & comfortable. Rooms very clean & well maintained",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The hotel has a good location as it is next to the main highway. It was expensive and crowded, but the room was quiet and equipped with a heater and 24-hour hot water. The room size was good, the staff was polite, and the restaurant cooked well. The quality of towels and room cleanliness is average. The hotel allows Pithu (back-rider) service providers to come near the entrance, so it is a good option for senior citizens to visit the temple.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "HOTEL SNOW CREST IS THE BEST HOTEL IN BADRINATH\nNow here is the reason\n1 it’s the nearest hotel from the temple\n2 it’s a beautiful property with parking\n3 big beautiful rooms with stunning views\n4 clean washrooms with 24H hot water\n3 room heater\n4 very worm welcoming staffs\n6 also they have good kitchen so you can order good food",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Rooms were ideal, found it little costly. After check-in we found that there is no water coming in taps. It took more than 3 hours to fix that. Food was great, loved the taste.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Sarovar Portico Badrinath",
      "rating": [
        4.1
      ],
      "address": [
        "Plot No. 834, Chamoli District, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Top class hotel in Badrinath, the restaurant was pretty neat and the food was very tasty.The portions were huge and top notch customer service. Highly recommend.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Stayed at Sarovar Portico Hotel with family for Badrinath Dham visit. Very clean and hygienic, though a bit on the expensive side. Enjoyed the good ambiance!",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Service is great here having polite staff , rooms are clean and hygienic,",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "My Feedback for the 2 days stay on 21 and 22 Sept 2022.\n\nAs there is a saying that don't go with the looks, below is my experience.\n\nThe services provided by hotel is very poor, washrooms had commode blocking issue, there was no soap or shampoo in the bottles and no other toiletry items provided. When asked for coffee cups on the day 1 it was not provided even till end of the stay, room service people don't come until you call for number of times and water bottles are also not provided until you ask for them and the food taste was very OK OK or medium rating for it.\n\nI don't suggest this place to anyone.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The hotel has a very tired look. During the initial days, must have been a great hotel. But now, it needs a major refurbishment. No life, old carpets, no fan or heating in the room. Etc. despite that, I feel it is perhaps the best place in Badrinath. What was very impressive is the service and food at the restaurant.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Yoga Badrinath",
      "rating": [
        4
      ],
      "address": [
        "Near Bus Stand, Badrinath, National Highway 58, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Horrible service. The person Chandraprakash doesn’t picks up your call after you reach Badrinath. They are not bothered about their guests and doesn’t evens calls their to know where they are. They promise you dinner but if you reach they won’t even bother to serve  dinner which is included in your room plan or won’t even inform you earlier that dinner is closed. Please be away from this hotel and their Manager ChandraPrakash. The standard room quality is severely poor.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Poor quality of service. Room rent too high , serving not upto the rent ,staff not at all good there was mouse in the room .never recommended to stay in hotel yoga badrinath ,",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good hotel , decent clean rooms with warmed up beds, food is decent, no heater available. Hot water is available. 15mins walking distance from the main temple.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Room was nice ..hotel staffs were really helpful.Extra care was taken for the customers electric kettle,geyser and especially bed warmers.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Decent hotel under a poor management. For ₹5,000 a night with no meal, I expect some basic things which were not there.\n\nThe bad:\n\n1. Untrained staff - One of the staff barged in my room using his master key while I was getting ready. There was no knock before entry. Basically there was no security for my stuff.\n\n2. I was not given a key to access my room but had to ask someone at the reception to get in via a master key every time.\n\n3. There was no hot water, the reception's response to this was half a bucket of warm water. I was explicitly told hot water was supplied 24/7.\n\n4. Poor electricity backup - the rooms were dark for long periods at times. I had to take a shower using my phone's flashlight.\n\n5. The window ledge was covered with dust.\n\nThe good:\n\n1. Well built, comfortable rooms with properly furnished bathroom with comb, sewing kit, shower gel etc.\n\n2. (electric) Warming mats below bed sheet was very soothing to sleep with.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "GMVN Tourist Rest House Devlok",
      "rating": [
        4.1
      ],
      "address": [
        "PFVV+H95, NH 58, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Very conveniently located, ample parking but no wifi or TV. Rooms have rats, ours needed to be changed. Vegetarian breakfast and dinner buffet included. Food is ok.Staff is helpful and courteous.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We had a wonderful stay at the Gmvn property. Lots of parking, tasty food, nice staff and close proximity to temple makes it almost perfect. Rooms need slightly better maintenance though.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent place to stay in Badrinath dham , nearest hotel to the temple only around 300 meters away. Great staffs , good food with complementary breakfast and dinner . Mesmerizing view of mount Neelkanth during sunrise",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best place to stay nearby Badrinath temple. Rooms are well maintained even though it is of old style. Hot waters were available for both bathing and drinking. Good parking space. They provide room heaters too. Comfortable for aged people also. We went through GMVN Tour.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good resort with prime location....Temple hardly 50 meters away from GMVN resort..Hospitality was good....overall good experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel New Urvashi",
      "rating": [
        3.5
      ],
      "address": [
        "Mana Road, near Seshnetra Ashrama, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "It's a good option to stay in Badrinath dham, the rooms were good but the options for dinner and breakfast are not at all up to the mark you will not get a taste even 40 or breakfast or dinner the tea is the maker of powdered milk and it's damn sweet. Staff are overall good rooms are good and one of the good option you can have in Badrinath dham",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very bad hotel. Poor service. Taking full payment as advance. They don't accept online booking. We showed our booking reservation through MakeMyTrip, but they said they don't consider that as booking. Unprofessional staffs inquiring about our personal details. Basic hotels have professional staff and heaters in room. This hotel has no hot water in bathrooms and no heater facility. How could we survive in such extreme cold weather??  Please stay in other hotels who show good hospitality and kind to customers.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Poor service and poor management. Shameless staff. They don’t care about women safety and don’t even respect women.\nDon’t deserve even a single star\n\nDear hotel owner, correct your basics first. Asking for women’s safety isn’t illegal demand.\n\nYour staff misbehaved with my mother and sister when they used property toilet.\nYour staff literally ready to hit us. I was about to file a police complaint.\n\nI’ll request all those pilgrims who are looking for stay, please don’t consider this hotel if you are with your family.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Rooms were good but I don't know why , in every hotel here at Uttarakhand heaters are banned !? It's so cold that when you return to your room after Darshan , the bedsheets are freezing . Water bottles (atleast 2L) should be complimentary in any case which was absent . The service was perfect , on time and efficient. The food was also well cooked and perfect . ❣️",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "hotel urvashi badrinath There is no facility for the driver, how does the driver sleep in the car, these people give him the king, he takes the room guest to his room to sleep, but he knows how the driver sleeps in this cold. These people don't even give food, but the king is right here, he spends the night in the pursuit of online booking, people should also think about the driver.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Kuber palace Badrinath",
      "rating": [
        3.9
      ],
      "address": [
        "Badrinath Bypass Rd, near Bholagiri aashram, Badrinath, Uttarakhand 246443, India"
      ],
      "reviews": [
        {
          "text": "The staff and owner are frauds. They showed me room saying there is no power on the floor. They showed me room with mobile torch. I had no option but to take that room. When I did the payment and checked in the room, it was dirty. There was no towel, wash basin was dirty. One can see dust and dirt on the floor easily. After asking staff to clean the room and give towels. They were not at all interested. Seems like you were needy and you booked the room. It not our business. Top on that they cut of the electricity of the floor and when I ask them to check for that, the staff told me not to disturb us and call on the number mentioned on reception.\nSuch pathetic experience and such weird and arrogant people. I would recommend not to stay if you want to have pleasant stay in Badrinath. I used to to hear tales of pahadi culture and their simplicity. Gone are the days. People here turned to thugs.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms were good but food quality was worst. We ordered Masala Dosa, but it didn't even look like Plane Dosa and the taste was worst. Owner is also bit arrogant. I am not recommending this place to those tourists who were planning to visit Badrinath",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "My room was not clean. I just look inside one of the the lock room of the hotel so that i can ask for it. Owner asked me to get out from the hotel. First time had a such weird experience. Very arrogant people. Guys there are lot of good option in badrinath in similar budget. I don't know why is this much ego.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms, location were Good. The dinner they gave was very homly and fresh. The breakfasrmt taste was good, but it was not sufficient for even my 7 year kids. The hotel dont entertain the drivers, and it was a surprise, as its a place many prefer to take a driver.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Food and staff is amazing. Only 300 meter far from the temple. I would suggest if you are coming here then you can stay and have food",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Bhajan Ashram Badrinath",
      "rating": [
        4.2
      ],
      "address": [
        "Last Ashram at Old, Last vehicle parking in, Taxi Stand, near Saket Chock, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "It was a very nice experience with bhajan ashram ..\nI had visited here for last two years ..back 2 back\nFood was awesome feel like home ..\nIt was located near temple, so easy for darshans in mrng nd evng timimgs.as well ..\nJAI BADRIVISHAL 🛐",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are very neat and clean, staff is very cooperative , location is near to badrinath temple..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Update as of 12/June/2023.\nLocation of the property is not very far from Badrinath temple. But rooms are costly in Char-Dham yatra season. Their budget rooms with shared toilet were not up to mark. There are cracks & gaps in the rooms-doors, that invade privacy. There are doors in between two rooms, with similar defects. We found the walls & floors dirty. No bed-covers were provided. Overall experience was not satisfactory.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very near to the temple. Old wood structure but suitable to that environment. Well renovated rooms with geyser and western toilets. Food is very good, reception also fine. I prefer to stay whenever I visit there.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The staff was very supportive, went out of their way to help us. We were travelling first time in such low temperatures but the staff and amenities provided made it comfortable to stay in such inhospitable climate. Our pilgrimage was made smooth. And the prices were very affordable too. It was only 1 minute distance from temple",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Panchvati Inn",
      "rating": [
        4.8
      ],
      "address": [
        "PFQW+576, opposite ISBT, Badrinath, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "I stayed here for three days. The staffs are extremely nice and friendly. It's a luxury hotel. My room had everything starting from hair dryer to everything that's needed for a comfortable stay. The view from my room was breathtaking in the mornings.\n\nLet's talk about the in-house chef now. He can anything. You will lick your fingers. From breakfast to lunch to dinner, he will make delicious recipes for you. Foods are a bit costly but after a long tiring day, a comforting food is must. You should check out the view from the restaurant. It's amazing. You get the view of Badrinath, the Charan Paduka track and ISBT bus Stand.\n\nI accidentally stepped on broken glasses near ISBT bus stand and the sole of my right shoe came out right before my Vasundhara Waterfall trek. Their Atul Singh helped me fixing my shoe, he added glue and made the shoe functioning again. Thank you Atul. 🙂🙂🙂 I may had to waste my time finding a new shoe if u didn't help.\n\nI will definitely check-in here again. Great hospitality, clean n luxurious rooms and friendly staffs.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Service is beyond expectations. Hotel is beyond its class. All work done in Hotel by heart. All accessories used in hotel is classic. Cleanliness in hotel is eye catching.\nOwner Mr. Prabhat also is kind hearted and extremely helpful. Location of hotel is in a narrow Street opposite petrol pump but ambience of hotel is forced us to forget about location. Even lift installed is superb. Coffee and tea maker available in room. Hair dryer and other facilities also available in room.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "A perfect stay in Badrinath Dham. It has all facilities required.\n\nClean and hygenic rooms. Neat and clean bathrooms with geyser facility.\n\nBasic amenities like TV, tea and coffee maker in rooms. Good and Polite staff is always available at your service even at mid night.\n\nGood quality of food is a basic requirement which makes Panchvati Inn a winner.\n\nI appreciate all their services.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "We have excellent experience at this hotel, staff is polite and doing their level best, food also delicious and one madam at dinner is very energetic and knowledgeable",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Our experience was fantastic and saw first time owner looking over us as we are their relatives..Good person also rooms are luxurious.Thanks a lot",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel neelkanth",
      "rating": [
        3.7
      ],
      "address": [
        "NH 58, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Location is very bad. To reach the hotel from main road ,it is very difficulty.  100% up hil . Distance near about 1.5 km. Room is very dumpy.  No room heater( most necessry )item  provide the room , even extra pay for this.bed is very dirty. 25.10.2023 .",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "You can easily reached to this place from Gaurikund and from this place Badrinath.\n\nRoom was good and clean. Service from hotel staff is good. Rooms are available here cheaper as compared to the other nearby places.\n\nWe try South Indian food here for breakfast and we like it.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I visited this place. Atmosphere is very nice and nilkanth hotel to tungnath mahadev temple road room touch.\nTungnath mahadev and Ganesh Mandir The more times you visit this place, the more fun you get.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Worst experience we reached there at night lately after getting three rooms for 2500 they ask money for hot water if u not pay they not going to start gas gizr rooms are small and the quality of matters is not that good some room have gas gizr some have not.. if you want to stay for just 4 5 hr or something then think about this hotel otherwise not.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The location is bit off from temple. When I visited, the manager was kind enough to drop me nearer to temple and pick me up four times.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    }
  ]
}