{
  "places_with_reviews": [
    {
      "name": "Hotel Akshay",
      "rating": [
        3.3
      ],
      "address": [
        "5M59+WCR, Sector 22, Nava Nagar, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": [
        {
          "text": "Worst Service i ever experienced. Rooms r not clean, miss behavior from room boys, receptionist is useless person, he don't know how to talk with guests, phone doesn't work at rooms if we need any thing we have to go down wards at receptionist and there all the room boys will be watching tv. Tube lights are not working simply they have sticked at wall if we asks that room boy will tell all the rooms tube lights are same and POP lights are there but those also on-and-off continuously, tv is not working (remote is missing ), main thing hotel doesn't have proper parking, have to keep our car road side. Overall not a good place to stay with family in Bagalkote..",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Walk in rates are cheaper than booking online (as online sites charge 20-30% more.\n\nRooms were fine, no drinking water provided, no breakfast included.\n\nNo AC\n500 meters from Navanagar bus stand, so easy access.\nKamat veg hotel is in same building so food is not a problem.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Visited Kamat restaurant at around 4 pm. We were around 15 members. They were not bothered to offer seats in AC hall, which was closed. Since it was a full rush in the general hall we waited for 10 minutes but there was no use.  On request also they behaved unprofessional. We returned without food. Not recommended....",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Book this hotel if you don't mind sleeping on a urine drenched bed, and are happy to deal with untrained service staff.\nPay some extra, and get into a decent hotel, unless you are looking for a bad adventure trip.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "This is International Hotel, that's why you will find GERMAN COCKROACHES all over the room 🤣🤣🤣🤣There is no hygiene👎👎 Except towel & ₹2 soap they don't give you anything. The phone was also not working. Hot water only in the morning. Bed was hard(no cushioning). No hangers in the cupboard.\nIn short I'm NOT RECOMMENDING this Hotel 👎👎👎👎👎👎",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Clarks Inn, Bagalkot",
      "rating": [
        3.1
      ],
      "address": [
        "Badami Flyover Road, behind Railway Station, Ward No 10, Bagalkote, Karnataka 587101, India"
      ],
      "reviews": [
        {
          "text": "The kind of hotel that charges you for AC even when the AC doesn’t switch on.\nDisappointing and disgusting, no hot water in morning (or maybe hotel staff is instructed to say lukewarm is hot).\nThe cherry on cake: phone to room service doesn’t work, you’ve to go n greet them for even to order cup of tea.\nP.S. don’t bother complaining, they wont fix.\nMaybe that’s what you get for the price you pay.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Worst experience ever. Flush did not work and exhaust fans doesn't work in most of the rooms. Rooms were pathetic. 2 cups of tea were delivered to our room after 90 mins.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Never stay in bagalkot. All 9 hotels are charging same tariff Rs.2300 per day 12 noon strict checkout. No sight seeing places. No entertainment. Rooms are average lodge rooms. Horrible breakfast and not that good taste.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Worst hotel I have seen in my whole career I told the staff at 6 pm that my room tv is not working but they have not solved the problem yet so the entire hotel staffs are not good they have not given any service they are morning tv will get on like that there is no proper communication they have given to the customers this is the worst hotel I have seen in Bagalkot",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Good hotel by all means in Bagalkot.food taste & quality has tp be improve if they expect long stay by guests,\nI had a good stat.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "Kailash Inn",
      "rating": [
        3.7
      ],
      "address": [
        "near Rotary Circle, opposite Kerudi Cancer Hospital, Bagalkote, Karnataka 587101, India"
      ],
      "reviews": [
        {
          "text": "I had a disappointing experience at this hotel, which claimed to offer luxury but fell short. Upon booking an AC room for my family, we encountered numerous issues. The AC in the room was not functioning, despite multiple attempts to fix it. The staff was uncooperative and dismissive of our complaints. It took multiple room changes and over an hour to finally get a room with a working AC, leaving my family, especially my young child, uncomfortable in the hot weather. It's evident they prioritize profit over guest comfort, and their attitude towards complaints is unacceptable. Overall, a frustrating experience that tarnished our stay. Avoid this hotel if you value your peace of mind and comfort.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "1. Don’t book via travel apps as they reject upon arrival\n2. Exuberantly charging for services like 20₹ water bottle for 30₹ n if you question about it , the owner gives blatant reason of paying hidden taxes to local authorities and humbleness is completely missing\n3. Food s very ordinary.\n4. Overall a overrated hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Worst service. Rooms are not clean, restaurant service and quality is not OK.\nNeeds much more improvement. Dear Customers do not look into the ambience and photos. Actual stay differs a lot here. Do not get yourself cheated. Even complementary breakfast  options are also less. You will become fool if you book hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "We stayed at Kailash Inn for 4 days in Dec 23/Jan 24. We had booked a suite and a deluxe room. The rooms are ok, need some improvement.The staff of the hotel is very helpful and cooperated in every way to make our stay comfortable. Special mention to Ms.Kaushalya, who took a lot of care at the restaurant giving us the best service. Ms. Ankita of the reception went out of her way to help our senior citizen member and giving us prompt service where ever required. Both these young girls genuinely care for their guests. The food at the restaurant is good. The complimentary breakfast had limited options but was fresh and good. This hotel gives the best service and made our stay very pleasant and comfortable. Thank you guys. We will definitely visit again.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "One of the unsafe hotel in Bagalkot for corporates and business executes.\n\nOne of the worst experience from uncultured staffs and highly rude behavior by owner/MD Mr. Abhishek for the regular corporate customer at nights for rooms and sudden high price on demand.\nAlmost wasted my 2 hours of time by saying they will give rooms during night. And finally got rooms with lots of arguments and insults. helpless situations\nTerrible.. No lights in corridors at nights in any floor. staffs drops for room in mobile torch light.\nWiFi not works at all, Hot water problem in all the rooms, Cleanliness is just moderate.\nThink twice before booking the rooms",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Chalukya Hotel",
      "rating": [
        3.4
      ],
      "address": [
        "Sector 4, Sector 63A, Nava Nagar, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": [
        {
          "text": "Nice and well maintained lodge. Owner himself alongwith his take care. Nice hospitality. Lodge situated in good location.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Not clean, receptionist was unresponsive.\nNo drinking water and towels in room. Avoid if possible.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Clean and budget friendly Rooms to stay... Friendly staffs, and location is also good",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Improvements needed:\n1. Some rooms do not have windows or any kind of ventilation. Please ask for ventilated rooms (corner rooms)\n2. Bathrooms are not clean. Some are western (comode) and some are Indian style.\n3. There are no AC rooms. All the rooms are non AC.\n4. Bedsheets, blankets and pillow are not washed regularly.\n\nGood points:\n1. Hot and cold water is available.\n2. Price is affordable\n3. Have some space for parking.\n4. Few rooms are good.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Location is good, but cleanliness and service is worst.\nNot preferable to stay with family, and even not preferable for girls and couples.\nIn picture the room looks good but actually its not.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Shiva Sangam Residency",
      "rating": [
        3.4
      ],
      "address": [
        "Badami Rd, APMC Yard, Nava Nagar, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": [
        {
          "text": "It's near a few wedding halls. That's the only reason to stay here.\nFew photo props are there and the hotel looks like it is a ruined dhaba.\nRooms were pathetic and way too costly. Old, spacious but untidy rooms maintained poorly with water leaking in the balcony. Washrooms were having spots and beds and bedsheets looked like they were never cleaned. No lift.\nRude manager, not providing any service.\nIt is a bit inside away from the main road and the approach road is full of gravel and coarse. It's like a mini trekking reaching the hotel. No other shops or nothing is nearby.\nThe approach road is pitch dark and unsafe in the nights. (Attached pictures).\nOverall, spacious but not well maintained hotel.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Ideally this hotel doesn't deserve any ratings, most irresponsible front office team & service team, they charged for 4 people n 2 pillows provided, asked for 2 extra beds but given 1, when asked they simply say there is a shortage,bedsheets were torned, today morning i asked for towels receiptionsist said will send in 10 mins but for 2 hrs no one turned out, morning 7 am there was no hot water, i went down & enquired at reception then he went and started,after 10 reminders they had give 1 towel in 4 people, no soap, water bottles, phones r not available in the rooms, street dogs & cats are the permanent members of this hotel. TV remote i asked for 2-4 times, then I went to reception & collected,but could not able to on the TV. I stay in many good hotels of these range from last 3 decades but have never experienced such a worst service and on such a poor service there is no regulation, big zero for value for money. I will never stay in such unprofessional dirty hotel.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "This hotel is an old hotel, no towels were provided. No service to rooms. There is a temple beside hotel and they play songs so loud in the early morning that nobody can sleep. No water bottle provided. No phone to call reception. In total there's no service at all. Irresponsible people. Nobody will come back if they have been here once. Atleast am not coming back. That's all",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Worst stay on my entire karnataka trip, never seen such worst hotel. Owner is such a pathetic, have instructed receptionist to give only one water bottle even if they stay more than 3days. So ideally I should check in and check out daily to get water bottle or else I’m not eligible 😂 this place is joke for hospitality business.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Rooms not clean, foot mats are very dirty. Not maintained well. Has no lift, need to climb stairs, I don't mind once or twice to climb stairs, not all the time.\nRooms are spacious though, but of no use if it is dirty",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Sarvodaya Deluxe Lodge",
      "rating": [
        3.6
      ],
      "address": [
        "opposite Bus stand, Ward No 10, Bagalkote, Karnataka 587101, India"
      ],
      "reviews": [
        {
          "text": "This is just opposite to Buss stand. It has both hotel and lodging. Hot water is available on demand for taking bath. The place is very average in terms of its cleanliness.  However they change the bedsheets every day morning but if they miss you to inform them and then they will change it quickly. They also provide clean towels. I have given 3 stars because their cleaning of floors is not good and you can feel dirt while walking in the room. Other than this it is ok lodging. The taste in the hotel also average.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Conveniently located near Bagalkot old bus stand and 1 k.m. away from railway station.  Rooms not maintained properly.  As a last option once can stay here.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Opposite to the old bus stand. The place is better than i expected. Ideal for bachelors visiting Bagalkot or Badami. The room was clean and the bed was nice and comfortable. The washroom is very clean too. They have TV as well. Affordable rates. Overall happy with it. They have an attachment restaurant too which serves good food.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I guess there are two parts of this hotel. One side the old one and other side the newly expanded ones\n\nThe room we got was newly built it was neat and clean. Doesn’t look good from the outside but when we checked the room it was really nice and price is much cheaper 800rs per day.\nBed sheets were dirty which upon request they replaced immediately.\nLocated right infront of the bus stand and ten minute walk to railway station.\n\nGeyser is fitted inside the room where the hot water is available 24x7 but the other part of the hotel which I guess is the old one , hot water will be provided outside the room which has to be collected and carried to the room",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Stayed for three days. Worst experience. Unclean, ill maintained.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "hotel anugraha deluxe",
      "rating": [
        3.1
      ],
      "address": [
        "Ward No 10, Bagalkote, Karnataka 587101, India"
      ],
      "reviews": [
        {
          "text": "Worst room ever, lethargic, highly unhygienic, dirty and diseased rooms ,\n\nIn room 121 , There were too many bed bugs and cockroaches on bed !!!!😨😨😨\nSo they gave us room 117 ( ac) ,\nThe ac doesn't work, the toilets are worse\nEven graveyards and sewage are more clean than this hotel\n\nThey have gods photo hanging on walls but inside the room , the gods would die ..\n\nSleep with your family on footpath but not in this hotel",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Rooms are just ok for a a short stay of a day or two.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Food very testy and cleenness.\nGood service , good parking.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "A decent hotel. Nothing great. Decent rooms. There were some flies in the room. Not so tidy. The architecture is old. Water dripping from pipes. It is a good place to stay for a cheap rate. (Rs 650/- for a non A/C deluxe room). There is an old tv in the room. The bed sheets were not so tidy but good for the price. It is a decent hotel in bagalkot considering the price.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Owner nice but staff persons could not care about visitors",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "HOTEL HARI PRIYA",
      "rating": [
        4.3
      ],
      "address": [
        "APMC Circle, near DC Office, Rajiv Gandhi Colony, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": []
    },
    {
      "name": "Hotel Drive Inn",
      "rating": [
        3.3
      ],
      "address": [
        "5J98+H7M, Navanagar Rd, Yadahalli, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": [
        {
          "text": "Best Service of all food item's, Party Hall arrangement was best facility.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Opposite to UHS Bagalkot,  rooms not clean, reception not picks phone...Room service is poor.....",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Services not good and room is not clean\nAnd night more than disturbance\nFood qualities not good",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Bad experience,\nWe had booked for two days for marriage.\nAc not working and no response from the hotel team\nWater problem and dint even response for that\nRoom service for food and drinks was fast, but food quality was least and worst\nFood taste wasn't up to mark .. most of my family members left out food without eating\nRecommended to book a room is a must NO .",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "One of the worst hotel I ever experienced. It is not for any use, only bar or drinkers around it.\n\nI would not recommend this hotel for anyone. Instead of staying here, better to stay in car.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Savita Lodge",
      "rating": [
        3.4
      ],
      "address": [
        "19C Nava Nagar, Sector 33, Near LIC Circle, Sector 33, Nava Nagar, Bagalkote, Karnataka 587103, India"
      ],
      "reviews": [
        {
          "text": "Good place for staying for a night",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Good lodge when it comes to price. Average with facilities. Good restaurants near by. On the main road and thus easily accessible.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Value for money. Cheep and easy. Good locality, everything required is nearby as well.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Not liked at all.. Please avoid staying in this hotel.. Nothing is clean... Reception desk also not available after 8:30....Tv also not working..",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Worst place.... Unclean.....toilet and bathroom was horrible....unclean blankets... Feeling happy to leave that place.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    }
  ]
}