{
  "places_with_reviews": [
    {
      "name": "OYO 84381 Hotel U b Inn",
      "rating": [
        3.6
      ],
      "address": [
        "Baghpat, New Colony, Ghaziabad, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "Finest place for meet-up",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I'm visit from fire services purposes",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I am not used oyo",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Booked room online but when visited they refused to entertain",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Its location is not correct, this oyo hotel is a little inside",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Ganga Resort",
      "rating": [
        4.1
      ],
      "address": [
        "Meerut Road aggarwal mandi, W7X4+GX4, Tatiri, Qasamabad Urf Dudba, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "hotel is good food is also delicious",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The place is very spacious and separate space for women/ladies. Also, have basic amenities with good maintenance. Sanitizers and masks also available to reduce the risk of Corona Virus.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good space, location and parking.\n\nVery very nice for marriage party and all. Book without any doubt.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good parking space with ample space for other things as well.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Vatsayan Palace",
      "rating": [
        3.7
      ],
      "address": [
        "Meerut Rd, New Colony, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "This is very good place for rooms and services is good 😊 I rate 100/💯 car parking is very inside the palace",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "0 rating would be best for such type of banquet halls. Worst place ever, no cleaning, small space, people smoking inside the banquet hall . You people get another good banquet in this budget but don't choose this one. Honest review",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A place for mini family get-together",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Palace is situated on prime location. Good for the people who want to stay at night. But the facilities and service are not good enough. Only stay here if you have an emergency to stay at night.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice place for weddings and stuff but the main thing is that the hall is a bit smaller than it should be and some things are in basement and some are upwards so yep, there is a lot of staircase involvement aged people may have issues.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "HOTEL SHANTI PALACE",
      "rating": [
        3.9
      ],
      "address": [
        "W6WC+HFX Tyagi Market, New Colony, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "Most wonderful hotel in baghpat. Loved it. Extremely happy with their service. I wish I must visit again",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Worst experience ever had in Shanti palace Hotel. I recommend do not go in this hotel. AC are not working properly. Managers behaviour was very rude. They lying by telling you that we have proper working AC & Geyser but there is no working of AC & proper earthing was also not done in this hotel. When you guys gonna start Geyser you will get a shock by touching Tap of bathroom & Wash Basin which is really ridiculous. Hotels like this should be Banned who knows about this all things but not taking any corrective action.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Only good place to stay in this area. Rooms are clean, service is ok.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice hotel ... service is very good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Best quality in rooms , service is very nice",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship As Hotel",
      "rating": [
        4.8
      ],
      "address": [
        "115, Baghpat Bypass Rd, Old Town, New Colony, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": []
    },
    {
      "name": "OYO Flagship Dream Stay Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "block B, plot 2, Meerut Rd, near Vandna Chok, opp. Bus Stand, New Colony, Baghpat, Ghaziabad, Uttar Pradesh 201012, India"
      ],
      "reviews": [
        {
          "text": "Good service",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO 85064 Starlight Guest House",
      "rating": [
        4.6
      ],
      "address": [
        "W6X9+93J, SH 57, Bhajan Vihar, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "Rooms are more spacious, cleaner than any other hotel rooms in baghpat. Also the staff and hotel owner was very kind and provide us great service and experience! I would recommend this hotel if you looking for clean, comfort and safe stay as they follow all covid-19 guidelines.\nMarket and bus stand are at walking distance. Also you can order food from outside and it get delivered very fast.\nThanks for giving me such a good experience!!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I stayed here in Dec 2021 and to say that my experience was great would be an understatememt. The host is very hospitable and would go above and beyond to ensure your stay is not only comfortable but memorable as well. It’s a great location with walking access to nearby market and historic places. 5/5 I would stay there again if I ever visit the area again.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Stayed here overnight.. very clean and hospitable. Market is nearby. Spacious rooms and host even provided lot of information about nearby places which was helpful. Will definitely come back again whenever I drive through Baghpat.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The owner Mr. Rajiv is one of the kindest person I have ever met. Excellent rooms and home cooked food and tea is available, too.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "One of the excellent guest house in baghpat.\nRooms are so spacious. As per covid guidelines the protection is very good in this guest house. The service and parking availability is also . The staff is very good.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "OYO Home Aone",
      "rating": [
        3.8
      ],
      "address": [
        "road, near Delhi - Meerut Expressway, Chamrawal, Ghaziabad, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Flagship Hotel U B Inn",
      "rating": [
        5
      ],
      "address": [
        "Chamraval raod C.S. tower, pole No. 12/6, HDFC building, New Colony, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": []
    },
    {
      "name": "The Royal Regency Hotel",
      "rating": [
        4.5
      ],
      "address": [
        "NH 709b, near, Baghpat Bypass Rd, New Colony, Baghpat, Uttar Pradesh 250609, India"
      ],
      "reviews": [
        {
          "text": "Fine place,not such wide varieties are their",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent food and good service",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "A good hotel. Good location too",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very nice Hotel feeling good",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good food",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    }
  ]
}