{
  "places_with_reviews": [
    {
      "name": "Hotel Highway King Bagru",
      "rating": [
        4.2
      ],
      "address": [
        "near HOTEL HIGHWAY KING, Bagru, Dahmi Kalan, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "I recently had the pleasure of dining at this Hotel and Restaurant, and I must say it exceeded all my expectations. From the moment I walked in, the ambiance was inviting and elegant, creating the perfect atmosphere for a memorable dining experience. The service was impeccable, with attentive staff ensuring that every need was met promptly and with a smile.\n\nNow, let's talk about the food – it was simply outstanding. Each dish was expertly prepared, bursting with flavor and beautifully presented. Whether it was the succulent steak, the fresh seafood, or the decadent desserts, every bite was a delight to the senses.\n\nOverall, this Hotel and Restaurant offers not just a meal, but an unforgettable culinary journey. I highly recommend it to anyone looking for exceptional food, impeccable service, and a luxurious atmosphere. It's truly a gem worth visiting again and again.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The ambience & facilities provided here are impeccable, I mean there is hot water for washing hands in general public areas. The washroom is so clean & fresh and there is always good music playing. The staff is courteous & friendly. The only issue is that the food is just above average, nothing special. It gets your belly filled & that's about it.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "If you travel to Ricco Industrial Area Bagru for work, Hotel Highway King Bagru is a great place to stay. It's a value for money Hotel with Clean, Hygienic and Big size rooms having all amenities. They have a Bar, Restaurant and a Swimming pool. Room service is great. The Menu is Pure Vegetarian and food is tasty.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Food is really worth the money. It tastes so good. The thing that I most liked is its environment which is too good especially its wall paintings.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We really enjoyed our staying here. We were doing a 2 day block printing workshop in Bagru and wanted to save the journey back and forth to Jaipur.\n\nThe hotel has recently been redone and the rooms were lovely, possibly the best shower we have even had, not just in India! The hotel was quiet and was an enjoyable place to relax. The wifi was very good.\n\nWe've visited the restaurant many times and it was very tasty food, we had garlic nan, veg curry and a king thali\n\nOnly downside is no breakfast, fruit would have been good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Bhanwar Singh Palace Jaipur",
      "rating": [
        4.5
      ],
      "address": [
        "opposite Solitaire Industrial Park, Bagru, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Bhanwar Singh Palace Jaipur exceeded my expectations during my two-day stay for my brother's wedding. The accommodation options of villas and rooms provided ample choice, with both being spacious and tastefully decorated in an old royal theme. The villas, in particular, stood out for their generous size and elegant furnishings.\n\nOne of the highlights of the stay was the attention to detail in the themed decor, which truly transported guests to a bygone era of regal splendor. The washrooms were clean and well-maintained, adding to the overall comfort of the stay.\n\nThe staff at Bhanwar Singh Palace were exceptionally cooperative, ensuring that all our needs were promptly attended to. Their professionalism and friendliness contributed to the warm and welcoming atmosphere throughout our stay.\n\nThe expansive grounds of the palace provided the perfect backdrop for the wedding festivities, with different locations available for each function. This flexibility allowed for a seamless flow of events and added to the grandeur of the occasion.\n\nLocated slightly outside Jaipur, Bhanwar Singh Palace offers a serene and picturesque setting, making it an ideal choice for destination weddings. The tranquil surroundings added to the charm of the palace, providing a peaceful retreat amidst the excitement of the celebrations.\n\nOverall, my experience at Bhanwar Singh Palace Jaipur was nothing short of exceptional. From the luxurious accommodations to the impeccable service, every aspect of the stay surpassed my expectations. I would highly recommend this palace to anyone looking for a memorable and regal wedding experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Though not managed by any professional group that I know of, the service quality, promptness and politeness was exceptional during our stay in this hotel. Full marks to owners and management for achieving it as it is one of the most difficult things to instill. Keep up the good work 👍",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "My stay at Bhanwar Singh Palace Jaipur was nothing short of magical! From the moment I stepped into the grand foyer, I was transported to a world of luxury and elegance. The architecture is breathtaking, with intricate details that showcase the rich heritage of Rajasthan.\n\nThe staff were incredibly attentive and went above and beyond to ensure that every aspect of my stay was perfect. The room was spacious, beautifully decorated, and equipped with all the modern amenities one could ask for. I particularly enjoyed spending time in the lush gardens, surrounded by the serene beauty of nature.\n\nThe dining experience at Bhanwar Singh Palace was equally impressive. The restaurants offer a wide range of culinary delights, from traditional Rajasthani cuisine to international favorites, all prepared with the freshest ingredients and exquisite attention to detail.\n\nThe highlight of my stay was undoubtedly the impeccable service. Every member of the staff greeted me with a warm smile and was always ready to assist with any request. Whether it was arranging transportation, booking a tour, or simply offering recommendations for exploring Jaipur, they truly went out of their way to ensure that I had a memorable experience.\n\nOverall, Bhanwar Singh Palace Jaipur exceeded all my expectations and provided a truly unforgettable stay. I can’t wait to return and would highly recommend it to anyone looking for a luxurious and authentic Rajasthani experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good for small ceremony functions, marriage\nNo fun activities\nSwimming pool is available but you can access in evening in summer as it has very hot surroundings.\nFood was good,",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Went to attend a wedding in the central lawn. It is quite far away from central Jaipur. On the Ajmer highway which is in a poor condition due to diversions it takes an hour to reach. Additional cost of toll on both directions.\nParking was valet. A long walk into the venue. Many steps and no clearly visible ramps for the handicapped and senior citizens.\nThe lawns divided into four portions. Can easily accommodate 750 people.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "THE TRADE INTERNATIONAL",
      "rating": [
        4.6
      ],
      "address": [
        "The Trade International Hotel, Jaipur, Ajmer Expy, near MPS School, Dhami, Bagru, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Great food and above all great service.... Had a wonderful time.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This is very beautiful place ,  it's very nice  home stay and staff service is very good",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Hi Hotel Team,\n\nWe have booked this place for my wedding last year in April-2022 and undoubtedly it was the best decision for us. The staff is so cooperative and the decorations, food everything was so perfect. We book the hotel for our stay and all the wedding festivities. My entire family joined us and they all have appreciated the efforts and arrangements made by hotel staff.\n\nSpecial thanks to Ms. Seema for her efforts. You are really doing a great job. Looking forward to Do more gatherings there in future.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice Budget Hotel for a Quick stay and also for Organising Family and Friends Event. Location is not near to Airport nor near to Railway Station but it's a Good Property to do small and medium size event. Nice room considering the rate offered. Rooms are clean. Staff is Good. Can't able to taste food this time so no comments on Food",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The place is definitely beautiful. It gives a simple yet fulfilling experience. The location is also not that bad. The service was also good. The price is on the higher side but I definitely recommend this place.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Choudhary hotel",
      "rating": [
        4.1
      ],
      "address": [
        "Jaipur-Kishangarh Expy, Chhitroli, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Overall a nice place to have a break on the highway and munch on some snacks or tea coffee",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We had paneer parantha and paneer pakodas and those were totally worth it . Just before hotel highway king this is also reasonable.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I liked Choudhary hotel for its professional service and access from the highway. The main catch point is great taste in all they serve, we had a special thali with all delicious foods, salads, quality service, clean ambience, and background open space. The staff is fast, responsive, and courteous. Prices are reasonable even for a large group. The special thali costs anywhere between 280-300 depending on extra servings. Our team of 4 members paid Rupees 1450 with multiple rounds of delicious foods served.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very nice clean. South Indian food available but not tasty but North indian food like paratha is tasty and lahsun chatni is very tasty. Chai also great.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We took a break for dinner.\nDisappointed with the food quality!",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Riders Resort",
      "rating": [
        3.9
      ],
      "address": [
        "Near Bagru flyover Ajmer, Highway near Gehlot, Petrol Pump Rd, Jaipur, Bagru, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Riders Resort is a great choice for travellers looking for a 3 star star hotel in Jaipur. This Hotel stands out as one of the highly recommended hotel in Jaipur ...\n.\n\nAnother nearby attraction is Bagru, a quaint village known for its traditional hand block printing. Immerse yourself in the rich cultural heritage of Rajasthan ...\n.\n.\n@nicharta_rm",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "According to the room price, the family is ok. If you want to stay then I would also avoid a little, everything else is fine, especially in summer, it is good here, there is a swimming pool and all the facilities for entertainment.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Apart from the grandeur and comfortability, it was the staff that made the difference. Cordial and helpful even in trying circumstances. I would especially mention Foolchand ( whom I asked to correct his name spelling) who was omnipresent whenever I required him. Overall the stay was fabulous and is an ideal destination for Royal Rajputana marriages.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Not good for family stays. Liquor bottles are littered everywhere and the place seemed deserted when we arrived.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "One of the best stays Which I Ever had!! Its not only about hotel services but the most attention seeking part is their hospitality which is superb✨",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Chaudhary Mama Bhanja Hotel",
      "rating": [
        3.9
      ],
      "address": [
        "Express Highway Road, RG9H+V4Q, Jaipur-Kishangarh Expy, Bagru, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Chaudhary Mama Bhanja Hotel is a hidden gem! From the warm hospitality to the delectable cuisine, every visit is a delightful experience. The cozy ambiance creates a perfect setting for enjoying their diverse menu. The staff is friendly, ensuring a memorable dining experience. Whether it's the mouthwatering local specialties or international dishes, the quality is consistently exceptional. Chaudhary Mama Bhanja Hotel is my go-to spot for delicious meals and a welcoming atmosphere. Highly recommended! 👌🍽️",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "stopped there for lunch while coming from bagru, it is a clean and spacious place, food was served efficiently. We ate Sev tamatar ki sabji, paneer masala, dal and chapati. Everything was good, especially the Sev ki sabji was excellent.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Varities of foods and serving quantity and quality was very impressed and room atmosphere was very peaceful..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice food nd cleen restro",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good location with huge parking facility, nice gesture and cooperative staff",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Plara fort",
      "rating": [
        4.5
      ],
      "address": [
        "NH 48, Dahmi Kalan, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Nice place and superb ambience, Rooms, Lobby areas, Garden portion...All r quiet good..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nice place for big event like marriage, if you can afford😁",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Huge property on jaipur ajmer highway  big parking.best venue for weddings .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This is Bhanwar Singh Palace. A beautiful resort at the outskirts of Jaipur, in Bagru. Resort is amazing. We stayed in Royal Villa. Really a great option to spend your weekend. Food, though little at a higher price, it is worth it. Loved the stay there.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Beautiful resort and And it's a great place for a wedding",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Levishta",
      "rating": [
        4.3
      ],
      "address": [
        "26th milstone, Near Bagru police station & manipal university, jaipur kishangarh expressway, main, ajmer road, Jaipur, Dhami, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Wonderful! Do not be put off by the negative reviews. The restaurant staff were fantastic. Service was great. Food was tasty and a good choice. A beautiful place to celebrate an important occasion. Thank you for making our day even more special with Lovely ambiance & peaceful vibe, i Loved the hospitality & A superb superb experience of this outstanding summer palace turned garden with sweeming pool and Luxury swiss tents Definitely worth a visit for dinner with loved ones.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very well maintained and hygiene place to stay, they've literally proved the saying \"home away from home\" true. The tents (or 'shamiyaana' as we say in urdu) here literally gave me the childhood nostalgia where every child has desired to live once.\n\nThe location is also good, they've utilised it in apractically well mannered. The host Pooja has been very warm and hospitable. A huge shout-out for her going an extra mile to make our stay special.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I visited with family 12 people's manager namely Vrindra sing ..he act that he is doing favour on guest his attitude is fully arrogant and he wants people to run out soon from his ambience. literally negative vibes from that person Virendra Singh.. truly advise not to visit he don't respect his guests",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Perfect example of an excellent resort\"\nReview of lavishta resort\nReviewed 20 December 2020\nOne of the best resort I have visited till now. The receptionists were really helpful and friendly. Great staff who knew how to serve the customer. The room was well equipped and the service was excellent. The food was toothsome The interior of our room was absolutely perfect. As soon as you come out of the resort, we just need to cross the road and there is a direct path leading to the highway . The scenery was beautiful and it was a relieve to walk in such a quiet and peaceful environment. The view of the sunset from that point was mesmerizing. I must say the location of the resort is at best place of Bagru. .\n\nDate of stay: 19 December 2020",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Wonderful visit. I just stayed for one day, had to rush back urgently but this stay was wonderful. Despite being located in an isolated area, they managed to help me commute to Manipal University Jaipur via their own vehicles. Truly grateful.\n\nThe swiss tent architecture is beautiful, it's air conditioned and clean. I'd say winters are the best season to come here because despite AC, Jaipur afternoons do tend to make the tents hot. Nonetheless, awesome food, picturesque location, well maintained.\n\nBest part about the visit was the hospitality. Massive shoutout to Mr. Binoy Ghosh and Mr. Ramniwas for making me feel at home and a part of the Levishta family. Thank you so much, will definitely visit again!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Choudhary Ghatala Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "Chitroli, Bus Stand, Jaipur-Kishangarh Expy, Chhitroli, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Its an traditional dabha at Jaipur - Ajmer Expressway. They have dal batti at best. And also have all other veg options as usual. Best thing is they have a huge sitting area at the back side. They also allow you to bring your own drinks or else you can take some from them. They run 24*7 365 days which is the best part here. If you cross home here you can surely visit it. They also own thier own hotel just along side which is a very good property if you dont like dabha or you want stay facility.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's awesome place to go with ur friends or callegues.. enjoy the Desi food",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Channa dal best one, you must try with fried chilli.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good test and nice ambiance. Costomer friendly environment.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Should improve their toilet condition",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "New jahdamba hotal",
      "rating": [
        5
      ],
      "address": [
        "RG83+2MX, Bagru Rawan, Keria Ka Bas, Rajasthan 303007, India"
      ],
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "You are very nice",
          "languageCode": "en-US",
          "rating": [
            5
          ]
        },
        {
          "text": "gjb",
          "languageCode": "en-US",
          "rating": [
            5
          ]
        }
      ]
    }
  ]
}