{
  "places_with_reviews": [
    {
      "name": "Leisure Resort Bahraich",
      "rating": [
        4.4
      ],
      "address": [
        "GHQ7+2J3, Bahraich - Sitapur Rd, opposite Leisure Resorts, Bahraich, Sisai Haidar, Uttar Pradesh 271825, India"
      ],
      "reviews": [
        {
          "text": "Best place to stay in Bahraich. The place is outside the main city. It has a big campus with a children's playing area. It has a restaurant and children's game area. The hotel has a big lawn  for marriage or other party functions. The room is decent and clean. Food is good but service is  slow. The hotel has a big parking area.Room charges are reasonable.p Place has a swimming pool. Nice Place.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very nice location, staff are polite and helping nature, rooms are spacious and well maintained and food is delicious....",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The hotel is decent and a good option in the area. Service over here is good and the staff is cooperative",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's a wonderful experience of stay here. Good service & feel good in resort.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice stay, clean rooms, servise is also good- Swati Mishra Musician Group",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hariyali resort",
      "rating": [
        4.3
      ],
      "address": [
        "GHWG+92V, Bahraich, Sisai Haidar, Uttar Pradesh 271825, India"
      ],
      "reviews": [
        {
          "text": "Nice place for... marriage function",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beat place to do arrangements for marriage and other functions. Nice interiors and there are two hall one for small gathering like 50-100 and other for 100-200.\nMostly booked so if you have plan go for it. Bit away from city but could be managed easily.\n\nNice open parking area and kitchen as well. Mostly recommended.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Lawn is descent .\n✨Interior looks great.\n✨Various selfy point located.\n✨Rooms were well furnished.\n✨There is large space for parking .\n✨The lawn is on the highway . So you can reach here easily by public transport .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best for parties, functions and marriages. Great location but according to me the hall isn't much spacious.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice place according to me but rooms are not so well trampoline was broken also",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Sawariya- The Boutique Resort",
      "rating": [
        4.1
      ],
      "address": [
        "Bahraich - Lucknow Rd, Bahraich, Sisai Haidar, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "It gives me immense pleasure while writing this loving feedback from my side for your lovely property. You have made my stay a memorable one. Whenever I travel to your place I make sure I stay at your property. The rooms are really good with all the required facilities and housekeeping staff along with the services is excellent. Moreover the restaurant and food quality is even I feel one of the best. The variety and range of food you have is quite appreciative. I always try refer your property in all my contacts in my personal and professional fields. Whosoever have stayed at your place they are also impressed as well. So keep up the excellent job you all are doing. Hope to see you soon again 🙂",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Ruined my sister's wedding with their most pathetic service.\nOne should never book this place for any function of theirs. -The rooms were not being cleaned.\n-There was no water in the washrooms.\n-The ACs were not working in 42°C heat.\n-They were not ready to switch on the generator in case of power cuts.\n-They did not even provide glasses to drink water.\nAbove all this, the manager and staff had the audacity to argue rudely with us.\nBride's father and brothers had to leave the ceremonies and be there from 12 AM to 3AM to get things sorted.\nJust imagine 3-4 of your guests having to checkout because the services of the resort were so bad.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Grand place to celebrate 🥳 marriage, birthday, program etc",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Wonderful experience including hard to beat local dinner that went in and on and on and was delicious and interesting… () breakfast was excellent and the onsens in the hotel lovely albeit pretty hot… We had booked two rooms for three people each which were converted at our request and no additional cost to three twin rooms. Wonderful and memorable stay.”\nAmazing location of the hotel, close to all very pleasant and helpful staff at the reception.\nGreat location, really pleasant and clean rooms, but the thing that makes this such a good place to stay are the staff. All of the people are incredibly helpful and generous with their time and advice.   lots of luggage and despite the stairs up to the elevator this was one of the nicest places.\nBest place for any type of occasional events like birthday party marrige party mundan party etc .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Stay for 2 days but rooms were not clean and you can find dust and dirt everywhere, specially below bedframe. They don't have arrangement for Tea or Coffee. Not recommending to anyone",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "BAN SARITA RESORT",
      "rating": [
        4.1
      ],
      "address": [
        "Gonda Rd, near St. Norbert School, Aminpur Nagraur, Bahraich, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "Best place on Outer Bahraich-Gonda highway to enjoy your celebrations. This place is good for marriage party and big gathering. At least 2000 can accommodate at one shot.  Very nice approachable location. Huge parking facility is available here for hassle free enjoyment. Very neat and clean place. The behavior of staff is also good.\n\nBut Room locks were giving a very bad impression as per the property, and there was no towel in the room, even when we got the towel it was torn.\n\nExcept that everything was awesome.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Old rooms on first floors are not recommended.. washroom in these rooms have smells and water leakage.. new rooms on the 2nd floor are good, spacious and clean",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Ban Sarita Resort, located 5 kilometers away from the city, offers a unique experience for those seeking peace and tranquility amidst nature. The fact that it's a bit secluded and the road can be lonely after sunset might not suit everyone, but it does provide a sense of isolation and serenity that some travelers may appreciate.\n\nOne of the notable advantages is the resort's accessibility by private vehicles, which makes it convenient for those who prefer to travel at their own pace. The spaciousness and the lush green surroundings also contribute to the overall appeal of the resort, providing a refreshing break from the hustle and bustle of city life.\n\nWhile Ban Sarita Resort may not be a luxurious destination, it seems to offer a peaceful and nature-filled escape, which can be a welcome change for those looking to unwind in a tranquil setting. It's an option worth considering for those who value solitude and natural beauty in their travel experiences.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice experience,wifi and all type party place,there is big holes,good survice available,meeting and sitting arangment are good.over all good survices are here,\nThanks",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I attended a marriage party 🎉 here...\nArrengement is better....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Panchvati Hotel",
      "rating": [
        3.9
      ],
      "address": [
        "Civil Line, Safipura, City, Bahraich - 271801, HJ62+83C, near Pani Tanki, Madhavpuri, Bahraich, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "Staff is very help full, easily assessable location and large parking space in campus,lawn and banquet available for party's , services are very much quality full.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "wonderful hotel and super sweet staff. Great facility and tasty food.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's a nice hotel 🏨 in Bahraich city. Food is very good and service is also good. You can enjoy your food inside and outside of the restaurant. They have a small open area, in case of good weather, you can enjoy your food.😉\n\nYou can park your vehicle in side the hotel. They have good security and it's loacted at on main road.\n\nEnjoy your stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The food was really bad I ordered so many things and none of them were good not even average I felt like I just wasted my money on that food....",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is situated in the main city. Hotel is very well connected to the city. It's also connected to the lucknow highway.\nLift in the hotel is not available. It's difficult for old age people to stay on top floors.\nFood at restaurant is good. There is variety of food. Food price is average.\nRooms are neat and clean\nGarden is beautiful.\nThere is no swimming pool in the hotel.\nStaff behaviour is good.\nOverall experience is good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Vinayak Resort Bahraich",
      "rating": [
        4.1
      ],
      "address": [
        "HJGF+2VJ Shiv Nagar, Gonda Rd, Nawagarhi, Friganj, Bahraich, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "Good location for marriage ceremony, birthday celebration and others. Good amou t of parking and huge lawn to decorate properly. You can easily find on the way to Gonda or Balrampur district from Bahraich.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Interior designs and decoration are so beautiful and food taste is also very tasty.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms were spacious and washroom was clean.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Visited a reception here\nWide open area- suitable for hosting of heavy number of guests.\nA wide variety of food was available.\nParking large enough, in front and back too.\nInside place also available for indoor celebration.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It is superb for all services and facilities...\n\nAtmosphere are also good..\nNice adjustment of parking..\n\nIt is on the road so eaay to find out it..",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "CR- RESORT & ROYAL KITCHEN RESTAURANT bahraich",
      "rating": [
        4.2
      ],
      "address": [
        "Tikora Mod, Bahraich - Lucknow Rd, near Parag Dairy, Sisai Haidar, Uttar Pradesh 271825, India"
      ],
      "reviews": [
        {
          "text": "Nice place for happy gatherings and other ceremonies. Peaceful and courteous staff.\nJoin with the resort's family and get the happiness.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "According to the city/district it’s good … and it’s a big campus with plenty of rooms … i visited for a wedding and it was a nice experience…",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel is very good. Food is very good and awesome food service very fast staff carefully I am revisit my family",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very good CR resort carefully staff and lovely resort\nRestaurant and testy fooding wow",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Went to a wedding of a relative, Got right on a location on maps, lovely place.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "BLISS Resort",
      "rating": [
        4.1
      ],
      "address": [
        "NH-927, Bahraich, Nanpara Rd, Biswaria, Andhra Chak, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "One of the best places in Bahraich for grand celebrations like marriage/birthdays/mundan and other programmes. Located at Bahraich-Nanpara National Highway and very close to the city as well. One must visit the place to spend their vacations in  a Serene environment.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of best Hotel in Bahraich, located outside of the city. Renovation work in progress it might affect your stay. Room size of very big and all the amenities were available as per room standard. One major problem was mobile network, you may face problems in calling from any telecom operator. However the hotel has wi-fi service.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good place for wedding function\nSpace for around 600-700 guest...",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good service and very soft skills by respsnist\nThank h u so much\nManeger &service boy",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice and Big place, parking space is also good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Awadh Kailash",
      "rating": [
        4
      ],
      "address": [
        "Opposite District Hospital, near Makhan Bhog sweet shop and Garg Medical Agency, Brahmnipura, Bahraich, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "Hotel is on the main road, manager was very frank and helpful. I got the room for Rs. 600 after bargaining from 700. Toiletries were provided on request. My room looked quite new and very clean including the toilet. Overall this hotel is definitely recommended.\n\nFurther details can be found as below.\n\n- Walk-in booking\n- Single person\n- Date: 31st Dec 2023\n- Amenities provided (Yes/No):-\n1) Blankets - Yes\n2) Soap - Yes\n3) Towel - Yes\n4) Hot water - Yes\n5) Parking - No (main road below hotel)\n6) Wifi - No",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "very nice hotel. very good location in the city. Friendly staff. very good customer service provided. delicious meal. rooms and meal not expensive at all. Clean room. really enjoyed staying here. Will visit again in the next trip. Will proud to be here again.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's feels like as safe as home and the behaviour is too good with customer all services which is given can be experienced at hotel",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Service very good\nRoom facilities very good\nStaff behaviour.  Awesome",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel Awadh Kailash near Bahraich Dist Hospital is one of the best hotels i have stayed so far. The highlight is the staff working there. Well trained, patient and very courteous. The property is well maintained, the rooms are very comfortable and you will get the true Hotel experience here with very low prices. I am now a fan of the Awadh Kailash hotel Bahraich.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Grand Palace",
      "rating": [
        4.2
      ],
      "address": [
        "Nanpara Bypass, Near RTO Office, Adnan complex, HHGH+2CV, Rajapur Mafi, Uttar Pradesh 271801, India"
      ],
      "reviews": [
        {
          "text": "Everything is good, neat and clean , it is near to arto office baharaich,Jai bheem",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Delicious food, nice room, staff behavior is very nice.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Great service and fantastic rooms.\nManager Ankit Kumar singh is a delight. I booked the entire hotel for my brothers marriage. Hospitality is top notch.\nRooms were clean and good, just like shown in the pictures.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Spacious property but poorly maintained. Should be maintained in a better way than I experienced. Spider’s web at the washroom corners. Lizards & Mouse can be seen. Car park & facility for your driver is good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Surprisingly good and modern - Never expected this at Bahraich",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}