{
  "places_with_reviews": [
    {
      "name": "WelcomHeritage Taragarh Palace Hotel Palampur",
      "rating": [
        4.3
      ],
      "address": [
        "V & P O Taragarh Distt. Kangra Valley , Tehsil Baijnath, Alhilal, Palampur, Aweri, Himachal Pradesh 176081, India"
      ],
      "reviews": [
        {
          "text": "I had an amazing stay at Taragarh Palace with my family.Tucked away in the tranquil embrace of the mountains, my stay at Taragarh was like stepping into a fairytale. The aura of history enveloped me as I wandered through its halls, adorned with vintage decor and steeped in stories from times past. The staff treated me like family, ensuring every moment was filled with warmth and hospitality. Waking up to the majestic peaks outside my window was a dream come true, and each day brought new adventures, from scenic hikes to lush green tea garden was a quiet moments of reflection. Taragarh is more than a hotel; it's a sanctuary of serenity and charm.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Always wished to visit Taragarh palace because of its glory, royalty and heritage value I have listened and lastly got opportunity to approach this palace. Really it is out of my imagination..It's beautiful location, infrastructure,  well maintained nature friendly environment put me in peace and filled me with joyful moments...I personally appreciate all the staff members who devoted their efforts to make this heritage so beautiful...We can't forget our warm welcome and cooperation in reception . Meals service are so dynamic and delicious. Cleaning of rooms are also Appreciable..I personally recommend visiters to spend your time here for relaxing from running life...Surely it will not waste of time, inspite it boost your energy level..i wish all my best wishes and definitely visit The Royal Taragarh palace in future...",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A very beautiful heritage property with sprawling Sun kissed lawns .. a perfect blend of heritage with touch of modernity and beautiful Dhauladhar ranges on the background!! At Every visit I love to have couple of drinks at their vintage bar followed by great meal !! Value for money deal !! Highly recommended stay/ stopover.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The staff was extremely impolite and unprofessional, dressed in sweatshirts and pajamas. The chicken served was cold, despite my request to warm it up, which the server forgot to serve again and the kitchen had already reheated. Despite being the only customers, they still managed to overlook our order. This seems to be a recurring issue, as evidenced by other reviews. Furthermore, they overcharged us compared to the menu prices, attributing it to a company-wide rate increase, which is unacceptable as their menu wasn’t updated.\n\nConsequently, we will not be returning ever.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I had a very pleasant stay. The location of the hotel is great and close to everything. Excellent location, superb services, helpful staff,  The staff are very good, especially the Reception staff Ms. Shipra who is very friendly and helpful. definitely come again to this place.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Binwa View",
      "rating": [
        4.1
      ],
      "address": [
        "Neri - Bajnath Rd, Baijnath, Kasba, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Decent rooms, good location, great views but they will even charge you for a bottle of water (at least that one could have been complimentary)",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good place for family functions.\nEnough parking space.\n\nLift is also available. Food is good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms are neat and clean.Hotel staff is also cooperative.Nice place to stay.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Awesome place to stay and very near to temple.. Services are superb.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel rooms are good, hospitality services and  food is excellent.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Bhejnath",
      "rating": [
        4
      ],
      "address": [
        "3J2X+RPV, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": []
    },
    {
      "name": "Hotel Billing View - Baijnath",
      "rating": [
        4.1
      ],
      "address": [
        "Hotel Billing View, near Petrol Pump, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Good budget Hotel to stay. We reached at 10.30 p.m.on October 9, 2024.Manager Mr. Arjun Thakur welcomed us and quoted straight way rates for two rooms.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Overall a good experience but  need to provide a towel and bath sabun.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Love billing view hotel",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The experience of Hotel Billing View Baijnath is the best.  The all staff members are  very cordially.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel was good as compared to price.... Owner's nature was nice.... Food were tasty.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Taj Hotel",
      "rating": [
        3.4
      ],
      "address": [
        "2JXW+VX6, MDR56, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel in Bejnath (Himachal pradesh) we reached here 12 in night and they provide us rooms. Other wise it was too difficult to stay there.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Nightmare.full of dirt,sinking bathroom,fans not running,tv and charging sockets are not working. bed sheets and mattress are the house of insects. No water or other facilities.hotel condition looks as owner is not intersted to run this hotel as he is an ex MLA..better to live in any dharamshala that is more safe and sound..",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Don't fool your self by the name this fake TAJ hotel..it is not The TAJ...it is Taj of the badness...bekar hotel.dirty & sinky.(Drinkers Home) sharabiyon ka adda..gunde, lafantars & thiefs are here...rude I'll behaved care taker,,no staff available ...rooms are dirty Fan Tv,gyser,charging soket not working,no  electricity backup...cheaters and unprofessional behaviour from care taker...",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Not safe for family or any one,One of the wrost hotel owner is a drinker rude and I'll behaved drinks in the hotel and this hotel belong to so called x MLA congress so they are just like gunda Bahubali..and at night they told to leave our hotel ..or increase their charges...no facility ...even no inverter in electricity failure...rooms are dirty ..fans are not running..no staff to look out..",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Nice hotel for stay. Near to bus stand and Baba Baijnath tample. Staff behaviour very nice.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Temple Town Guest House",
      "rating": [
        4.1
      ],
      "address": [
        "3M32+V37, near petrol pump, Baijnath, Himachal Pradesh 176063, India"
      ],
      "reviews": [
        {
          "text": "Clean and economical good service by waiter Ramphal",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Location of the hotel is good, food was decent as we ordered egg bhurji only tha that was quite well cooked. Staff is helpful. Rooms were decent and only one room got AC in the hotel.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice place to visit, good management",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Not good bad guest house TV not  working don't  try  to book",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Clean and veery good Guest house near baijnath Temple",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Standard Hotel",
      "rating": [
        4.1
      ],
      "address": [
        "MDR56, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Not very good between the market and near the bus stand.but owner is this place is very nice person. Lord Shiva historical temple in this city near the hotel only 1 km.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "ok",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Kamakshi Guest House",
      "rating": [
        4.3
      ],
      "address": [
        "Trekkers Inn,, Kamakshi Guest House 75 Mahal Gankhetar,, Bunglow No. 869, Baijnath, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Amazing experience. Rest house is very good and the best part is that the owner is very kind and helpful. They have arranged all the facilities to make our tour easy and memorable. Rest house is very close to market.\nWe really enjoyed our stay and loved that the traditional furnishings. The rooms are spacious and the bathroom was clean. They take care of your all needs and demand. In one line you would feel you are living in your own house not in any hotel or guest house. Food cooked is just fingerlicious.\n\nI would recommend this as a nice authentic stay in Baijnath (H.P), and would say it's particularly great for families & couples.  Perfect place to have complete peace of mind. Would highly recommend to every one .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Friendly, Helpful Staff, Clean rooms for a great value,\nWe stayed here before and after our trekking. Hotel staff were very friendly and helpful. Our rooms are very spacious . The breakfast was specially prepared on your order - service was fast and food was tasty.\nspecially thanks to Ishaan",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very good place to stay. Bon fire will be arranged. Calm,quiet and comfortable.\nFood is good. They guy \"Ishaan\" who runs the place has got very good contacts and can guide you to other places.\nHe can arrange for paragliding.\nPlace is reasonable too.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Amazing management, best services, awesome experience. Clean and pocket friendly. I went there with my family and they provide very good services. I would love to recommend to everyone who wants to go there. In short beautiful and amazing place.😊😊",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Highly recommended for a stay in Baijnath. The owner, Mr. Ashok Goswami is very polite and helpful just like the staff especially Ashu. They helped us to plan our 3 day itinerary and it was perfect. I went with my parents to find our long lost relatives and they helped us track them too. Apparently the town is very small and they all know each other. Food is amazing and does not burn a hole in your pocket. Thumbs up!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Amit",
      "rating": [
        3.3
      ],
      "address": [
        "near Shiv Baijnath Temple, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "24 Hrs Room Service-parvati Homestay",
      "rating": [
        3.9
      ],
      "address": [
        "3J2W+2GH, Baijnath, Himachal Pradesh 176125, India"
      ],
      "reviews": [
        {
          "text": "Nearest from the temple, very very nice service, I don't think 24 hours but at the reasonable price and nearest from the temple, it is best that one can find, clean bathrooms, 2 beds, with tv, and two blankets for cold, very pleasant experience...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Affordable budget price hotel......place is logistically good as it is near lord shiva temple......owner is also quite friendly .....rooms are not much luxurious but manageable in comparison to other rooms at that place...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Room ok but bathroom is not proper working",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice Place for Stay in Budget !!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Wow",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}