{
  "places_with_reviews": [
    {
      "name": "Chokling Art House - The Treasure of Himalayas",
      "rating": [
        4.8
      ],
      "address": [
        "Peme Awam Choegar Gyurme Ling Monastery, Bir Colony, Bir, Chaugan, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "Astonishing view with great service. This property is 10/10 where one can relax and feel like staying at home in the centre of mountains.\nEveryone is so welcoming and generous. Owner was so helpful from providing us itinerary to providing us great food and arranging our travel in the most reasonable prices.\nI would say this is the only place where you should go while in Bir.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The hotel ambience is Superb. Perfect destination on hills. Rooms are Neat and clean. Food is awesome. Service is perfect. The view from each room is excellent. over-all experience is very good.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I was stayed 5 nights at this property. Staff and service was very good. Parking space is also available. Owner is also very polite and humble. Highly recommended for families and corporates.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The Chokling Arthouse is in such a prime location, right across from the beautiful Chokling Monastery, and the views from there are absolutely breathtaking. As a solo traveler, I booked the dorm and let me tell you, it's so spacious! And the staff? Super sweet! I would totally recommend this place, especially since I've been to Bir a few times and it's my go-to spot now. Plus, everything you need is nearby. Oh, and did I mention how it's filled with all kinds of cool art? The whole building is like a tribute to the amazing artists who've painted there. Trust me, it's worth checking out!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The “twin room” is actually a shared “dormitory” but they don’t tell you that. This is false advertising. Don’t be surprised when some random guy walks into your room and sleeps right next to you. This specific room is also right next to the parking lot which can get pretty loud and the door to the balcony does not lock so anyone from the outside can just walk right in. This same door is also made of glass so all the bright lights they keep on in the parking lot come through at night. The cafe upstairs is also really expensive compared to the nice cafes around town.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Bir Nest Hostel",
      "rating": [
        4.7
      ],
      "address": [
        "Near Learn Well School Village Chougan, Bir, Chaugan, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "Bir Nest Hostel offers a cozy haven amidst the serene Himalayan landscape. The staff exudes warmth, always ready with a smile and helpful advice. Clean rooms, comfortable beds, and a vibrant communal atmosphere make it a perfect retreat for travelers seeking both relaxation and adventure. A delightful experience overall.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "If someone is looking for stay in Bir, without a doubt go for Birnest. Rooms are big, clean & at last what a view from this place, sunset & sunrise you can watch both. Mostly I had my dinner here only. Thank you everyone for comfortable stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This place defines the meaning of the traveling community. Situated at a great location and enough space for exploration of creative thoughts. Bir nest also has a work room equipped with office chairs and very good internet service. A volleyball court right in front. A beautiful stage for musicians and artists  to perform and also has a table tennis room. Food gives you the feeling of being home and people who manage this place always with open doors of their heart. I never stayed at Bir nest so won't comment about the rooms and amenities inside the rooms but I have experienced everything else it had to offer. Thank you Bir Nest for being an example of communal living at the best.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Had the most amazing time at Bir best. If you're a traveller and looking for a safe and happy time...this is the place!..\nEverything from rooms to food to hospitality is great!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Amazing place to just stay in and relax. Enjoy the peace and nature in its full glory. The location is pretty nice, easily accessible by main road. The hostel also arrange for an open mic every Saturday which people would really enjoy. Food is good and quite affordable as well.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "North Wind 57",
      "rating": [
        4.8
      ],
      "address": [
        "Mouza Bir Khasra No 464 ,Bir, near Zostel, Baijnath, Bir, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "Unique rooms to stay at Bir, Himachal Pradesh, India. Quiet and romantic! The view of snowy Triund Top is amazing!\n\nTheir homemade cooking meals are delicious and prepared to the guest freshly everyday for breakfast, lunch and dinner.\n\nLifetime experience !",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "It is a super clean, beautiful, scenic property with amazing views, including snow capped mountains, beatiful sunset with paraglyders glyding down the cliff of the mountain from Billing. The concept of domes are unique having all the ameneties. The rooms were clean, very comfortable. Food was very tasty. Both veg and non veg items available. The staff was amazing and very cooperative. They went over and beyond to help and make our stay enjoyable and memorable. They also made special arrangements for our anniversary. Highly recommend this for anyone visiting Bir Billing.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I stayed here for one night on Christmas Eve. The rooms are basically large plastic dome tents that are rather shabby and the decor is definitely tired. The bed was comfortable enough and the view was amazing. one reception staff member was friendly. There was a limited menu and the restaurant was not very welcoming. The room was not particularly clean and I felt for over €100, this was an extremely overpriced stay. I did write a review to this effect and the company contacted me to said say it was because of the Christmas period and that they would give me a discount; however, this is not happened. I was unable to pay by card and their online system wasn't working so they took me to an ATM on the back of a motorbike with no helmet which was really frightening. In general, I don't think this is a very professional set up, and I think the gimmick of staying in a tent is being used to cash in. These prices are equivalent to many high-quality hotels that I've stayed in all over the world, and this tent hotel does not really compare.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The rooms were clean, very comfortable, and the staff was amazing. They went over and beyond to help make our stay enjoyable. They made special arrangements for us on our anniversary. highly recommend this for anyone visiting bir",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "One of the best property that I have every stay and the food was so homely. Apart from that the staff were so helpful like brothers anytime ready for help and support. One should visit this site Life time experience. I personally feels like I was supposed by nature and also with lovely people. Keep it up and also all the very best!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Little Bir",
      "rating": [
        4.6
      ],
      "address": [
        "Khasra No 855, 856, 857 Village Keori Post Office Bir, Near Landing Site , Tehsil Baijnath, Bir, Suja, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "My wife, friend, and I stayed here for almost 2 weeks while on a paragliding trip to Bir. Location is great, it’s a short walk to the landing zone. Hanging out on the rooftop was a great way to enjoy the mornings/evenings here. The food at Little Bir is top notch, we explored many of the local restaurants and the food here is right up there with all of them. The rooms were great and we had hot water the whole time which was lovely after long days of adventuring. Above all the staff here were amazing and helpful our entire stay. They really helped make our stay comfortable and enjoyable. 10/10 will come back and stay here again.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nestled amidst the lush greenery of the mountains, this property in Bir offers a serene retreat from the hustle and bustle of city life. The staff, led by the hospitable manager Kush, goes above and beyond to ensure a comfortable stay. The cafe serves delicious food, making dining a delightful experience. Plus, the property's proximity to the main city adds convenience without sacrificing tranquility. Overall, a perfect blend of nature, hospitality, and convenience. Highly recommended for a rejuvenating getaway.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Had a wonderful stay in Little Bir. I took the winter room which has a wonderful charm. The food is amazing and the location is also great. The staff here is extremely friendly and always helpful. The view of snow mountains to the right and valley in front is just amazing. The food and especially the chai is awesome. I met so many wonderful people here and definitely will book this again for my next visit. Bir is one of my favourite places and Little Bir is definitely worth the stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "A genuine review:-\n\nThought rooms and location were decent but the staff were very rude towards customers.\n- They won’t allow you to play music.\n- They closed the common room so early and don’t even bother to open even after multiple requests.\n- Food was below average and very expensive.\n- There were no woods available for born fire.\n- Gym equipments were dirty. Only bench and some dumbbells were available.\n- There was no vibe at all like other hostels with fun activities. It was so boring.\n\nOverall very bad experience because of rudeness of staff and boring environment.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Clean and big rooms. The staff is very helpful. Pocket friendly stays and a worth it trip. It's a perfect location for all the activities and adventures ( has paragliding landing site within walking distance). Market is nearby and overall this is definitely a good place to stay at Bir.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Namlang Himal Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Namlang-Himal Resort Rd, Chaugan, Saten, Himachal Pradesh 175032, India"
      ],
      "reviews": [
        {
          "text": "No words can explain the beauty and the serenity of this place. It's an abode amidst nature.\nLocated in the center, it makes itself accessible to all places of attraction",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Resort garden are very beautiful and rooms are ok normal. Food is tasty and they serve alcohol also. Excellent place for friends and party.\n\nYou can check posts for more information in my Instagram id: maheshwar_traveller",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I have been to this place many times, but recently they changed their staff and these guys are high on something I keep wondering.\n\nI ordered boiled eggs (took them an hour)\nI ordered mutton curry( they served mutton dry)\nWhen I asked where is curry (the put the mutton dry in soup & tell me this is curry!\n\nWhen I ask this guy (in the image) what’s your name. He says he has no name!\n\nVery very rude to first lie to me & saying the mutton soup is how the mutton curry looks & then deny me his name so that I don’t complain!\n\nNote to the owner: until you are at the table yesterday everything was fine but as soon as you left they act acting like this.\n\nEven the reception of the restaurant is mostly empty after you leave the venue.\n\nI hope I visit sometime & things are better.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Namlang resort in Bir Billing is designed to offer the best stay experience. It features a selection of cottages for a comfortable stay. These cottages are nestled in nature and the presence of many cute little dogs adds to the charm.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Best and beautiful place with a fantastic view of snow covered mountains.\nThe cafe is very good and they know how to party hard. We were here on weekend and there was live music. The vibe was on whole different level. They menu is also very good with local items and food quality and quantity is very good. Alcohol and beverages are also up to the mark. Would like to spend holidays again and again. Rooms are clean. You will get personal attention here.\nEnjoyed a lot specially the Dance floor with Live music, good atmosphere.\nIf you are in Bir, you should visit this cafe.\nStrongly recommend visiting here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hipostel Bir - Stay and Cafe",
      "rating": [
        4.6
      ],
      "address": [
        "Hipostel Bir Gunehar-Lahar Road, Gunehar Rd, Bir, Gunehr, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "I had the opportunity to stay at this property for one night, marking my first visit to Bir. During my stay, I chose to occupy one of their tents.\n\nMy overall experience was pleasant, characterized by the absence of any significant issues. One minor improvement I would suggest is placing a power board conveniently near the bed for added convenience.\n\nThe property boasts a generous open area, which is a noteworthy feature. This open space provided a tranquil environment where I could comfortably work or simply enjoy the outdoors.\n\nThe on-site cafe at the property deserves commendation for its delectable meals. The culinary experience was certainly a highlight of my stay.\n\nPerhaps the most noteworthy aspect of my visit was that it aligned with my budget, making it a cost-effective choice for my accommodation in Bir.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Wonderful stay, awesome ambience, specially after evening when everyone is at the hostel . We'd play table tennis, carrom, card games, chess and enjoy songs while being gathered around the bone fire.\n\nBoth dorms and private rooms are available and prices are very pocket friendly. Great people managing the place. Must stay if you come to bir and have a fun and great experience while making friends..",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I had a great stay at Hipostel.  The place is like second home. I would come back here everytime if I would get the chance. Kapil bro is a great host, if you get the chance kapil bro will take you to explore different places. The hostels vibe is totally enjoyable.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I recently had the pleasure of staying at Hipostel in Bir, and it was an experience that exceeded my expectations in every way. The hostel's vibrant atmosphere, coupled with the thrill of paragliding, made for an unforgettable getaway. Bir is renowned for its paragliding opportunities, and the hostel's convenient location made it easy to arrange this thrilling activity. Whether you're a solo traveler or part of a group, the hostel's vibrant atmosphere and proximity to paragliding facilities make it a must-visit.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Amazing view and the most for the youngster and friends. Do not recommend for family. You will fall in love with the views.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Sagarmatha Bir by Solitude Stays",
      "rating": [
        4.2
      ],
      "address": [
        "Vill. Choughan, Bir-Billing Rd, near Choughan Chowk, Bir, Chaugan, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "The rooms were very spacious and spotlessly clean! The only problem was the washroom which didn't have an exhaust fan so it became smelly after a while. But overall, the service is too good, the food was awesome! Thank you so much for a pleasant stay!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Our stay with Sagarmatha was unexpected as the hostel we did our initial booking denied it at the gate. It was 6am in the morning and we had no where to go. Only the kind receptionist at  Sagarmatha agreed to take us in with all our luggage.their booking were full but they offered us an empty room until they get a check out slot at 11am. Not only they let us use the bathroom area they offered us delicious breakfast as well. And we got our rooms as promised.\n\nThe staff is very friendly. Rooms are super clean & the food is delicious!\n\nThank you & Love from Sri Lanka",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I stayed here for one night, Booked a standard room. Room was good but not great, the service was poor, TV was not working no signal whatsoever, mobile network was not there no signal for jio and airtel, wifi was available but without internet so doesn't matter. It was just like you will be disconnected from the outside world as there was no TV no wifi\nFood was ok ok\nBreakfast was not good I order Two aalu pranthas, and it was like without any stuffing looked like plane pranthas.\nOverall experience was not good.\nAnd was costly according to the service they provide",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are spacious, and the staff is courteous. Did not face any issues.\n\nThe view and the terrace are a nice addition.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It has been a wonderful experience to to Bir and Hotel Sagarmatha ha been instrumental.\nRooms are very comfortable and spacious including the bathrooms and view from the room is icing on the cake.\nFood is nice and one doesn't miss the home because of homely food.\nService is also good boys are very helpful and prompt with to act.\nHotel helps out with activities around the area also suggested the areas to explore near by.\nOur Paragliding was arranged and booked by Hotel itself and we had a good experience with that.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Bunker Bir",
      "rating": [
        4.7
      ],
      "address": [
        "Bir-Billing Rd, Kotli, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "One of the best hostels i have stayed in. Food was seriously the best. Although it takes around 30 minutes to prepare, you will not be disappointed by the quality of it. Clean rooms, friendly staff, quiet place. No traffic. They have their own parking space also.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I recently visited the Bunker for a couple of days with my friends, and my experience has been one of the best hostel experiences so far. The hostel is located away from the hustle bustle of the main road, situated in a quiet place, still making it accessible to all the main locations if you have a scooter. The entire hostel staff has been really good and helpful and they made all the experiences including stargazing, great. Extra points to the host for arranging all activities, and providing with a chill environment to hangout. The food at the cafe was also of exceptional quality which one generally doesn't find much at hostels. 10/10 recommend.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "An amazing place to be in Bir with clean, safe and awesome stay. They arrange lot of activities like nearby hikes, sunset walks etc. Property is in vicinity of Volvo bus stand and you can survive without a vehicle. Renting a bike or bicycle is super easy directly from\nHostel. All in all, best memories created and good friends from all over the place.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "There is simply no other place I'd stay at in Bir - the vibe, the food, and the people at the Bunker was the best! The activities organised by them everyday gave a complete experience of Bir. Absolutely loved the time spent here - looking forward to returning soon. :)",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "First solo trip that didn't feel like one. Very lovely crowd. The host is very kind and helpful. Rooms are clean and well maintained. The check in process was very smooth and easy. I will surely suggest this place to my friends ✨",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Monkey Mud House & Camps",
      "rating": [
        4.7
      ],
      "address": [
        "Village - Bir Khas, Post Office - Bir Tehsil - Baijnath, Bir, Bir Khas, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "Amazing place for retreat. Spent great time with friends in our batch trip. Great camping experience. Bonfire is so lit. The vibe is top notch.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "A must visit place if you’re travelling to Bir. Great hospitality and location is also very serene.\nThe service is top notch as well, you’ll get what you ask for. The vibe is pretty chill.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Thoughtfully curated place with amazing ambience. A must visit for anyone in the area looking for a warm and welcoming spot for a quick bite or wholesome meal with decent service.\nHighly recommended for a relaxing and enjoyable staycation with your loved ones!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "amazing food & awesome vibe!! We're visiting this place from almost 3-4 years and everytime it's breathtaking. I cannot put everything into words how the staff and people here are welcoming. Much love to this place and people❤️❤️ and ofcourse can't miss to name #HUNTER, a friendly dog!!!!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We had a fantastic family trip at Monkey Mud House Camp! Amit bhai, our host, went above and beyond to ensure our stay was comfortable. The cozy accommodations and attentive service made for an amazing experience. The bonfire added a delightful touch to the evenings, and the food was delicious. Highly recommended for a relaxing and enjoyable staycation with your loved ones!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Surya Classic Hotel & Restaurant",
      "rating": [
        4.1
      ],
      "address": [
        "Paragliding Landing Site Road Village Chougan, Post Office Bir, Block Baijnath, Bir Colony, Chaugan, Himachal Pradesh 176077, India"
      ],
      "reviews": [
        {
          "text": "I recently spent 12 days at Surya Classic Hotel. Situated right next to the main bus stand in Bir, the hotel offers two types of well-kept and neatly maintained rooms. The service was commendable, with friendly staff available even during late hours; Mr. Vikki, in particular, was notably helpful. While I found the menu slightly overpriced, the food was both tasty and clean. The hotel's location close to the paragliding landing spot, serving as a sunset point, and the proximity to 3-4 monasteries make it an excellent choice for families and solo travelers alike.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The only good place I could locate in Bir, to have north Indian food. With good taste, nice service and reasonable prices\nWill be staying here the next time :)",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Really friendly, clean rooms at a very reasonable price - and hot water when you turn the tap on!!  Great place to stay when flying at Bir/Billing.  As always, highly recommended.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very neat & clean decent place , reasonable price , courteous staff, addl facilities like laundary , heating device , cloth hangers will further improve.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Okay rooms need to be more clean but saff is cooperative and 👍 nice food is ok ok over all much better than others",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    }
  ]
}