{
  "places_with_reviews": [
    {
      "name": "Buntar",
      "rating": [
        4.2
      ],
      "address": [
        "V4JX+X8J, Bhuntar - Kullu Rd, Bhuntar, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Not good",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Village",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Royal Mansion Bhuntar",
      "rating": [
        4.7
      ],
      "address": [
        "Manikaran Rd, Parla Bhuntar, Bhuntar, Shillihar, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "A very good premium hotel at affordable price.\nStaff is very well behaved and it is recommended to stay here with the hotel.\nFood is great. I found the food a bit overpriced but the taste is too good so one might feel that it is worth the cost.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Absolutely loved it! Humble and friendly staff enthusiastic to help you out with anything you need. Beautiful in the day with shadows and cozy at night with good lights. Perfect dinner Place with authentic and delicious food. A must visit to satisfy your cravings .",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very delicious food staff is very nice to us good food and service received rooms are also very nice. Keep it up",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Comfy and great aesthetic room, great lighting and bouncy beds everything is just majestic here if any relative ever comes to kullu, I'll always prefer this hotel to them. Great stay, great food. Roaming around this hotel is just so good feels like home. All the luxurious stuff around here is for real majestic, I love this place. And this hotel will always be in my preferences",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Hoping to be best stay ever. The environment was pleasant and welcoming.  check-in was professionally handled and easy.Came for family stay.The staff was wonderful. The hotel is well maintained.Excellent food. Tasted chicken today, which was excellent. Great chef and excellent price and quality ratio. Cosy restaurant facilities.\"Restaurant staff was helpful and clean resturant 💯/💯.Thank you for ur hospitality🙏",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Amit",
      "rating": [
        3.7
      ],
      "address": [
        "Hotel Amit, Near Sainik Chowk, Bhuntar, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "Very great experience.. great staff and ambience.  Good food quality and presentation.. very friendly staff!",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms were very neat and clean. Staffs were soo good and kind enough to help in exploring the city. Food was very hygiene and tasty. They will also customise according to our cusine need. Mr. Arjun helped us alot in customising our preferences.\nOverall, had a excellent stay experience.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very good staff...and service is also very good . Nice place to stay.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "We got down at Bhuntar at 4 am and this hotel was a savior. We knocked at the door and the caretaker woke up and accommodated us. The room was clean and we could rest for a couple of hours before we headed to kasol. Food is awesome. 5 stars for the cleanliness and hospitality.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "We took hotel this week for one day. We had a very comfortable stay there. Rooms are quite small but, worth the money.\n\nWe checked in early and they allowed us to do so. Good staff and nice location.\n\nHighly recommended!",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Malabar Bhuntar",
      "rating": [
        3.9
      ],
      "address": [
        "near Kullu - Manali Airport, Bhuntar, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "Best service received during my trip to manali... Stayed there while going to kasol and also coming back from manali... Their service is amazing.. met a guy named Ram there who helped us with everything... Rooms are clean and cozy. All weather AC is there... Hot in winter so extra cost of heater or blower is saved. Bonus tip: their food is amazing; tried daal fry and paneer butter masala for dinner... It was just wow ..... For morning Try puri bhaaji, its gonna stay on your tongue...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The people left us freezing outside hotel at 11pm and were not picking calls and also not responding as we tried to shout and knock the door\nWorst behaviour by the staff and the staff also argued with us itself and blaming us for being left out..\nTrust me don't visit this nightmare as they will ruin your trip.. very unsafe hotel",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Excellent Service from staff, Rooms  are good for the money charged. Just stayed for night, so cannot write more. But safe place.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The food is very good..or the taste of the food is the same since years….whenever my family or friends come here I come here to eat, I have been coming here for 14/15 years to eat.......👍👍👍👍👍👍",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Best place and best food ... Worth every penny... Lovely place and decent atmosphere",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "The Bliss Banquet",
      "rating": [
        4.5
      ],
      "address": [
        "Kalheli, Bhuntar, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "Perfect place for your events, functions, marriages. very good hospitality and friendly staff. delicious and varities of food.The rooms were spacious and spotless, with great décor. #besthotelever 😍",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We recently hosted our daughter's wedding at The Bliss Banquet Hall, and it was an absolute dream come true! The venue's elegant decor, spacious layout, and top-notch service made our special day truly magical. Our guests couldn't stop raving about the delicious food and the beautiful atmosphere",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Arranged a function there. Nice ambience and decor.  Ample parking & other facilities. Manager Mr. Arun Kumar and other staff very co-operative.\nCatering arranged by them was also good. Buffet (standing) Kullu Dhaam and counter snacks preparations were excellent. However the 'jalebis' could have been served crispy hot.\nOverall good experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Superb place and amazing services.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I attended a marriage here. The rooms and property is new so obviously they are nice for now but the food was gross. During reception they also served undercooked rice. Management needs to be improved big time.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "47 Hill",
      "rating": [
        4
      ],
      "address": [
        "Plot No-47, Shahinala Colony Bajaura, NH-03, Kullu-Manali Highway, Bajaura, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "This is not even a hotel. It's just a homestay with very dirty rooms, the worst room service and no restaurant.\nEven the wifi wasn't reaching our room, they only have one wifi which is in the ground floor. It doesn't reach any other floors.\nThey don't even provide an extra bed, they just provide one mattress and you have to sleep on the ground, which is not clean at all.\nNot recommendable at all do not waste your time and money visiting 47 hills.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Awesome hotel..Had a very pleasant experience there.. rooms,services,food,view all were quite good.Higly recommended. Very 9c staff",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "So the place is basically a guest house in a residential area made like a residence. The room which we stayed in was clean but quite small. Have private parking and is easy to find location.\nThat being said there is no room service or food that can be ordered. You either have to go outside or order food from outside.  The caretaker is one person taking care of the property who was hard to find in the property. They can provide you plates but have no spoons or forks.\nAll in all its a place where you stay of you are looking for an overnight stay on the way.\nThe owner was easy to reach but do not live on property.\nWifi was good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Rooms are airy, spacious. Nice view. Located at a peaceful Recedential area. Room service can be better. Outside hotel food served as no restaurant. Food is very spicy and oily.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms were clean and cheaply prices the view was kinda okayish....The hotel was almost empty I felt like it was only us there😂😂 Talking about the service..so, it was good like there was good speed wifi, hot water supply, we were provided with a kitchen with crockery and all essentials...We went to Manali so, we just had one stay at the hotel. So, of I talk about you staying at thi place and thinking about having a super luxurious stay then this is not the place for you but if you're a traveller who has to spend a night or so on a budget then this place is recommended! Just one last important thing about this place that the way to get here was kinda complicated, I followed the directions on Google maps but I got on the wrong road So...when you reach the residencial area that's just before the hotel ...you can contact the hotel , they'll help you out like they did to us. The staff here was very helpful and soft-spoken. Wishing you a happy stay folks!",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Anjum Regency",
      "rating": [
        4
      ],
      "address": [
        "Jhiri, Shiyaugi, Himachal Pradesh 175121, India"
      ],
      "reviews": [
        {
          "text": "Everything was good the room and the location but we ordered Chinese item Manchurian it was pathetic 🤮 we didn't even had it. It was waste of money other than Chinese items the Indian food was good but I was very annoyed to give money for such food not even worth it.\nps: don't order Chinese food item from here. 🤮🤮🤮🤮",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Most third class hotel I have ever came accross the tap was not working, neither the charging socket. There was no table in the entire room. Foods were also not available. The room service telephone was also not working. Better sleep in your car than to stay in this hotel 😡😡😡😡😡😡😡😡😡",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very nice accomodation and food at reasonable rates.....Manager of the hotel very cooperative and decent",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "On main four trek express Highway of kullu Mandi via padoh to Chandigarh. Nice room for stay. House keeping is very good.staff is also co operative. Resturant facility available. Parking area is very well place.view s are very natural at windows",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's great experience to stay... Food was awesome as we have taken lot of dine in hotels in Manali and kullu we found best and yummy food here.... We found great hospitality....rooms was so comfortable...and we enjoyed there roof terrace dine in....we suggest other to visit once....",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "The Tara Villa Hotel",
      "rating": [
        3.7
      ],
      "address": [
        "Near, Kullu Manali Airport, Bhuntar, Kulu, Himachal Pradesh 175125, India"
      ],
      "reviews": [
        {
          "text": "Very good property with a lot of space for big and small family functions, like marriage, retirement, etc. Onsite parking is available along with two big halls and some private rooms are available for function. The place is located beside Bhunter-Kullu highway idle for the function of the locality between Bhunter and Kullu. For Bookings you can contact Mr. Solanki, the owner of this place is a nice and humble person.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are not at all clean. Definitely not a place to stay if cleanliness and hygiene mean anything to you. If anything positive has to be said, the staff is polite.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Tara vila is owned by the Solanki family. Outside the hotel there is ample space to organise events and functions. I have attended some of the functions there and found the place best for marriages reception etc. I have not stayed at the hotel but I know there is a restaurant in the hotel, ample parking space, nice open surrounding lawn, and villa look. It's on NH 21 so road connectivity is awesome , you can come by any means of transport , just outside the hotel isbus stop. It's just two km from airport. Overall it's a good place to stay at bhuntar or for organising functions.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "If you want a quiet place without the hustling traffic, this is a great place to stay in Bhuntar ! The bedrooms have large windows and plenty of light ! Nice private surroundings where banquets are also hosted occasionally . Helpful and polite staff  ! Bed linen was nice and clean ! Food was prepared well .",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "They take the money advance and no restaurant service. They just give the room and forget about the guests. The only plus point of this property is their Lovely Dog Chase he is very friendly.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Shailraj",
      "rating": [
        3.6
      ],
      "address": [
        "National Highway 21, Nagwain, Himachal Pradesh 175121, India"
      ],
      "reviews": [
        {
          "text": "I booked this hotel online from make my trip as some reviews are good. The room I booked online was deluxe room but when I reached the  hotel manager shown the room and said this was booked by me online. The condition of room was disastrous. Then manager asked me to see other rooms with extra 400 Rs charges.  poorest service I have ever seen. No hot water available. Served cold hard rotis with food. Manager is drunked. Loud music was  running from 5.00 am in the morning. Overall it is not a family hotel for the stay.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Good environment\nGood staff behaviour and cooperative nature.\nLunch is delicious.\nCost of lunch is also cheaper than other Roadside Restaurant.\nOne star is cutting for unhygienic washroom. Maintain the washroom.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "We were six and coming back from Solang valley. It was afternoon time when we decided to eat something at Hotel Shailraj. The hotel is situated on NH-21 near to Bhunter. We have ordered mix veg, Daal tadka, salad, aalu jeera, curd and butter roti. We were so disappointed due to mix veg because it was not fresh, the sabji was smelling so dirty, we returned back the mix veg.\nI think the daal was also from yesterday. They took 40 minutes to prepared the yesterday's food. And the service was so bad, we were 6 and waiter has served only 4 bowls to us. I don't know why they were not paying attention to us although we were only clients there in restaurant that time. If you are hungry don't go there, they can serve you unhealthy food.\nI hope hotel staff will understand the basic requirements of customer and will serve the fresh foo to customers.\nThe best part of this hotel is the view from inside. You can have some mesmerizing landscape from here.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Value for money. If you are noise sensitive take back side room. Because front side rooms are adjoining national highway hence there may be traffic noise. Back side rooms offer view of farms and mountain also. Cleanliness is good.\n\nhotel manager is co-operative. staff behaviour is good. Taste of food is good. Service is also good. Good for a night stay to break the long journey to Manali.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Hotel is infront of DTDC courier service (Nagwain) and in road side. Parking facility is available.\nDining facility looks decent and food is also good.\nChairs are very comfortable and staffs are very supportive.\nGood for families.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "HOTEL FLIGHT VIEW",
      "rating": [
        3.4
      ],
      "address": [
        "fruit market, NH-21, Kashawri, Bhuntar, Himachal Pradesh 175138, India"
      ],
      "reviews": [
        {
          "text": "One of the worst hotel I have experienced in my life.  Even soap, towel, mosquito repellent are also not provided. A bottel of water is also not made available. Prime location but negative service",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Not so good. Rooms are not good. Noise of traffice dont let you rest. No chappals, no towel, no soap, no shampoo in the bathroom. Even there is not light in the room. Only one person handlinh everything from recpetion to waiter and Specially for Owner a wrost person. Even dont know how ta talk in front of a family. Dont go there",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Food is good in quality and quantity. Nice service, clean table and toilet. Only drawback was that there was no swipping machine. Near to the volvo bus stand in buntar so that you can quickly have a dish, time taken for the preparations is reasonable.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "I was not in hotel but I requested because my wife was in female emergency, There is no courtesy in case of emergency he told us very badly to go to the public washroom even he knows public washroom was in the dark place without doors, which is not suitable for any lady to use.He just showed  the way and did not lend helping hand in case of emergency.Person who was setting at reception, to whom we said that there is emergency  knowing the fact that  there was a female emergency. Still he denied the  request. It was really bad",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Rude owner. The hotel is right besides the Bhuntar interstate bus stand and a lot of people tend to avail refreshments  at this place. But the hotel owner and it's staff lacks politeness and are rude on customers  for petty things .They foresee no shortage of customers as a lot of crowd going to kasol lands up there. I personally do not like rude behaviour and  would advise to avoid this place . Get your water bottles and a cup of tea from somewhere else rather.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    }
  ]
}