{
  "places_with_reviews": [
    {
      "name": "Ginger Agartala",
      "rating": [
        3.9
      ],
      "address": [
        "Khejur Bagan, Airport Road, Mouja, opposite Industrial Office, Barjala, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "The hotel's location near the assembly is undoubtedly convenient, and the room was clean with essential amenities like tea-making facilities and a mini-fridge. The staff members were polite and helpful. However, the price seemed inflated for the room type provided; similar accommodations are available for less than 2000 at other hotels. Additionally, despite arriving after the stated check-in time, I had to wait for over 30 minutes to check in, which was inconvenient. Overall, the stay was satisfactory, but the pricing is on the higher side for what's offered.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice place for staying. I recently stayed at the hotel for one night and had a pleasant experience. The hotel was nice and clean, including the bathroom. The staff were well-behaved and friendly, making me feel welcomed. While I can't comment on the food since I only stayed for one night, the facilities were good overall. I would recommend this hotel for a short stay. I gave 4★  cause atleast they should include light breakfast like - bread and butter for the price as complementary.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are neat and clean. Capitol City. Hence providing a better cleanliness. A bit costly but worth it. Comfy beds and hot water 24*7., what else we shall expect in a hotel. Good to go guys",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The staff was very nice and the hospitality was 10/10. The stay was quite good with the rooms and bathroom well kept and especially the housekeeping for their patience and mannerism. Have to mention restaurant staff's hospitality and wonderful food suggestions ( Ashesh & Satyajit) making the stay more comfortable. Also the local food they suggested was super good - try aloo tomato bartha.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The hotel is more like a hostel converted into a hotel. The color scheme of using orange, blue and yellow is hilarious. The rooms are extremely small with old bathrooms. The breakfast spread was nice and sufficient.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Polo Towers Agartala",
      "rating": [
        4.5
      ],
      "address": [
        "VIP Rd, Kunjaban, Agartala, Tripura 799006, India"
      ],
      "reviews": [
        {
          "text": "Fabulous visit. The sky grill and bar on the rooftop is a nice place to spend quality time. The food was absolutely fantastic. Our attender Mr. Surajit  Das was very nice and made our visit memorable. The overall review was nice.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Finest in the city and the sky grill and bar on the rooftop is a also a place to spend quality time. Our attender Surajit make sure we spent quality time on our date evening. Glad to visit here. Eill come back again",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Hotel Polo Towers exemplifies unmatched luxury. From elegantly appointed rooms with breathtaking city views to impeccable service, every aspect of the stay was exceptional. The staff's hospitality was beyond reproach, ensuring a memorable experience. Culinary delights at the on-site restaurants surpassed expectations, offering a gastronomic journey. The hotel's commitment to guest comfort extended to well-equipped fitness facilities and a rejuvenating spa. Whether for business or leisure, Hotel Polo Towers stands out as a paragon of sophistication, making each moment a celebration of opulence. A truly unforgettable stay that defines the pinnacle of hospitality..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "\"Everything Is Not as It Seems\"\nAt first i thought I am not going to post about this but I saw multiple post that everyone is saying about the \"Poila Boishakh\"...Even On Daily News paper and other Platforms also. I think they didn't even came over there, Even They didn't Taste the food aslo, Hotel Charged 1799/- (+GST) Per Person On buffet.\nUnfortunately the food was Disgusting they didn't even serve Mutton, they Served Chicken which is also Disgusting. Even \"Aquilaria Clubhouse\" food was far more better then a typical so called 5 Star Hotel. And Also the Decoration is not as good as others. If you are thinking that I am wrong about this, just go \"Aquilaria Clubhouse\" and prove me wrong.\nAnd also the attitude of the Stuff.. oh God save me..!!!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Myself Partha Chowdhury this side , owner of DELL EXCLUSIVE STORE Agartala. A day before yesterday I have booked one room at Hotel Polo Tower for our Branch Manager of Redington India limited. I had to meet him there regarding our Business conversations. As I reached there one of your hotel receptionist named BARNALI DHAR behaved very disrespectfully saying that \"outside guests are not allowed there \" even after me telling repeatedly that I and our Branch Manager (who stood there ) had important meeting regarding our business, that lady didn't let me go at his room . This was very disrespectful and unexpected behaviour from Hotel Polo Tower Agartala. The worst experience ever had at a starred hotel at Agartala . Will think a thousand times before visiting there.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Sonar Tori",
      "rating": [
        3.9
      ],
      "address": [
        "Ronaldsay Rd, near Fire Brigade Chowmuhoni, Jay Nagar, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "Everything was good here.  The aura, the politeness and behaviour of the staff, the room service, the restaurant and its food. The rooms are quite good, with decent space. For the price you're paying, it's a nice place to look for. The dinner and breakfast were really great with different dishes at our side, so we don't regret booking ahead. The location is easy to access. Laundry option is also available if needed.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Average due to quality is not up to the mark as I expect. I am simple traveler who is traveling with senior members of family. I feel they are not concern about common peoples but it is my right to express my feelings which may be not useful to Hotel Sonar Tori Management Body.\n1. Rooms are very small.\n2. Food quality is not good in taste and hygienic levels.\nFoods are very enrich with oil and spices.\nMajor issues got bad smell from dishes.\n3. Toilet is so small like railway toilets and water draining is very slow.\n4. I have booked suit room with breakfast and check out day I have early flight so they said that they have arrangements for that but unfortunately at morning checkout time we realized it is false statement and no service is there.\nMy experience they are good for short party organizations like married birthday like wise.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Sonar Tori, with its distinct charm and riverside location, offers a mixed bag of experiences. The service, while decent, doesn't quite match the excellence one might expect from a hotel of this caliber. However, the redeeming factor lies in the delightful culinary offerings.\n\nThe food at Sonar Tori stands out as a highlight. With a diverse menu boasting flavorful dishes, the hotel delivers a satisfying culinary experience. From regional delicacies to international fare, the kitchen succeeds in pleasing the taste buds, making it a haven for food enthusiasts.\n\nFor couples seeking a romantic getaway, Sonar Tori provides a suitable ambiance. The riverside setting adds a touch of tranquility, creating an intimate atmosphere for a memorable stay. The hotel's focus on creating a space conducive to couples is commendable and adds to its appeal for those seeking a romantic retreat.\n\nOn the flip side, cleanliness emerges as an area that could use improvement. While not entirely subpar, it falls short of the expected standards. Enhancing cleanliness measures would undoubtedly elevate the overall guest experience, aligning it more closely with the hotel's potential.\n\nIn summary, Sonar Tori is a mixed bag – from decent service to delightful culinary experiences, and a romantic ambiance for couples. However, attention to cleanliness would significantly enhance the overall guest satisfaction. For those who prioritize good food and a romantic setting, Sonar Tori has its charms, but there is room for improvement in certain aspects of the guest experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel Sonar Tori, located near Fire Brigade Chowmuhoni in Agartala, offers a blend of comfort and convenience for travelers. The dining options, which provide a variety of buffet and Asian breakfast choices, are good. The rooms are equipped with modern amenities like a flat-screen TV, satellite channels, and a kettle, ensuring a pleasant stay.\n\nAgartala Airport is just 11 km away. Moreover, the hotel's location provides easy access to local attractions.\n\nWhen it comes to service quality, the hospitality and the enthusiasm of a young team eager to serve with a smile is praiseworthy. However, room service is less than satisfactory, with delays in fulfilling requests.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The smell of the washroom was too bad to enter ! Had requested 2 times to solve the issues but hardly solved. Ventilation was not working at all. There was too much dust on the complementary glass water bottle, seems like water has not changed for months.\n\nThe behaviour of the staff was appreciable! Food was delicious to some extent except South Indian Dishes.\n\nHopefully Management will take care of the issues and serve better next time.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Rudra Hill Forest Resort",
      "rating": [
        3.9
      ],
      "address": [
        "Chandmari, 79 Tilla, Agartala, Tripura 799006, India"
      ],
      "reviews": [
        {
          "text": "Nice hangout place for girls group and family with small kids. Cleanliness was impressive. But could have been better as this place has potential in it. Food was disappointing especially for vegetarians. Should improve the gardens, the menu for more starters and Biriyani items and of course the taste.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "A good place to hang out with friends and family....nice and dining area. You can also pre book food as per your choice if you are going in a large group. There is a entry fee of 200rupees per person. Overall I liked the place and food",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The environment is very good. If anyone Weekend Family time spending the place is very good. I suggested you must go atleast one time. And there food quality & quantity is good as reasonable price.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's a private property. Good for Birthday party or reception or get together. Apart from that there is nothing spectacular as such. For couples 💑  it's a so so place to do boom boom only in one or 2 pos 😜, for family visit with kids well better u go somewhere else.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "A good place for family gathering, friends meetup and celebrating events. Entry fees include fooding coupon also. Food items are good 👍",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "The Parkline Hotel",
      "rating": [
        4.5
      ],
      "address": [
        "R7MJ+J4V, Palace Compound, Indranagar, Parkline, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "This hotel is opened recently approximate 2-3 year old hence new building, clean & tidy reception area, stairs & room. Food is tasty. Sufficient option during complementary breakfast. Room service on time. They also call prior closing the kitchen if order is not placed. Rooms are very clean and kept tidy by housekeeping staff. Ms. Bina & her team was very courteous. Daily use items such as Toothbrush, soap, shower caps, lotion Laundry etc were provided on time.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I am with my family visit there just to have lunch. So I can definitely say food quality was nice and ambiance is very nice. Location wise it is situated at excellent area all visitors attractions within 5 to 15 min walking zone.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Wonderful experience quality of Food\nWe had prawn and chicken dishes, quality of food was too good, portion was adequate. Staff were very helpful overall a wonderful experience in restaurant. Wish to visit again soon.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The behaviour of the manager was so rude! He didn't even allowed us to use the washroom as we are not staying in the hotel. It is totally against the laws as there is law for allowing any stranger to use washroom in case of emergency in any hotel, whether he/she is staying in the hotel or not. Totally unexpected hospitality from the hotel's end.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Stayed there for 8-10 days and felt cheated. Rooms are generally okay as compared to the other options in the city but beds are noisy and small. I could also hear occupants talking in other rooms.\n\nThey have over five hundred items on their menu but only a few of them shall be available when you try to place an order. I had opted for lunch/dinner inclusive and when I complained about why most of the items were missing, the staff laughed and told me that I was free to go and eat outside.  In addition, the taste is not good either.\n\nFurther, most of the staff are freakishly untrained. Particularly those at the reception. They always give a look as if they are ready to wrestle with you. They make it look like they have done a favour by accepting your booking.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Welcome Palace",
      "rating": [
        3.7
      ],
      "address": [
        "Hari Ganga Basak Road, Post Office Chowmuhani, Dhaleswar, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "It was a good experience. Service is good. Food is tasty. There is performance by local artist on every Friday at restaurant. There is no BAR and GYM. No swimming pool as well. Area is prime. Just do Uber and reach Railway station with less then 100 INR. I stayed mostly in Kings beded room which was spacious.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I have mixed reviews for this place.\n\nPros:\n1) The room service staff were kind and responded to requests promptly.\n2) Both restaurants seemed quite popular. We ate in the lower restaurant & the food was good! Highly recommend the paneer tikka. Staff were also very helpful and kind.\n\nCons:\n1) Some weird, damp smell throughout the building, especially in the rooms. Likely due to poor ventilation & the hotel being old.\n2) Rooms are quite dark, especially if you need to keep your curtains closed (no view, or a residence is next to your room).\n3) Toilet needs replacing. Hard to tell if it’s been cleaned… likely just old.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Pro's\n1. Location\n2. Reception behaviour\n\nCon's\n1. Rooms need to renovate, all electric connections came out, bathroom flash is in poor condition\n2. Food quality is not good\n3. Service is not up to the mark\n4. Need to walk long way in the corridor to reach the room\n5. Service persons are greedy for tips",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Food has been served with utmost authenticity. Spices maintained well. Good place to have authentic dishes.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Though the property is a bit old but well maintained. Food is good\nComplementary breakfast is buffet with varieties..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel RAJDHANI",
      "rating": [
        3.8
      ],
      "address": [
        "R7QP+M4C, BK Rd, near Palace Compound, Banamalipur, Indranagar, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "Location is in good area proper town\nwe invited on a party it was on rooftop arrangements and decoration was very great\nprice of snacks starter n dinner was little bit high\nrest all was good\nthere is. no parking area for all you have keep your bikes on roadside.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I had the pleasure of having dinner at Hotel Rajdhani and it was a delightful experience. The ambiance of the restaurant was fantastic, providing a comfortable and inviting atmosphere. The food served was top-notch, with a wide variety of delicious options to choose from. The dining experience was enjoyable, and the staff was attentive and friendly. The only drawback was that the service was a bit slow, causing some delays in receiving our order. Nonetheless, the overall quality of the food and the pleasant ambiance made it a memorable dining experience.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Well serviced and at heart of Agartala city with all nearby places\n\nRestaurant is also good but less visitors",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "My dugout whenever I visit the city. The staffs are very well behaved, great & prompt service. In house dinning has wide range to offer, good food , good taste. Economic & pocket friendly and located in the centre of the city.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good hotel to stay at Agartala...service and staff are very good...food is excellent... Conveniently located...  Overall a nice place..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Prantik Hotel",
      "rating": [
        3.1
      ],
      "address": [
        "Prantik Hotel Netaji Subhash Road, opposite RCC, Dhaleswar, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "Rooms are not good and not clean.\nStaff behaviour is not good they charge 2000 for 1 night they don't change bedsheet and and there are no protection from mostitque worst experience ever😑",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "First week of every month is the time when I stay here because of official work and it's really budget friendly for a person like me who have a stay of atleast 3-4days every month, though if you book don't expect any kind of levish services here.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Please guys don't go at this hotel. It's very cheap. Service provided hotel. And one of the very important thing we all feel a horror which call ghost genuine activities which is really effective for each and every person who will be coming here..",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "The  rooms here are pretty clean and well furnished. The staff here are very professional and very approachable. The hotel meal gives home like taste.\nToilets are clean. AC, Guizer, TV, Fan everything is there and they are working very well I can say this coz I've been to this hotel almost like 10-12 times.\nOverall its a very nice place to stay in with your friends families and even alone also. Hope this helps Kudos!",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Rooms are dirty.\nMosquitos hampers the most, even the great All Out also fails in front of those mighty mosquito warriors. Had to battle all night with them instead of sleep.\nLocation was good but condition of the hotel needs a major improvement.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Rimi International",
      "rating": [
        4.5
      ],
      "address": [
        "Maharaja Bir Bikram Sarani, Shiv Nagar, Dhaleswar, Agartala, Tripura 799007, India"
      ],
      "reviews": [
        {
          "text": "Wide variety of food choices ranging from Continental, to English and Indian cuisines as well as coffee and other beverages. The best thing I like about their food is the quantity, one plate is generally sufficient for two.... Also their food presentations are beautiful. The staff are very cordial and helpful",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent Place to stay in Agartala! Rooms are clean and hotel is well managed. Staffs are professional. Only issue was with their restaurant and its waiting time. So,  4.5star out of 5.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Foods are really good and tasty. Rooms are as per the standard of the hotel. Service is good too",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very unprofessional organization. They never paid our balance payment against machines supplied for absolutely no reason. Later stopped responding our calls/msg. Think 100 times if any supplier want to deal with Rimi International. Worst",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "During my visit to Hotel Rimi International, I had the pleasure of trying both the dum biriyani and mixed biriyani for dinner. The food preparation and quality were commendable, although I wouldn't describe it as excellent. The dum biriyani, in particular, had a spiciness level that was slightly higher than expected. In terms of cost, I found the restaurant to be a bit pricier compared to other dining options in Agartala. However, I would still recommend giving it a try to form your own opinion.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Woodland Park",
      "rating": [
        3.6
      ],
      "address": [
        "Math Chowmuhani, Jail Ashram Rd, Shiv Nagar, Indranagar, Agartala, Tripura 799001, India"
      ],
      "reviews": [
        {
          "text": "Very Dirty rooms. Unhygienic practices. Above average service. Food was okay, but breakfast was very bad. This hotel absolutely reminded me of the hotel from the hotel California song. Absolutely Unhygienic is the name of the game here.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Good hotel. Very much livable. Room lights, LED bulbs are a little bit too dim. Can increase the brightness for senior citizens - elevate mood. Difficult to read fine letters.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I recently went to Hotel Woodland Park in Agartala for a conference and had a pleasant experience overall. The food was delicious, offering a wide variety of options that catered to different tastes. The ambiance of the hotel was cozy and inviting, creating a comfortable atmosphere throughout my stay. The staff provided excellent service, ensuring that all my needs were met promptly and with a friendly attitude.\n\nHowever, there were a few areas that could use some improvement. I noticed some minor issues with the interior furniture, which appeared slightly worn or outdated. Additionally, there was a broken glass table top in one of the common areas, which could be hazardous if not addressed promptly.\n\nDespite these small concerns, I thoroughly enjoyed my time at Hotel Woodland Park. The positives, such as the fantastic food, welcoming ambiance, and attentive service, outweighed the minor drawbacks. I would gladly recommend this hotel to others and would consider staying here again in the future.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I recently went there and I stayed there for two nights . The staffs were so much good and friendly, they have done everything to meet my satisfaction . But the rooms were not so much well cleaned and the furniture was tourned out but overall it was a good for me . the main thing I didn't liked about it was the breakfast , in the breakfast there were less variety of food so i would prefer to please increase the variety of foods. the charges are very much high for such a small room there's no swimming pool nor any gym or any kind of extra necessities so I wouldr\nRecommend to please work in this things . Although my 2night stay was good and upto my satisfaction",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Overall good but the room rent is a little bit on the higher side.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    }
  ]
}