{
  "places_with_reviews": [
    {
      "name": "NOCCi Residency",
      "rating": [
        4.4
      ],
      "address": [
        "NOCCi Business Park Bampada, Artung, Balia, Chhanpur, Odisha 756056, India"
      ],
      "reviews": [
        {
          "text": "Food is excellent here. You can opt for pool side dining to enhance your experience but avoid in summer. Service could be better and the road to reach the location needs to be better as well.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "There are two categorie rooms including breakfast:\n\n1) Deluxe - 3600 ( only twin bed no king size is available )\n2) Executive  - 4100\n\nthey are expanding and there is large space and hospitality was very nice and staff is welcoming. This is located 3km away from the main highway which is good. Wifi facility available. good parking space and nice view.\n\nFew rectifications\n- No tap in my room but it is available in other rooms .Only shower is available in my room.\n-  It is surrounded by industrial area( CONCOR). Mostly industry people stay there.\n- Complimentary Breakfast was not good. No good service and food was not hot , tasty ( Poori Sabji,Vada, Dosa, Idli, Dhalia, Egg, Chicken).\n- A fountain type swimming pool which is of no use for adult\n- No lift facility.\n\nOverall it was nice stay. The reception staff are very cordial and the location is  inside though but ambiance is good.\nWith family it would be of nice stay. lot of space for having a walk and for the kids to play.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Neat and clean property. Food is really good, less oily and healthy. Food price is is pocket friendly.  I went there twice. If you are traveling by road you can use it also a your rest point. Washrooms are also very clean and hygiene.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Best Hotel in Balasore wihtr a Swimming pool  food was good we vivist Balasore on Business regularly  this is the best location",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I had visited there in the year 2018. Then after yesterday I visited there on the purpose of EXPO. But the bad feeling was that can't find that NOCCI which was in year 2018 ,the beauty, services, maintenance etc..\nSo immediate maintenance is required.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "HOTEL NILADRI INN",
      "rating": [
        4.8
      ],
      "address": [
        "Bhimpura, Infront of reliance petrol pump, Kalidaspur, Balia, Balasore, Baleshwar, Odisha 756019, India"
      ],
      "reviews": [
        {
          "text": "I am extremely happy and satisfied with the arrangement made by the hotel. Staffs are extremely well mannered,specially the manager Sekhar sir! I arranged lunch for my ring ceremony. The quality of food and service was very good. I have no words to express my gratitude and satisfaction for making the event successful. I recommend this place for organising any event like birthday party, seminar, ring ceremony etc.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Just attended a birthday day party there. The small hall was adequate and well lighted and decorated.\nLocation is amidst conjusted bazar although the hotel has it's own parking space.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Stay at hotel was neat,comfortable and pleasant. Staff was highly courteous and humble. Breakfast was fresh and delicious. Stay here is highly recommended. Management and staff deserve a big thank you.\nDr Ramakant Chaturvedi\nBharatpur Rajasthan",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "It was a pleasant and hassle free experience at Niladri. We organised our son's first birthday party this December and they took care of everything with utmost quality and care. Special thanks to the Manager - Sekhar for arranging all items and courteously coordinating the event.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Rooms are very good and all premises are very clean. A girl manager in restaurant was exceptionally good for hospitality profession. Despite being very professional. May God bless her.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "HOTEL STARWAY",
      "rating": [
        4.2
      ],
      "address": [
        "Remuna golei circle, Sidheswar Colony, Kalidaspur, Balia, Balasore, Saraswatipur, Odisha 756019, India"
      ],
      "reviews": [
        {
          "text": "While on our way to Bhubaneswar, we found this hotel just to left side of the National Highway. The location is very convenient and they also have a car parking facility.\nThe room was very neat and clean, and all the basic amenities were provided.\nThe staff behaviour was also excellent and we loved staying for a night here. The food was also tasty which they prepare in their in house restaurant.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I had an overnight stop here on my way north, the hotel is very conveniently located.\n\nThe rooms at the back are further away from the highway and are more quiet and peaceful.\n\nThe staff is very helpful and courteous, good job 👍\n\nThe rooms are clean, well maintained and spacious. There is plenty of hot water and the shower is very well equipped.\n\nThe food is on a rather pricey side, but it was fresh and tasty.\n\nThe parking is safe and secure with ample space for two wheeler as well as four wheeler.\n\nI would definitely recommend staying here for a transit or a day or two.\n\nHope this helps 🙏",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Its just beside the NH16 and a great place to stay. Food served by own restaurant is added advantage. If you are looking for nice and cozy experience stay during your travel or just to explore places this is a recommended place. If you need local transportation for visiting they will arrange it for you and save your time and headache. Staffs are very courteous and rooms are well maintained with great service",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had a delightful overnight stay at Hotel Starway which is just beside NH16. The staff went above and beyond to ensure our comfort, offering excellent services and quality food. The complimentary breakfast was a delicious bonus, making our short stay truly enjoyable. Highly recommend for a restful night during your travels.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Visited this hotel thru one of friends who told me about this property. Hotel having good and big room's. As from my opinion you didn't get this type of room size in a basic price. They won't charge you much but they will provide you big and best room's. About staff, very cordial and helpful.\n\nLove to stay here. But only this is missing that is restaurant.\n\nThey are serving basic breakfast to their guests.\n\nPls once visit this property.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Hari Plaza",
      "rating": [
        4.2
      ],
      "address": [
        "O.T. Road, In front of Oriplast, near Laxmi Narayan Swamy Temple, Mallikashpur, Balasore, Meghadambru, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "Hotel Hari Plaza is a stunning venue that exudes charm, elegance, and sophistication, making it the perfect setting for unforgettable weddings and special celebrations. Nestled [provide location details], this exquisite mandap captures the essence of timeless romance, offering a captivating ambiance that leaves a lasting impression on guests.As soon as you step into Mandap, you are greeted by a picturesque landscape adorned with lush greenery, vibrant floral arrangements, and tasteful decor elements that set the stage for a fairy-tale wedding. The mandap itself is a masterpiece of architectural design, featuring intricate detailing, ornate pillars, and opulent drapery that create a sense of grandeur and refinement.What truly sets Hari Plaza apart is its commitment to personalized service and attention to detail. The dedicated staff members go above and beyond to ensure that every aspect of your event is flawlessly executed, from the initial planning stages to the moment you say \"I do.\" Whether you're envisioning an intimate ceremony or a lavish reception, the experienced event coordinators work tirelessly to bring your vision to life, taking care of every last detail with precision and professionalism.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "All staffs are friendly and very much gd service,,The Decoration of the interior is awesome 👍..After all a very good place for marriageparties",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hari plaza is the well know hotel for marriage, official events organisations, Birthday celebration etc. Must visit if you are searching for best hotels in balasore, Odisha.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "An excellent property, very well maintained as well. The service staff are nice, though they lack the training, but made us feel at home. Rooms are spacious, good Internet connectivity, all the amenities of a modern hotel are available. It's a small hotel, only 20 rooms, all are in the first floor.\nBest part of the hotel is it's location, it is inside a business park, so you can step out and have a walk and breathe fresh air whenever you wish. Even one can sit by the pool side and work or chill out.\nOne can take a morning walk in the nearby rural areas, walk through the tribal villages.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice place for wedding and reception party.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Suraj Hotel",
      "rating": [
        3.7
      ],
      "address": [
        "GW37+XHP, Artung, Balia, Balasore, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "We stayed for one night, on our way back from Panchalingeswar to Kharagpur City. We were 3 friends, they provided 2 blankets and 3 pillows on request. One old towel and soap was all for 3 people , even for their suit rooms. The amount was bargainable. Overall services and quality of the room was below average. If you have stayed in government hostels or dharamshalas you won't find any issues. Don't expect good service at a low cost, which is possible for many hotels in the South Indian states.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "If you as a new to balasore, then it is extremely good hotel for lodging.... Staff are well behaved and proper mannered.... They are always gives you nostalgic feeling",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Placed in very good location. Parking facility available. Room is good.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "It's one of the oldest in the city and was counted as a 5star hotel in the past. Close to the bus stand it's been catering a very quality service since a very long time. I have been witnessing since last 35 years. Though there are many new commers present in today's time, but it is still shining 🌟 like the Suraj.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "It has good service and waiter boy is very very good behaviour is very good",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Nishi",
      "rating": [
        3.7
      ],
      "address": [
        "Cinema Bazar, Motigang Rd, Manikhamb, Balasore, Gopalgoan, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "I had the worst experience ever. The rooms are full of dirt. There were beer bottles in the  balcony. The bedsheets gave us skin infection. The sruffs were helpful but the condition of the hotel is so bad that even they could not help it. I won't recommend.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Hotel staff are good they help but rooms are not clean and plenty of mosquito in the night plz provide your guests goodknight and dusting is also needed in the room..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "At the tariffs they provide excellent service.  I booked a single bed room for 2 days (600 per night) and it provided me all the amenities which we can expect in a no frills hotel.\nThey have an in-house restaurant and they also provide room service for dinner and tea.\n\nThe room service guy comes every morning and does a through cleaning. Changes the bedding and towel.\n\nIt is in central area and you get auto at odd hours too.\nOverall I got a great deal with the paltry amount I paid.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Third grade hotel ... Service are too much pricarious won't like to suggest any one ... According to high price service quality is too much poor",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I am happy in first step .... All is okey\n\nGood Staying Idea in Balasore",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Basanta Convention",
      "rating": [
        4.5
      ],
      "address": [
        "Saraswatipur, Artung, Bampada, Balasore, Kuruda, Odisha 756056, India"
      ],
      "reviews": [
        {
          "text": "Outside town limits. Peaceful, Spacious Garden n Food area. Ample space to accommodate Mandap, Reception, Food, Activity, Entry Passage with setbacks.\nAt present day, a huge disadvantage is the access road from Main Road. It's narrow n in horrible condition. Once it is ready it won't have any other glitches.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very decent place for 1-2 nights. Large rooms. Very well made. Great service.\nBreakfast could be better.\nNo hot water",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Basanta Convention is a charming resort situated in a village near Balasore town. Surrounded by stunning scenery, the resort offers a pollution-free atmosphere for a refreshing experience. The spacious, clean, and comfortable rooms, along with well-maintained toilets, enhance the overall stay. Additionally, the expansive outdoor party area, equipped with a sizable stage, provides a beautiful setting for performances and events.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Really nice place And food quality is so nice",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Attended a marriage reception of relative. Very nice place with open garden",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "LN PLAZA (ROYAL PALACE)",
      "rating": [
        4.5
      ],
      "address": [
        "Tamulia bridge OT ROOD, Asha Nagar, Meghadambru, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "Wow! just amazing experience.\n- Very clean property.\n- Staff behaviour very nice.\n- Available all types of food including Veg/Non- Veg in reasonable price.\n- The surroundings are very beautiful.\n- Gorgeous decoration.\n- There is good transportation system.\n- The hotel is located next to the main road\n- You can have dinner at the hotel restaurant.  The restaurant location is really amazing.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellence at its best. Starting right from booking to follow-ups by hotel manager, welcome, location, staff behaviour, accessibility to tourist spots, security, exact room as shown in photos, housekeeping, food, amenities, fare per night, ambience, water supply, complimentary breakfast; I must say this accommodation deserves more than 10 rating. Spot on. Enjoyed the stay overall. Can't even imagine any complaint/issue whatsoever. Call them directly on ph.no. in public view & you can book basis availability (they've 2 categories of rooms, deluxe & suite - suite is bit expensive owing to the extra space of rooms), & pay total fare + water bottle+ food (if availed) only at checkout. I repeat, this LN plaza could not have served me more than they did, fantabulous hospitality !",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Had a great stay.Very cordial staff.Nice food.Peaceful ambience.Having dinner at night on the rooftop,is like a cherry on the cake. Value for money. 👍",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Rooms are comfortable but required maintenance. Food quality and taste is good. Keep it up and all the best",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Overall good hotel with clean rooms and well mannered staff.  Prompt service and good food.  The only drawback is its little noisy because of vehicles passing and also a railway line near by.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "OYO 81150 Hotel Tipsy",
      "rating": [
        3.2
      ],
      "address": [
        "Station Chhaka, Railway Colony, Balasore, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "I have booked this hotel via OYO on December and on January when I came for the Check-In and showing that I have booking for 2 days with full payment paid through online but after showing them all the things they denied to provide me the room instead that they are telling me that they haven't got any confirmation from OYO and showing us lame excuses that they doesn't have recharged Oyo and their Oyo services are closed for long time but I have shown them through new booking process then there they it's showing the same that we can book through Oyo. Repeated the staffs are denying to give me the room and telling me to pay 1200 per day and after long negotiation they came down to 1000 rupees pr/day. No doubt rooms are very good but services are worst. They don't provide any drinking water, no brushes, soap,etc. No housekeeping and no cleaning of room and corridors.\nThey are hunger of making illegal money from the guests. We should file a fir or case against this hotel. In my past 10years of experience of tour this is the first time I'm have faced such a scam. I highly recommended not to book this hotel and thankfully I got my refund from Oyo customer care after long process.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "The most worst hotel staffs that I have ever seen in my 20 years of marketing career. I have booked the one ac room of this hotel via make my trip few days back for from 12th June to  14 th June with full advance payment. But when today I went to the hotel for check in one hotel staff by name Pratap asked for extra  Rs. 300.00 per day whose bill they will not provide. So it is clearly understood that they are making illegal money in this way . Then I have refused and thnx to make my trip for refunding entire money. Please do not book this hotel.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Hotel Tipsy is not all a good place to stay. They charge more than oyo .booking done in oyo is done also payment is done  but hotel tipsy donot have any knowledge of booking. While complaining to oyo customer they keep the phone on hold for 20 mins and disconnect. For a company like oyo it is harrassment to customer. I ll never recommend any body to use oyo and book hotel.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Rooms are clean\nBut the receptionist asked for extra money Rs.580 his behaviour was so bad he was taking rudely after talking to the owner I was able to check in..\nThe owner was a good person and well behaved but the receptionist doesn't have manners..\nThe service was bad they don't even gave us any towel,water bottle, soap etc..\nBut the room was cleaned and the owner was a good human being..",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Service to be improved so people visit repaidly.\nAll senior management behaviour is good.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Lucky International",
      "rating": [
        3.9
      ],
      "address": [
        "V. N marg, Chidiapolo, Balasore, Gopalgoan, Odisha 756001, India"
      ],
      "reviews": [
        {
          "text": "While I can't find the images of this place on my phone, I'll just let people know that this is a great place to organise a get-together or any kind of party like birthday and marriage reception as the place is both cost effective and readily available most of the time with good space and great food.\n\nThere is an underground parking which although isn't very big, the surrounding areas make up for the parking without any hassle for the traffic. Lucky International also has a bar for some party time activities although it is a dine-in and not a club.\n\nThe lower tier rooms are kind of not that great but the suites are absolutely fantastic with faux leather and velvet decoration all round.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I dont like a single food, naam bade darsan chote.for lunch dinner don't go this resturant.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Go n Pay ur Bill To have food in LUCKY international Only to see how UNLUCKY you Are . Worst Ever restaurant Experience in terms of taste .",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel is Located in the middle of the city. Communication to Railway station and Bus stop is difficult.  You don't get a route auto. You have to hire one, which is costly. Rooms are good but the bed mattresses need to be changed. You can have complementary breakfast but they don't provide complimentary water bottle. This needs to change.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Wonderful ambience, and the food test is also very good. They maintain proper hygiene.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}