{
  "places_with_reviews": [
    {
      "name": "Sangam Banquet And Hotel",
      "rating": [
        4.2
      ],
      "address": [
        "Main Rd, above V bazaar, Purani Bazaar, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "I am really happy to write this review. I have been travelling across the india mostly i booked hotel in southern state of india. Recently my brother marriage was there nearby in a village, so I visited the property after i made a booking based on reviews. And surprisingly once i visited at location my mouth was opened , not because i never seen such hotel , but the facility and specially the cleanliness which will be lacking area in north India part . I have booked hotel for my friend stay and they were very happy that such kind of property is there in a tire-3 town . And specially thank to all the staff who were there. They are really friendly and helpful and professional as well . Well behaved and well trained. I would request please do stay here u will like it.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A good hotel with neat and clean room. Staff are very polite, professional in managing things.\nRecommend to opt this hotel for stay in Lakhisarai.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It was a great experience, I accommodated three days here, All services were excellent. Staffs were also helping nature and graceful. The food was also so tasty and joyful.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are top notch for a 3 star hotel. The banquet hall is spacious and looks beautiful when decorated. At present, the best place in Lakhisarai for functions.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Amazing food quality at sangam banquet hall. The food and room service is exceptional. One cannot imagine this level of elegance in a small city like Lakhisarai.  The food was delicious with unique aroma . Staff deployed for room services were respectful and skilled in customer services.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Paras Hotel",
      "rating": [
        4.5
      ],
      "address": [
        "near D.A.V public school, Lakhisarai, Gobind Bigha, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "Good service by R Singh",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Clean Rooms. Excellent staff. Who take care of the guest at every moment.\nFood is delicious.Good location.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nice ambience with good staff service at peak location. Rooms are also with sufficient space.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Rooms are too pretty.\nGood for accommodation. Excellent service by staff.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "very humble staffs and manager are there, i enjoyed my stay  , location was also good. ❤️",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Murari Hotel, Vidyapith Chowk Lakhisarai. (811311)",
      "rating": [
        3.7
      ],
      "address": [
        "Vidyapeeth Chowk Rd, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "The Murari Hotel at Vidyapeeth Chowk in Lakhisarai, Bihar, falls short of expectations. Limited menu options, unclean facilities, and slow service leave much to be desired. Not recommended for a satisfying dining experience.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "All things are not good\nThey don't serve clean food\nMisbehave with everyone",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Vidyapeeth is the only best hotel in Lakhisarai where good food is available.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I would say my experience is below par..This is a old fashioned hotel. Furnitures were old and colour of the wall were in bad condition. However, I was ok with the service. The person who served me was good and clean. Since road near by were dirty it had affect on atmosphere.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Only food is tasty...",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Buddha Residency",
      "rating": [
        4.2
      ],
      "address": [
        "NH-80 Kiul Station, Road, Garhi Bishanpur, Bihar 811310, India"
      ],
      "reviews": [
        {
          "text": "A very good sarvise hotal Buddha residency family restaurant\nA good hotal on main road near to lakhisarai Patna to bhagalpur NH 80 road in Bihar\nThis hotel is clean.location is very good,staff behavior just superb\nAmazing hotel with a  good restaurant. Food quality are very good and available at a affordable price. Cleanliness is well maintained.\nOverall it is amazing",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice pic 😍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very pathetic service, No proper lighting in the room, Air conditioner often remain shut due to electricity, Have to call 100 times for room service, No lift, Bathroom unhygienic and remain pathetic all time. Price too overcharged, unprofessional staff with no dressing code, staff are underage children only .\nOverall ratings should be in negative.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Located on main road. Food was awosome and tasty but you need to have patience as servive was slow",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very good place for marriage ceremony and stays. Location is close to main market and Railway station. Rooms are Top notch without any issues. Price is reasonable too.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Ritu Raj lakhisarai",
      "rating": [
        4.3
      ],
      "address": [
        "Purani Bajar, near, Rani Sati Mandir Rd, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "Very good hotel in lakhisarai near railway station.... I have stay 8 days in this hotel my experience is so good\nThanku 🙏",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "ROOMS ARE NEAT AND CLEAN.\nELECTRICITY IS AVAILABLE ALL THE TIME.\nMANAGER AND STAFF ARE VERY HUMBLE.\nVISIT THIS HOTEL, MAZA AA JAYEGA.\nTAKE REASONABLE MONEY , NOT TOO MUCH COSTLY.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The hotel is in a very good location, not far from the station and the service of the hotel is also good and the hotel staff is very helpful",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best hospitality i ever received in a hotel. Hotel owner was really nice and cooperative with helping nature.i really had no problem of anything here,... highly recommended 💯💯💯💯💯",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It's just a normal hotel. It is a upgraded version of rest house.... There is only one person in staff and he even doesn't know how to talk politely and totaly unaware about hospitality and hotel rules. You can stay here of your own. If you are in hurry thn you can stay here.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Gayatri Inn",
      "rating": [
        4.4
      ],
      "address": [
        "Chotidurga sthan, near purani bazar dharmshala, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "Rude behaviour, they not know how to deal with guest . Not recommended",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's worderful experience with Ccc",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very bad restaurant",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very cool",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice and affordable budget friendly place compared to nearby hotels.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "OYO 85747 Hotel Bhole Shankar",
      "rating": [
        4
      ],
      "address": [
        "Astghatti Chowk, Naya Bazar, Gangta, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "just amazing, staff behaviour and owner behaviour was very good, room washroom was also clean",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Not bad",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Rooms are neat and clean but needs regular cleaning.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very good in service and nature",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Great behaviour & service",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Annapurna",
      "rating": [
        3.8
      ],
      "address": [
        "Main Road, near Bharat Gas Agency, Purani Bazar, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "This is the very best hotel of the city Lakhisarai. The room of the Hotel is neet and clean and very best. This place is best for all types of person and they also provide cheap rent for the people who need room. This hotel is located at Bank of the River quil. And this hotel also provide Parking facility for vehicles like Car and Bike. And they also provide wifi facilities to the customers.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Staff bahavior is not good, even manager has misbehaved. Properly discuss the room fair otherwise they would charge more money then commited earlier by showing hidden cost.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Too good....I like all the service",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Hotel rooms are clean but here one major problem is insects. It's very different to live. You will get insects like lizards everywhere in wholesale quantity. Seriously",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "This is affordable hotel in Lakhisarai. It can be taken on rent for marriage purpose.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel DRS Deluxe",
      "rating": [
        3.6
      ],
      "address": [
        "Hotel DRS Deluxe, Puranibazar, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "budget friendly rooms,good service,okok location 👍🏻",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very good service and room. In this budget what do you want.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Owner Is Greedy Person. They Charge 700 For Non Ac + Taxes And 1500 For Ac Room.  Location Is 2 Km Far Away From Station. There Are Lot More Hotels Available Near Railway Station.  A Good Neat And Clean Dharamshala Is Available Just 50 Mts From Railway Station And They Charge Only 200/-",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Best for night hold",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Ordinary hotel, ac rooms are available. There hardly other options in Lakhisaray. No food available. Staffs are good.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel lakshmi kedarnath rest house and marraige hall",
      "rating": [
        5
      ],
      "address": [
        "Bhardwaj complex, purani bazar, Lakhisarai, Bihar 811311, India"
      ],
      "reviews": [
        {
          "text": "Best place to stay in Lakhisarai\nService was too good",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Best place to celebrate your special day,\nBudget friendly, located in the main market that helps you to get anything easily.\nAll services provided by the hotel owner , very good behaviour.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Good and quite economic. Very cheap.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Best place  in market . Some distance from Lakhisarai station  north side. Best  sevice best work by owner and the all people near related with thing are very good .nice  thanks",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "It's an awesome place, we were there for a marriage reception, birthday party, amazing location on the bhardwaj complex ,purani bazar lakhisarai",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    }
  ]
}