{
  "places_with_reviews": [
    {
      "name": "Mogli Jungle Resort",
      "rating": [
        4.3
      ],
      "address": [
        "Bijharia, Tala, Bandhavgarh, Umaria, Tāla Bandhavgarh, Kuchwahi, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "Mogli jungle resort is one of the best options to stay in the area. The resort is located amidst the wild bamboo plantation. Rooms are moderately spacious and comfortable. Food is great. They even honoured our request for a specially prepared meal with ingredients given by us for a less than a Year old baby. Swimming pool is clean and a great place to hang out. The resort shows map of everyday tiger sightings in all 3 core zones of the tiger reserve.\nAll in all, a great stay and would like to come back again.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beautiful place with absolutely amazing service and food. We stayed there 2 nights and we really enjoyed our time there. Especially the staff was very friendly and helpful! Thank you Mogli for making our stay so memorable ☺️we definitely recommend this place for everyone!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Located very near to Tala Gate of Bandhavgarh National Park, Mogli is one of the best resorts in the area.. It has some lovely Cottages and Log huts. One can opt for meal plan that include all meals. They can arrange private bonfire in one of the many Gazebos within the property at little extra cost and you can enjoy your drinks there.. It was one of the best experiences that we had at the resort. Food is very good and Staff takes care of you well. Don't forget to take your swimming costume if you intent to enjoy the pool..",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Room is really good. Cuisine as well and I relish their tea time cake..its mouthwatering. Recently I & my hubby have celebrated our wood anniversary here. Overall the place it really good. We enjoyed our quality time.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "V.good resort near bhandavgarh national park.\n• Food was delicious. They also gave packed breakfast for morning safari\n• Good and eco-friendly location giving some vibes of natural forest.\n• Good atmosphere\n• Staff was also very polite and respectful.\nRecommended 👍👍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Tiger Trails Resort bandhavgarh",
      "rating": [
        4.3
      ],
      "address": [
        "BANDHAVGARH NATIONAL PARK Village & PO, Tala, Jamunara, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "Tiger trails resort as the name suggests It has a touch of it's beauty surrounded by the wild. The place is amazingly beautiful! When it comes to the rooms...it is very aesthetic and soothing. We loved it!! The food was amazing... Not too spicy, not too bland... Just what we needed to boost up our energy for an adventure. They packed our breakfast for the morning safari and the day we checked out the manager was kind enough to pack us lunch too. The staff was very friendly and their service was great! The place is the right mix of wilderness, luxury and aesthetics. I would definitely recommend this place for whoever is planning to visit.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Spacious rooms and suites with high-quality furnishings and amenities. Rooms may also include private balconies, stunning views, or access to exclusive lounges. Top-notch facilities, culinary excellence, exclusive amenities, and privacy and security. Luxury hotels typically offer high-end amenities such as spas, fine dining, concierge, valet, and 24-hour room service. Elegant and exclusive design. Rooms may feature original art on the walls, windows that open, robes and slippers, adequate storage, hangers, desk, reading chair, safe, good-size flat-screen TV, and coffee maker",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Absolutely wonderful stay here we had, it was three of us including my mom and dad. The manager Mr Mukesh ji is wonderful person and very helpful person. He arranged our pickup from Panna, all the Safaris and drop off to Katni. Overall we did 6 Safaris and everything was handled very professionally and amazingly. The food is great, accommodation is amazing and property is wonderful, super amount of birds on the property, took an amazing photo of the Verditer Flycatcher right from the reception area. Property is very close to Tala Gate and close by to other core areas too. The staff is amazing and everyone seems to be very helpful in every way possible. I highly recommend them and thank you to the hotel staff and Mukesh ji for an amazing stay and experience, I will return for sure. This place is literally gonna be my go to place for Bandhavgadh from now on.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I recently had a fantastic experience at Tiger Trails Resort. The breathtaking surroundings, impeccable service, and luxurious amenities exceeded my expectations. The staff's friendliness and attention to detail made my stay truly memorable. From the well-appointed rooms to the diverse dining options, every aspect contributed to a perfect getaway. I highly recommend Tiger Trails Resort for anyone seeking a blissful retreat in the awesome surroundings of the Jungle in Bandhavgarh.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Located near tala gate, tiger trails is very beautifully managed resort with top class service.\nStaff is very helpful and rooms are equally gr8 too.\nFood here is also amazing.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "MPT White Tiger Forest Lodge, Bandhavgarh",
      "rating": [
        4.6
      ],
      "address": [
        "Village Tala, Post -Tala, Manpur, Distt, Bandhavgarh, Tala, Madhya Pradesh 484664, India"
      ],
      "reviews": [
        {
          "text": "One of the best place to stay when in Bandhavgarh. All staff are courteous and always got prompt service. Rooms are large and with all amenities. Room was clean and linens were fresh. Bathroom is functional and no issues faced. We visited in winter and was provided with room heater and hair dryer.\nWith all food included it's a value for money accommodation. Breakfast, lunch, dinner is all buffet and they consists of enough spread - both vegitarian and non-vegetarian options. They also serve high tea along with some snacks in the evening.\nThe hotel is spread over a large area, so children play area is there and many places to sit and enjoy with family and friends. They have swimming pool as well. We enjoyed our stay there and highly recommended.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Entire experience was very good. The rooms are big, clean and comfortable. Hot water is readily available, fruits and biscuits are always kept in the room, AC, heater, tea making kit, toiletries all satisfactory. Service is excellent. The staff is very friendly, give prompt service and go the extra mile to make you comfortable. Many activities available like badminton and table tennis. Food is excellent, of wide variety, and gives a feeling of home. Kitchen staff is also very helpful. Overall, the stay was amazing.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had a very good experience at MPT White tiger. We stayed for 3 nights. Excellent facilities and services. Special mention to Dhurendra and Abhishek for addressing all the queries we had and also for helping with the gypsy/guide bookings. Food was the best part of our stay here. Everyday there were different dishes prepared and everything was perfectly made. We were traveling with a toddler and all our requests were addressed with a smile.\n\nWe stayed in AC room that could do with a hand of renovation, but all the facilities in the room were working perfectly.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "First of all it's not a lodge it's a resort which is near to Booking office and Tala gate. Rooms are beautiful neat and clean, also huge kids play area.\nStaff is polite and good.\nBest thing is they will serve very good food, breakfast/lunch and dinner.... you will gain at least 2-3 kg in 3 days.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We stayed on 11.01.2024. As soon as we had reached the lodge, the receptionist welcomed us with a great warm and offered juice. We were overwhelmed. The lodge is very decorative. Rooms are very nice with modern facilities. Breakfast, launch ,snacks and dinner are complementary. Food is very delicious. Staff are very cooperative. Fortunately, we saw tiger in the forest. It is a memorable stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Lemon Tree Wildlife Resort Bandhavgarh",
      "rating": [
        4.4
      ],
      "address": [
        "Village Bhijariya, Post: Bandhavgarh (Tala), District Umaria, Bandhavgarh, Jamunara, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "Our stay at Lemon Tree, Bandhavgarh was beautiful and peaceful. It is definitely one of the best hotel in Bandhavgarh, surrounded by lovely forest . The property is Lush green and very clean with spacious room.\nOur special Thanks to the front desk Manager - Nagendra Chauhan. He has been very helpful and kind throughout our stay.\nAnother Thanks to Karan (Restaurant Manager) and his team Ram, Uday Bhan Yadav,Santosh, Rajesh\nChef - Sukhendra, Murli, Sujan who made sure we never missed our food and the food quality was amazing and fresh.  A variety of food was served every single day and we always looked forward to having our meals .\nIt was a wonderful experience 🙏🙏",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Property is located pretty interior, rooms are huge spacious and airy,  good sunlight entering the rooms.\n\nFood quality and taste needs a lot of improvement they serve below their standards\n\nStaff is courteous and helpful",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Located in the buffer zone.... Quite inside from main road.... Near to Tala gate.\n\nHuge, spacious rooms, excellent decor and large washrooms with a private sitting and private outdoor shower too!!\n\nPool and dining area are co located.... But in cool season, there's not much activities to do except to relax indoors.\n\nA big downside is that they don't have a liquor license.... !!\n\nBonfire, some dance or group activities could be organised for  entertainment in evenings!!\n\nDire need of  kids play area to be upgraded or something to keep them engaged!!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Lemon tree Bandhavgarh resort is situated very close to Tala Core Zone in Bandhavgarh. The hotel is spread over 6 acres of lush greenery and has around 33 cottage rooms. The best part of Lemon Tree is the service and the employees who provide this service. Employees of the hotel are very tenured and polite who create a positive bond with guests by sharing their knowledge of Jungle and vicinity which helps to soak in the Bandhavgarh ecosystem. I would like to thank Lemon Tree manager Nagendra Chauhan who helped us from start to end and made sure that our stay was pleasant. He is a customer focused manager who makes sure to understand the needs and support guests throughout. I would  like to thank  Restaurant Manager Karan and his dedicated team- Uday, Ram, Rajesh, Santosh, Sukhendra, Murli and Sujan for catering a wide variety of vegetarian food items. Special thanks to Munim who took care of our transport and entertained us with jungle stories and Ram Niranjan from housekeeping team. Final thanks to Hotel GM Anil for your management. Wishing all the best to Lemon tree Bandhavgarh team.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Our Recent stay at Lemon Tree Wildlife Resort Bandhavgarh was Very peaceful And amazing, It is surrounded by lush green forests and natural Wildlife.The staff of the resort was hardworking and made us breakfast at 5 am in the morning the overall place is worth a shot would totally visit again if we could.\n20 March 2024\nRoom no.102",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Aranyak Resort",
      "rating": [
        4.4
      ],
      "address": [
        "Deori Dol, Bijariya Road, Village Kuchwahi, Bandhavgarh National Park, Tala, Jamunara, Madhya Pradesh 484664, India"
      ],
      "reviews": [
        {
          "text": "Stayed at Aranyak this March,loved the property and staff is very welcoming and makes you feel at home. Milan in dinning hall took special care of us during our stay. We took 3 safaris to park and were able to spot tigers in 2 of them. Between our safaris we took cycled in buffer forest around the property.\n\nRooms are well furnished and rustic, outdoor shower is added bonus. Swimming Pool is good and maintained. They also have a spa.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Amidst the lush jungles of Bandhavgarh, Aranyak was like as a sanctuary of  hospitality and warmth. The culinary delights and comfortable accommodations were an extraordinary element of this retreat.\n\nHaving travelled solo, I was enveloped in a symphony of smiles and genuine care, thanks to Ram and his team. Their tireless efforts ensured that my every need was met with impeccable service and grace. Even the most mundane tasks were transformed into moments of delight by their unwavering kindness.\n\nThe safaris, too, were an unforgettable adventure. Accompanied by Ram, who shared his understanding of the Bandhavgarh wilderness, I understood the majesty of tigers and the tapestry of life that unfolds within this ecosystem. I got to spot them too😁.\n\nThe resort's setting, amidst lush jungle, offered serene walkways that invited leisurely strolls at dawn and dusk. I was delighted by the company of Hunter, a captivating German Shepherd whose playful antics added an unforgettable touch to my experience.\n\nThank you Ram and the team at Aranyak, Bandhavgarh for this memorable stay. I look forward to coming back and reliving this beautiful experience again",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Wonderful food and service from Milan and his staff. The mature garden is lovely, peaceful, and quiet. Great location as a basis for safaris. Rooms could do with some maintenance. Beds are old, worn, and uncomfortable. There is mould on the ceiling.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Stayed for a couple of nights at Aranyak. Loved our stay. Rooms were nice and clean and the open air showers were novel. The food was tasty, and the service was exceptional, with all members taking pains to make our stay comfortable",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We had an amazing experience, one of the best pet friendly resorts in Bandhavgarh. The property offers a wonderful space for retreat and one can easily spend hours wandering peacefully in the resort.\nThe staff is also very accommodating and made our stay quite comfortable.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Syna Tiger Resort - Bandhavgarh National Park",
      "rating": [
        4.4
      ],
      "address": [
        "Tala, Bandhavgarh National Park, Manpur, Umaria, Tala, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "My stay at Syna Resort in Bandhavgarh surpassed all expectations, thanks to their exceptional hospitality and attention to detail. We arrived at the resort much earlier than the usual check-in time of 2 PM, but to our surprise, Mr. Behl, the General Manager, personally welcomed us and ensured a smooth check-in process. This personal touch set the tone for our entire stay.\n\nThroughout our time at Syna, we were greeted with warmth and hospitality from every staff member we encountered. Mr. Manish and Mr. Rishabh at the front desk, along with the entire dining room staff, were exceptionally hospitable and always had cheerful smiles on their faces.\n\nThe property itself is a testament to thoughtful design and meticulous planning. Spread across a vast area, the resort blends seamlessly with its natural surroundings. Our themed cottage was not only spacious but also meticulously serviced multiple times a day, ensuring our comfort and convenience at all times.\n\nDuring our safari adventures, the staff went above and beyond to make our experience memorable. From ensuring our comfort during the safaris to packing delicious food for us to enjoy on our trips, every detail was taken care of with utmost care and professionalism.\n\nAnother unique aspect of Syna Resort is its in-house botanist, Dr. I P Barman, a two-time President's Gold Medal winner. Dr. Barman was not only knowledgeable but also incredibly cordial, taking the time to walk us through his herbal garden and sharing fascinating insights with us.\n\nIn conclusion, our stay at Syna Resort was nothing short of a five-star experience. From the impeccable hospitality to the delicious food and unique experiences, every aspect of our stay exceeded our expectations. I cannot recommend this enchanting retreat highly enough to anyone seeking a luxurious and memorable getaway in Bandhavgarh. We can't wait to return!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It was a wonderful experience staying at Syna. Great cooperation and support. Personal touch by each employee to every detail makes the stay a memorable one. Outstanding food which even small kids could enjoy. One full day we spent only to enjoy the property. We lost out belongings in the cab (cab was organised by the hotel) which brought us back home. Even that was tracked and despatched to us safely. Its been a learning for me to see their GM Bhupendar ji sit outside on a table and keep a close watch on each detailing including milk for children for early morning safari's. Manish ji in the front desk has been a support from the word go to us. If I come back to Bandhavgarh m sure to come to this place again.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's a beautiful resort, spread over an area of 85 acres with some beautifully designed cottages. Really enjoyed my stay at the  property.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Front office people especially ritika is greedy for money …they took 40000 money for basic cottage for two nights and then she was asking 50000 rs more near about 1 lakh for cottage without giving facility for extra bed or family room ... Hotel was so dirty there was no maintenance no hygiene .. not value for money and they didnot offer dinner we travelled such a long distance they were sogreedy and bad ambience that we had to leave at 9 pm",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Worst Hotel in Bandhavgarh.\nThey are liars and they are beg for money. They fool us.\nThey charge extra money for every thing, jungle safari cost only 2000 but by them they mentioned 12000.\nI kindly request please do not prefr This resort.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Tiger's Den Resort",
      "rating": [
        4.5
      ],
      "address": [
        "Bandhavgarh National Park, Tala, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "\"Absolutely phenomenal experience at Tiger's Den Resort! From the moment we arrived, we were greeted with warm hospitality and impeccable service. The resort's lush surroundings provided the perfect backdrop for relaxation and adventure alike. The accommodations were luxurious and comfortable, with attention to every detail. The food was exquisite, offering a delightful blend of local flavors and international cuisine. The highlight of our stay was the thrilling safari experience, where we had the opportunity to witness majestic tigers and other wildlife in their natural habitat. I cannot recommend Tiger's Den Resort enough for an unforgettable getaway filled with nature, luxury, and incredible memories!\"",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I recently had the pleasure of staying at Tiger Den Resort in Bandhavgarh, and my experience was nothing short of fantastic. From the warm and welcoming staff to the beautifully appointed rooms, every aspect of my stay exceeded expectations.\n\nThe rooms were not only aesthetically pleasing but also featured incredibly comfortable beds – a welcome retreat after days of less luxurious sleep elsewhere. The proximity to the National Park gates was a key highlight for me, making it incredibly convenient for my wildlife adventures.\n\nThe pool provided a refreshing escape, even in the cool month of January, and the well-arranged food options showcased a thoughtful culinary experience. What truly stood out was the impeccable service. The staff went above and beyond, with friendly faces checking in on us and ensuring our needs were met.\n\nThe overall ambiance exuded a sense of friendliness and calmness, creating a truly enjoyable atmosphere throughout my stay. Tiger Den Resort left a lasting positive impression, and I highly recommend it for anyone seeking a memorable and comfortable retreat in Bandhavgarh.\n\nA Dutch couple traveling through India.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This is 'the' best place to stay in Bandhavgarh. The hospitality especially is top notch. Amazing infrastructure, delicious food, very courteous staff, and other available facilities make this place really special. The staff really took care of us in every aspect. The chef Rohit made sure that each and every food item gives a unique experience to the guests. We had a great spa session here and spotting a tiger in bandhavgarh made our stay more memorable. Would highly recommend this place.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We recently travelled to Bandhavgarh as a group of families and stayed on a beautiful property surrounded by trees. It was one of the most peaceful locations we have ever been to. The staff members were incredibly supportive and cooperative. Both the management and staff were very helpful and humble. The service was excellent, and the food quality was top-notch. The room service was highly attentive to all our needs. Although we only stayed for a day, our experience was amazing. The resident manager, Shri Tilak Tripathi, was very helpful and easily accessible. We strongly recommend this place to anyone visiting Bandhavgarh.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "It was an amazing and memorable trip for us..we enjoyed to our fullest and would love to recommend people to go and stay in Tiger's Den , Bandhavgarh. Awesome food.. awesome service and awesome gesture 😊",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Nature Heritage Resort, Bandhavgarh",
      "rating": [
        4.3
      ],
      "address": [
        "Railway ORH, Bandhavgarh Tiger Reserve Bandhavgarh, Madhya Pradesh 484664, India"
      ],
      "reviews": [
        {
          "text": "Had stayed in April 4-7’2024. A very nicely located resort but the behavior of the staff was very rude. They served liquor also, they do not have license to store and serve. Do billing without gst number, clearly evading gst despite charging 18% of it. A clear blood sucker.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Really beautiful property, great service and equally tasty food.\n\nThe team is very helpful. Their help in planning and coordinating for your forest trips is precious. It also helps, that the resort is walking distance from the Tala gate at Bandhavgadh.\n\nDefinitely recommend.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "If you are looking for peace and tranquility in Bandhavgarh then give this place a miss! Loud boisterous parties by uncouth people backed by raucous crappy music have reduced this paradise to a place which is simply violating rules and regulations expected from a place situated right next to the Bandhavgarh National Park. The staff are helpless because the property owners have started welcoming uneducated uncouth fools who leave a city to destroy the tranquility of a natural space with their third class behaviour and conduct.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Worst Stinky Rooms with huge insects on bed , blankets and towels. Food very oily and pathetic. Full of red food colour. They don't even provide you with menu card.. and also the staff talks very rudely. Don't go even if someone offers for free.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beautiful location with super awesome services cosy rooms delicious meal . Couldn't find a better place than this .very very amazing experience",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Tree House Hideaway - Bandhavgarh National Park",
      "rating": [
        4.7
      ],
      "address": [
        "Umaria-Badhavgarh Rd, Vijarhia, Rakhi Amodar, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "If I could give this place a 12/10 for service I would. What an incredible crew of people who go above and beyond to take care of you in every way. Truly incredible experience!\n\nRooms are really well done, you are literally in a tree house and each is slightly different based on the tree it’s located near (I loved the hot water bottles in the winter) and have big balconies.\n\nThe food team is incredible and the meals were top notch. We didn’t have the best luck with the safaris but the hotel naturalist did his absolute best.\n\nLocation is amazing since unlike other hotels it’s minutes from one of the main core zone gates!\n\nIf I could I would give it above 5 stars!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Of the 4 rooms we had - 2 were very large new / refurbished while 2 were smaller, older and more “rustic”\n\nThe service is exceptional.  The entire team works in sync to ensure a memorable stay.  Food is wonderful too.  A lot of their produce comes from their own gardens.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very intimate and aesthetically designed treehouses, providing ultimate seclusion and serenity in the surroundings of the lush jungle. Excellent and warm service as well from the staff members all round, with special mention to Raj from the dining and bar area whom graciously took care of all our personalised needs. Food and bar service too was very professional and well prepared, with options galore based on one's dining preferences.\n\nVery memorable stay, enjoyed every moment of our isolation in the wild. Though different than that of African safari lodges, this is truly too a unique experience for those who seek a remote and remarkable experience in the untouched nature of Indian jungles.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This place was the highlight of our 3 week trip. We were here for 4 nights, at first we were concerned that it would be too long especially if it turned out to be a bit unpleasant. Admittedly our concern increased as we continued down smaller and smaller and rougher and rougher roads. We needn't have worried. We loved our treehouse, loved the food, loved the service, loved the park. Didn't want to leave.\nThe staff was great and so friendly, if they couldn't understand our requests they kept trying until they found a way to help us.\nThe food in the restaurant is exceptional. It was table service instead of the usual buffet style we found at other lodges. I don't have an issue with buffet style but this did seem a little more personalized and it was still all you can eat. The serving staff just kept coming back to the table offering more and more food.\nOur treehouse was spacious, immaculate and very nicely furnished. We had a lovely deck overlooking the forest, there was even a fan on the back deck that was very effective at keeping away the bugs. There are two types of treehouse we were told by another guest, older original treehouses and the newer treehouses. They are essentially the same but the older ones have a little more of a \"rustic\" feel. Some guests prefer those feeling they are more true to a treehouse. We had a newer one so I can't compare, but I was very happy with ours. I don't think you can go wrong either way. They are all in a beautiful setting!\nThe lodge is close to the park... there's multiple gates.. the closet one is 10 mins away...the furthest one is 20 mins away.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "When I first arrived at this place I thought wow, this is going to be awesome. Sadly it went downhill from there. Though this place has many positives, one incident in particular has left a sour taste in my mouth. On returning to my room after dinner, I realised my camera bag had been moved and tampered with. Upon inspection I noticed several lenses and a camera body had been moved from their original place in the bag and thrown haphazardly back in. All lenses had the lens caps removed. Naturally my first thought was that something had broken and given I was there on a photographic holiday to take pics of tigers my heart sank. I was furious as the only time this could have happened is when the room attendant came to turn down the bed and deploy the mosquito net while I was at dinner. I immediately reported this to management and explained the situation (my thoughts re what happened was that the room attendant went to move my bag, and as it was open, he spilled the contents. In a panic he hastily and randomly threw the equipment back in). A short time later the manager arrived with the fellow who serviced my room. I once again explained the situation and showed them the state of my bag and equipment inside. The room attendant was asked if he had any idea how this happened. He looked me in the eyes and said no, it was not him. Needless to say I was not amused. I told the manager I did not want anybody in my room (for any reason) for the duration of my stay. He said that would not be a problem. The following day I received a text telling me the room attendant had owned up to spilling the contents of the camera bag as he moved it and in a panic just threw the gear back in. So, the previous night he looked me in the eyes and blatantly lied. I wonder what made him finally confess. So, the next night after dinner I return to my room and sure enough somebody had once again serviced my room after strict instructions not to. I confronted management once again with this. They had the audacity to come up with some half backed meaningless excuse. Obviously, they forgot or just decided to completely ignore my original request. The fact that a staff member had tampered with my gear and then lied about it has left me with a negative memories of this place. Management really needs to step up a gear and staff need to be more honest with guests when issues arise. I would never return to this place given how they lied to my face and ignored my requests. If you stay here, keep your valuables locked up or with you.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Bandhavgarh Meadows",
      "rating": [
        4.3
      ],
      "address": [
        "Village Bijaria, Tala, Bandhavgarh, Jamunara, Madhya Pradesh 484661, India"
      ],
      "reviews": [
        {
          "text": "We stayed 4 nights in a lovely room.Felt like we were in the jungle.\nWe had arranged for 7 safaris, and all went well.\nGreat wildlife and a  fantastic sighting of a Bengal Tiger.\nFood was mainly Indian which we enjoyed.\nVery attentive staff.\nWe would recommend.\nThankyou",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Simply put, their rooms are the Best. We stayed in villa and its huge, clean, old fashioned interior and has a nice sit out in the front. Even the bathrooms are huge. Buffet doesn't have much to offer but the food is home cooked with less oil and spices and tastes great. They charge you for what they offer, don't expect a buffet spread like huge resort chains but what they offer is the best in the category, ask them to prepare a dish in ala carte for you believe me you won't be disappointed. Resort is green, and offers good ambiance after sun sets. Great service, great food, awesome rooms, basically all you need for a peaceful stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "\"Outstanding service and delectable food! From the warm welcome at check-in to the attentive staff throughout our stay, the service at this hotel exceeded our expectations. The food options were diverse and delicious, catering to various palates with fresh, high-quality ingredients. Whether dining in-room or at the hotel restaurant, every meal was a culinary delight. Overall, a truly memorable experience thanks to the impeccable service and delightful dining options.\"",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I recently got chance to explore this property and was fully content n satisfied with the blissful experience... Well managed & maintained.. absolutely perfect ambience n location to b amidst jungle.. peaceful place, felt the serenity at it's best.. Raw jungle experience with all modern amenities.. staff was absolutely courteous.. food was beyond expectations..",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very beautiful and peaceful resort. Beautiful rooms and outdoor. The staff was very friendly. Service was great. Food was top quality and very delicious. Everything was perfect. Loved the trip to bandhavgarh just for the resort.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    }
  ]
}