{
  "places_with_reviews": [
    {
      "name": "White Pearl Beach Resort Agatti",
      "rating": [
        4.7
      ],
      "address": [
        "Airport Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "Beautiful small hotel on the shore overlooking the beach. Activities were well planned and staff were very co-operative and kind. Rooms were clean. Thy can improve on food variety, understand that there is resource constraints as everything needs to be imported. Overall we had a good time.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Had been here in Nov 2021 .. lot of it must have changed with this place now but the location and beauty of this place is something that I would miss ..\nThe hospitality of the people here is top notch , very friendly.\nYou also have access to scuba diving institute which is hardly 100 meters from this location\nThe fish served here is fresh since it’s caught on the boat journeys to different islands , we were able to see huge turtles swimming in the turquoise water during one such trip.\nDinner times are even more splendid as food is served outside with candle lights.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I had the pleasure of staying at your beach resort in Agatti Lakshadweep, and I must say that it was an absolutely incredible experience. The location was simply breathtaking - situated right next to the beach, the views were nothing short of spectacular. The pristine waters and the white sand made for a truly unforgettable experience.\n\nBut what really set this resort apart was the incredible service we received. The staff were simply the sweetest and the most helpful individuals I've ever encountered. They went above and beyond to make sure that our stay was comfortable and enjoyable, and they really took care of us, especially my father\nwho was celebrating his 90th birthday.\n\nThe resort itself was perfect for our family to get close and enjoy each other's company. It provided the perfect setting for us to relax and unwind, and create some wonderful memories together.\n\nOverall, I cannot recommend this resort highly enough. It truly exceeded all of our expectations and provided us with an experience that we will cherish for years to come. Thank you to the entire staff for making our stay such a memorable one. We will definitely be back!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Absolutely Loved the location and the scenic view from the room!! Loved the Welcoming we got from the people here..really nice, peaceful place...just if you wanna enjoy the activities make sure to visit Lakshadweep after Sept to enjoy and explore most of it...\nAlso Absolutely loved the food here...",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I recently had the pleasure of staying at the White Pearl Beach Resort in Agatti in March 2023, and I can honestly say it was an incredible experience that words simply cannot fully capture. From the moment I stepped foot into the resort, I was greeted with warmth and hospitality that made me feel instantly at ease. The rooms at the resort were not only comfortable, but also exquisitely designed. The attention to detail was impeccable, and I found myself spending many evenings on the balcony, enjoying the gentle breeze and taking in the breathtaking view. One of the highlights of my stay was the exceptional culinary experience. The resort offered a wide variety of delectable dishes, ranging from local specialties to North and South Indian cuisines, all available in separate vegetarian and non-vegetarian buffets. Each meal was a delightful journey of flavors, and I found myself eagerly looking forward to the next dining experience. The resort's water sports center added an exhilarating element to my stay. From thrilling diving and snorkeling adventures to kayaking and stand-up paddleboarding, there was no shortage of adrenaline-pumping activities to choose from. Exploring the nearby islands, such as Bangaram sand bank, Thinnakara, and Kalpitti, was a mind-blowing experience that left me in awe of the natural beauty surrounding the resort. I must also commend the staff at White Pearl Beach Resort for their exceptional service. The team was not only polite and courteous but also went above and beyond to ensure that all guests had a memorable stay. It was impressive to see a resort that not only had chefs from various parts of India but also embraced the local culinary traditions. This unique blend of talent resulted in delightful meals that truly showcased the diversity of Indian cuisine. Moreover, the cleanliness and maintenance of the rooms were impeccable, reflecting the resort's commitment to providing a top-notch experience for its guests. I have no hesitation in recommending White Pearl Beach Resort to others looking for a remarkable and unforgettable getaway. In conclusion, my stay at White Pearl Beach Resort was an absolute delight. The well-designed rooms, the perfect evening ambiance on the balcony, the exceptional food, and the thrilling water sports activities all contributed to an unforgettable experience. With its polite and helpful staff, clean and well-maintained rooms, and diverse culinary offerings, this resort surpassed all expectations. I wholeheartedly suggest this resort to others without any doubt.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Kasims Beach Villa",
      "rating": [
        4.4
      ],
      "address": [
        "Airport Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "Very nice sea facing cottages with private beach. All the meals served were very good and fresh.Hospitality was good.\nOnly issue we faced was the regular use water in rooms were salty.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very horrible experience for charging 8000 per day ,no water heater we even found insects on beds gol has to check these though staff are friendly and location is good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It is currently managed by GoL Travels and the resort is now known as \"Agatti Beach Villa\". It was a great experience for us.  We stayed here for 4 days in April. Here is my detailed review.\n\nLocation:\nThe location is outstanding. I mean, you can't ask for more. You literally stay between two beaches on either side of your room. Just walk 50 feet & 100 feet on either side to reach to the pristine beaches.\n\nRooms:\nRooms are neat and clean. They have a tap in front of every room, so that you can wash your legs before entering your room. This may seem a small facility, but it's very useful to keep your room clean.\n\nStaff:\nHidayat & Saffwah will win your heart with their polite and helpful attitude. All other staff members are extremely well behaved and polite.\n\nOther arrangements:\nOur other island visits, scuba diving, other water sports activities, all were arranged and well coordinated by the staff members.\n\nThank you for giving us a memorable stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Horrible food experience for charging ₹8000 per day needs GoL needs improvement in it staff are very friendly\nRooms are pathetic no water heater and salty water, good view of beach. Room fan always make noise as it scratches with ceiling.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This resort is now acquired by GOL Travel and renamed as Agatti Beach Villa. Location of this property is excellent but that is only you get after paying an exorbitant price 8k per night including food which is below average quality. Hospitality was very poor due to untrained staff. You have to ask for everything from welcome drink to evening tea. GOL Travels never stated things clearly about what all included in the package. They hesitated giving reply to your queries in writing on email and insisted on talking through WhatsApp. I come to know through another group that you get better price if negotiate with them but your booking can also be canceled at last moment if they get someone ready to pay higher price.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Seashells Resort Agatti",
      "rating": [
        4.5
      ],
      "address": [
        "airport road, near airport opposite airport, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "One of the best properties on agati. It has  own beach where you can sleep without worries. Also hospitality is too good. You can see 2 different types of beach in the same location. If you travel to Lakshadweep this is the best option",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Highly recommended resort in laxdweep agatti island.its very near from airport,good rooms,meals are homely, wonderful views of sunset and sunrise.friendly and warm staff. Don't expect high end resort services. It's basic amenities are sufficient enough to survive. Location and sea is very clean and serene highly recommended",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nice stay, beaches on the both sides, nice view and ambience. Rooms are clean and well maintained. Veg food could have been better but it doesn’t affect the overall experience. The staff is very helpful and friendly. Thanks Team Seashells Resort Agatti",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We travelled to Agati(Lakshadweep) in group of 11people and stayed at sea shell, the property is located in a good place with both sides covered by sea. Which means you can see both sun rise and sun set from your rooms. Only room 107-109 have good view rest of the rooms are not well lit.\n\nThe resort is not at all maintained there is no power backup and if there is power cut you literally suffocate in those room, no water pressure in any taps in the bath room and by the way no hot water for bath.\n\nKitchen service is pathetic, the kitchen staff are in their own zen world they are least interested in doing their job, they don't understand the customer needs irrespective of whatever language you communicate to them\nThe kitchen is run with only two persons and they don't bother to cook enough based on the number of guests checked in, we had to struggle to get enough food and this happened for 3meals.\n\nPlease plan your trip such that there are no local festival around because that's the standard excuse you get that man power is not available due to festival be it water activities or ground we were left with no water in the resort for couple of hours because the guys were not there in the resort.\n\nIt's only worth the location and nothing else, better explore other places\n\n,",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Location excellent. Rooms are good but can be better maintained. Services is to improve.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Agatti Beach Resorts",
      "rating": [
        4.6
      ],
      "address": [
        "R5JH+FX8, Unnamed Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "One star cuz the location is amazing, the service really is horrible, the manager just doesnt care. Choose this if you just need a room to stay without food, water, service .",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The place is surrounded four sides by sea and boating from one Island to another in sea was thrilling.Calm and quiet place.Neat and clean. Responsible local people who are against polluting the sea and surroundings. Tourists are guests and well treated.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very nice and beautiful place",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice & cool",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Beautiful",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Red Corals Beach Resort Agatti",
      "rating": [
        4.5
      ],
      "address": [
        "Airport Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "Please read up about agatti island before you get here (the island can be covered on foot and has a population of only about 7000 people) Once here, this is a really good place to be at. Very basic but one of the better places here.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We stayed at Red Corals Beach resort in Nov,22 for 4nights. Property location is the best & unique. As you step out from cottages you have  connections with Eastern & western both side of beach to enjoy. Absolutely serene & beautiful. Hospitality of caretaker & Property owner is very good. Food is simple but delicious, clean & well maintained property. I would completely suggest to to explore this property if you plan to take a stay at Agatti island. Thanks Sameer for giving us best stay & well planned entire tour package which suits our requirements.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very nice experience. We stayed there for 7 days and it felt like another home. Food was simple and delicious. Caretaker abubakar was very friendly. Highly recommended for people who are planning to visit agatti for a vacation.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "A beautiful resort located closest to Agatti Airport. Has all the amenities. What a view from the view....mesmerizing. Owner is a great host and takes keen interest. Recommended.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Beautiful location, amazing rooms, delicious foods and the friendliest staff. I've been planning to visit Lakshadweep for so many years and I'm so glad I traveled with them. Recommended for any type of travelers. Families, solo or couples. I'm definitely coming again",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Coral Paradise Beach Resort",
      "rating": [
        4.4
      ],
      "address": [
        "Airport Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "This place provides simple facilities, decent meals, and standard services, perfect for a short stay during your island hopping. Its prime location right by the beach compensates beautifully for any shortcomings, offering a natural charm that enhances the overall experience.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great location, great people.\nWe went as family trip and it was perfect. Everyone enjoyed.\nBest part is the location - very close to airport and clear blue water on both sides of the resort.\nAnd the people there - they do everything to make you feel comfortable. Shoutout to Noor, Naufal and the chefs Syed and Mohammed.\nDate of visit - 2023 Aug-Sep",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Amazing experience. Their level of service to make us feel comfortable is to be experienced to believe it!! Family and kids loved it. An excellent stay, good food and lots of fun!! Stay here to experience it first hand. Highly recommended!!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Resort is good. You cannot expect a stellar hotel experience there. There are limited resources in the island. But the people are good and the view from the resort is breathtaking. Hospitality is great. Amirkka(resort manager) was really helpful. It’s definitely one of the best options available in the island.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the beautiful resorts facing the beach which also fits in the budget in Agatti island.\n\nThe resort is near the airport building and can be transferred within 5 minutes. The main USP of this resort is its location views and staff.\n\nThe staff are so courteous that they treat us really like Attithi Devo Bhavo. The rooms are basic which is the case in all of the Laccadives. The resort guys have a snorkelling kit for us to enjoy free snorkelling sessions in front of our house.\n\nWonderful place and highly recommended for staff, food and views.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Coraline Beach Resort",
      "rating": [
        4.9
      ],
      "address": [
        "Island, Airport Road, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "1. Good place and value for money.\n2. Tap Water is good, but slightly salty due to costal place.\n3. Food is simple, but do not expect 24 hrs service. The cook and care taker leave at night.\n4. Beach near the resort is dead coral line. So you cannot swim, but once tide goes low, you can walk till the end and watch marine creatures and corals.\n5. Being eastern side gives you fantastic view of sun and moon rise.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Beautiful ambience with scenic beauty.  Hospitality and the management is superb.  Staffs are very much cooperative and helpful. I will visit again and again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Nice rooms, friendly staff, good simple food, and amazing location.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Beach just facing the rooms is the best but dead coral in front is a bit of obstruction to enjoy direct sea water. Otherwise rooms are nice, food is good service is ok.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Must visit lakshadweep",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "White Sand Beach Holiday Home",
      "rating": [
        4.8
      ],
      "address": [
        "behind Police Station, Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "Absolutely Loved the location and the scenic view from the room!! Loved the Welcoming we got from the people here..really nice, peaceful place...just if you wanna enjoy the activities make sure to visit Lakshadweep after Sept to enjoy and explore most of it...\nAlso Absolutely loved the food here...\n\nRooms: Rooms were very clean.\n\nNearby activities: Please visit after September to enjoy and explore most of the activities\n\nWalkability: Enjoyed walking by the beach to enjoy the peaceful surrounding and hear only the sounds of the waves and winds.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very congenial people with warm hospitable spirit and bang on the beach location .. AC TV and basic facilities are included: beach house style stay where you can walk bare feet into the mesmerising blue waters all day\n\nOr simply enjoy the sounds n breeze of ocean laying in hammock under coconut trees..\n\nFood is simple rice vegetables and fish/chicken, very healthy and all meals are taken care of\n\nMuthar, the guide, is fairly conversant in Hindi and English and provides insight into history and culture of this island.\n\nHighly recommend it if you want to unwind and have a laid back vacation away from noise crowds and tension",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "One of the best resort at Agathi. Good amenities, very clean rooms, best people to help us in this remotest area. Timelines and efforts to make the stay memorable. Very reasonably priced. You can't have a better choice at Agathi than White Sands beach resort .",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Awaited trip...finally end...2sec distance beach from your room...only and only blue water....excellent lagoon side....thank you altaf for giving me this memorable experiance to my family. Muhtar- Fantastic manager... taha....he become friend to my children....4 days not at all sufficient....7days minimum....then only come....altaf have good plans....ammati scuba...made my son comfortable for scuba.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very nice Hotel. location of Hotel is mind blowing.\nIts near to crystal clear water beach on both left and right at 50m distance. Hotel staff is so cooperative. Food and Hospitality is too nice. All site scene, sports activity and guide arrangement was very nice. Really we enjoyed the real beauty and nature of LAKSHDWEEP through White Sand beach hotel",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Wundervoll Resort",
      "rating": [
        4.7
      ],
      "address": [
        "Agatti, Kerala 682553, India"
      ],
      "reviews": [
        {
          "text": "Love the hospitality,Resort located just besides the Arabian sea with oceanic view. Food quality was not upto the mark.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "No wifi, no daily cleaning,",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Wow, my stay at this resort was absolutely amazing! i am satisfied their good service",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Awesome place and people i met ever😍😍🥰",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Best customer support",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Turtle Nest Resort",
      "rating": [
        4.8
      ],
      "address": [
        "Agatti, Lakshadweep 682553, India"
      ],
      "reviews": [
        {
          "text": "Nice people and good hospitality, we did scuba and it was amazing experience and with nominal charges",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Nice service, best beach view\nI love it.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    }
  ]
}