{
  "places_with_reviews": [
    {
      "name": "Prathamesh Resorts Khed Shivapur",
      "rating": [
        4.4
      ],
      "address": [
        "Sr. No. 205, At Post Salwade , Tal. Bhor, near Khedshivapur Toll Plaza, Pune, Maharashtra 412205, India"
      ],
      "reviews": [
        {
          "text": "The location is a good place if you come by private transport. Uber accessibility is poor. The place has all necessary activities even if your not staying both for kids and adults.we came as 2 adults and 7 Yr old, had a blast. The breakfast was okay types , however the lunch was yummy.\n\nOver all a recommended place for it ambience,  activities,  good food , good service. We came during off season so the rush was minimum.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Was there for company outing. Approch road from highway is in bad condition. It's crowded place. Lots of people opts for day package. Decent activities, zip line was good. Lunch was below average in taste. We stayed in rooms in front of small pool but it was not filled with water, disappointed. Evening snack is okayish.\nDecent dinner.\nOverall average place to visit.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Went for 1 day outing (11.30 to 6.30). My package included Lunch and HiTea. Place wasn't crowded much. No waiting time for any activity. Food was also great. 5-6 hours is enough to explore all activities and spend some time in swimming pool. Good for outing with family and friends. Approach road from highway is not that good as it passes through villages.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Indoor games are not maintained.\nFood taste was not good.\nRestaurant is always dirty. Every time I have to look for a clean table.\nStaff is really good. Polite & helpful.\nGarden & swiming pool are good.\n\nReaching to the resort from highway is a task. Rough road and if traffic is jam then you will stuck for an hour or more.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The location is isolated and it is difficult to drive if 2 vehicles come face to face on a single lane road during the last 3 km of the road.\n\nThe activities are average and food was not up to the mark, not sure if it was due to the weekday.\n\nThe best part is the zip line but it is allowed only 1 time, since it was a less crowded day they allowed to do it multiple times, nice gesture from their team. They have football and cricket too but you will need more members to play and enjoy them.\n\nOverall a fine experience for a day at 1200 per head cost.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Vansrushti Agro Tourism Resort",
      "rating": [
        4.5
      ],
      "address": [
        "velha road, grampanchayat office towards forest nursary, road, opposite to malegaon, Malegaon, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "I recently visited the place and i was disappointed with the rooms. I was in wood rooms where balcony opens to the water side. Bad mattresses which were noisy and the springs would irritate and poke the person. Cleanliness however was top notch location was clean spic n span. Pool was clean, rain dance area was clean and they also provide speakers to play music. The food is village like and tasty but also not too heavy, however the only challenge is if u r not spice and chilli friendly u may go hungry. Otherwise they have plenty of open areas for recreation, badminton rackets tt table etc… had the mattress been better the experience would have been good. Also in the evening musquitoes spoilt the mood, so please keep odomos handy",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Beautiful well maintained property in close proximity of Pune just 45 min drive. This place is perfect for group of people, families get together. Loads of indoor and outdoor options withdraw lovely homely cooked veg and non vegetarian options. You can visit gunjvane Dam and baneshwar temple nearby.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good place for family outings. staff, food, cleanliness all good. Owners involvement is cherry on top.  Little bit strict with their rules and regulations but thats ok. We enjoyed our stay.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Amazing place, we enjoyed a lot. Food is delicious. Clean and tidy rooms.must visit place with family and friends.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Our day picnic turned into stay because we just loved the food..! Definitely good place to recommend.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Marath Mavla - Mutton Bhakri",
      "rating": [
        4.1
      ],
      "address": [
        "Pune - Satara Rd, near Nasrapur, Highway, Kamthadi, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "Amazing test. We tried mutton thali which test is  just an amazing and price is pocket friendly. Worth for money. No compromise with Quality and Quantity. Must try solkadi here.\n\nBiryani is Okay not much tasty\n\nVintage theme. Seating arrangement is just like baithak\n\nThis place is cosy.\n\nThis place is on Pune - Satara Highway",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The Mutton thalis served here are really worth it and also has reasonable prices if we compare taste, quality and quantity of food. Has a different sitting style of vintage Marathi culture, also there are several options for veg people. Sitting area is spacious enough to accomodate many individuals. Located just aside of NH4 and has good amount of parking space",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "A beautiful place with a different kind of seating arrangement, the short benches do look a little uncomfortable and difficult to sit but once you sit down it is very relaxing, the food is quite tasty, a wide range of food and named based on different Maratha army ranks and positions. You can order as per your capacity as some thalis can be very big and filling. We had very light food because of our travel but the mutton was very tasty, we'll cooked and flavor full. Would definitely recommend. Worth a try.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We stopped by this hotel on our way back to Pune. They mainly serve thalis, so we ordered the mutton thali and the Maharashtrian Vej thali. The mutton thali was delicious, as recommended by my friends, but the Vej thali was just okay. It had akhha masoor, paneer sabji with roti, and dal rice. The paneer wasn't soft and seemed stale. The ambience was nice, and the place wasn't too crowded. The service was good too. Overall, I didn't enjoy the Vej thali much, but I would recommend trying their non-veg thali. You can give this place a visit.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Yummy kalla mutton and chicken chicken can make a profound impression on you. Nice and quick  service. It's an opportunity for you to enjoy the peaceful atmosphere. The Any thali if your order for a single person is unlimited.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Baneshwar Agri Tourism One Day Picnic Spot near Pune,Hurda Party pune",
      "rating": [
        4.2
      ],
      "address": [
        "91 Baneshwar vasti,Nasrapur gaon, near, Baneshwar Temple Access Road, pune, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "Baneshwar agri tourism is the best agri tourism for hurda party near pune.\n\nBaneshwar Agro Tourism is local agro tourism in Pune. They've organised various activities to show you the culture and food within the city.\n\nEnjoy the beauty of Nature with Singing Birds, Fresh Air, Delicious Organic Veg Food, cooked by handpicked vegetables directly from their Farm.\n\nBaneshwar has been designed keeping your physical and mental well-being in mind.\n\nBaneshwar Agro Tourism can also offer transportation to and from any of these tours as per your request.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A nice place to visit in any season. Feels cool in summer too. Baneshwar is a place which has many attractions mandir (temple), birds chirping, good constructed van-udyan, play areas for children , veggie farms, a place for open eating, a small adventure park and a waterfall too (which of course can be seen only in good season)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Loved the place lots of games to play indoor outdoor games",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Pretty decent place for a weekend holiday drive. Easy to get to with friendly locals.\nWear trekking boots as some of the paths are slippery during the rainy season...I don't think this place is much when the river is dry.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A good place to visit with family. But has time constraint being followed strictly, which is 8:30 to 17:30. We were there at 17:40 and missed the opportunity to have fun at waterfall, as entry was denied. So be cautious of time.\nSpacious parking is available.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Vedanta Resort (Ved Farm)",
      "rating": [
        4.4
      ],
      "address": [
        "At, Kelawade, Maharashtra 412205, India"
      ],
      "reviews": [
        {
          "text": "The trip was great and the staff was also quite friendly, the cleaning was also up to the mark couldn’t have asked for more.\n\nThank you for the wonderful stay. Hoping to visit again. The breakfast was also good and villa was neat and clean.\n\nThe plunge pool is better than expected. The garden area is well lit at night which makes it very lively. We have enjoyed lot with family, Cleanliness is up to the the mark, caretaker Raja is extremely helpful went out of the way to make our stay comfortable.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Overall the location of property is very good, it is surrounded by a Farms where we had a good time.The property pictures shared with us beforehand were absolutely accurate. We went there with our family for a special occasion and had a great time. The team made special beautiful arrangements with the decor and made us feel special. The property has several facilities such as a swimming pool, barbecue arrangements, Indoor Games so there is very less likelihood of someone getting bored even if you went alone.\nFood quantity was fantastic and fresh.drumstick soup was amezing. Chicken & Mutton was perfectly cooked.\n\nBest place to visit on weekends as it's hardly 25-30 Km from Pune City.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Location is very nice.\nService is equally good.\nVery nice place to get relaxed yourself form your hectic schedule.\nFood would also get 4.5 out of 5.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best place if you planning out night stay near Pune with your near dear and friends..Foods are amazing whether it's breakfast..Lunch. Dine....this place is having Swimming pool..Garden view and 3 Types of Rooms to stay.Rooms are neat clean and Hygeine...Property is very well mainten by Owner...Lastly thanks to Prathamesh and Aniket for their overall management .They Sell what they tell.:)",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great place for group visits. Good food, clean rooms, area is also nice. Not too far from Pune.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Palette - Prathmesh Resorts",
      "rating": [
        4.7
      ],
      "address": [
        "Bhor, Shivaganga Nadikathi, PRATHAMESH RESORTS, Khed Shivapur, Varve Bk, Maharashtra 412205, India"
      ],
      "reviews": [
        {
          "text": "Very good adventure and water park, clean, good and safe rides.\nPlenty of open space with trees and greenery makes it perfect place for elderly people as well. Food is also good.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Awesome place... Enjoyed a lot 👍\nMust visit place and highly recommend🤗",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Amazing place for a day's trip..good place even for night stay.. Staff is very cooperative\n\nI am sure you all would enjoy to the fullest.. the amenities and activities will keep you busy the whole day..\n\nA nice place to chill with friends and family 😍",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very professional service. Polite and co operative staff. All games are very safe. We enjoyed a lot... Thanks.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice service outdoors adventure games good and relax enjoying the one day trip. Thank you🙏",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Jagtap mala",
      "rating": [
        4.2
      ],
      "address": [
        "Chintamani, Back side of Hotel, Pune - Satara Rd, Kelawade, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "Loved the food and the service.☺️\nWill be visiting again to experience more.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice experience. Good food and ambience. Good for family, kids & elderly also. Had dinner there. Thanks.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Food quality and quantity is good. Service also good.  Atmosphere and greenery well maintained",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The best restaurant I visited ever the gharguti style flavour must must try and also their chicken tandoori... I strongly recommend",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ambience is good, Food also good service was fast although we could not their non veg item bur surely will try next time. In veg their paneer chilly was good, sev bhaji was also very good.\nIts little inside from highway you can’t see the premises from the road there is a approach road to get in. Once you get in there is lot of parking space available.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Rainforest resort & lawns",
      "rating": [
        3.8
      ],
      "address": [
        "SH65, Nasrapur, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "Place is very cool For Night Wedding hall loance.and The Hall Area is Better and The dinner Area is Okey.but Toilets & Bathroom is so Dirty and Not  water in the Bathroom no clean. Outside area is not okey.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good place for marriage...\nBut garden stage not in middle,is one sided , looking odd..\nParking area sufficient..\nMain road touch lawns",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Under construction opening will be on 10th May",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Hall is very nice but\nSpeciaous Parking is not available..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's a cost effective and good place for family functions and marriage easy to reach just a parking is not enough all.\nOver all it have a hall\nBig lawns and decorations..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Collection O Orchard Resort Hotel Pune",
      "rating": [
        3.1
      ],
      "address": [
        "Pune-Satara Highway Village Kelawade, 5 kms ahead of KhedShivapur Toll Plaza. Near Reliance Petrol Pump Tal:, Dist:, Bhor, Pune, Maharashtra 412213, India"
      ],
      "reviews": [
        {
          "text": "This is a fraud resort. They give ordered food from outside and the surrounding is so terrifying and horrifying. It looks like we are living in graveyard. This is not a resort in working condition. The water is so dirty and the indoor games are not like they show in pictures. No one lives there in there and drunken people live there. Very bad experience don't go. Looks like some haunted shadow lives there.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "My first visit was almost a year ago. It was okay then. Yesterday's was second. The place has deteriorated significantly beyond anybody's imagination.\n\nSwimming pool is full of garbage and dead insects. Water in pool is inadequate too.\n\nThe place is in shambles. It lacks cleanliness and maintenance. The staff are least bothered and one needs to demand for service.\n\nThe rooms are infested with frogs and insects. Some rooms have broken doors. The bathrooms smell and some of them don't even have water supply.\n\nIt will be an unpardonable sin visiting here with family. There are no words to describe how ugly this place has become.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "We had planned for the weekend night stay at this resort.\nThe place is located in a very deserted area which is completely not safe at night. The rooms were also not up to the mark.. water supply was not proper. The staff was less due to which it was maintained properly.\nNot recommended for couples.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "1) They take time to allot a room for you even though you have a pre-paid booking. Until then you have to wait at the reception with your luggage.\n2) Rooms are not hygienic/clean. You may get ugly bedsheets and comforters. Even though you call multiple times to change them, they won't respond.\n3) Even though If you paid for a room with 3 adults, one should be sleeping on the floor. Because they are not going to provide any extra mattress.\n4) You may also get a room with open window with no curtain to disturb your privacy. I have never seen such a wonderful facility at any hotel in my entire life. People will be clearly visible from outside.\n5) For any help, you can contact them. But you will never get any response. I have called them multiple time for an issue with lock and key. They didn't even come and check.\n\nI would have given ZERO rating if Google allow me, I had a worst experience with this stay and the worst staff who doesn't even respond for any problem. Attached the images for reference.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Ekdm bakwas resort..total waste of money.free me dega koi to bhi mat jana.This  resort is not in working condition.swimming pool water is so dirty.all water is green in slimming pool.slides are also dirty.you can see garbage all over.and the indoor games are not like they show in pictures.on all games there is garbage.if you want to ride it you have to clean it yourself.Very bad experience don't go.rooms also are very dirty.u cant see bathroom it's yuckkk...you will get frog in bathroom.water smells very bad in bathroom.they can't provide you enough bisleri water also.a small fridge in room that 1 also is very dirty.you can see maggots in fridge.AC also not working.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "Teakwood Forest Resort and Camp",
      "rating": [
        4.3
      ],
      "address": [
        "S. No. 38, Malegaon-Salawade Road, Bhor, Pune, Didghar, Maharashtra 412205, India"
      ],
      "reviews": [
        {
          "text": "Being here was one of the rarest times when we were close to nature. It was a beautiful experience. The resort is amazing and well maintained. Staff is very polite, food is great, accomodation is homely & neat. Planned activities are really exciting and thrilling. Great place🙌",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Visited this resort with office colleagues for team building. It was a great experience. The owner Vivek was very helpful. Location was great. The place is well maintained. Had so much of fun. The team building program was also engaging. We all really enjoyed the team building activities. Thanks to the staff as well who helped and served us a delicious food. Overall it was nice experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A very personalized experience and a memorable adventure in countryside living. Nothing short in comfort levels, instead the exotic environment was a great change in rejuvenating energy levels. It lightened the mood, in fact, one of my great escapes away from the monotonous urban routine. Thank you team Teakwood.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Had an awesome weekend at this place. Best place for corporate outing, family get-together.\nRooms are very spacious and Clean. Food is excellent.\nDo visit this serene place to enjoy your weekend to the fullest 😍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Visited over the weekend with my friends and had a wonderfully peaceful time. The views are absolutely scenic, making it the perfect spot for spending quality time with your group. The rooms and washrooms were spacious and impeccably clean. The staff, were incredibly cooperative and helpful. Plus, the food was delicious!\n\nThis resort seamlessly blends luxury, adventure, and eco-consciousness. If you're seeking a rejuvenating nature getaway, this place is truly magical. I can't wait to return!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    }
  ]
}