{
  "places_with_reviews": [
    {
      "name": "Mandiri",
      "rating": [
        4.1
      ],
      "address": [
        "Parunglesang, Jl. RE. Kosasih, Banjar, Kec. Banjar, Kota Banjar, Jawa Barat 46311, Indonesia"
      ],
      "reviews": [
        {
          "text": "Cheap.... but dirty in places. Economy rooms have no air conditioning.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Can stay here if you benighted ot the road to Pangandaran.....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "There's hot shower is a plus but very weak stream of water. Buffet style breakfast is a plus. No wifi but cell phone provider coverage are quite strong.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Service and amenities are so-so for the price offered. But one of the best option we can have in Banjar area. One room for two, but usable for three, just need to pay extra fee for breakfast in the resto area (25k). Unfortunately there are impolite guests here and there. Smoking in front of our room and talking loudly, until I have to tell them to go.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Proper place for short time stay especially for goods distributors, overnight stay etc. It has rather cheap rate and proportional facilities such as hot water shower and mini restaurant. Guests may make their own hot drinks with hot water dispenser provided in the main lobby.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Penginapan Cisaga Indah",
      "rating": [
        4.4
      ],
      "address": [
        "Jl. Raya Cisaga No.295, Dusun Cimanggu, Cisaga, Kec. Cisaga, Kabupaten Ciamis, Jawa Barat 46386, Indonesia"
      ],
      "reviews": [
        {
          "text": "Nowhere was written, that hotel has only smokers rooms. The smell was terrible, but we had already booked it. We tried to get our money back, but they did not give a refund. We drove away.\n\nIf you are a non smoker, or you don't like rooms, where you can only smell cigarettes, then this is not a hotel for you.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good place",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Affordable, quite comfortable, there is a swimming pool, quite large parking in the back area, near the market, square and mosque. Maybe what needs to be improved is the AC (not cold enough) and the water heater (running out of warm water on the 1st floor).\n\nOverall, recommended 👍",
          "languageCode": "en-US",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Banjar Indah Hotel",
      "rating": [
        4.1
      ],
      "address": [
        "Jl. Kantor Pos No.200, Hegarsari, Kec. Banjar, Kota Banjar, Jawa Barat 46321, Indonesia"
      ],
      "reviews": [
        {
          "text": "although it is a hotel in a small city its a good hotel to stay for a few days, i have stayed here twice, the first impression when i came was good bcs the rooms looks like a classic old hotel, but the maintenance back then (2021) wasnt that good, a few places has dust here and there and i cant play the tv, the wifi wasnt that good too, but the second time i came it was allclean, I can play the tv and the wifi connects well! i just want to give some advice on the food, it is a bit salty, hope you can fix it.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Tamatabi 20190106\nI am Traveller by bicycle.\nI could not stay this Hotel.\nBecause regular room is 500Rp.\nIt is very expensive for me.\nBut it is easy to find this Hotel.\nGood trip",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "as a one star hotel,it has an \"okay\" service and hospitality..but the maintenance and the equipment,especially in the bathroom,are bad and a lot of things are broken (we cannot use it)",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Simple, clean, with good amenities, familiar, courteous and helpful services, in the heart of town. Recommended pick while in Banjar.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Clean, strategic location but way too pricey. Mahal , ga sesuai dg service :)",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Galuh Sehati Hotel",
      "rating": [
        4.3
      ],
      "address": [
        "Jl. Brigjen Moh. Isa,Sh No.111, Purwaharja, Kec. Purwaharja, Kota Banjar, Jawa Barat 46331, Indonesia"
      ],
      "reviews": [
        {
          "text": "Good choice for affordable hotel room",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "average but acceptable",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel DHD syariah",
      "rating": [
        4.9
      ],
      "address": [
        "Purwaharja, Banjar City, West Java 46331, Indonesia"
      ],
      "reviews": [
        {
          "text": "Looking good and nice place to relax",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Cozy and confortable..",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Cozy place to stay",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Recommend Hotel",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "I had a great experience of 6D5N staying in this hotel. The staff are very helpful to the point of being able to help prepare my child's MPASI, the hotel is clean, wifi is ok & there is a smart TV. Food is decent. Maybe if you go to Banjar you will stay here again",
          "languageCode": "en-US",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Rumah Poppy Dharsono Guest House",
      "rating": [
        4.4
      ],
      "address": [
        "Jl. Kewadanaan No.12 A, Banjar, Kec. Banjar, Kota Banjar, Jawa Barat 46311, Indonesia"
      ],
      "reviews": [
        {
          "text": "It's been more than 20 years for me (during my commute to the city), to find this hidden gem... I'll be back soon.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hotel is very beautiful and quiet. And the stuff is very kindly.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Cozy, warm, nice people, good bfast and good service..",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Experience of staying here exceeds expectations, like a hidden gem in Banjar.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's ok",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Family",
      "rating": [
        3.7
      ],
      "address": [
        "Jl. Letjen Suwarto No.179, Hegarsari, Kec. Banjar, Kota Banjar, Jawa Barat 46311, Indonesia"
      ],
      "reviews": [
        {
          "text": "A very simple room,humid,not clean, cockroach walking in the room.its too expensive for what it is.the best thing:it s close to the railway station",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Quite nice hotel in small city like Banjar.\nLocated in the central of the city, this hotel is easy to reached.\nI stayed for a night on their executive room for 380k (breakfast included). Little bit pricey, honestly, even though they offer spacious room and spacious bathroom with hot water.\nBut in other side, the room was clean, towel and bed also nice.\nThe only problem was their WiFi only good",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Tamatabi 20190106\nI am Traveller by bicycle.\nRegular room is 200Rp.\nRoom is not good and dark.\nThen I didn't stay this Hotel.\nIt's easy to find this Hotel.\nGood trip.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "HOTEL FAMILY",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "HOTEL ARROW",
      "rating": [
        4.4
      ],
      "address": [
        "JGMM+RQR, Jl. RE. Kosasih, Banjar, Kec. Banjar, Kota Banjar, Jawa Barat 46311, Indonesia"
      ],
      "reviews": [
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Strategic hotel, affordable prices, good service...recommended for those who want to unwind from long journeys...",
          "languageCode": "en-US",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Clean comfortable price friendly stay....",
          "languageCode": "en-US",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The place is comfortable, clean, good service. Coffee is provided too. Recommendation for those looking for a cheap hotel in the Banjar area",
          "languageCode": "en-US",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I want to order for Monday, is it possible or not, to rest for a while",
          "languageCode": "en-US",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "RedDoorz @ Cisaga",
      "rating": [
        4.2
      ],
      "address": [
        "Jalan Raya No.295, Mekarmukti, Kec. Cisaga, Kabupaten Ciamis, Jawa Barat 46386, Indonesia"
      ],
      "reviews": [
        {
          "text": "A budget hotel in roadside location.  Spacious parking in the rear building, even though looks little in front. Clean room and bathroom. No breakfast in the restaurant and no coffee-tea & kettle in the room. A friendly service. I got water problem but it was fixed soon. For budget class hotel, it is quite good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Not bad",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ok budged hotel...",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Be careful, there are CCTV fraudsters. \"Agus Triono Carim\" he cheats and extorts consumers using cash and other methods.",
          "languageCode": "en-US",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms are OK. Service is OK. Suitable for a stopover or overnight stay.",
          "languageCode": "en-US",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "SPOT ON 2488 Villa Tirta Melati Syariah",
      "rating": [
        3.7
      ],
      "address": [
        "152, Gg. Soun No.147, Banjar, Kec. Banjar, Jawa Barat, 46311, Indonesia"
      ],
      "reviews": [
        {
          "text": "SCAM. Owner uses apps to sell rooms then asks for extra payments. Other reviewers tell same story CAUTION. Dishonest guy who behaves friendly to steal. Rooms damp with leaking plumbing. Swimming pool used as fish farm. Rats....",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "In general,\n- T4 is quite quiet, because it is in a residential complex, so in the afternoon you usually meet local residents,\n- Mr. Haji is friendly,\n- price can be negotiated,,\n- the room has AC,\n- t4 sleep like at home.,\n- Access is a bit of a hallway, but you can walk in\n- Access anywhere, deck,\n- Currently the pond has become a fish pond, it's okay so there's entertainment.\n- If you go to Banjar again, definitely stay here.\n- there is a kitchen for cooking yourself",
          "languageCode": "en-US",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A bit of good advice is to always check the cleanliness level of the toilet, for rooms that are very good according to standards. And maybe because OYO takes a really long time, the booking and payment process doesn't go directly into the partner system, so I have to wait until there is verification that the payment has been received. To the owner, Mr. Hj really cares, thank you, Mr. Hj",
          "languageCode": "en-US",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This pandemic rarely makes people stay here, so yesterday it was a bit quiet. There is a pool but it has turned into a fish pond. There are many choices of rooms from non-AC to AC. The service is good, friendly. The toilet water is clean. Close to the mosque, although inside. Strategically located in the center of Banjar City.",
          "languageCode": "en-US",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Thank God the place is comfortable and cool, it's just like the swimming pool has become a fish pond because of the effects of the pandemic, right? Booking using NgOYO is really annoying, thank you, Mr. Hjny, when I've booked, there's no notification yet.",
          "languageCode": "en-US",
          "rating": [
            3.7
          ]
        }
      ]
    }
  ]
}