{
  "places_with_reviews": [
    {
      "name": "Hotel Saptarshi",
      "rating": [
        4.1
      ],
      "address": [
        "63HH+RXC, Lal Bazar Rd, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "My review is just average. I booked room no 106 from 25th February to 27th February. I accidentally booked this hotel as my mother fall ill while going to Purulia and had to cut short our trip  Stay here. The best part of my stay - meeting \"Bhairav da\" and getting his brilliant service all the time. Without his service I would give 1 rating in my stay. Mr Swarup all helpful and courteous . The room is avg . Wifi also not working properly. Food is just okay and very High price . 200 rs for Veg chowmin ridiculous and 2 medium pc of chilcken for Rs 200.\nDuring our 3 day free breakfast - Ask any guy how much food We take ( less than Bare minimum ). Today surprisingly The old fat manager at reception ( with Moustache and glass ) asked me rudely how many of you in the room as I was having 2 plates - 1 having 1 Vada + 1 idli and 2nd having 2 sweets. This can be asked politely. And most of all don't ask me - your job to find how many staying and that also someone carrying food his sick mother. my mother felt so insulted She did eat anything. Even during payment his behaviourwas arrogant and cold. I could give him a good treatment but I maintain my patience and decency. Put your arrogance at home you are at hospitality industry. 2nd person is an old guy for room service ( having a swollen part at his head) . My mother asked  - \" apnara Chap karen sandhe bela as Chap is very famous here \". With arrogance he replied \" eto boro hotel e chap hoy naki \" with a mockery. He  is big mouth old man doing a small job since 1990's . If you like you hotel to flourish and not to lost in competition take care of these guys as Behaviour is most important in hotel business. Ask any your stuff My behaviour - you lost a customer and many like me on the way",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent food. Nice and comfortable rooms. Polite and prompt services offered by the staffs (would definitely like to mention people like Mr.Kartick Roy and others).\nOverall experience was very good and would definitely try to revisit .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms are good, service is good. Location is also good. Food quality is also good. I love the decoration. It's simple & decent. Booking process is genuine and gentle.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "This is by far the best hotel in Bankura. The service is top notch. Mr. kartik is very helpful and cooperative. You can rely on on him if you are visiting the property.\nThe property is located in the heart of Bankura and everything is accessible from here.\nThe cleanliness of the rooms, the food quality everything is just perfect to the point. So, if you are in Bankura do visit this property and I am sure you wont regret.\nCheers! 🥂",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Room ambience is good & also food quality is very good. I used to stay in this hotel every month for official purpose & mainly I like their services specially Mr. Kartik Da.( Kaka)",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Hilton",
      "rating": [
        4.2
      ],
      "address": [
        "Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Great hotel 🏨 great service, great food. One of the great hotel I visit. Very clean rooms, price is also pocket friendly. Food is great. And service is just mind blowing 🤯👍👍👍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Staffs are very well behaved.Continental food is very good.\nMy suggestion to the management of the hotel is just to increase the number of staff specially at restaurant.\nBasin outlet in the bathroom should be covered upto the drainage point.\nOtherwise it's very good.\nThanks",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had a wonderful time at the restaurant with our family. The ambiance was great, and the service was excellent. However, we were a bit disappointed with the chili chicken; it didn't meet our expectations. Despite that, everything else on the menu was delicious, and we enjoyed our overall dining experience.😍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It's the good place to have a  dinner with your loved ones. It is also a nice place for family DINE-IN. The interior is very beautiful and eye pleasing.\n\nI haven't explored much of their menu but I just loved their Chicken kosha. I have just fallen in love with it.\n\nService is nice. Price is little upside but the price matches with the ambiance and quality that they provide.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Best kind of stay at Bankura. Hotel staff and owner is way more comfortable to approach.  Food menu is affordable. I travel half of Bengal and can say this is one of the best I have ever stayed.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Rajmahal",
      "rating": [
        4
      ],
      "address": [
        "Station Road, Lalbazar, Block 3, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Good budget hotel. Neet & clean room. 10 minute walking distance from Bankura railway station. Free wifi available. Fooding facility is available only at night. Manager and staff are very good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Haunted hotel in bankura...no balcony...no light around the hotel after evening....but nearest tea shop is awesome... everyone must try👍",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Best place to stay in Bankura, it is near the BANKURA railway station 5 mins walk from the hotel , and bus er also available. Rooms are clean and comfortable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel is very good and comfortable their service.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel location is very nice. Good receptionist asish.\nStaff behaviour is well",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Priyadarsini",
      "rating": [
        4
      ],
      "address": [
        "School Danga, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "The room was spacious and spotless, with all the amenities I needed. The staff were incredibly friendly and attentive, ensuring a fantastic experience from start to finish. The dining options were delicious, and the hotel's amenities were top-notch. I highly recommend Hotel Priyadarsini.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Overall, the ambience and rooms of the hotel is good enough and location is also very good. Sewerage system in the bathroom found ridiculous.\n\nTV is useless as not a single Bengali popular channel is working as they are paid channel and no paid channel is subscribed by the hotel authority.\n\nNot all breakfast items are available by 9.00 a.m. as mentioned in the menu card. Only egg toast is available. After 9.30 or 10 a.m. there is no point of having breakfast.\n\nQuantity of food of some items are quite less.\n\nService of Bikram Das is good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Spacious clean rooms, reasonable rates. The road infront is wide enough for two 4 wheelers to pass. Staffs are good, service is also good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Service was fantastic.\nStaff was very welcoming .\nAnd stay was really comfortable.\nStaff such as Chinmoy and Gobindo and were really helpful and comforting",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotels room are perfect but require update bathroom fittings. Hot & Cold water mixing, hand shower to be fixing.\nService boy service was excellent mainly Chinmoy service staff.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Debarshi",
      "rating": [
        4.1
      ],
      "address": [
        "Lal Bazar Rd, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Rooms ar excellent.but as of now lift service is not available..They have promised to open lift service in the upcoming 6 months.\nThe staffs are well behaved and friendly\nThis hotel is an good option for staying with prices being average compared to  other hotels providing  same space and comfort",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The rooms were clean. Spacious room. No lift service available . Well connected. Sofa , small tables were provided.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good service, clean and clear rooms, meeting hall etc. Specially food quality is very good and like home made.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The hotel is basically very clean.. but specially their every room, bed and bathroom is very clean.. hotel service is very good.. also extra advantage is their hotel food which I found very delicious..",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The location of the hotel is perfect, Rooms are not spacious, service is excellent, behaviour of all the staff are very attractive.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "OYO 47055 Mayaban Village",
      "rating": [
        4.1
      ],
      "address": [
        "Bikna Station Rd, Mobarakpur, West Bengal 722155, India"
      ],
      "reviews": [
        {
          "text": "Excellent experience. Hotel Staffs are very active and their behavior is very polite, specially Sourav. He is very good at his work. Manager Mahadev Roy is also very modest and cooperative. Hotel atmosphere is very neat & clean.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's very good place to stay...... Best in service..... Kashinath, he is the best person in this hotel....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very nice hotel. Nice ambiance. Staffs are very good. Nice experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good ambience,very cooperative staff...food quality and service is excellent.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice & clean hotel.\nFive starts for the best staff. 👏🏻👏🏻👏🏻👏🏻",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "OYO Hotel 65035 Maa Laxmi Lodge",
      "rating": [
        3.6
      ],
      "address": [
        "Bus Stand, Thek, Bankura, Ailakundi P, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Very Bad Experience.\n1. Extra Charge\n2. Very Conservative Room\n3. No Wi- Fi\n4.No Ac\n5. Too Darty .\n6. Nothing Facility Available those mention in OYO application.\n7 .Mosquito",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very much disappointed with the room quality and service. Rooms were dirty, condom packets were left in bunker. Unhygienic untidy bathroom commode. Feminine hygiene Blood spots marks in walls.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I stayed here for one day and I liked the hotel very much, the reception staff was very nice, they helped me a lot and the service boy is also very helpful.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very good hotel and also staff behaviour is so good and parking is awesome 👍",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Bad service (this room Price - 1300)",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Iman Kalyan",
      "rating": [
        3.9
      ],
      "address": [
        "63GF+WQ3, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Value for money. Hotel stuffs & Owner behaviour is very good and friendly in nature. Moreover you can enjoy homely atmosphere.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "This is a fine property but neglected by owners. No upkeep. Cleanliness is a big issue. Bathrooms have no shower heads. The entire place needs repair and painting. No closets. The halls are used for weddings, receptions and dinner and money spinned in busy seasons. No geyser anywhere for hot water. Lack of interest by owners other than getting money is visible. Not recommended unless renovated.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Near Bankura rail station and reasonable rates",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "We booked this lodge for our wedding and everything went well. The rooms are good. They have good number of AC rooms and AC Hall. Regular cleaning of rooms happens. The Owner is very helpful and not money minded. Upon request he offered rooms for guest without any extra charge. I would recommend this lodge for family vacations and occasions. This lodge is very near to Bankura Railway Station and well connected to all parts in the city.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is a small Lodge near Bankura railway station. I must say it is not well maintained. Bathroom condition is very poor. Stains are everywhere. Condition of mug and bucket is very bad. One plus point is it is located near the station and have conference or meeting room. Entry view is good enough. But cleanliness is not here. Authority must take care about it. It is a budget lodge.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Sidhu Kanu Guest House",
      "rating": [
        4.6
      ],
      "address": [
        "62WX+658, Nutanchati Rd, Paddapukur Palli, Bankura, West Bengal 722101, India"
      ],
      "reviews": [
        {
          "text": "Recently we arranged a get together for my mom's university friends and accommodation was arranged in this place. The rooms are nice and comfortable. The staffs are polite and prompt. Food was okay. Overall good experience.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "It's a wonderful experience of staying at Sidhu Kanu guest house. The best part of the stay is service and you will never feel away from home. Rooms are fine with all necessary things to make your stay a comfortable and lovely one. Come and enjoy the hospitality.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Room is very clean.Toilet is also very clean. Food is also good & is like home preparation.It is AC room though it was not used being winter.Corridor is covered and also fitted with 5 new split ac. Ambience is very good. Service is very good. All staffs are well behaved & friendly. They are very helpful.Recption is also guding for tour which was also very valuable & helpful. Awsome. All should stay here while staying in Bankura. Room rent is very easonable.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "One of the best place for staying. Staffs are very friendly and humble . Decent atmosphere. Food quality is also good. If you want to stay in a home environment, this is the place.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "One of the best guest house in bankura. I had been there in many occasions. Homely atmosphere, behaviour of staffs also great, ample parking area. Halls, rooms, lobbies are well decorated and spacious as well. I strongly recommend.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Aheli & Restaurant",
      "rating": [
        3.6
      ],
      "address": [
        "GOBINDANAGAR BUS STAND, Bankura, West Bengal 722102, India"
      ],
      "reviews": [
        {
          "text": "We have taken 3 non AC room. Two out of them was not having lock in the washroom. No steps taken after after informing the staffs. Cleanliness and hygiene was not maintained.\nThe rooms were too small where only a couple can stay but not for family at all.Yet they have cost 1250 per day.\n\nI will not recommend this place to anyone.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "The worst restaurant I have ever experienced. The food I ordered through swiggy from this garbage restaurant, and they send me 30 rupees food for which I paid 135 rupees. Please dont fool people, they give their hard earned money so they deserve some good quantity and quality food even they order online.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Ordered mixed noodles from this place. Taste was good. Fresh and proper taste. Not spicy.\nNov, 2023- ordered mixed fried rice (Schezwan) taste is good. Love it.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Food was good and tasty 😋",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "It's located near Gobindanagar Bus stand. Food quality is okay. Thali systems of food during lunch hours are really good. Service and staff behaviour is very much appreciable. Desserts are good. Ambience is also fine. Indeed U can have a decent lunch/dinner here at decent prices...",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    }
  ]
}