{
  "places_with_reviews": [
    {
      "name": "Hotel Utsav Banswara",
      "rating": [
        4.3
      ],
      "address": [
        "Udaipur-Dungarpur Link Road, near Maharana Pratap Circle, Wadiya Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "We stayed here during a wedding and the overall experience was excellent. All meals served were fantastic - I personally was very happy with the food, great taste and not very spicy also. Even the housekeeping team was very helpful. I truly enjoyed my short stay at Banswara because of the stay here. Highly recommended!! :)",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nicely treated at hotel with decent stay and delicious food items. Very humble staff. Owner is also very good and oriented to provide good facility within premises.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "So it's a once a month visit for me at restaurant, breakfast hours are very lazed out staff , least bothered they are to serve. But main meal hours are well served and tasty meals",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This review is for their restaurant.\n\nThe food tastes good, jain food available too. We had Jain food only and it was very good.\nThe ambience is nice.\nThe staff is also cheerful and good.\nQuick service, didn't take hours to get our food on the plate.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The food was really wow. Restaurant is neat and clean. Staffs behaviour is good. I personally enjoyed the food.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Relax Inn",
      "rating": [
        4
      ],
      "address": [
        "Udaipur Road, Banswara, 17, Shiv Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "We have used Relax inn hotel for almost everything.\nRooms - Best rooms with nice facilities.\nThe new building has better rooms than the old one.\nFood -\nBest in banswara still. The chef is a magical guy. He knows what he is cooking.\nI still miss the malai kofta and veg lollipop from this place.\nHall-\nWe used it for a mini function and all our requirements were met for 50 people.\nGarden-\nBig garden for all the functions you want -150 people\nOverall a one stop place for everything.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Service was good but as a stranger unable to identify who are in service but sab iske bina bhi ho gya time se it is a good experience to have a coffee there.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Near to heart of city, hygienic place and environment, quality food and amenities, reasonable rates, friendly and cooperative staff, best stay for family and business personnel, you can consider as first choice for stay in Banswara.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The restaurant is good. The food is average but good. The ambience is very nice.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel Relax Inn Banswara. The tagline \"Pride of Banswara\" seems to be fitting based on your description of the hotel. The fact that the rooms were very neat and clean indicates that the hotel prioritizes cleanliness and provides a comfortable environment for its guests.\n\nFast service is always a plus, and it's great that the hotel's restaurant offers delicious food. The fact that people from far away come to dine there is a testament to the quality of the food. Additionally, the positive mention of the hotel's bakery suggests that they offer tasty baked goods as well.\n\nLastly, the rates for returning customers are quite economical, which implies that the hotel values its loyal customers and provides them with affordable pricing.\n\nOverall, it seems like Hotel Relax Inn Banswara has a lot to offer in terms of cleanliness, prompt service, delicious food, and reasonable rates. It sounds like a place worth considering for anyone visiting Banswara.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Landmark - Best Hotel In Banswara",
      "rating": [
        4.2
      ],
      "address": [
        "Dungarpur Road, opp. Coco Petrol Pump, Wadiya Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "Services of this hotel is very good. Staff behave is also very good. Food Service is awesome. A variety of food is served in a plate for only ₹150.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Best quality food osum food test only Rs 150",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very poor experience. We initially saw the room and then booked a room verbally. He didn't told us that without payment they will not keep room as booked. But when we again arrived at hotel with luggage he told the room you booked was given to someone else.\n\nPlease try another room. We have no choice except to stay in that hotel. Because we have a function in the evening at hotel itself. Never trust the owner of the hotel. They will never co-operate. Very bad experience.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Really a best hotel. Very spacious rooms. We fell in love with the dal of their hotel.\n\nThe only minus point was the little parking space. Apart from that everything was good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Bathrooms are not clean. Rooms are average. Breakfast service is slow.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Surya Palace",
      "rating": [
        3.9
      ],
      "address": [
        "HC3X+37M, Nai Abadi, Banswara, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "This is good location because it's nearby bus stand. Hotel is old but cleaning and staff are good...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "nice place..... I check in there only ...when i go to banswara.....",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Surya Palace is a good hotel, providing delicious food at good price. Services are so good but rooms are average.\nTheir Check out timing is 24 hours from check in.( so please keep in your mind for before early check in. )",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Due to official work, I had to stay in hotel for approx 2 weeks.\nHotel is near busstand and very well approachable.\nStay was comfortable.\nRooms were good.\nFood available in Anand dining hall, attached was also good.\nStaff of restaurant and Ramsingh ji at reception made sure that no discomfort happened to us.\nThanks.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are  not clean properly,  conjusted  room, more than tarrif",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "The Imperial Hotel & Restaurant",
      "rating": [
        4.6
      ],
      "address": [
        "Opp Indian Oil Petrol Pump, Maharana Prataap Circle, Road, Akshardham, Housing Board, Udaipur, Banswara, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "It’s an excellent place to stay in Banswara.. The Hygiene is excellent & food is mind blowing.. I can’t expect such food & hygiene in Tier-3 Town.. Amazing & Looking forward to see you again with such great Taste & Hospitality..👍👍",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The stay was full of inconvenience. ACs were not working, Staff was incapable and impolite in managing the issues, the food taste was under average, the Breakfast Buffet comprised only 3 items.\n\nSpecial mentioning of their Staff Kalpesh. I complained him of AC not working at 2:30 am, after hearing my issue, he did not bother to solve it. He hanged up the phone. After waiting for an hour that he would take an action, I had to go downstairs to ask him for a different room. He was in deep sleep, phone receiver was kept aside so that I should not bother him in sleep.\n\nIt was a terrible stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "\"The hotel's culinary offerings exceeded my expectations. The diverse menu showcased a fusion of flavors, and each dish was expertly crafted with attention to detail. The presentation was impressive, and the quality of ingredients was evident. The attentive staff and inviting ambiance added to the overall delightful dining experience. Highly recommended for those seeking a culinary treat during their stay.\"",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Food is delicious but Pathetic Service. We visited the restaurant for dinner and wanted to sit on a preferred table but staff doesn't allow even the table is not reserved.\nAlso service is so slow. We ordered the main course and after almost completing they brought salad\nPathetic service according to the standard they have set.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "What should I say? The worst experience ever. The food was not cooked well. Although the service was pretty good yet the taste was tasteless. They need to improve their menu as well and the food quality also. So far, I don't recommend this place at all.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Rara Avis",
      "rating": [
        3.7
      ],
      "address": [
        "Near Pratap Circle, Udaipur, Road, Shiv Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "Food us good, but service is poor, after ordering , you have to wait for long ,\nVery poor Service ☹️☹️☹️",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are good. Best service",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Best residential place and restaurant in Banswara (Rajasthan)",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The stay here was pretty good\nIn the time I stayed here, due to a storm, entire banswara's light had gone out for more than a day and ONLY this hotel had a generator which powered the ac, lights, fan, everything except internet for more than 13+ continuous hours",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The hotel is situated  just in front of new bus stand, it's perfect for night stay as there will be good availability of auto and public conveyance.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Nakshatra",
      "rating": [
        4
      ],
      "address": [
        "Nakshatra Mall, Udaipur, Dungarpur, HC3G+CQW, Link Road, Wadiya Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "Hotel Nakshatra offers impeccable service and luxurious accommodations. The rooms are spacious, well-appointed, and offer stunning views. The staff is warm, attentive, and goes above and beyond to ensure a memorable stay. The on-site amenities, including the fitness center and restaurant, are top-notch. Highly recommend for a delightful experience",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Great stay for my business trip! The hotel had everything I needed - comfortable room and a convenient location. The staff were friendly and helpful. Would definitely recommend.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Rooms are good but food quality totally lost",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Great room and ambience.\nRestaurant is new and has great taste again.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Despite complaining at 11 pm, the hotel management could not stop the noise from the adjacent room till 2 am.\nBooking on13.3.2024",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Anandpuri",
      "rating": [
        4
      ],
      "address": [
        "GCWM+FX5, Subhash Nagar, Banswara, Banswara Rural, Rajasthan 327001, India"
      ],
      "reviews": []
    },
    {
      "name": "Bhungra",
      "rating": [
        3.8
      ],
      "address": [
        "GCXP+62H, Harijan Colony, Bhagat Singh Colony, Banswara, Banswara Rural, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "Bhungra is a very good place for nature lovers. Mahi Dam is built near Bhungra which is built on Mahi river.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "My work printing and advertising",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Patan",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very nice place and people is very nicee",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Jagdish Kumar Meena",
          "languageCode": "en-US",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "होटल गणपति",
      "rating": [
        3.9
      ],
      "address": [
        "Hotel Ganapati, Udaipur Road, opposite Hero Moters, Shyam Colony, Banswara, Shyampura, Rajasthan 327001, India"
      ],
      "reviews": [
        {
          "text": "Room and bathroom was very very dirty.\nFood was ok.\nOverall I don't like the servicing of ganpati hotel.\nRoom was not exactly the way they shown in the pictures.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms was clean 👌  and food was tasty",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice Hotel , good to stay\nNear Pratap circle.\nGood Staff and Manager\nSpecious rooms & facilities .\nLift available for four floors\nNeed to improve some amenities, otherwise all are value of money\nDiamond Restaurant is in 1st floor , good variety and taste of food .",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice place to stay with family or alone..very cooperative staff.. Even food is awesome..I really liked that hotel..😀",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Customer satisfaction 0 👎   price very high comparative quality\n\nI",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}