{
  "places_with_reviews": [
    {
      "name": "Flagship Sea Coast Sunny Resort",
      "rating": [
        3.5
      ],
      "address": [
        "Surya Lanka Beach Road, Muttaya Palem, Guntur, Ramnagar, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "Nice room .clean and tidy .king size bed sufficient for 3 people to sleep.one sofa and mini refrigerator is also available. Good service. Swimming pool available but separate charge of 200 rs per 1 hour per person. Parking place is sufficient.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Good hotel near bapatla suryalanka  Beach. The room is well maintained. But it was a little expensive on weekends and holidays. Overall, good views from the rooms",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Each villa had two portions, Each portion had 2 rooms and a small hall, each with a queen sized bed can accommodate two adults and a kid. They charge 2500-3000 per day for room during weekend. The online rates were not final they will charge you more once you reach there. The swimming pool is good but always filled with drunken people on mornings and nights. They will charge extra 200 per person to enter swimming pool. The water in washrooms were too salty to do bathing.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "FOR SURE THE MANAGEMENT IS GONNA ASK FOR THE EXTRA CHARGE IF YOU HAVE BOOKED ONLINE. THE OWENER OF THE PROPERTY ENCOURAGES THE MANAGEMENT TO DO SO. THE SAME WAS CONFIRMED BY ONE IF THE EMPLOYEE.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "worst location swimming pool maintainance also so bad overall its better to avoid its for drinkers only not good for familys",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Lotus Pond Resort & spa",
      "rating": [
        3.7
      ],
      "address": [
        "VFGV+326, Road, Mutthaipalem, Maddiboinavaripalem, Bapatla, Muthyapalem, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "Recently visited the resort along with my friends.This is my second time to stay here in this resort.The rooms are very clean and well maintained.This resort is having indoor swimming pool which is clean and neat and a big garden area to chill out with friends and for children they have installed trampoline and other play equipments.The suryalanka beach is 4 km far from the resort.\nOverall it's a great place to enjoy with your family and friends.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very beautiful place. The hospitality was very good by the owner & the staff. They were always ready to assist with the queries & took care of us very well.\n\nVery peaceful place for a family to stay. Lot of options, room are neat, vast play area for kids with equipment. Good swimming pool (currently under renovation) spa, beauty parlor, restaurant. Very near to the beach as well.\n\nThe present owners are taking full responsibility of maintaining the property near & clean.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very peaceful atmosphere and good room service  very secure and near to beach ⛱️ food was excellent very quick response to the coustomers,it's very comfortable to family who want to enjoy in week end",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Really Good Resort in very reasonable price. It’s very spacious and has got nice Swimming pool and Rain dance. Kids also can enjoy in fun area. Best part of the Resort is Food. Food served there is really tasty and  Hygiene and the cost also very reasonable. Overall we had a great time.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Lotus Pond Resort and Spa is the best place to stay for the people who visited bapatla. Prices are medium and there is a function hall in it. Spa is also there where Body massage will take place. There is restaurant for people to order for eating Lunch, dinner and it's not a compliment for the room stay. It's very spacious and the rooms are also clean. The staff is polite and can give better service.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Kavuri Grand",
      "rating": [
        4.8
      ],
      "address": [
        "Surya Lanka Beach Road, beside substation, Muthyapalem, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "Really nice, cossy and comfortable stay. Very very cordial and helpful staff. Can't get better hospitality than this.  Really neat and clean rooms , being maintained very well. Ask anything to the staff and they will get it for you. Just 5 km from beach.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent rooms , neat and clean , friendly atmosphere , spacious rooms ,friendly staff , they will arrange A to Z what guests needed . Overall excellent",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent 👌 rooms , nice location and friendly staff taking care of every single thing , mostly families prefered this hotel , we enjoyed stayed here and satisfied .🏠 Feel like home",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very good hotel very cleaned well maintained not company… owner maintained feels like our own house just try it",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Good to stay family  rooms are very neat and clean",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Goutham",
      "rating": [
        4.1
      ],
      "address": [
        "Guntur, NH-214A, Ongole Road, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "I had lunch yesterday with family members. Though many varieties of dishes are available, taste was not good. Hotel Management should take proper steps to engage good Chef",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We have organizers ఆ wedding reception in the Hotel. The hall is very nice and enough space for a small gathering  They సర్వర్ good and tasty food and service is nice staff are courtious",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Amazing experience. Our time in this hotel for 3 days was flying and we didn't know how fast its gone. We loved almost everything over there and we recommend this hotel as one and only good options available in Bapatla.\n\nOptions in food menu: 5/5\nComplimentary breakfast: 4/5\nQuality of the food: 5/5\nRoom cleanliness: 5/5\nRoom ambience with sun light: 5/5\nWashroom cleanliness: 4/5\nStaff behavior: 5/5\nBilling/Logistics: 5/5",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Having stayed for 5 days in this hotel from 11/3/24 to 16/03/24 for 5 days, asked the hotel manager that I will vacate hotel by 6 am instead of 4 am they are asking us to vacate at 4 am early morning else pay one more day rent\n\nNever i will come to this hotel next time Rather than I will stay in Oyo hotel which are reasonable priced. Literally looting in a place called bapatla where only sea is there and small town on sea shore",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Yesterday I had taken VEG BHIRYANI and FRAUNS fry, totally they had bad smelled items. A",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Bapatla Guest House",
      "rating": [
        4.3
      ],
      "address": [
        "ECO House, 4-2-89/a, near panduranga swamy temple ,panduranga nagar ,chelu, road, Patel Nagar, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "highly satisfied with the stay at Bapatla Guest House, which is a part of Eco House. Firstly, the outlook of the building is attractive, especially the different plants that surround it. Secondly, the staff behavior is really nice. Language is a big problem when we travel to offbeat regional places, but here, the manager and the other staff were fluent in both Hindi and English. Rooms are decent and spacious, with good ventilation. Last but not least, the terrace is amazing, with many varieties of plants. Overall, there is a high amount of oxygen and positivity in the Bapatla Eco House.\nSpecial mentions: i) 24*7 drinking water on each floor; ii) in-built clinic\nCon: The restaurant facility was closed at the time of our visit. so that was the only con.\nOverall impression: Highly satisfied\nPS: Whoever is reading this review and might go to Bapatla in the future should plan their stay here. Booking can be done just over a phone call.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Don't follow negative comments ,, it was amazing too much nd service too good nd rooms are osm location also v good nd beautiful 😍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Rooms are well maintained.but bed sheets green colur looks that they are not changing regulaly. Bath rooms are good but getting bad smell. TV and AC not working . Telephone is with full of dust. No body is taking care. But food in restaurant is good.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I booked through Goibibo and when arrived at 10 pm with my wife and kid they didn't allow us. They said they are not accepting online booking. You have to pay. I showed them the Goibibo recipe but they didn't listen. At that time after 9 hrs of driving I had no patience. I offered to pay cash as per their ask. But I said let's talk to Goibibo once. Then they said sorry room not available. My phone has dried so couldn't call Goibibo. They realised immediately I can't call Goibibo. So they asked us to leave. It was harrowing to say the least. These frauds should be in jail. Be it Goibibo or this hotel.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Dirty surroundings but rooms are good to stay. No restaurant here.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Pagadala Grand Residency",
      "rating": [
        4.7
      ],
      "address": [
        "Ward no.20, 12-4-4, AG College Rd, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "I visited the place recently in March 2024. I didn't expect the rooms to be so neat and clean with proper and the prices are so affordable compared to other Hotels. The beach was around 8 kms far from the Hotel but it was worth it.\n\nYou need to have your own transport then no matter if you stay little far without having any disturbance service was really good evening the Hospitality.\n\nI enjoyed my vacation with family here in Pagdala Residency. I suggest you can opt in the future to enjoy the peaceful stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very good place but they do not serve breakfast. Lunch and dinner available. You get breakfast in near by tiffin center in Rs 40 to 50 only",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Excellent Service and good room service . Overall Good Experience",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Its pretty far from the location, their room service is very prompt but the food in their restaurant is not good, better have it outside. The charges are on higher side compared the rooms and amenities they offer.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Really excellent service given by pagadala team, Mr Rakesh helped us in all aspects pertaining from check in upto check out.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Bhavana Lodge",
      "rating": [
        3.4
      ],
      "address": [
        "West Prakaram Street, Near Bhavanarayana Swamy Temple, WF48+8X3, 13th Ward, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "Cons: Mosquitoes all over, stingy washrooms, no cleanliness, very unhygienic atmosphere.\n\nPros: Coming to cost, it is the most economical in this area. Owner is pleasing, great ambience.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Very near to famous & Historic Sri Bhava Narayana Swamy temple. Rooms & room service was good. And it's under budget.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "100 years old Government hospital rooms are better than rooms of this hotel.\nNo dustbin., Dirty walls, dirty toilets.\nyou won't like to walk to footwear in room, such level of dirty rooms.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Average hotel.\nRooms are comfortable.\nMosquito menace and hotel does not even offer mosquito repellant.\nIn a narrow lane. You may not be able to take your car comfortably.\nFans rotate without speed control.\nPoor maintenance.\nGood staff.\nNext to temple.\nNear railway station.\nJust ok to stay.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Non AC rooms are just ok to live if we have no other options. Washrooms looks dirty and bad odour.24hrs Water facility. Walkable distance to bapatla railway station",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "RR Resort & Guest House",
      "rating": [
        4.8
      ],
      "address": [
        "Maruproluvaripalem Rural, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "I highly recommend the RR resort near Bapatla Beach for its exceptional service in catering to individual taste buds. The personalized cooking experience adds a delightful touch to the overall stay, making it a memorable and enjoyable retreat.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I recently had the pleasure of staying at RR Resorts and Guest House, and I can confidently say it was a truly unforgettable experience. From the moment I arrived until the day of departure, every aspect of my stay exceeded my expectations.\n\nThe resort itself was a haven of tranquility and natural beauty.  The guest house was tastefully designed, with spacious and well-appointed rooms that provided a comfortable and cozy stay.\n\nOne of the highlights of my visit was the wide range of amenities and activities available at the resort. Whether it was taking a refreshing dip in the sparkling swimming pool, participating in exciting outdoor activities, there was something for everyone. The well-maintained facilities and the attention to detail truly made a difference in enhancing my overall experience.\n\nThe location of the resort was also worth noting. Situated in a picturesque setting, it allowed for breathtaking views of the surrounding landscapes. Additionally, it was conveniently located near popular attractions and landmarks, making it easy to explore the area and immerse oneself in the local culture.\n\nIn conclusion, my stay at RR Resort and Guest House was nothing short of extraordinary. The combination of stunning surroundings, top-notch service, and excellent amenities created an unforgettable retreat. I wholeheartedly recommend this resort to anyone seeking a peaceful and rejuvenating getaway.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Delip sir have treated well in good ways\n\nThe Rooms is very clean and gud mataince\nIn food all 3Times was tasty and healthy and good\nAnd Games is also very nice\nDo vist and enjoy",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "RR Resorts is a good place to stay. This is not on the beach. The rooms are clean and well maintained. Ricky, the young manager has really been helpful in fulfilling our needs, like providing extra beds, getting us the food. On the whole the stay was pleasant. The owner may consider keeping drinking water jugs and glasses in the rooms.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The best in the city very comfortable the prices are very reasonable.\nThe service is too good I'll strongly recommend you to go and visit this resort and guesthouse.\nThe food is homely food you'll never regret staying in this luxurious resort",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Seatel A/C",
      "rating": [
        3.7
      ],
      "address": [
        "NH-214A, Bapatla Ongole, Road, Bheema Vari Palem, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "The AC didn't work it just blow air without cooling. When asked the receptionist said they might have turned it off at night. Then what's the point of staying in an AC room.\nDeeply disappointed with Receptionist, rude and has prepared answers for everything.\nNever stay in AC room here.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Awesome hospitality , the best room service I have ever seen ,clean bathrooms , wonderful beds , definitely I'll visit again, cost is just 15k to 17 k",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Not sure you got this yet and it is good for me and you can get a hold on me and you will get a better feeling when I get back from the new house in a couple weeks so we will have a good to be home and I can make it work and get some good rest of it will get done",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very good.And I will surely recommend it",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good but not great",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Best Lodge",
      "rating": [
        3.9
      ],
      "address": [
        "AG College Rd, opposite vijaya digital, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India"
      ],
      "reviews": [
        {
          "text": "It's was very nice to say hear . quality and cleaning was good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "For travellers, this lodge called \"Best Lodge\" is cheap and rooms are neat and tidy. People from Hyderabad or other districts coming to bapatla for sightseeing beaches like suryalanka and chirala beach can stay here.\n\nThere is a small ahle hadees masjid nearby (just search ahlehadees masjid in maps) which Muslims can go to offer salaah InShaAllah.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Reasonable rate",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "nice",
          "languageCode": "en-US",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}