{
  "places_with_reviews": [
    {
      "name": "Hotel Omkar Inn",
      "rating": [
        3.4
      ],
      "address": [
        "BEPQUEGAL, Vodlemol Cacora, Hodar, Goa 403706, India"
      ],
      "reviews": [
        {
          "text": "You can stay as many days as u need.Rooms are clean and spacious with supportive staff. Perfect location with access to all shops,banks,market,railway station etc.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Had a comfortable stay at the hotel, room rates are very reasonable and affordable..rooms are clean. Location is good, they also have taxi facility for tourists like us. The food is good and also the service.. overall 5 stars for this hotel",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Stayed at the omkar inn hotel for couple of days. The management is very helpful. The room was very clean. The are lot of tourist tourist attraction around for example the Rivona waterfall. Perfect for a weekend. Also the railway station and bus stand is at a walking distance.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "We stayed at the hotel last week and the rooms are in very good condition, location is right in the city, transport facilities are very closeby, food is nice. The staff here are very friendly and at the service at any point of time. We had a wonderful stay here. Also there are lots of tourists attractions nearby .",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Luxurious room with affordable price. Staff are very cooperative.. Located in between the market which makes shopping and other activities more convenient..",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Kenilworth Hotel",
      "rating": [
        4
      ],
      "address": [
        "74XF+PHQ, Bandoli, Goa 403706, India"
      ],
      "reviews": [
        {
          "text": "if you rent a tennis court in a hotel, the rental price can suddenly be 50% higher than a week ago 😉",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Arco Iris Boutique Homestay",
      "rating": [
        4.5
      ],
      "address": [
        "House No 1384, Sinai Bagh, near Carmel Chapel & High School, Curtorim, Shelvan, Goa 403709, India"
      ],
      "reviews": [
        {
          "text": "I really enjoyed my stay at Arco Iris. i stayed there for 5-6 days along with my parents. Located in the quaint village of Curtorim in South Goa, this 200 year old Portuguese mansion has been restored and beautifully furnished  by the owners- Benny and Ganesh.  The place is serene, filled with greenery and the mansion itself is a haven for book lovers, housing a lot of books, both in the guest rooms - each of the guest room has close to 30-40 books- as well as in the common areas such as dining hall and the reading room. The room are well lit, well decorated  and yet have a homely glow to them that quickly makes one feel at home. Meals are home cooked- the goan veg curry served here with pao is really good and a must have local delicacy- do not miss out on this. Bennita and  Ganesh both are wonderful hosts, gaily chatting away with our family as well as with other  guests, helping us with our travel itineraries and  by the end of the trip felt more like extended family. The hosts also own an extremely loveable and well trained labrador- Feny ( I am not a pet lover and I havent seen a better behaved pet in my entire life-Feny is really  adorable- so if you are not a dog lover pls do not worry). Pets are also allowed  and I observed that pets of fellow guests were also equally well trained.  This place is really a suitable choice of holiday if you really want to soak in the culture of Goa and  enjoy the pristine, green southern side of the state rather than see the usual party side of Goa ( this seems mainly to be the northern beach side which is also more noisy, crowded and polluted- with all due respect) . Some of the best beaches (read clean), churches, temples and other tourist attractions of South Goa are  best accessed from Curtorim village. To sum up our homestay experience at Arco Iris was an extremely  memorable one- in terms of the  facilities which were excellent and more  importantly in terms of the people I got to meet during my stay - Bennita, Ganesh and the guests, all of whom were warm and friendly. This is something that clearly distinguishes Arco Iris from hotels, clubs and other homestays(where interactions are clearly impersonal). Thank to Bennita Ganesh and Feny for making my trip to South Goa extremely enjoyable.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I had booked a stay for my parents and they had an absolutely wonderful experience. The decor was beautiful and authentic, the house was well maintained, clean and the food was just perfect. My parents loved the company of the family and experiencing their Goan way of living. They also gave some great recommendations for sightseeing around the area.  Beni was extremely prompt and thorough with her communications and the entire process from booking to checkout was extremely smooth and easy. Would definitely recommend this place for anyone looking for a quiet, Goan stay and experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Arco Iris is a beautiful place to be. It's not your regular homestay. It's your chance to live the Portuguese heritage of Goa. The best part about staying at Arco Iris is the ability to enjoy nature and quietude along with heritage. So it has many experiences altogether, in one package! The rooms are pretty with so much thought given into the details, the decor and styling. My most favourite memory of Arco Iris were my morning walks....oh it used to be so lovely to get up early and walk towards the gate and see the lake right across....sitting in the courtyard and savouring the lull... If you're looking for a stay in South Goa, which is more than just a stay, go for Arco Iris.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This boutique well crafted, well thought and superbly Goan Heritage small yet meticulously planned property makes one feel on the stature of our Indian hospitality and it's diversity. Every inch of the 2 acres compound has been for a purpose starting from the entrance from main gate, to view of the lake in front from porch stairs to the view from balcony or the courtyard in the middle with rooms reach side to the room detailing to the trees manicured and saved.\n\nBenny and Ganesh have been generous hosts and superb individuals with largly Benny weaving this gracious Portugese",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The ambiance and the decor of the entire place takes you to a different (dreamy/laid back) world altogether. I loved the Goa that this place portrayed to me. Courteous hosts and nice service. Beni and Ganesh are gem of people....extremely welcoming and warm. They made us make a beautiful memory of our trip. Food service though could improve. Would love to travel again.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Indira Farms",
      "rating": [
        5
      ],
      "address": [
        "85V4+C2, Sangod, Goa 403410, India"
      ],
      "reviews": [
        {
          "text": "A wonderful peaceful farm. It is situated amidst nature, surrounded by greenery and forests, providing a serene and peaceful environment.\nThe hygiene measures are taken care of and utmost cleanliness is maintained, as well as pool is also clean.\nThe staff is helpful and accommodating Mr. Saurabh, the owner is such a helpful and nice person.\nThe facilities and amenities provided are more than what is expected at the given price.\nJust enjoyed the stay.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Indira Farm House, Mollem is nature's paradise. I loved it. The natural beauty can't be expressed in words, it is to be  feeled. Late evening music of birds, early morning rising sun and moreover dance of peacocks, natural flow of river Dudhsagar, a scenic beauty.\nCook is very courteous and the food U love will be prepared by Cook. He provided me special dishes purely of bihari test which I m fond of.\nA nice natural beauty place to spend quality time with family & friends.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Indira Farms was an absolute delight! The cozy farmhouse, delicious farm-to-table meals, and refreshing pool made for a perfect weekend escape with friends. Highly recommend for a relaxing getaway.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Indira farms is an amazing place to be in. Saurabh is a great host and the cook Indirajith made amazing food. It was very serene and relaxing to walk alongside the trees. The room was cosy and had all the needed amenities. A dip in their pool as well as the river near the farm were quite refreshing. We also saw a lot of cool birds! Would definitely recommend!",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Indira Farms a remarkably beautiful place to get away from mundane activities. We Got a much needed rejuvination right in mother natures lap, far from busy-city lives.The ambience of the villa is mesmerizing made our stay feel like home. They have a great chef, Mr. Indrajeet, who cooks delectable food and moreover, humbly asks if he should make any changes as per individual palettes. What's more, the infinity pool sure stole our hearts as even the little ones enjoyed being around the pool area. What got me nostalgic is the river deeper into the farm that brought back memories of school hiking days.\nThank you Mr. Saurabh for making our short trip a memorable one at Indira farms.",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Hotel Vishwas Lodge",
      "rating": [
        3.4
      ],
      "address": [
        "7464+RJ3, BEPQUEGAL, Vodlemol Cacora, Hodar, Goa 403706, India"
      ],
      "reviews": [
        {
          "text": "Very nice place if Youre on budget ! The staff is nice and polite Specially safe",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "The cost of room is 500/- per day .\nBest price for staying  if you have low budget .\nAC is available at some room .\nWater Geyser is available.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Rooms are affordable but there is no space for parking..but the service is not bad though",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Rooms are cheap and affordable but no proper parking place",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "No parking area",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Azaya beach resort",
      "rating": [
        "Unknown"
      ],
      "address": [
        "74XF+PHQ, Bandoli, Goa 403706, India"
      ],
      "reviews": []
    },
    {
      "name": "MOUNTAIN LIQUOR",
      "rating": [
        4
      ],
      "address": [
        "95F4+Q25, Darbandora, Goa 403406, India"
      ],
      "reviews": [
        {
          "text": "Place is good and it's location is awesome.... Good parking space and food taste was good.... Must try Kanda bhajiya.... Awesome taste. 4 star because of veg food taste... They were boasting of their nonveg food but we are not eating nonveg in navratri so rest and proper review in next visit.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good place for a break on your drive and i got a fresh fish thali home style and typical. And please it's my request to maintain the home style and not to turn into commercial curry after becoming famous. I wish you all the best 😊👍",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Fish was not completely fresh , also their quantity is very less as compare to price not reasonable",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We had one of the best Tavva pulavs",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very nice place. We also had a lot of fun.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Malpe",
      "rating": [
        "Unknown"
      ],
      "address": [
        "74XF+PHQ, Bandoli, Goa 403706, India"
      ],
      "reviews": []
    },
    {
      "name": "Flames Cottages Home-Stay",
      "rating": [
        4.8
      ],
      "address": [
        "Igorjebhatt, Chandor, Goa 403714, India"
      ],
      "reviews": [
        {
          "text": "Clean rooms and nice field view and also a pool all by itself",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "They have room service and a swimming pool",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Nice clean room and pool hade a great party",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Small pool for private parties great fun 😁",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "It nic place where u can stay but room r small bathroom attached to it. It like containers",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "POP 80785B Oyo 23545 Nazareth Guest House",
      "rating": [
        "Unknown"
      ],
      "address": [
        "59, Grand Hotel, Fuldem Vaddo, near Nagoa Behind Nagao Chapel, Nagao, Goa, Bandoli, Goa 403516, India"
      ],
      "reviews": []
    }
  ]
}