{
  "places_with_reviews": [
    {
      "name": "Surja Guest House and Marriage lawn",
      "rating": [
        4.6
      ],
      "address": [
        "Near Vikas Bhawan Ujjawal Nagar 1.2km from NH27, Bypass, Awas Vikas Colony, Barabanki, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Best part of your stay at Surja Guest House is\na) Humbleness and Hospitality.\nb) The cleanliness of the rooms and we'll maintainability.\nc) The whole place is maintained and kids enjoy the garden area for play and recreation.\nA place to recharge yourself.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Rohan bhai is best , my whole experience with Surja Guest House was brilliant.  I will suggest you all this property for private marriage session as whole property is 110000 sq. Feet",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had a very comfortable stay, staff were very nice and courteous. The property was maintained well. It had a spacious well maintained lawn.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Great Rooms at affordable rates\n\nThe best place to stay for a night while going to Ayodhya Ram Lalla Temple\n\nJust 120kms away from Hanuman Garhi\n\nAnd property is 5 min away from Lucknow-Ayodhya Highway",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very nice place\nRoom service and all too good\nOne of the best hotel in tha town\nIf you are looking for a hotel in barabanki must visit here",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "S K MARRIAGE LAWN",
      "rating": [
        4.3
      ],
      "address": [
        "NH 27, Kurauli, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Good lawn.\nI recently attended a wedding at S K marriage lawn and I must say it was a wonderful experience. The venue was stunning and the entire event was well-organized and executed.\n\nThe lawn itself was spacious and well-maintained, with lush greenery and beautiful flowers adorning the surroundings. The seating arrangements were comfortable and there was ample space for all the guests to move around freely.\n\nThe staff at S K marriage lawn were extremely helpful and courteous. They made sure that all the guests were comfortable and had everything they needed. The decorations were also top-notch, adding to the overall ambiance of the venue.\n\nThe food served at the wedding was delicious. From the starters to the main course and desserts, everything was prepared to perfection. The menu had a wide variety of dishes to choose from, catering to different tastes and preferences.\n\nOne thing that stood out for me was the attention to detail. The management at S K marriage lawn made sure that every aspect of the event was taken care of, leaving no room for any complaints. The sound system and lighting were also on point, creating a lively and festive atmosphere.\n\nThe parking facility at the venue was also convenient and well-organized. The staff guided the guests to their designated parking spots, making it hassle-free for everyone.\n\nOverall, I had a great experience at S K marriage lawn and I highly recommend it for any wedding or event. The venue, the staff, the food, and the management exceeded my expectations and made the event truly special. I would definitely consider hosting my own event at S K marriage lawn in the future.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Worst marriage lawn of barabanki, manager of the lawn is a lyer and makes false promises, no water supply, ac's of rooms and banquet hall are not functional. Poor services , they usually don't have diesel for running generator.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best wedding lawn in barabanki all mangement are very good 💯",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place for marriage, location is little interior otherwise it is good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I was involved for one wedding at the venue. The decoration, the venue all are absolutely fantastic.\nI really liked how there are two separate spaces so that different things can be arranged. The parking facility is a big plus.\nHowever one thing that needs improvement is the rooms and the facilities in them. There was frequent shortage for water supply in the rooms and only two rooms had a mirror installed. So this caused pretty inconvenience for us. As a guest things were fine but as an organiser it was bad",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Capital O Mayur Motel & Resort",
      "rating": [
        4
      ],
      "address": [
        "Mayur Vihar, Colony, Oberi, Barabanki, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Dear Hotel,\n\nToday i booked the room and got a confirmation from the hotel, but after few hours i got email that my booking was cancelled. The number google is not reachable. Can you please help me with the refund?\n\nThank You,\nShahbaaz",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Average place all over. The owner has a really bad attitude towards new people. I guess that's what happens when you are not educated in ethics and morals of the service industry.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Room AC wasn't working\nRoom Service was pathetic\nLocation has serious bad roads\nRude behaviour from staff\nFood was unbearable to eat",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good location for functions and ceremony",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good place for family function",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Regal Palace - Rooms || Banquets || Lawn",
      "rating": [
        4.4
      ],
      "address": [
        "Regal palace road, Near Jal Nigam, W59J+6GM, office, Yogashram Rd, Avas Vikas Barabanki, Awas Vikas Colony, Barabanki, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Location is a bit tacky as it's in between resedintial space....so getting in is difficult as the roads are narrow.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Fabulous hotel for stay with family. Lot of space and tidy environment",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "If you are searching for a nice dwelling place then this can be your useful result. The service is good and cleanliness is main focus of the resort for organizing any function or part you can book this palace the room's here are massive and nicely decorated. 😍😍😍",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's a good place for party and marriage.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It is a very nice marriage palace. It has enough area for functions. Parking area is very big. Their management is good. They keep note of each and everything to give their guests the best experience.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Royal Realite",
      "rating": [
        4.2
      ],
      "address": [
        "Hotel Royal Realite, RTO Office, near Gayatri Mandir, Preet Vihar Colony, Civil Lines, Obaree, Barabanki, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Nice place cln room and very nice food not available breakfast or dinner k liye opposite wale me jana padta hai",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I have been here it's amazing experience overall bestest in the town",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It was not very nice but good you can go",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I enjoyed their restaurant service and dinner with my family and friends.  Their nonveg  preparation were beyond doubt,  so tasty and value for money.  But their vegetarian dishes were not upto the mark,  that shows they were cooked by some helping hands without knowing how to cook,  if you are planning to go for vegetarian food please avoid this place.  But if you are searching nonveg, you can try them.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Awesome food and best place for banquet party",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "R.R. PALACE",
      "rating": [
        4.1
      ],
      "address": [
        "Shuklai, Palhari, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "A1 location, very nice parking,breezy atmosphere and excellent infrastructure.Overall very good experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Lawn is good and has decent space . Only the road that connect to the lawn is not good otherwise best for marriage function.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best place for wedding, birthday party, parking facility is very convenient here.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Neat and clean place for shadi, mundan party. A very big space for program.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "it was a nice place  there was plenty of space there was just a little dirt around",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Capital O 44672 Crown Palace",
      "rating": [
        3.6
      ],
      "address": [
        "1 OppBanki Block, Dewa Rd, Preet Vihar Colony, Civil Lines, Barabanki, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Good place for engagement and wedding purpose they provide large space for all things also caters.♥️👍",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very good Hotel service and location nice",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very nice and good facilities",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very bad service and Very bad behavior Hotel Manager specially Lady Manager  She doesn't know how to talk to Guest...room rent is to high",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "One of the best place for exhibition in barabanki as we visited for exibition at this place and the hall was also spacious you would not feel uncomfortable and the foot fall of place is also good you will be not feel disappointed there so you can enjoy yourself there and they also have lawn for marriage and other functions",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship Hotel Easy Stay Inn",
      "rating": [
        3.2
      ],
      "address": [
        "plot number 2, 120, Faizabad Rd, near shalimar bay, Lucknow, Uttar Pradesh 226028, India"
      ],
      "reviews": [
        {
          "text": "looted us with booking the room. after booking no one has opened the door.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Don't go here, utterly disappointing, I booked this hotel online on Oyo but when I arrived at hotel they charged me extra ₹600, I was under Compulsion so I paid extra 600 without any reason.\nRooms were also dirty, no staff , no drinking water, extremely unhygienic washroom, it was looking like a सरकारी स्कूल,",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Don't go and book this hotel they are fraud , don't pay any amount in advance",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Bad experience of room,staff, location all",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Joyful",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        }
      ]
    },
    {
      "name": "Shivalik Residency - Hotel & Banquet Hall",
      "rating": [
        4.6
      ],
      "address": [
        "Mayur Vihar, Obaree, Uttar Pradesh 225001, India"
      ],
      "reviews": [
        {
          "text": "Wonderful service .. I m impressed with staff of Shivalik residency.. I am giving 5 star review .. And I can recommend Shivalik residency for providing me top class service. Shivalik residency is Best hotel in barabanki.. Few days ago I stayed here for 2 days and got wonderful experience",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Instead of staying in ayodhya or lucknow, we stayed here as the rooms were not costly INR1400 per room per night. and even they allowed late checkout upon request. And for that cost, the rooms were good enough, neat with AC and geyser. Only thing was no lift, but the person available there to carry our luggage, so that was not an issue.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Good hotel to stay with family and children. . Whenever I come in barabanki,  I choose only Shivalik Residency.  Best hotel in barabanki. . Ac well neat and clean room.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "It's very good  hotel/ marriage vanue rather multi purpose  accommodation. Well maintained and managed . Only one thing noticed, i.e. approach road from main road not paved / constructed . It may be that coloniser or municipality has not taken interest in it . Second point I don't find enough space for parking of vehicles.  Parking is done on both the sides of approach road. If both things are taken care of, it's one of the best hotel or multi purpose venue . It's worth to be hired or booked for any type of functions and accommodation.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Best hotel in barabanki. Good rooms. Clean rooms",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Kushmanda Greens, Hotel & Banquet Hall",
      "rating": [
        4.1
      ],
      "address": [
        "Lucknow - Colonelganj - Gonda Rd, Mayur Vihar, Barabanki, Uttar Pradesh 225003, India"
      ],
      "reviews": [
        {
          "text": "If you live in the area around Barabanki, then do visit and book once for the wedding or any function of someone in your family.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It was good I was there for marriage ceremony and it was quite good at that location rooms are good clean on road location.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice, Clean and great place for Marriage bookings and Family get-together parties.\n\nVery nicely built with modernized decoration and equipped with all facilities..\n\nHighly recommended for hassle free Marriage arrangements. Comfortable Rooms available for doing all the preparations.\n\nFully supportive to cater additional requests and customizations.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of the best wedding and party destination in barabanki, they have 2 very big AC halls and very clean and modern rooms.\nLawn and garden area is nicely managed. Perfect for any kind of events and gatherings.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of the best Wedding hall and Lawn in Barabanki.\nThe location is perfect as it is very near to the city and on the highway, enough parking space, rooms and halls are very beautifully decorated and kept clean and hygienic.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    }
  ]
}