{
  "places_with_reviews": [
    {
      "name": "Boho The Sky Cafe- Madhyamgram",
      "rating": [
        4.2
      ],
      "address": [
        "86/3,3 Jessore Road, Prantik Guest House 450 mtrs from Star Mall, Vivekananda Nagar, Madhyamgram, Kolkata, West Bengal 700129, India"
      ],
      "reviews": [
        {
          "text": "The ambience of this cafe is top notch. You can have the two options either open air seating arrangement or in the shaded area. For the food I find their continental cuisines are better than any other cuisine. Mocktails are a must try. Prices are little on the higher side in my opinion.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "FOOD REVIEW:\n1) Chicken Tikka Pizza 🍕 (Price: ₹345/-; Rating: 5/5 ❤️)\n2) The Black Bear Chicken Burger 🍔 (Price: ₹195/-; Rating: 5/5🔥)\n3) Overloaded Chicken Quesadillas (Price: ₹315/-; Rating: 4.8/5 💯)\n4) Lover's Delight 🥤(Price: ₹175/-; Rating: 4.8/5)\n.\nEach & every item was very tasty 🤤😋 & the seating area , ambience was awesome. This rooftop cafe is one of the best cafes in this area & the staffs were also very good. (HIGHLY RECOMMENDED 💯🔥)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Boho - The Sky Cafe in Madhyamgram offers a delightful rooftop dining experience. With its charming ambience, friendly staff and delectable cuisine, it's a must visit spot.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The food was good with good portions served, though the staff really dont care to behave properly and are utterly rude. They asked us to shift tables twice stating there were a larger group who wanted to sit at our place even though they were the ones to offer us the table to sit. Horrible experience, would visit probably for the food but not recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ordered buffalo wings, reshmi tikka pizza, white sauce pasta, blue berry basil mojito, peasant mojito and another drink.\n\nPizza was really good. Nice crust and the sauce was perfect, buffalo wings were a little sweet for our taste but overall was good.\n\nWhite sauce pasta was utterly dissapointing. There was no white sauce what so ever. Only had the taste of olive oil.\n\n2 drinks tasted same dont know how  that's possible. Only the blueberry mojito was good.\nCould'nt click all the pictures as we were in hurry so we ate as fast as possible. Overall the food and drinks could have been better i think as we visited around 10 pm and they were serving only two tables including us. But hope to have a better experience next time.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Shibaloy Garden | Best Banquet in Madhyamgram",
      "rating": [
        4.4
      ],
      "address": [
        "62, Chandigarh Main Rd, Kora, Madhyamgram, Kolkata, West Bengal 700130, India"
      ],
      "reviews": [
        {
          "text": "The best banquet hall I've ever witnessed in the Barasat-Madhyamgram area, truly one of a kind and looks absolutely stunning when decorated! Must recommend for people who want their event to be remembered by everyone!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautiful place for having a marriage or birthday party. Huge area, very well decorated and maintained. Easily can accommodate around 1500-1600 people's gatherings. There are also full AC bedrooms, that can accommodate around 200 people. There is a fully equipped room for arranging DJs.\nOne thing that's not so convenient is the road . The entry road is very narrow. There will be congestion for a huge gathering.\nOtherwise it is very nice. Behaviour of the attendants and the staff are very polite.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Awesome place….. seriously…… go ahead for any occasion for bday, marriage ceremony and many other occasions….. ambience, locations, staffs and scenic beauty as great….",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Huge space for any ceremony , corporate events. Car parking available.  Decoration is good but old fashion.\n\nOnly draw back is very narrow path from the main road.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautiful place.different types of selfie point.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Flagship 811733 Hotel Ambassador Barasat",
      "rating": [
        3.3
      ],
      "address": [
        "AH1, Champadali More, Post Office and Police Station Barasat, Champadali, Banamalipur, Kolkata, West Bengal 700124, India"
      ],
      "reviews": [
        {
          "text": "One of the worst hospitality......bed sheets are dirty , bathroom doors are broken.....even I am sharing one incident that happened with me 'I had booked this hotel once whatever when I encountered the room I saw a blood stains on the bedsheets some minutes later whatever then went for receptionist but there was no one.... however I have returned from there again to the room and I managed somehow to stay as there as I got no options to left that place.... whatever at the check out time on complaining to them they were blaming to me that I caused that stain....they literally disrespect me...... however this place is not safe for everyone.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Too much noisy inside. Bedsheet are dirty, hairs on the pillow. Bathroom taps, basin is broken. Provide used package drinking water. No arrangement of food.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "I have been here due to exam purpose... Location is very nice... It's near chapadali more Bus stand, Boro Ma Kali Mandir...You can get everything nearby from meals to daily essentials including medicines... Monginis, KFC,Wow Momo, Pizza shops are there...Staffs are cooperative...Very much safe and secured... Adequate water supply...Budget friendly...The rooms could have been spacious...There is a parlour in the first floor of this hotel...Overall it's homely...",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The most worst hotel of my life.  There is no early check-in.  The hotel cannot be found properly.  All pictures are duplicate.All Rooms are non ac.No water.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Good place for staying near and clean a good budget rooms and staff are very helpful and cooperative specially manager Mr jay is a nice friendly person highly recommended for family ....",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Flagship Black Diamond Hotel and Restaurant Barasat",
      "rating": [
        3.8
      ],
      "address": [
        "Brahmapur, Algoria Post Office, Government colony, NH34, Barasat, Noapara P, Algaria, West Bengal 700125, India"
      ],
      "reviews": [
        {
          "text": "Nice Room price verry low good sarvice let night food available very nice loveit",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Same The hotel didn't accept the booking through OYO unless extra charge was paid.\nLook for better options before considering.\nLocated on the Krishnanagar highway and easily accessible by transport or personal vehicle.\nThe food offered is decent but high priced.\nHas issue with water supply or Electric issue &The current was going off many times, I could not spend 3 hours at the hotel. They told me you used to check out very badly ... we would grow up in the rain had to go out....very bad experience.... And I couldn't stay for 3 hours because I saw an electronic problem but I didn't get any money back.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel didn't accept the booking through OYO unless extra charge was paid.\nLook for better options before considering.\nLocated on the Krishnanagar highway and easily accessible by transport or personal vehicle.\nThe food offered is decent but high priced.\nHas issue with water supply.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I stay for 3 nights here for an exam. Service was really good. Rooms are small but quite clean. We could have our meal in the next restuarant which serves really delicious meals. The only drawback is it is kind of far from city area so finding a taxi or cap in morning is quite hard. I nearly miss my early morning flight.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Located at kalyani highway, good parking area, food quality is very good, nit & hygenic.. Staff's behavior is so humble",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship Komfort 34 Barasat",
      "rating": [
        4.1
      ],
      "address": [
        "Barasat, North 24 Parganas, NH12, Kolkata, Khilkapur, West Bengal 700125, India"
      ],
      "reviews": [
        {
          "text": "Beware of the price...they will tell you to come directly and give you personal number and cancel oyo booking....then charge more",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Clean Hotel. Humble staff",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Palash",
      "rating": [
        3.2
      ],
      "address": [
        "Barasat - Petrapole Rd, Champadali, Barasat, Kolkata, West Bengal 700124, India"
      ],
      "reviews": [
        {
          "text": "Worst Decision ever of my life staying there.\nDirty Room, dirty bedsheets, bedbugs all over the bed,dirty blankets and room was smelling cigarette 🚬  & alcohol also there were lots of garbage under the bed and washroom was dirty too geyser was in bad condition. 👎",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "FRAUDSTAR HOTEL\nBEHAVIOR-ZERO\nSERVICE-ZERO\nLOOTING PEOPLE WITH FALSE WORDS.\nI VISITED RECENTLY AND AFTER BOOKING ROOM IT WAS NOT BOOKED AND CHEATED ME BY CHARGING 1000/- EXTRA FOR A 1300/- ROOM.\nUSED BLANKET\nUSED BEDSHEET\nVERY UNSAFE\nDON'T  GO WITH FAMILY ITS A REQUEST\nAT POINT OF TIME U MAY LOOSE ANY BELONGINGS.\nALL FAKE STAFFS..WELL PLANNED TO CHEAT CUSTOMERS AND TAKE ADVANTAGE OF SITUATIONS.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Rooms are good , not all rooms are the same few are in good condition, few are looking very old and dirty.\nOverall a good hotel in that area .. AC dulax room are in good condition.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Very bad smell room used condom found under bed masterbate every where in room period pad also found in room",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Very good place for food and accommodation",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        }
      ]
    },
    {
      "name": "Flagship Downtown Inn",
      "rating": [
        3.8
      ],
      "address": [
        "pore Road, near Nav Bharti Gate, Barasat, Kolkata, West Bengal 700126, India"
      ],
      "reviews": [
        {
          "text": "Every thing is quite fine, Managers Behavior is very poor. They even ask for extra money later after commitment of the final amount. Choose other nearby hotel as the promises is very conjusted.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Staff Behavior is too bad, lady don't have manner how to talk. AC condition is good but no separate remotes available for the rooms, Washroom are very small.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very nice place to stay.. The food was amazing and their behavior and services is all good overall experience is very good..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It was a very nice experience there. I went directly and ask for rooms. I think that is better rather than going via Oyo. The room and the bathroom was good and clean. Service was good. Ambience was quiet.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very bad behaviour. Denied for check in and also asked for extra money.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship 80647 Hotel Rose",
      "rating": [
        3.8
      ],
      "address": [
        "NH12, Barasat - Petrapole Rd, Barasat, Kolkata, West Bengal 700124, India"
      ],
      "reviews": [
        {
          "text": "NEVER EVER GO TO THE PLACE\nWe went for attending a ceremony in there\nVery weird location\nVery awkward service\nStaffs are not professionally trained even rude\nServes cold rotten food\nYou would definitely have food poisoning after taking food from them",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Bad  behaviour with customer and manager of hotel talking rudely...... waiter are 😊....not 🚫 Go .",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The location and the service is good and friendly but the  hotel provide me a non ac. Room..i think it his there mistake ..otherwise  this is 5 out of  5",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very poor service. They don't accept booking from OYO. They will force to cancel your booking and ask to book them privately. Worse Hotel. So avoid them.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice hotel and nice sarvice 😊👍",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "'Live on KOL2463",
      "rating": [
        4.1
      ],
      "address": [
        "Barasat - I, 1, Barrackpore-Barasat Rd, Nababharati, Barasat, Kolkata, West Bengal 700120, India"
      ],
      "reviews": [
        {
          "text": "The rooms are good, but they really need to clean the washrooms and provide clean sheets nd towels.. the management is amazing, they were really well behaved nd helpful.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good behaviour of staffs.\nNice place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Five stars wont justify the warmth i felt and the care i recieved as i fell sick during my stay at the hotel. the manger joy dada is one of the kindest people ive met. thank you saffron inn.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Don't know",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms are good and price is low.\nService is very good, all staffs are very polite.\nLocation also is a good place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "OYO Prantik Guest House",
      "rating": [
        3.3
      ],
      "address": [
        "House, 86, Prantik Guest, 86/3, Jessore Rd, Vivekananda Nagar, Madhyamgram, Kolkata, West Bengal 700129, India"
      ],
      "reviews": [
        {
          "text": "Worst experience ever. My friend has booked the stay for one day on her marriage. The list goes so long, they didnt inform the instructions before hand, no proper room service, the rooms smelled of tobacco n cigarettes the whole time, the flush didn't work and the blankets were smelly besides which they overcharged for us for 2hrs. They kept us waiting for over 2-3 hrs at the gate as their rules included no entry from 3-6 am which was not informed to us before hand. Horrible oyo experience ever.\nPlease don't encourage this kind of facilitation as its defaming the Kolkata's vibe.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "It was a night stay for my exams.\nThe location is just right beside the highway, so pretty good place. Though it don't have a bus stand nearby, you need to walk for at least 5 minutes.\n\nRooms are spacious, but not very clean. TV's have only 1/2 free channels. Wifi works fine though.\nBathroom of my room was in worst condition.\nDidn't love the stay much..",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The only negative thing was the room we have been provided.. it was not well painted, bed sheets were unclean... The AC was dropping water, except that all is very good and privacy was a positive point",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Service is very bad.\nStaff behavior not good.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "This is a typical OYO Hotel only for couples, you people know what I mean. Decent peoples should avoid this place. Everything sucks except the elevator.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    }
  ]
}