{
  "places_with_reviews": [
    {
      "name": "Hotel RJ",
      "rating": [
        4.3
      ],
      "address": [
        "Mirchoba, Chhotonilpur, Bardhaman, Becharhat P, West Bengal 713103, India"
      ],
      "reviews": [
        {
          "text": "Had organised  a program in the banquet with a lot of trust but was really disappointed when it came to the billing part (As we were not clear what the team wanted to convey) Special mention to Management team and one who is in charge in taking care of the event part to be a little more soft and courteous while dealing with the customers as the concerned person was very rude.\n\nShould also mention about the steward and the front desk who were extremely supportive and well behaved.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good rooms.. Comfortable stay. But not much value for money. 4500 rupees without complementary breakfast. Few staff needs to be little more professional. I ordered dinner. A staff came with my food. Before he left he said,\" Sir you will have to pay for this meal in advance, please pay it now as you are under direct billing as per directions from reception.\".. Now tell me what kind of a hotel asks for money before you can finish your dinner, when you can make settlements during check out. I don't argue with fools, so I just paid and went ahead to finish my dinner. That's not a big deal but it definitely spoils the mood. Let your guest relax. They are there at your hotel after a hectic business travel -Kaustab Gogoi Room 201,Check out 7 Feb 2024",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The location of the hotel is good and it is beautifully decorated as well.\nWe went there to have our Lunch around 12:10 PM. Sadly, they were not serving lunch at that time and we had to order breakfast items. We ordered 2 chicken sandwich, 1 veg sandwich, 2 masala tea and a fresh watermelon juice. It took 35-40 minutes to prepare and serve the items. And to our surprise, before having our breakfast, a manager came and asked if they liked the food.\nI would highly suggest to reduce the serving time and look to serve meals round the clock.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "May not belong to any big chain of hotels but it's beautifully maintained, strategically located and well served hotel in the city.\nFoods are good n rooms are neat n clean",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The rooms are fitted with a flat-screen TV with satellite channels, a kettle, a shower, free toiletries and a desk. At the hotel rooms have bed linen and towels. At Hotel RJ you will find a restaurant serving Chinese, Indian and Pizza cuisine. Vegetarian and halal options can also be requested.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Sinclairs Burdwan",
      "rating": [
        4.3
      ],
      "address": [
        "Sinclairs Burdwan High Street 1, Renaissance Township, NH -2, Bardhaman, Goda P, West Bengal 713102, India"
      ],
      "reviews": [
        {
          "text": "Very nice place. Clean, comfortable and spacious rooms. Food was excellent. All service was perfect. It's a little outside center of Burdwan but not far from Burdwan University. Close to Shiva 108 Mandir also.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "3 star ⭐ hotel at Nababhat more Bardhaman beside National highway 2....best in class luxury hotels... Serene location.... Best hospitality and services... Years before there was no ideal place for conducting conferences or seminars at Bardhaman town.... Now most of the conferences of large business houses are hosted here... Food quality is also unquestionable.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Classic Ambience. Food is average. Courteous Service - Over all a good place to hang out.\nbit expensive!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We have been there during puja, and with that kind of rush, they only had 2 waiters to serve all table making it very difficult to manage. Also it's so empty to a point where you don't want to spend more than 10 minutes.  Food is good but staff seems insufficient in number",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice hotel with good food..I had my engagement there many years ago so this place is very close to me..",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Bless Inn Hotel",
      "rating": [
        4.2
      ],
      "address": [
        "148/D, Grand Trunk Rd, East End, Baronilpur More, Bardhaman, West Bengal 713103, India"
      ],
      "reviews": [
        {
          "text": "The hotel's location is great , But a lack of decent parking space due to the location.\n\nThe rooms are clean with basic amenities but too small in size.\n\nGood hotel for low budget business travellers. The restaurant below is also a very busy restaurant in weekends and takes time to give room service. Food quality was good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Thank you for the opportunity to provide feedback on our stay at your hotel. Overall, we had a positive experience and appreciated the accommodations and services provided. However, there are a few areas where we believe there is room for improvement.\n\nFirstly, the check-in process was quite slow and inefficient. There was only one staff member at the front desk, and we had to wait in line for quite some time before being attended to. It would be beneficial to have additional staff members available during peak check-in times to streamline the process and reduce wait times for guests.\n\nSecondly, the cleanliness of our room was not up to our expectations. While the overall condition of the room was satisfactory, we noticed some dust accumulation in corners and on surfaces. It would be great if housekeeping could pay more attention to detail in ensuring a spotless room for guests.\n\nAdditionally, we found the noise levels within the hotel to be quite high, especially during the evening. The soundproofing in our room was not very effective, and we could hear conversations and footsteps from adjacent rooms and the hallway. This impacted our sleep quality and overall comfort during our stay.\n\nOn a positive note, the hotel staff were generally friendly and helpful. We received prompt assistance when requesting additional amenities and their recommendations for local attractions and restaurants were quite helpful.\n\nFurthermore, the location of the hotel was convenient, with easy access to nearby attractions and transportation options. We appreciated the proximity to popular tourist spots and appreciated the hotel's efforts to provide informational brochures and maps for guests.\n\nIn conclusion, while we enjoyed certain aspects of our stay at your hotel, there are areas where improvements can be made. We hope our feedback will be taken into consideration in order to enhance the overall guest experience. Thank you once again for hosting us, and we look forward to seeing the positive changes in the future.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are very well equipped, though the blankets and comforters are old and dirty, also the breakfast menu is very short on items and availability",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel is really awesome from both inside and outside. One of the best in the entire bardhaman town. Location wise also, it's in a prime spot, right on the GT Road, and also well connected to the bardhaman railway station.\nThe rooms are very high quality with almost everything at your service from AC to 24hr geyser to hair drier.\nThere is a restaurant attached to it as well for refreshment.\nBut the place is costly and not affordable for everyone. And also the attendants are very reluctant to give you room even if the entire inn is empty. They try to shoo away the customers needing room,even if there are ample rooms unoccupied, don't know why.\nThey switch off all lights at night and lock the main door from inside which could be tricky for people coming from any occasion in the middle of the night.\nAs a whole it's a good place if you have money and if you have cache to get the rooms booked, cz for ordinary people going to book rooms, they ALWAYS SAY NO.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "All service are very good. No problem and no any complen about there service. I recommendations for that hotel.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Nataraj & Boarding",
      "rating": [
        3.5
      ],
      "address": [
        "Ward No-7, railway station, 54, Grand Trunk Rd, near Burdwan, Khosbagan, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "This is one of the finest hotel in Burdwan town in low rate .\n1) Good staff behaviour.\n2) Comfortable bed and sofas .\n3) Neat and clean washroom and rooms .\n4) Per night 1600/-",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Truly the staff behaviour is very good and like friendly ....they treat u as their guest ...each staffs are very helpful....u can stay with ur girlfriend properly and can spend romantic mood (fulsojja) with ur partner ...they does not disturb u by knocking... I spend many nights in here ....the AC room price is so high for a night it's 1500 and also the non AC room price is 1300 the price for a night is too high....but if u want to spend a several times then it's better to pre book as someday the rooms are not available it was full by the others....\nASAP! U can go to this hotel with ur gf or family .....\nThe non AC rooms are in very bad condition.....not to book it .....u can take the ac one .....",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "I had a good stay here . I stayed there with my brother . The objective was to see the tourist attractions of Burdwan . I will just list Pros and Cons here :-\n\nPros :-\n1. Room was spacious and comfortable . Room rent is 600 for Non AC and 1000 for AC . If someone books online , he/she has to pay double that amount . My suggestion is to come, check the room and stay . Even if rooms are not available , there are many hotels nearby .\n\n2. Very convenient location. Walking distance from railway station and Curzon gate .\n\n3. Lots of eating options present in vicinity .\n\n4. Liquor shop at the basement of the hotel .\n\nCons :-\n\n1. If someone comes with own car, forget this place. This has no parking .\n\n2. No lift/elevator ,staircase is narrow . Not suitable for elderly person .",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Good One With a low Price And well maintain Fully Satisfied",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Useless hotel. The behaviour of the staffs is not good and they are behaving like they are the owner of this hotel .Very bad service .Useless and money waste hotel. The incident happened with me is that we booked hotel and we had asked them earlier that the does the room can be adjusted for three people ,they said yes and but when we reached the hotel ,they put one mattresses on the floor and told one of us to sleep on the floor. Disgusting and irritating intolerable .Kindly never ever come to this hotel for stay .",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "NAKSHATRA - Banquet, Hotel and Restaurant",
      "rating": [
        4
      ],
      "address": [
        "6VJ8+RCC, 63, Grand Trunk Rd, Perbirhata, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "The buffet is satisfactory at the price range, but the service is slow. Restaurant food is over priced and quality is average. Over the phone the staff said that mutton seekh kabab will be available in the buffet menu but it was not when we visited the next day. The buffet is definitely recommended but the restaurant not so much. No comments about lodging and rooms as I haven't stayed there.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The restaurant offers both buffet and ala carte options. We chose the buffet, which was a great value for money at 699/- (non veg). The food quality was excellent, especially the main course dishes. Unlike some other buffets, this place did not compromise on the taste or variety of the main course items. Apart from the mutton, which was average, everything else was delicious and satisfying. I would highly recommend the buffet here for 699/- as it is a worthwhile experience.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Food quality is good but the quantity is very poor....\nPrice are very much high for this small amount..\nWe have ordered kebab...in which 6 boneless pieces are available but the size of this portion ...omg!! Horrible...\nBut the price is toooooooo high.\nAlso the quantity of biriyani is very small.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We went here to celebrate my birthday.\nTrust me you will never be disappointed by go there,\nI love their service\nThe staffs are very good , polite and respectful for costomers.\nAnd taste is really too good\nWe tried their buffet for lunch\nWhich is about 800 + gst for 1 person\nWe go there and for two persons bill goes to 1789 something. But we loved the food , service and everything.\nThey also provide mutton in their menu .\nAlso they have hot serve of kabab and all in the table in fire .\nThey have soups and breads and all\nbutter chicken, chicken kosha , mutton , egg curry, fish, and chicken varta , biriyani and many more\nThey also have a vegetarian buffet which is in completely different place . Very well managed.\nMainly their crispy baby corn is too yummy\nAnd casun potato is just 10 out of 10\nBut main course is also good\nThey serve roti and breads hot on the table if you want them",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "These hotels are not for common people, here you have to enter with a lot of money to eat, your lowest bill is from 200 taka, you can bill twenty thousand taka here.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Preet",
      "rating": [
        3.4
      ],
      "address": [
        "Bus stand, 53, Grand Trunk Rd, near Teenkunia, Khosbagan, Bardhaman, West Bengal 713145, India"
      ],
      "reviews": [
        {
          "text": "This place absolutely doesn't deserve even 1 star.\nWe had booked 3 rooms in the hotel for 1 night. The owner/front desk person is a grumpy sardarji full of attitude who probably doesn't know how to treat guests. We had a heated argument with him at night and decided to check-out and not stay the night at such a place.\n\nComing to the rooms, there is nothing good about it. No WiFi/proper mobile network, dirty walls, bedsheets, AC for which the remote is not provided, bathroom which has all broken fittings.\n\nI know it's not a 2/3* hotel but considering they charged 1500 per room, we can atleast expect some basic amenities and politeness from the owner/staff.\nThink twice before deciding to stay here.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Lots of problems in this hotel,\n1) One of the dirtiest hotel room ever experienced .\n2) Rude behaviour of hotel staffs .\n3) Unusual demand for tips by room service though no room service provided .\n4) According to room situation and quality high rate 1100/- .\n5) Dirty washrooms.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Its in a very congested street ,They won't give you towels and soap.\nStaff behavior is ridiculous\nIf you order food they may ask for your property papers LOL",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Rooms are not clean, smells like pee everywhere. Owner is very abusive and not good person",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Very  bad experience  rooms  are too 👎  but the important  thing is they are  fraud  as we showed our adhaar  card and they took  a pic  of it and  we use our gpay  for room  rent next day  my bank  account  was debited  and the massage  showed apps cw  ,which  means  some  one has taken  money  from my account  by adhaar  no. Gpay bank  no. Some one from the hotel  has done  the fraud.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Hotel City Tower",
      "rating": [
        4
      ],
      "address": [
        "85, Grand Trunk Rd, Khosbagan, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "This hotel is in the heart of the town they have upgraded the rooms and amenities as well. Service is good but little bit late. the rooms are comfortable.....food quality is good....but here breakfast is served after 8 o clock. So if you check out before 8 o clock plz manage the breakfast with your own. This needs to be corrected by the management as ASAP.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Went to hotel at 10pm, the reception guy said that a room was available for 1250.. but immd his owner frm behind spoke something in local language and told rooms only available at 2950. They tried to cheat me and thought i would be forced to take a room as it was in the night. Less priced rooms will be available . But they wont give and trouble u in the nights.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good place to stay.  Rooms are very spacious. Cleanliness is good.  stayed at Room no. 308. Problem of Car parking, especially for  big vehicles like Scorpio. Restaurant not available.  05.01.2021\nAgain stayed at Room no. 407 on 20.12.2023. It seems Problem of vehicle parking resolved. Parking arrangements in basement.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The old manager is mannerless people & he does not know how behave with customer. 3rd  class hotel in the city...",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Excellent location, rooms need to be more improve, low room lights which creates eye pressure at the time of reading and writing.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "OYO 31121 Hotel Damodar Inn",
      "rating": [
        3.9
      ],
      "address": [
        "BC Rd, Karjan Gate, Khosbagan, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "Well ..place ... atmosphere was good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "happy with your service. We will recommend The Candid House team to take their services as they are probably the best photography group in Rajasthan",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "EXCELLENT PLACE TO STAY AT BURDWAN AND SERVICE QUALITY IS JUST AWESOME.\nMY SUGGESTION IS TO STAY EVERYONE ONCE ATLEAST.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Really very nice and clean room . And staff is very helpful and we'll behaved..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Neet & Clean. Staff behaviour very good. Ac room rate are little bit high as per room size.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "The Pearl Burdwan Hotel & Banquet - Best Hotel In Burdwan",
      "rating": [
        3.9
      ],
      "address": [
        "LAXMIPUR, 140 G.T. ROAD, PURBA BARDHAMAN, PIN-713101, Laxmipur Math, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "It was my second time to visit at this restaurant. The first time I was harassed, I was told to \" If you don't like us here, you can go somewhere else\". This time also the same person harassed me. Food quality is very good. But the Service is very bad. But the one who wears  red blazer \"the tall guy\" has misbehaved with me twice. The company should fire this person. Your restaurant is getting a bad name for this person. i am never visit this place again.\nVery Bad experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Food was good but service of the staff was below the mark . I booked tables for my birthday dinner and pre ordered the food with an advance amount a day before but they made us wait like 30 minutes in between the starter and main course. Water stagnant in the sink . Top of all the waiting period ! Ah ! It's just so awkward for me to face the guests after this much inconvenience!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very badly served… even after giving order a day ago we have to wait for so long for the food also the food quality was terrible, the staff was so lazy their behaviour was so inappropriate as if they don’t care about customers….. will recommend you to hire well mannered staff first then decorate your restaurant, people don’t go to restaurant for siiting for 1hr to just get a starters !",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "My stay at the hotel was marred by various issues, including dangerously slippery bathroom sandals, persistent room odors, uncleanliness with no bedsheet changes, and an overall lack of professionalism from the staff. These aspects collectively contributed to a disappointing experience, especially during a special occasion like attending a wedding. I hope this feedback aids others in making informed decisions about their stay at this hotel.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The food quality is excellent, the ambience is highly classy and the behaviour of the staff is really good. I ordered Veg Biryani and Kadai Chicken for lunch  and all I can say is that the quality of food was up to the mark.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Bardhaman Bhavan & B B Caterer",
      "rating": [
        4
      ],
      "address": [
        "Kalna Link Road, Railway Loco Colony, Bardhaman, West Bengal 713101, India"
      ],
      "reviews": [
        {
          "text": "A pretty basic hall with accomodation facilities with space enough to park approx 7-10 cars.\n\nRooms are okay at this price with majority of them having dents, non working washroom/geyser/taps.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The place has good space, so ambience is very good for organising weddings and receptions. It has 12 rooms ac and non-ac, including a dormitory. Total capacity will be strictly between 30-50 person. The rooms are good wrt to Burdwan standards, but some have damp smell. The outside food area is big enough for 100 people at a time in case of occasions. Although we found the main room for reception to be very small fitting 70 people, which is why we organise the party completely outside.\n\nAs the Sabhapati also lives in the same campus,there are some restrictions. Please be aware of them before planning things. The people running the place are reasonable and cooperative.\n\nThe decoration, flower, electric and food are handled by different parties and you need to state your requirements to them as well as to the authority there.\n\nWe have an wonderful experience there.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Ample space for the decor ... Neat and tidy. Limited car parking space on the property however can be parked outside alongside the road.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice catering they're having. Good quality food available here .",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice place for marriage and reception etc",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}