{
  "places_with_reviews": [
    {
      "name": "Ramada Encore by Wyndham Bareilly Civil Lines",
      "rating": [
        4.2
      ],
      "address": [
        "8/8A, Block A, Civil Lines, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "Me and my friends had a really great time at Ramada. Elegant atmosphere, humble and efficient staff, scrumptious food and amazing cocktails.\n\nA perfect hangout destination with the best sushi in town! Can’t wait to try more from the menu.\n\nI must praise the staff. They were effortless. The chef recommended us a few dishes and all of them turned out amazing.\n\nThe interiors of the hotel are aesthetic and one of the best in Bareilly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I recently had the pleasure of dining at the Ramada restaurant in Bareilly, and I must say, it was an experience to remember.\n\nFrom the moment I walked in, I was greeted with warm smiles and excellent service. The ambiance was inviting, with a modern and elegant decor that made me feel instantly at ease. The staff(especially Prashant and Anand) were attentive and friendly, and I felt well taken care of throughout the entire evening.\n\nAnd the food? It was nothing short of spectacular. Each dish was expertly prepared, bursting with flavor and beautifully presented. The menu offered a wide variety of options, from traditional Indian cuisine to international favorites, and I was impressed by the quality of every dish I tried. The chefs at Ramada truly have a talent for creating delicious and memorable meals.\n\nOverall, my experience at Ramada restaurant was truly delightful. The combination of exceptional service, inviting ambiance, and outstanding food made for a truly memorable dining experience. I highly recommend this restaurant to anyone looking for a top-notch dining experience in Bareilly. Whether you're a local or just passing through, be sure to make a reservation at Ramada – you won't be disappointed.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Having our stay in ramada hotel for 2.\nDays. Breakfast was really  good. Had a great service by hotel staff specially Mr Tapos Nd Ms. Ishita Look after us during our stay. Would strongly recommend everyone to visit Ramada Hotel.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "With a great staff and service this hotel serving some very tasteful dishes.\nMy recent visit was a beautiful experience in the heart of the city providing a relaxing environment and such well trained staff.\nThis place is my go to place.\nHighly recommend.🍷",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ramada’s breakfast experience was a delightful way to start the day. Whether you’re a continental connoisseur or a lover of Indian flavors, there’s something for everyone. Kudos to Harish and the team for making our morning memorable!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Gala Galaxy",
      "rating": [
        4.2
      ],
      "address": [
        "KK Hospital Rd, Rajeev Kunj Colony, Rajendra Nagar, Bareilly, Uttar Pradesh 243122, India"
      ],
      "reviews": [
        {
          "text": "I had the pleasure of staying at Hotel Gala Galaxy during my visit to Bareilly on 29th Jan, and I must say, it was an exceptional experience. The staff at this hotel is truly outstanding—courteous, attentive, and dedicated to ensuring a delightful stay.\n\nWe attended a function organized within the hotel, and I was genuinely impressed by the impeccable work of their team. The decor was nothing short of overwhelming, creating a truly festive atmosphere. The party hall was beautifully arranged, and every detail seemed carefully thought out.\n\nThe highlight, however, was the food. The Veg Jalfrezi was an absolute delight, showcasing the chef's culinary expertise. Moreover, the breakfast served at Hotel Gala Galaxy surpassed the standards of other hotels in the same category. It was a gastronomic delight, offering a variety that left a lasting impression.\n\nFrom the party hall to the rooms, everything was perfectly maintained, reflecting a high level of cleanliness and attention to detail. The overall ambiance was not just comfortable but also exuded a sense of elegance.\n\nIn summary, my stay at Hotel Gala Galaxy was marked by exceptional service, remarkable decor, and outstanding culinary offerings. It has set a new benchmark for my expectations in the hospitality industry. I highly recommend this hotel to anyone seeking a truly memorable and enjoyable stay in Bareilly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I am extremely grateful to Arshad Khaliq and Akhilesh Kumar Singh, the general manager, for their exceptional care during my Roka ceremony on 9th December. They were incredibly supportive, and all the guests had only positive things to say about the hospitality, food, cleanliness, and service at the venue. The food was delicious and served hot, with the staff ensuring every guest was taken care of from the beginning to the end. The rooms were spacious, clean, and hygienic. Overall, it was a wonderful experience, and I hope to have all the rooms booked for my wedding day so that my guests can enjoy the excellent service provided by Arshad, Akhilesh, and the entire Gala Galaxy staff. This way, I can have a stress-free wedding day knowing that everything will be taken care of. Thank you all.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good experience overall for aur 5 nights stay,location is very convenient,rooms were clean and service was quick,the only hiccup we faced was the need to switch the rooms a floor up coz they had a booking for a group on our floor and we were moved without the next rooms being ready.\nWould recommend for stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Well managed property at convenient location. Attended one function there, well decorated hall and good food and services.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice experience.\nFood was expensive as per my thought.\nService was good.\nCleaning good.\nNice experience overall. Location is not so good\nCar parking place is about 200 metre that trouble me",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Flagship Resort Sita Kiran",
      "rating": [
        3.6
      ],
      "address": [
        "88 B, behind Hind Cinema, Civil Lines, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "This hotel is inside a street on the main road of Ayub khan choraha and It is safe couple friendly , try to get deluxe rooms on 1st floor , the rooms on 1st floor are good and spacious. Room price are quite high but If I honestly say , it's a good prize for safety and privacy with a clean room",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Problem is : hotel put all issues on OYO and nobody knows where is OYO.\nOnly good thing that saved me is that I am very well known to the city. So no problem. But hotel stay was pathetic\nI wanted Bill. Who to contact.. Hotel gave to OYO... Who will give me.\nMy first experience with OYO booking. And this is also the last.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Worst experienc not a hygieneic place to stay, bathroom n room both are not clean staff behaviour also so rude overall wrost hotel giving 1*",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "only location is good but it is like a dharamshala (now days dharamshala are much better than this ) where you can not expect any service .... interior is good but maintainence is very poor ... no clean accesories you expect here dirty towles torn quilt and stained bed sheets  ... only good thing is location which is in the middle of city and space for parking ..please focus on your services otherwise a good hotel will close soon",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "They urgently need renovation in rooms,\nThe plugs in room are not working so you can't charge phone.\nYou can easily find cockroach and insects here and there",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Sobti Continental",
      "rating": [
        3.9
      ],
      "address": [
        "Green Park, Bisalpur Rd, Green Park Colony, Bareilly, Uttar Pradesh 243006, India"
      ],
      "reviews": [
        {
          "text": "Offering a restaurant, Sobti Continental Bareilly is located in Kāgāraul. Free Wi-Fi access is available. The property is 1.5 km from Fun City. The property is located 3 km from both Bareilly Railway Station and Bus Stand. The famous Laxmi Narayan Temple is 4 km away. Rooms here will provide you with a flat-screen TV, air conditioning and a minibar. There is also an electric kettle. Private bathrooms also come with a shower. Extras include a seating area and satellite channels. At Sobti Continental Bareilly you will find a 24-hour front desk, a garden and barbeque facilities. Other facilities offered include meeting facilities, a business centre, car rental, a tour desk and dry cleaning.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The interior of the hall is beautifully designed,  commendable space for parties\nThe food is delicious and the service is impressive.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "My experience in this hotel was very pathetic. The way hotel receptionist received us absolutely disappointed. The girl who was on the reception, doesn’t even know how to talk with the guest. No body was responding clearly on the desk.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "There were few turn offs, but overall experience was good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Went for dinner. Food was okay. Pindi chole were sweet and naans were thin. They had musicians which were too loud for the kids. Overall the experience was not good. Its also pricey as compared to our good restaurants.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Swarn Towers",
      "rating": [
        4
      ],
      "address": [
        "228-A, Station Rd, Civil Lines, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "I had a very enjoyable stay here. The staff were welcoming. I ate in the roadside bar and the food was very good. The deal Makhani and breads were the best. The beer was also cold and having a Cappuccino with breakfast was a treat.\nI would recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A well established set up close to the railway and bus station having good proximity to the city centre. Neat layout, spacious parking and new feel to the rooms. they have maintained their high standards of service. The hotel is also equipped with a gym which is a welcome addition. Keep up the good work, overall recommend this hotel to everyone. I would like to extend my heartfelt thanks Mr. Pawan, Ms. Jyoti and Sachin in Making my stay memorable & comfortable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "ideal location, close to railway station. nice property. rooms are very spacious. the best part was service. coffee shop was also open 24/7. close to railway station has its own drawback with trains sound. Special thanks to Ms. Jyoti & Mr. Pawan  Amit  Sachin & Rajneesh for making our stay memorable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's a pleasant place for stay. Rooms are very comfortable. Service is so good. Fooding is ultimate especially brakefast.Staff behavior is so good. Over all experience is ultimate.\nRegards\nAmit Kumar\nMEERUT\nLoby boy Mr Rajneesh Kumar (Staff member) is so cool and very polite and so helpful.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Our stay was very pleasant… delicious food and staff was very supportive specially Ms jyoti and Mr pawan… i highly recommend this hotel to have stay in bareilly",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "The Manor Bareilly Hotel",
      "rating": [
        4
      ],
      "address": [
        "209, Station Rd, Civil Lines, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "It is one of those rare places ,which has maintained it's class and quality of servings since its inception. It still tops in the list of favourites in bly for me a decade ago.They serve delicious tandoori platter ,soups and all time fav stuffed potato ...Along with great music by Aman 👍 lot can be done on cocktails and snacks part..Some new cuisines can be added  like Mexican nd thai",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel Manor is just walking distance from Bareilly station. This is a good hotel with parking space. Hotel is having restaurant and good food quality. Rooms are also spacious and clean. Good hotel for family and business purposes.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice experience. Stayed first time & got kind service. Harshit from front desk was very cooperative. I impressed with the food quality & taste. Room size was also good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "This is at this property are all great They all go above and beyond to make your stay comfortable please Hotel Manor give your Staff awards.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel is @Prime location. Near to Bareilly Jn. Railway station. Property getting Renovated to new look. Which already giving Luxurious vibes.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel JM Vistaraa",
      "rating": [
        4
      ],
      "address": [
        "1165, Pilibhit Rd, Delapeer, Ekta Nagar, Bareilly, Uttar Pradesh 243122, India"
      ],
      "reviews": [
        {
          "text": "Hello friends, we had an amazing experience last night.  We celebrated the birthday party of brother-in-law's son here.  The decor and housekeeping were very good.  The behavior and service of the service staff was very good, we enjoyed ourselves a lot.  Special thanks to Mr. Harry for his cooperation and pleasant nature...Thank you very much personally.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Loved it here! Staff very professional and very friendly. Breakfast amazing! Very close to hustle and bustle but far enough away for chilling! Just perfect!!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Our function was very efficiently managed and executed by the hotel staff esp. Pramod ji, Harry and Jeetu who took care of the minute details right before the start till the very end and made it an ever lasting memory for our family and guests. A great place to be, safe and enjoyable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice place for attend a marriage ceremony. A hall in basement and a hall on ground floor. It is situated on road so finding it's easy. Food is good and tasty.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We had our party at Hotel JM Vistaraa and to our convenience and liking we found the crown hall perfect place for gathering and family function. Our preferences were taken into consideration and the staff was responsive enough to take care of our choices.\nMainly the managers Mr. Harry and Mr. Pramod Chawla managed their staff and the whole function perfectly. The food was of our liking without onion and garlic.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Casa Divine",
      "rating": [
        4.3
      ],
      "address": [
        "Pilibhit Bypass Rd, near Royal Enfield Showroom, Avas Vikas Colony, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "The hotel premise is quite good and beautiful.\nThe staff is cooperative. We had the suite rooms booked which were worth the price.\nOne thing to note - I got a call from reception in the morning saying that we have our buffet on the top floor. From the statement we got the impression that the buffet was complimentary. Later on we found out that the buffet was chargeable and we paid some amount after negotiations about the miscommunication.\nApart from that the hotel staff and hospitality were amazing.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great ambience and ample sitting area closed and as well as open ..Services are good but lot to work on food quality ,and variety to be served.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "hello friends, these 2 stars for only decent staff and facilities of hotel. location is in front of main road. 1 thing was not good and it was environment. i felt very scary at mid night when unknown people was shouted outside of my room. some time they were trying to open my room and some time they were ringing the door bell and i noticed that time the hotel staff was not present. early morning i check out from hotel due to my exam. so, i personally can say that the hotel environment is not safe for wedding season. thank you friends .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Attended a kitty party today\nService was pathetic\nNo proper serving\nTasteless food\nAnd breads were so pathetic that even animals will not eat such breads.\nEven after complaining many time there was no proper response.\nWe didn't expect this kind of service with a hotel as reputed as CASA Divine\nI think they should change their name from Casa Divine to Gutter Divine",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "One of the major drawbacks was the lackluster service provided by the waitstaff. They seemed disinterested and inattentive, failing to provide the level of professionalism one would expect from a formal establishment like Casa Divine. It was disappointing to see that they were more focused on suggesting tasteless dishes rather than genuinely recommending what would enhance our dining experience.\n\nFurthermore, the DJ at Casa Divine failed to meet expectations. Instead of paying attention to the preferences of the guests, they played outdated songs that did not resonate with the ambiance of the restaurant. This lack of attention to detail and disregard for the patrons' musical preferences was quite off-putting.\n\nOne piece of advice I would offer is to avoid ordering any mutton dishes at Casa Divine. The quality of the mutton dishes was subpar, and I found them to be rather underwhelming. It's best to explore other options on the menu that may offer a more satisfying culinary experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel D'Grand",
      "rating": [
        3.7
      ],
      "address": [
        "211-A, Station Rd, Civil Lines, Bareilly, Uttar Pradesh 243001, India"
      ],
      "reviews": [
        {
          "text": "Please avoid this hotel if possible as the staff working here are fraud specially the manager with name govind gangwar.\nDuring my last stay when I booked online they asked to visit directly or book by phone\nBut they hardly answer on call so visited online at 11 pm at the same time checked online at goibibo price for the room so called deluxe one where I find the price 1584/- tax paid including breakfast and what I come to know that room is not available and they remove the room from the web in few seconds only and tried to shift me to maximum capping room which is so over priced for the  sevice and room quality the hotel is having.\n\nSo if you are considering for family this hotel is something you should avoid else have to suffer with family as they will try to steal you by shifting it to higher room capping one.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The hotel is situated on railway road . There is no space for parking infront of the hotel. They park the cars on the street beside the hotel .\n\nThe room service is very very poor. A cup of tea can take anywhere from 30-60 mins.\nEven bottled water took more than 30 mins to come that too after repeated reminders .\n\nThe condition of the rooms is very poor. There is no dustbin. There is no dusting in the room . The phone and switches are having so much dust as seen in the attached pic.\n\nThe lift is local and looks very unsafe. Also takes a lot of time to arrive.\nThe windows in the room are jammed and do not open .\n\nI think I don’t need to say anything more in praise of this place.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Stay there for one night when check in guy at reception confirm room for 1500 but at check out another guy demand 1800 after an argument and confirm with night person they agreed\nPlease take a receipt while check in this hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Near bareally railway station\nHotel very beautiful\nProviding complementary breakfasts\nHotel very hygiene and clean and neet\nStaff behaviour very good\nPrices also reasonable\nYou need to stay barelly\nFirst choose is hotel d grand",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very worst experience.....staff are thieves...they stole my gold earings from my room...very bad behavior of staff and manager.no safety at all...beware of such frauds..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Sparsh Hotel and Resort By Spree",
      "rating": [
        4.7
      ],
      "address": [
        "Chauraha, Pilibhit Bypass Rd, opposite Suresh Sharma Nagar, Chandpur Bichpuri, Bareilly, Uttar Pradesh 243006, India"
      ],
      "reviews": [
        {
          "text": "Very nicely mentioned green grounds and the rooms are also nice.\nPool parties are a hit 🎯👍\nVery nice and beautiful place for a party event or weddings.\nLots of open and covered spaces for different occasions.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Stayed here for a friend's wedding. The place has 2 banquets, a lawn, terrace pool. The resort is beautiful overall, especially the bridge they have put overlooking the lawn. The rooms are decent and clean with all basic amenities. Food was ok, some items were good, some not, a mixed experience. The service is on the slower side though. Parking is available outside the main gate.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Pathetic, I don't trust the reviews that are pasted here.\n\nRooms are smelly, food is bad. If you want to have function or party here I would suggest just check the rooms once before booking.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Hotel would have been better à few decades ago.\nStaff was very friendly and helpful, but rooms were suffocating and claustrophobic and no apparently no differentiating from smoking and non smoking\nThe pool has a pond with green water and who knows what else\nUnfortunately it is very hard to find a clean non seedy hotel in bareilly and this was not one to recommend\nNice sparkling front tho and nice front desk people",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Beautiful place hugs ground area pool amazing 💞 I will go this some day",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}