{
  "places_with_reviews": [
    {
      "name": "OYO Flagship 811566 Hotel Lotus",
      "rating": [
        3.7
      ],
      "address": [
        "3rd floor shivaji chowk lotus mall,tulsi marg near rto, bardoli, Govind Nagar, Bardoli, Surat, Bardoli, Gujarat 395007, India"
      ],
      "reviews": [
        {
          "text": "I would like to rate in negative but the range does not allow.\n\nHotel is a BIG SCAM. Do not book the hotel online. They will never confirm and they will ask to pay in cash at higher rates.\n\nThe hotel staff is very rude and they look keep starring at you and your stuffs.\n\nWe booked for 3 nights on 19,20 ans 21 Jan 2024 and even though asking them to confirm on phone 2 day prior, they keep telling us that the system will update on the day of stay. Neither they confirmed Nor they given us the room. In the end we had to pay coz it was night and we had senior citizen.\n\nI would like to boycott this hotel in future and request everyone to not put yourself in this scam.\n\n#WorstExperience #BadHotel #BadStaff",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Booking is confirmed on oyo app but when you reached at hotel hotel reception said no room available in hotel. After sometime said your booking id is not visible so contact oyo customer care and customer executive said i can not help i refund your money. In awkward time where we go so hotel receptionist said you have to take offline room.\nSo one type of fraud done with customer by hotel and oyo. So don't do booking on oyo and this hotel.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Never ever book this hotel through OYO....they don't have proper system....no proper person with knowledge..think 100 times before booking......this hotel doesn't exit n now on d the same address hotel lotus town house is there n this hotel want to just earn money .....staff don't listen n see our booking mail n voucher too.....they just say every1 that in their system no booking is shown even after speaking to Oyo reservation n customer care staff .....they are very stubborn n rigid....n the manager is operating from other place.....n he has trained staff also we'll.....horrible day .....please don't book.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Worst experience ever. Booked online room but they show hotel pantry room that will be given for online and than for other rooms they ask for extra charges. Or to take other room.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Oyo room is frod amplification\nAnd the Lotus hotel Bardoli frod hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel blue diamond",
      "rating": [
        4.3
      ],
      "address": [
        "Surat - Bardoli Rd, Hidayat Nagar, Aksha Nagar, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "I had a pleasant stay—one of the best hotels among the few. Blue Diamond is located adjacent to the main road and near to the bus stand. Surrounded by few good restaurants (veg& non veg).\nRooms are spacious and affordable. The only problem was that there was no proper exhaust to the bathroom.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good option for overnight stay at Bardoli !!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very cool experience & Reception personal very excellent.... Good behaviour Thanks for my bad timing support for room.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Service is extremely good, an attendant is present at the counter for 24/7. The staff is very good. They don't have the restaurant option in their hotel but many good options are present around the hotel like Bismillah ice creams, amdavadi chicken, hazoori's kulfi, food King, chai sutta bar, kathiyawaadi dhaba and there's also a general mall where you can get all the necessary general items.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Clean room, staff behaviour very good, near to bardoli bus stand,",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Golden",
      "rating": [
        3.9
      ],
      "address": [
        "GJ SH 6, opp. Khan Empire, Chanakyapuri Twp, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "It's really nice hotel for stay alone and as well as with family also. Staff is very friendly. Services are available 24 hours. Proper spacious room, full security. I loved this hotel very much. And the main and important thing is that it is located near Surat Bus stand which is 2 min walking distance.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Bardoli is indeed an excellent place to find good accommodations that are both comfortable and conveniently located near the ST bus depot. The combination of quality and proximity makes it an ideal choice for travelers.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Room was full of mosquitoes, ventilation system was not good enough, in reception they were asking about cash despite of having scanner.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's good for your stay, clean room",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I think I'm spending too much time in hotel price are good compare to other and room are also good best for family and frnds.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Flagship Gray Rooms",
      "rating": [
        4.7
      ],
      "address": [
        "3rd, floor, kheteshwar arcade, Ten Rd, Baben, Surat, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "Excellent service.i found my room and wash room near  and clean.nice property,good staff,rooms are clean neat,ventilated.location is on highway near bardoli but stand overall , newly renovated with friendly staff and nice ambience . bedroom and bathroom are clean.open air parking available ☺️",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This is the second time I have booked a room in hotel gray rooms, I had a very good experience here, the whole place is clean and tidy, the cooling of the ac is very good, all the rooms have window arrangement, there is no confusing room, the staff at the entrance to the hotel.  I want to come here again because of his influence and talking skills, soap, shampoo, towel, everything is provided here, there is Geyger system for hot water in the bathroom, I have a very good experience, I stayed overnight with my girlfriend.  Done, had a good night's sleep with security, the mood of staying with the natural surroundings of the hotel is different.  You also visit once.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very hygienic and beautiful color combinations  rooms  in very budget price and staff is also polite and well behaved and must say location is perfectly for All, Good experience to stay at this hotel. Nice location and staff is very supportive.  I will give 5 star.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It has been a very good experience, the rooms were clean and big, being a hotel in an open area, we got the benefit of pure natural environment, in every way it was a good experience, the staff were kind and helpful in everything, the owner of the hotel especially. The things that help are very simple in the mind, I think this hotel is the best in the service so far, you can definitely visit it once, they provide everything, soap, shampoo, towels. Thank you Hotel Gray Rooms for your service...",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Excellent services. I found my room and wash room neat and clean. I checked in here yesterday at 11:30 pm. Call 📞 Picked up on first attempt at reception, I called for check in assistance at 10:30 P. M.. Room Tariff Rs.850 only. SINGLE OCCUPANCY.. IT IS A GREAT EXPERIENCE.. I RECOMMEND THIS HOTEL FOR SOLE WOMEN TRAVELERS AS WELL.. CLEAN SUTRI HOTEL AND SURROUNDING LOCATION IS ALSO VERY GOOD, IT IS A DIFFERENT PLEASURE TO STAY IN A QUIET ENVIRONMENT, I CAME FOR EXAM. I did not get any disturbance even in reading. Nice property, good staff,\nRooms are clean, neat, ventilated.\nLocation is on highway near bardoli  bus stand\nOverall, newly renovated with friendly staff and nice ambience. Bedrooms and bathrooms are clean. Open air parking available..",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Hilal",
      "rating": [
        4.3
      ],
      "address": [
        "Block no-298,Gujarat National Highway -6, Surat - Bardoli Rd, opp. DGVCL, Aksha Nagar, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "Rooms are good and affordable.\nFood is not prepared in hotel, the same is called from nearby restaurant.\nServicing of AC's are not done for months hence do not expect good cooling in rooms.\nIt  takes 10-15 mins for checkout in morning 7-8 am.\nBreakfast only includes bread butter and tea, no other options available.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Hotel is good but location is far from city overall if you want a nice big room at just 2500",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The reason of this hotel being Excellent is, we were having an event organised at their Banquet and no doubt the event was managed so well by the staff. The job was taken care fabulously. Also the Room’s were well maintained, everything works well, room service happens to be on time with the food being with an amazing taste. Overall my experience and my team’s experience was way good. And i hope you have an amazing one too. 🔥",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "stayed here for 2 weeks whilst on holiday. All of the staff are so lovely and polite, nothing was too much trouble. They really went out of their way for us with anything we needed. The rooms were lovely, clean and spacious and very modern. Everytime we go to India this is the only place we will be staying!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great place and nice rooms for stay-in",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel The Olympia",
      "rating": [
        4.3
      ],
      "address": [
        "Olympia Complex , Nandida, Chowk, Gam, Ten, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "We understand the importance of offering a reasonable price without compromising on the quality of your stay. Our economic pricing structure ensures that you get exceptional value for your money. Whether you're a business traveler or a vacationer, you'll appreciate the excellent balance between cost and comfort.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "They are very unethical!!!!\n\nDon't go by old reviews...even we fell into that trap.\n\nWe booked it via Agoda and paid full. After reaching there the guy told we are not affiliated with Agoda...there is no booking of yours... and you will have to pay double the amount which we already paid to Agoda.\n\nUsually we confirm before going the hotel....but these guys have not mentioned their phone anywhere.\n\nThey use OYO's name, get customers in oyo/agoda name and then loot customers saying we are no more affiliated.\n\nSince it was late night, we had no other option but to pay....while paying also They have their own terms that you have to pay 100% advance. But after paying 100% you will come across rooms not properly cleaned....we had to change the room as the toilet was not clean. There was no soap, no towels.....we had to ask them to provide the same.\n\nAt the time of leaving we asked the bill and the receptionist said it will take minimum half an hour...and he will send via whatsapp later. We haven't received it till date.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It was a pleasant experience,  only good quality hotel with spacious room and android TV for entertainment. Cosy warm blankets and good quality made the stay better at very low cost.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Safety matters to me. Parking is very good. New property and very good rooms. Also best part is smart TV\nThank you.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good hotel to stay in bardoli. Little beat away from bardoli but good to stay. Service is also good. Price is average",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Lotus Town House",
      "rating": [
        4.3
      ],
      "address": [
        "325 Hotel Lotus Lotus Mall Shivaji Chowk Opposite Indian Petrol Pump Dhamdhod, Road, near RTO, Patel Nagar, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "Never ever book this hotel through OYO....they don't have proper system....no proper person with knowledge..think 100 times before booking......this hotel doesn't exit n now on d the same address hotel lotus town house is there n this hotel want to just earn money .....staff don't listen n see our booking mail n voucher too.....they just say every1 that in their system no booking is shown even after speaking to Oyo reservation n customer care staff .....they are very stubborn n rigid....n the manager is operating from other place.....n he has trained staff also we'll.....horrible day .....please don't book.totally fraud.....OYO have confirmation but the staff n manager don't listen to us....if they don't want to accept online booking then they should update on google",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very good experience. Property is just 400 meters away from main market but still an ultimate calm place and connected to nature. Very good service by polite staff. They resolved my all issues in quick time. Food is decent with good variety in breakfast and main course. I didn't try main course but breakfast was very much decent. Overall its a family friendly and safe property. Some observations: 1.\nInitially I had been allotted a room which not in good condition. But later upon request, management shifted me to new room which upgraded recently and having the latest bathroom and room amenities. 2. No 24*7 hot water. But staff provided us hot water in bucket on our late check-in day and also started hot water on our early morning checkout by 5 am. 3. No soap bars and shampoo or dental kit provided in the room which I feel a genuine ask in this tariff range. 4. No mineral water in the room on checkin.\nRequesting management to look into above concerns. Still, its a pleasant stay. Super like.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Bhot clean hotel tha staffed was awesome and food bhi bhot delicious tha good location ❤❤",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice stay and very peacefull place. Staff behaviour is good. Room is very clean and hygienic. I m recommend this hotel to stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I had an absolutely wonderful stay at Hotel Lotus. The staff was incredibly friendly and accommodating, the rooms were immaculate and comfortable, and the overall experience was truly exceptional. Highly recommended!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Bardoli Bus Stop",
      "rating": [
        4
      ],
      "address": [
        "4484+G5J, Surat - Bardoli Rd, Hidayat Nagar, Aksha Nagar, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "OYO Hotel Nature Peak",
      "rating": [
        4.2
      ],
      "address": [
        "3rd floor parishram park, 3rd floor, Parishram Park Shopping, Surat, Gujarat 394620, India"
      ],
      "reviews": [
        {
          "text": "Good stay Experience☺️ and staff behaviour is also wel😍l , Very clean room and Towels and must visit enjoy Ur trip in bardoli near Surat",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice hotel\nBest price and best rooms 🏨🔑👍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice hotel room's",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "NIC",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "SPOT ON 40751 Hotel Amiras",
      "rating": [
        3.6
      ],
      "address": [
        "Hotel Amiras 2nd floor, Hotel Amiras, Gyan Prawah Apartment, Surat - Bardoli Rd, GIDC, Surat, Bardoli, Gujarat 394601, India"
      ],
      "reviews": [
        {
          "text": "very well decorated and room was clean.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Great Hotel, Well-mannered Staff",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Nice place...👍",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Up",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Light power Water convenience available from garden",
          "languageCode": "en-US",
          "rating": [
            3.6
          ]
        }
      ]
    }
  ]
}