{
  "places_with_reviews": [
    {
      "name": "Ramada Plaza by Wyndham Agra",
      "rating": [
        4.2
      ],
      "address": [
        "672 Basai, Fatehabad Rd, Rakabganj, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "Excellent place to stay a bit far from the main City. Stayed here with family through Club Mahindra booking. Very polite staff and good food at the hotel. The swimming pool 4.0 ft looked good but we didn't have time to try it out. Overall a very pleasant experience.\n\nWhile Check out we forgot an Electronics gadget, the housekeeping and security immediately handed over to us asking us politely to wait at Car parking. Very pleased with the hospitality.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Loved the stay. The only thing i didnt like was the brkfast area or the dining area i would say. It is small as compared to a 5-stars dining area should be. If they can get that fixed it will be grt. U cannot sit for long in d area aftr ur brkfast as their are odr people or grp waiting to have their food and the lady has to request u to get up so that odrs can sit. This is not acceptable at a 5-star. Rest all are very good!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel services are not up to the mark, as provided by the other Ramada chain in the country. The staff seemed to be less caring..\n\nThe buffet service is very slow, items once finished took a lot of time to refill and that's not just once, i stayed for 2 days and both days were the same.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This is actually a 5 star hotel ,you can feel it and says it is truthful ❤️. Rooms and toilets are neat clean.you can also enjoy swimming in the pool.exterior garden is more attractive and peaceful.banquet hall, conference hall,gym are very nice.Here you can get nice food and drink options,are very tasty and excellent service.very spacious parking space, easy access.prices are comparatively budget friendly and offers are awesome.overall nice stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Staff superb can't do enough for you. Rooms good size with all usual amenities. Happy hour 2 premium budweisers large 450 rupees",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Taj Hotel & Convention Centre, Agra",
      "rating": [
        4.5
      ],
      "address": [
        "Taj East Gate Rd, Taj Nagari Phase 1, Telipara, Tajganj, Agra, Dhandhupura, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "Taj Hotel was amazing! The service from the moment we arrive to when we left was incredible, feeling welcomed and entertained throughout the whole stay. Beautiful views, good breakfast, and comfortable rooms.\n\nI specific highlight was Sabhar from housekeeping, who was diligent with his service and paid attention to detail. It was a joy to stay at a hotel and be hosted buch a wonderful team.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Amazing experience as usual at Taj. Also, in addition Taj Agra has so many great artists working with them which is a feather on the cap.\n\nspecial mention to @Mukul Singh - his wonderful sketching skills is a must try. He makes the picture come to life. I got a sketch done for me and my wife and got an amazing picturesque.\n\nOverall wonderful stay, Thanks Taj Agra. Will come back soon.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I recently had the pleasure of staying at the Taj Convention Centre in Agra, and I must say, it exceeded all my expectations. The bathrooms were spotless, a true testament to the hotel's commitment to cleanliness. As for the dining experience, both dinner and breakfast spread were exceptional. The variety and quality of food were top-notch, catering to every palate. Overall, I highly recommend the Taj Convention Centre for its impeccable amenities and delightful culinary offerings.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Superior room costing Rs. 6000 does not have a bathtub. The bathroom was very congested. The room quality was like a 4 star hotel. Not expected from a 5 Star hotel.\n\nThe staff was supportive and friendly. The breakfast buffet was good.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The hotel is truly remarkable, boasting stunning cleanliness and beauty. The views, whether from the room or the Sky Lounge overlooking the Taj Mahal, are breathtaking. The culinary experience was exceptional, with every meal being delicious. Additionally, the hotel features various shops offering quality souvenirs and local products at reasonable prices. However, what truly sets this establishment apart is its outstanding team. From the warm welcome to the attentive service provided by every member of the staff, including the cleaning crew and senior management, our experience was nothing short of extraordinary. The elaborate breakfast, lunch, and dinner buffets were thoroughly enjoyable, and the chaat papri session was a highlight. Plus, the terrace lounge with a swimming pool offered a beautiful view of the Taj Mahal.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Jaypee Palace Hotel & Convention Centre - 5 Star Deluxe Hotel in Agra",
      "rating": [
        4.6
      ],
      "address": [
        "5339+G6Q, Fatehabad Rd, Tajganj, Tora, Agra, Uttar Pradesh 282004, India"
      ],
      "reviews": [
        {
          "text": "Beautiful hotel in Agra. I stayed here as part of a tour package and thoroughly enjoyed my stay. My room was big, clean, and had an outdoor patio area. I didn’t use them, but there is a decent sized outdoor pool also spa facility. Nice gym as well.\n\nI only had breakfast and the buffet had a good number of options. The welcome fresh flower garland was also a nice touch to the start of my stay!\n\nWould definitely stay here again. Staff was wonderful.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "A beautiful and fantastic luxury hotel in Agra. The service of the staff were exceptional. One of the best I’ve stayed in. I had a medical incident and they were very responsive in getting me to hospital and staying with me for two hours.  Their kindness was appreciated more than they know. Highly recommend",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This is a huge property with a lovely jogging track and large swimming pool. It hosts a lot of events, so be prepared for loud parties. However, sound insulation was good in the rooms. The staff is very good and breakfast was ample and tasty.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "5 star property located near Tajmahal which is around 1.8 km away from this hotel this is very big property by Jaypee group almost 25 acre covered area, long walkway for rooms and other places. We are stay 2 night here for a business conference and feeling good vibes helpful staff, clean and hygienic rooms and other places like restaurants gym and pool area. You can do activities like cycling swimming and more. There is gaming area where you can enjoy bowling, video games, billiards and much more on chargeable basis.\nDifferent cafe and restaurant are here.\nBody Spa available here and important point regarding body spa there are no cross gender spa availability.\n\nFood was okay not too delicious, breakfast option limited for this 5 star property.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Fabulous hotel,  staff are really friendly and helpful but struggle to cope when busy, especially in the Tapas bar.\nThe room was one of the best we have ever stayed in, the shower was divine. We also had an outside seating area that looked into well -kept gardens\nAll in all, it is a good experience,  but you do need a good sense of direction to navigate the complicated system of corridors and floors.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Radisson Hotel Agra",
      "rating": [
        4.5
      ],
      "address": [
        "C-1, C-2, Fatehabad Rd, Taj Nagari, R.K. Puram Phase-2, Basai Khurd, 1, Agra, Dhandhupura, Uttar Pradesh 282004, India"
      ],
      "reviews": [
        {
          "text": "Had a good stay overall. Easy to find but being near the station there were some undesirable characters around. Once inside we were pleasantly surprised. We booked an executive Taj View family room. Would have been nice for two adults and two smaller kids d. The room was good and the food was good. Kids loved the free wifi.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "1)Starting from entrance...\nLobby is great but except security ,very few smiling faces .You can't see as welcoming faces as you see in other five star hotels\n2) You will keep waiting in the lobby and no one is bothered to ask, why are you waiting or do you need any assistance.\n3) Hotel and rooms are clean but in room no 332 ,the TV wall unit is broken in four parts (pasted with silicon), telephone receiver and TV remote broken( which was changed  after complaint). You don't expect this from a 5 star property.\n4) The food taste is average when it comes to lunch or dinner,don't expect it to taste like other 5 star properties. If you are an Indian planning for dinner or lunch just check other restaurants\nBreakfast spread is good but taste is average\n5) Would like to thank the housekeeping staff assigned for the 3rd floor and   Mr Chirag and also the restaurant staff for warm service",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The location is excellent and very close to the Taj Mahal. We stayed here for one night and were very comfortable. Service is quick and efficient. The breakfast was excellent with a wide variety of choices between traditional Indian food and western cuisine. Chef Ravi prepared it excellently and even checked in with us to ensure everything was good",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Our stay was great, and the staff were super attentive. Our room looked like it needed work, but other than that, I have no complaints. Our room has a view of the Taj Mahal. The travel coordinator graciously scheduled our driver/tour guide for early in the morning which was great!\nWould definitely come back",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Its a nice property and the rooms are nice. Taj view rooms are maybe not worth the extra price as it isn't lit at night and in the daytime its too hazy to see well. The room could smell better but the service from the staff is excellent. The breakfast is very good. Room service is quick but the food is only OK. Good for families",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "ITC Mughal, a Luxury Collection Resort & Spa, Agra",
      "rating": [
        4.7
      ],
      "address": [
        "Tajganj Ground Floor Fatehabad Road 4 kms and 15 minutes drive from Taj Mahal, Tajganj, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "The experience was amazing and outstanding, the service was very good and the style of preparing salad was like an art decorated by cutting the vegetables in different styles which my kid enjoyed. Afternoon lunch and the morning buffet was delicious and tummy was rumbling more for it.  It was the only buffet we saw till now  which we enjoyed thoroughly, we got value for our spending . The resorts room was having a nice and comfy springy bed which was very nice to sleep. The swimming pool is a nice experience  for my son, he enjoyed a lot claiming that was the best day of his life. Me and my wife enjoyed a great time at the spa while my son was swimming in the pool. The room was very modern and clean and nice .\nwe enjoyed a lot  at the resort the service was outstanding and the best of all was the spa. We would like to visit again to have a holiday blast.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The property is amazing , we took one of their upgraded room but the room was small. The dinner was average but the breakfast was amazing. It is very close to the Taj Mahal so one can choose to stay.The property is big, clean and peaceful and the staff is very nice. The rooms could have been better. Loved the pool and definitely take a walk or tour of the resort in the evening.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "A great place to stay in Agra. Very nice environment at lobby. They have magic show and artists on Friday/Saturday evenings along with horse riding which are complementary. Their breakfast and dinner buffet was great. Their room was renovated and their room staff support was great. We ordered a cake over phone and within 5 minutes cake was there in our room! Great room service!\nOne thing to improve: We, party of 7 had to wait 10 minutes to get a table during dinner time which was not good with kids. It’s not because tables were not available, looked like they were super busy among themselves rather than focusing on arranging tables.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Fantastic stay at this wonderful hotel, following in the footsteps of my father-in-law who stayed here regularly with work many years ago. After hearing his fond memories, it was amazing to see and experience the high level of service, luxury and tranquility at this stunning hotel, just as he described. The breakfast options were varied and delicious, and we loved strolling around the grounds before and after. A very memorable and enjoyable first home for my first time in India.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I recently had the pleasure of staying at the magnificent ITC Mughal Agra, and it was truly an unforgettable experience. From the moment we arrived, the impeccable service and attention to detail were evident.\n\nThe staff at ITC Mughal Agra exceeded all expectations with their warm hospitality and professionalism. Every request was met with a smile, and their genuine desire to ensure our comfort made our stay truly special.\n\nThe food at ITC Mughal Agra was nothing short of exceptional. Each dish was prepared with care and expertise, and the flavors were absolutely delightful. From traditional Mughlai cuisine to international favorites, every meal was a culinary adventure.\n\nThe property itself is breathtakingly beautiful, with lush gardens, stunning architecture, and luxurious amenities. It's a haven of tranquility and elegance, perfectly complementing the rich history and culture of Agra.\n\nDespite the luxurious experience, ITC Mughal Agra offers incredible value for the level of service and comfort provided. It's clear that every aspect of the guest experience has been thoughtfully curated to ensure maximum satisfaction.\n\nIn conclusion, our stay at ITC Mughal Agra left us mesmerized and amazed. Everything, from the impeccable service to the delicious food and beautiful surroundings, was truly flawless. I cannot recommend this hotel highly enough and cannot wait for the opportunity to stay again.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Courtyard by Marriott Agra",
      "rating": [
        4.4
      ],
      "address": [
        "Fatehabad Rd, Taj Nagri Phase 2, Ii, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "Great experience while visiting Agra. My stay was very comfortable and amazing. The ambiance is beautiful. The staff was so nice, friendly and made me feel welcome. Service is exceptional. The Breakfast buffet was delicious and tasty 😋, even I like the coffee ☕ most.\nThe pool is well maintained from what I can see.\nI really enjoyed ! ☺️",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Overall nice experience,  Hotel is good ambience is beautiful.. food is good, have many options in breakfast n dinner , head chef is wonderful,,\nRestaurant anise is beautiful n pleasant place, loved it  but quiet expensive as per the service... the staff need to be more active n  professional in restaurant anise.... specially ms monica\nJust a concern that Marriott should increase pool timings as in summer guest want to enjoy pool in evening n closing time shld increase by an hr.\nNeed to improve pool changing room, not clean properly,",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great experience here while visiting the Taj Mahal…it was clean and nice. The people that work here are so nice.\n\nService is exceptional. Breakfast was tasty 😋 and I even like the coffee in the main.\n\nSecurity is good as well.\n\nPool is shady as in…not that sunny 🌞 but it’s well maintained from what I can see.\n\nThey hooked up my friends with a honeymoon surprise and I really liked that!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I definitely must give 5 stars! My stay was very comfortable and amazing. Everything was perfect. I also had one of my best shower! Our room was very very nice. Even meal was good and all personnel was very kind and ready to help you. Hotel was near enough to Taj Mahal and very easy to reach. If I should come back to Agra on the future I’d go to courtyard by marriott of course. I really suggest it!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I went to Agra and spent the night to see the Taj Majal and \"baby Taj\" while on a business trip. I was delighted with the atmosphere and service at this hotel. The restaurant, Anise, was beautiful, with rose petal-strewn tables and traditional Indian music. The staff were very friendly and made me feel most welcome. The Indian food was outstanding, thanks to the chef Imran Khan, who also explained a lot to me about the cuisine and spices and was very friendly, as was the general manager. I also enjoyed the traditional puppet show in the lobby. An outstanding hotel stay, and the buffet breakfast was as good as the dinner. Thank you Chef Khan and all the staff!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "DoubleTree by Hilton Hotel Agra",
      "rating": [
        4.4
      ],
      "address": [
        "B/H-1&2, Taj Nagri Phase 2, Tajganj, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "A beautiful hotel with extraordinary service from the front desk, to the bar and restaurant.  All of the staff were friendly and could not be more helpful.  The restaurant has a great buffet for dinner and breakfast and the chef offered and prepared vegan dishes to order for my spouse.  Drinks are served with awesome appetizers so be careful not to spoil your dinner!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I was there with my wife to celebrate her birthday. They decorated the room prior to our arrival and also arranged cake. And on top of the above, hotel upgraded our room to their best available suite. Special thanks to Ms. Akanksha for her kind gesture.\nEverything was perfect. Room is well maintained, spacious, clean  and comfortable.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Lovely experience staying at double tree by Hilton.\nThe rooms were clean, very comfortable, and the staff was amazing. They went over and beyond to help make our stay enjoyable.\nThe food was really delicious and the staff definitely deserves an appreciation for it.\nAll together it was a beautiful experience. I  would highly recommend it to anyone to experience the stay at double tree by Hilton\nThe concierge services is very nice and specially thanks of *simrita*\nThis lady is so polite and dedicated to own profession..",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Excellent hotel that went above and beyond for me during my stay!\n\nA special thanks to my new friend Sourav for going out of his way to help me  on many occasions - it truly made my trip for me.\n\nWould highly recommend anyone to stay and I hope to be back one day!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Our stay (Feb'24) in double tree was like a breath of fresh air. The hotel lobby smelled divine. The rooms were spotless and comfortable. The staffs went above and beyond to make sure that we enjoy our stay. The hotel is located near Taj Mahal (we were visiting Taj for the 1st time). Highly recommended.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Holiday Inn Agra Mg Road, an IHG Hotel",
      "rating": [
        4.7
      ],
      "address": [
        "Commercial Complex, 16/2/8, Mahatma Gandhi Rd, Sanjay Palace, Sanjay Place, Civil Lines, Agra, Uttar Pradesh 282002, India"
      ],
      "reviews": [
        {
          "text": "It carries all the value from stay to hospitality to kitchen. Indeed its buffet have wide range of choices from starter to main course to delicious deserts, including four varieties of ice cream. Usually you won’t get so much varieties at other properties. Further to add it have ample space of parking. The most important point is that, you need not to go deeper into the city and can easily reach to highway in just couple of minutes, which is a life saver in case you want to avoid heavy traffic of the city. Totally 5 star in all aspects.\nKudos to team.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Good-looking hotel. The staff is always friendly and willing to help.\nThere is quite good gym inside the hotel and swimming pool. In the lobby you can find a billiard and kicker. The Wifi is very good and I have never had a problem with it.\nRooms are big and modern. There are big variety of different type of food\nThe location is great if you need daily access to Cessna Business park. The hotel is located near the main road where you can find a lot of shops.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This Hotel exceeded my expectations. From check-in to check-out, the staff was attentive and welcoming. The room was spacious, beautifully decorated, and equipped with modern amenities. The dining options were superb, especially the breakfast buffet. The pool area was a tranquil retreat, perfect for relaxation. Overall, a highly recommended hotel for a memorable stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Unfortunately, the hotel room booked through Agoda fell short of expectations in terms of value for money. Despite the convenient booking process, the room lacked amenities and cleanliness did not meet standards. Overall, it was a decent experience considering the price paid. Would recommend booking directly.\n\nEditing the review as the issues was promptly rectified thank you",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Overall the experience was wonderful. The room is above expectation and the staffs was very helpful. A special thanks to Kirti as she went beyond my expectations helping me to take away pancake for my baby after me having their breakfast. Thanks again and definitely will recommend Holiday Inn for everyone.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Clarks Shiraz, Agra",
      "rating": [
        4.2
      ],
      "address": [
        "54, Taj Rd, Agra Cantt, Idgah Colony, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "It's a vintage hotel with lot of history. Has very spacious rooms. Toilet are little outdated and need repair.\n\nHospitality is excellent, as well as their catering. Great food, courteous people, clean ambiance.\n\nYou must not miss an early morning walk in their park. It has lot of trees and flowers.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I stayed only for a night, but it had all the basic facility- for me to have a comfortable stay. Nice food (tried breakfast and Dinner). Very close to Taj mahal, making it easy to move around. I felt the hotel was very busy and a bit less staffs. Rest all was nice.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ensure that whenever you visit Clarks Shiraz, either take precautions to safeguard your vehicle or consider alternative transportation, as there have been incidents where the staff allegedly siphoned petrol from guests' cars.\n\nWe had an unpleasant experience at Clarks Shiraz during our booked Holi celebration this March. Initially, we thoroughly enjoyed the party, food, and our two-day stay. However, upon checkout, we encountered an issue when our car wouldn't start. Despite seeking assistance from the hotel staff, they were unhelpful. Eventually, we sought the help of a mechanic, who discovered that someone had siphoned petrol from our car and tampered with its connections. When we requested access to CCTV footage to identify the culprit, the staff made excuses and initially promised to provide the footage via email or WhatsApp after some persistence. Despite our numerous attempts to follow up, including written correspondence, it's been a month, and we've received no response from the hotel staff.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms are clean, and of decent size. Rooms have a tea maker, iron, locker and an extra bed on demand.\nThe hotel has a playroom, gym, and swimming pool. We enjoyed the swimming pool.\nThe breakfast menu has a pretty decent option. The restaurant is small compared to the number of rooms in the hotel and therefore it is quite crowded all the time.\n\nOverall a good hotel to stay in Agra.\nCost of the stay is worth it.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It's very good hotel, choose this hotel for homely stay. Good service good food and good room. The manager behaviour was very good , I am very happy with staff, Every staff are really polite.\nI am very thankful to them.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Oberoi Amarvilas, Agra",
      "rating": [
        4.7
      ],
      "address": [
        "Taj East Gate Rd, Paktola, Tajganj, Agra, Uttar Pradesh 282001, India"
      ],
      "reviews": [
        {
          "text": "Amazing views, and even better service.  If you are visiting the Taj Mahal, then you MUST stay here, or you will regret it.\n\nThe property is in immaculate condition, with incredible food, and the best views of the Taj Mahal- from every room!\n\nOur butler was awesome - he even got us a softer mattress at turn down.  Wow!\n\nBe sure to use a hotel guide, and make the effort to arrive at sunrise, by 530am.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "You can't compare the hospitality of an Oberoi with any other hotel in the world. Amarvilas stood out in all the aspects especially the service. It's surprising how they take care of the smallest things and kind of spoil you with their services!\nThe food is spectacular, the spa is great, the view from every room is obviously the highlight and worth every penny spent!\n\nThank you to all the staff members for making our stay more than special!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The best hotel in Agra! This is our 6th time in the city. The Oberoi is unmatched for location and service.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice hotel.  Beautiful view of Taj Mahal.  Service was best!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great place, truly royal, but only with respect to the aesthetics. Otherwise, the food quality was not what is generally expected from Oberoi Hotels.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}