{
  "places_with_reviews": [
    {
      "name": "The Belgadia Palace",
      "rating": [
        4.5
      ],
      "address": [
        "Meher Colony, Baripada, Odisha 757002, India"
      ],
      "reviews": [
        {
          "text": "Palace is extremely beautiful and gorgeous. Great location too. Numerous photo spots. Great staff behaviour. Food was delicious, aptly proportioned and served well. We went for our anniversary trip and they organised a cultural show for us.\nBut we didn't like our room, as it was very small. Bathroom is so small that you can't move at all. Dokra room is overly priced. If money is not a concern then Suites are great option.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The Belgadia Palace in the most beautiful place to visit in Baripada.\nIt's location, Architecture, design Services and room was so laxury.\nAll are recommended to visit once.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nestled amidst a lush green backdrop of rolling hills and sparkling waterfalls of the rich and diverse Eastern-Indian countryside is The Belgadia Palace. An 18th century victorian brick-built double-storey structure in the classical Western style of Doric-Corinthian column, a mixture of Greek and Victorian architecture. Guests have praised the property's serene ambiance and lush green surroundings. The staff is polite, helpful, and provides personalized care. The property promotes local culture and handmade products.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Amazing experience. Great rooms the whole place gives a sense of royalty feeling, great cultural event, bonfire and top it all amazing amazing food. Staff were great and courteous. Loved it",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "A very beautiful, heritage, monumental palace to visit and dine, brings feelings of royal treatment, a place to stay and visit atleast once.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "HOLY PALACE",
      "rating": [
        4.2
      ],
      "address": [
        "Shed A1 to A4, Industrial Estate, Takatpur, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Very nice hotel at the price point. Rooms are clean, all facilities available.  Booked a standard room and had all the basic things available. Even slippers were given. TV was working. The hotel has also it's own restaurant. Stayed there for 2 days and everytime the food served was just excellent.  Every tasteful.  Veg, Non-veg or breakfast whatever ordered was excellent. The hotel service was very good. Whenever ordered anything used to receive within few minutes. Facilities also available for marriage reception or any other similar functions. Very much recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Fantastic value for money suit room\n\nVery good food\n\nGood room service\n\nEven complimentary breakfast served in room\n\nVery courteous and polite staff",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Went their with some of my team members from Biju Pattnaik Swimming Pool. The food was yummy & service was courteous, price is affordable as well. The ambience is classy. A must go place for all.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Mind blowing rooms by the price for mayurbhanj district, room service also added without charges, rooms maintaining r really good, i didn't expect this in that area. Located some distance for main market so it make a silent and calm zone for all guests, night decoration just like a wow, total area covered with teak tree,",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I don't know much about this place.. I am a student of MPC Auto College. Yesterday I went to this place and tried the Masala Dosa.. It was good but not excellent. Overlay nice place for chilling and food are healthy and pocket friendly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "AVA GUEST HOUSE",
      "rating": [
        4.8
      ],
      "address": [
        "Ward no 7, Baruni Rd, Ward No 9, K.C, circle, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Well designed fine viewing rooms , Fully air conditioned. Cleaned and maintained bathroom. A kind of fast service is available. Very easy to reach from the BariPada bus stand. A joint restaurant is also available for food. List system available. Checkin time 11 am Morning, checkout time 10 am.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Rooms were very neat and clean, well maintained and very hygienic. Staff behaviour is very polite and it's view is in top notch.\nFree wifi\nFree parking is available.\nVery satisfied with the management of ava.\nDon't listen to the useless fellows visit and enjoy. I don't think that who have reviewed it 1 star they might have a valuable view..",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Well groomed rooms with best view and location.\nBook ur stay now if u are planning for baripada.\nStaffs are very cooperative and decent.\nBest thing of the staffs is that they provide service at any time even it is 2 pm or 3pm.\nFully satisfied by the rooms and management .👌👌",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very good rooms and staffs were too good must visit and enjoy your stay.The rooms are well maintained  and the best thing is that they have a parking area in their basement which is very rare to see in any other hotel in haripada.\n\nFully satisfied with my stay in ava....",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very NYC property. Rooms were soo good and the staffs were so cooperative and polite .They have a parking space too and also have a lift service. High speed free wifi is also available. Soo go for it if you are planning to baripada very friendly and feels like home.\nThank you to the whole management of ava guesthouse...",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Durga",
      "rating": [
        4
      ],
      "address": [
        "near Jagannath temple, Ward Number 8, Sankhapata, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "This place has been a personal favourite ever since I was a kid. The food here is so good that it has become kind of a benchmark for my taste buds. Highly recommend the masala kulcha, butter chicken and chilly chicken. Very light on pocket too. One of the og(s) of Baripada.\nThe only suggestion is that they can switch to better plates instead of the old fiber ones.\nA good 9/10 for me.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I personally prefer durga hotel for it's speciality i.e masala kulcha and biryani. This time I had the same and the masala kulcha turned out to be stale and smelled bad and when I complained, they agreed but didn't do anything in exchange.\nSecondly the service here is not good, there are many waiters but they don't listen to the customer and create chaos eventually.\nThe food is served late and the bill as well, which is why we had to pay the bill in the counter by ourselves.\nAnd as always they make mistake in billing.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice place. The staff were hospitable, helpful  and also helped us to get rooms quickly at a very short notice. The food in the restaurant was good and the bar was also adequately filled with good brands. The rooms were enjoyable and extremely well done in interiors and comfort. Thank you to the staff who made our stay so enjoyable",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The food here is tasteful and hygienic.Must try the soup with tomato sauce.Classy place.Makes you remind of the 90's era.It is decorated as such.Good place to go with your family for dinner.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The location of the hotel is fantastic, as it is situated in the heart of Baripada, making it easily accessible to various attractions and amenities. Upon arrival, I was greeted warmly by the friendly and attentive staff, who promptly assisted me with the check-in process. Their professionalism and warm hospitality set the tone for the rest of my stay.\n\nThe hotel's dining options were exceptional. The on-site restaurant offered a wide range of delicious local and international cuisines. The meals were expertly prepared, and the presentation was top-notch. Whether it was breakfast, lunch, or dinner, I was consistently impressed by the quality of the food and the attentive service provided by the restaurant staff.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship Pratikshya Guest House",
      "rating": [
        3.9
      ],
      "address": [
        "136/756, NH18, Baisinga, Betanati, Bhubaneswar, Tadkisul, Odisha 757025, India"
      ],
      "reviews": [
        {
          "text": "Staff behaviour bad. And there are no extra room for staff. When I was enter.I see hotel staff sitting a room. Nd when I ask where is my room tha staffs getting out side and give that room..... To disgusting.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Vry gd experience, hygienic, room and bathroom are neat nd clean, who wants to tour to baripada, thn stay here , u'll get good home wala ambiance",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Well...maintained....clean and affordable...stay...at baripada.....",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "6 ppl just wanted 1 ac room for having lunch and take rest for less than 45 minutes  due to some court work. I was made to pay ₹2700 as I was time bound I had no option. Lost trust.1 goibibo booking for 2 + 1 goibibo booking for 3 + ₹500 extra for ac + 1 extra person ₹200. They totally exploited the traveller. Minus 5 star ⭐rating for this below standard lodge. Staff behaviour was idiotic enuf despite of paying a 5 star price it tuk them 20 mins to assign 1 room for guests. 6 aadhar copy signatures xerox copies etc etc which cud have been done even after assigning a room when you know the stay is less than 45 mins. Staff kept poking for extra person charges amid the lunch in the room.\nin general below standard amenities... No food no smoking and no cooperation from staff.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good staying experience at this price. Rooms are clean but toilet needs few essential modernization.\nFood quality is excellent. Enough variation is also available.\nOwner, Manager and staff members are very cordial and helpful.\nBut the location is about 2 to 3 km away from the city beside highway.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Tulsi Guest House",
      "rating": [
        4.4
      ],
      "address": [
        "Puruna haatsahi, ward no 6, Deulasahi, Bhanjpur, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Best part is the hotel is pet friendly.  Pet parents can rest assure they have a comfy and cozy room with their pets. Service is good aswell .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Rooms are great.\nBook the rooms in advance if you want car parking.\nStaff is friendly.\nService is exceptional.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I am having a pathetic experience while staying in this guest house. I booked a room over there through phone when they said that the price is Rs 2100/- including all per day. During my check out they are telling that is Rs 2700/- and I need to pay that. They are a great CHEATER. Even they told me during my booking that there is car parking area inside of the guest house but during my stay I parked my car on open narrow road outside of the guest house.\nThere is no kitchen in the guest house and you need to order food from outside or to go outside for your food. Service is very poor. Even AC remote doesn't work and they don't have the time to hear you.\nThis Guest House is located in a narrow lane of Baripada town. Very hard to drive in for a SUV car.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Best price with suitable room service",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Best place to stay well behaved staffs and helpful nature",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Saibinayak",
      "rating": [
        3.9
      ],
      "address": [
        "757001 Ward No 9,K.C.CIRCLE,Baruni road Ph-7008831214, Dist, Ward No 9, Ward No.7, Madhuvan Sahi, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Please don't go for this hotel.I have booked one AC deluxe room costing 2100 inr for myself.But they provide me a Dormitory and should be charged not more than 1000.They are making Customers fool.Unprofessionalism is at its peak.Worst place to stay at Baripada.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good for organising marriage.located near kc circle",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very small and Dirty washroom, expect no help from service boy",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good facility for marriage and other ceremonies. It is centrally located located in the heart of the town and has very good connectivity with buses and train communication. The services are really good and they provide and to end services and caters to all needs and requirements for a function. They are also reasonably priced. They have two floors and is very spacious. They have provision for parking.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Such a worst hotel I have never seen before. I suggest nobody should plan to stay there.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Ambika",
      "rating": [
        3.8
      ],
      "address": [
        "Near Roxy cinema hall, Biju Patnaik square, Meher Colony, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Very old hotel in the heart of Baripada town probably 35-40 years old. Nothing is up to the mark. Rooms are in extremely poor condition. Let me start from the reception which in a small corner with dilapidated sofas waiting for guests. There are no lifts here and it was a pain to climb the stairs with my ailing mother. As you climb the stairs you can smell the rot. The rooms doors have not been cleaned since ages, full with stains. Door have manual key locks and kundis. In the room outdated and cushion less sofas are placed with old tables. The beds are old and cushions thin and poor quality. The bed sheets are poor quality and the blankets have similar poor quality covers. Not a place to stay @ 2200/- plus GST. I forgot to mention about the in house restaurant Suruchi. The meals and snacks are of worst quality. Want to have a nightmare stay here….. Terrible",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Twenty years later, the budget hotel may have changed, but the staff's impeccable behavior remains constant, adding a warm touch to my nostalgic visit.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "We went there for lunch & had it in their restaurant called Suruchi. The property has ample parking & is located centrally in Baripada.\n\nThe food served was tasty & fresh. The staff was Cooperative & attemptive to our needs",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "This classical restaurant in Baripada town is a true culinary gem. They have mastered the art of maintaining impeccable standards when it comes to hygiene, service, food quality, and ambiance. This establishment is highly recommended for dining with family. The presence of a nearby bar doesn't pose any concerns because the staff ensures a safe and enjoyable environment. The team at Ambika Restaurant is not only skilled but also remarkably polite, guaranteeing a delightful dining experience every time.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good place to dine. Lot of varieties of food available",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Mayurbhanj",
      "rating": [
        3.9
      ],
      "address": [
        "K C Circle, Balasore Golai, WPHG+MPV, Deulasahi, Bhanjpur, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Rooms are neat & clean. Hotel is evenly poised at the heart of the city. Value for money stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "BEST HOTEL FOR FAMILY IN BARIPADA\nLOVED IT 👍\nEXCELLENT SERVICE.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Normal Hotel for stay... Resturant is not working... No parking, average room",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Just Awesome staff behaviour is good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "All good. No need to mention anything.\nIf you need a luxury room then it's not your type ...\nIt's a normal deluxe ac room available .",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Mohapatra Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "Ground Floor, of Vijaya Bank, Roxy Rd, Deulasahi, Bhanjpur, Baripada, Odisha 757001, India"
      ],
      "reviews": [
        {
          "text": "Locally famous hotel inside baripada town near Roxy cinema hall. Ambience is just like any other budget friendly hotel with not much concern about looks and ambience.\nThough the hotel carries good seating capacity there will be a rush during peak hours.\nServed the most traditional dishes of odisha& baripada.\nMostly famous for lunch and desi meals.\n\nI tried Rotti, rice + Mutton curry. Tasted well,served well. The shop was open till 10pm. Value for money deal for all.\n\nTried meals for lunch multiple times -\nVeg meal - 3.5/5\nChicken meal -3.5/5 ( No vegetable curry will be provided, just rice+chicken+salad)\nMutton meal - 3.5/5\n\nIf we opt for nonveg meals they wont serve us any of the vegetable curries. We may have to ask for daal too !!\n\nCleanliness - just ok 3/5\nMutton dishes -3.5/5",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "This hotel is very very dirty rooms also service is very poor ,,,I have lived 5 days in this hotel  if you said to hotel pls take this key clean this room they are never clean room when ask for clean they said room is reday but they are lier 👎",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "No parking area for bikers, they are asking to park at the roadside area at night. Which I don't like at all.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Delicious food with affordable price.....Neat and clean hotel ....Near Baripada  bus-Stand ....I have good experience....welcome to Mohapatra Hotel ...Baripada @@@Mayurbhanj",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Went there after getting some recommendations about veg food here. Honestly it was not upto the mark.\nThey have thali system. Both rice and roti were dry, food items were not delicious in taste neither freshly cooked.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    }
  ]
}