{
  "places_with_reviews": [
    {
      "name": "Hotel Kailash International",
      "rating": [
        4.2
      ],
      "address": [
        "Nh 15, Jaisalmer - Radhanpur Rd, behind kalash hotel, Shastri Nagar, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Only hotel available in Barmer with some facilities.  Overall good. But check your invoice before you sign and pay.  Despite me paying the dinner charges with PhonePe, charges were included in the invoice. Certainly the reception guys need some training how to handle clients.  Stayed here from 26  Feb to 01 Mar 2024.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the best hotel in Barmer. Well maintained property. Recommended to all who visit in Barmer. Food is excellent and service is very fast. Rooms are specious and neat and clean.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Top class hotel in Barmer iski jaisi koi hotel nahi h pure Barmer mein . I come from Jodhpur to Barmer and stay here for 2 days . Beautiful hotel",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It very Sad to say as Hotel staff is very unprofessional and rude in behaviour, they are very incompetent to handle customers services.\nFront office as well as GM are also not bother to keep maintain the reputation of hotel.\n\nI really not recommended this hotel in any condition, if possible go for another option at Barmer location.\n\nPoor service and staff are not capable foor hotel/service industries.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Commendable service received from Mr. Vimal Nain, Mr. Sanjay Joshi who works in the F&B department of Hotel Kailash. He clearly understand the expectation with respect to food and trys to fulfill the request with utmost hospitality.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Kalinga Palace",
      "rating": [
        3.9
      ],
      "address": [
        "Ashapurna Complex, Rly. Station, Station Rd, opposite Barmer, Kothwali, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Rooms are ok but bathrooms are dirty.\nService is good.\nThe life was not functional which was little inconvenient",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Location is good for the party . Its party hall is very luxurious. Food is quite good with great mixture of ingredients",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are good but the hotel is on the busiest road. The parking place was terrible and better to avoid a 4 wheeler -traveller.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very nice place of stay, good service and  food\nBest place in Barmer",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "hotel is very nice room clin and food is verey testy",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Indraprastha Resort",
      "rating": [
        4.1
      ],
      "address": [
        "P9FX+GVR, Barmer-Mahabar-Malpura-Gudamalani Rd, Barmer Gadan, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Great palace where you can enjoy swimming activities, it’s good for marriage anniversary, marriage party, and social events. Having large well maintained garden. Hall having more than sufficient space.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms are good.\nCleanliness could be improved.\nThey should clean the swimming pool.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It was great and it have large swimming pool and their food was delicious and tasty I love This experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "There is no proper service in this hotel, there is no food, no waiter, no one listens.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Handicrafts bhawan handmade products applique work embroidery work craft shop store",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Yaduraj Heritage",
      "rating": [
        3.9
      ],
      "address": [
        "NH 68, Jaisalmer - Radhanpur Rd, Barmer, Barmer Magra, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Rooms were not clean. Service staff did everything possible to make our stay comfortable. Special mention of the staff, their hospitality was too good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I liked the sweets very well, the taste here is also very tasty, the shop is also very good.  💕",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The hotel room is not that good and not clean. They should focus on the cleanliness of the hotel and room. Not as expected what we paid. Location is on the jesalmer - Barmer highway so if you are traveling then location is good for mid stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Only had food on the way to jodhpur, quality was fine, serving bit late.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The worst hotel I have ever been to. Don't be fooled by its appearance on the outside because the service,rooms,staff and food is terrible. We asked for the bed sheets to be changed in our room as it had stains and was covered in hair and dust however it was not changed till after 2-3 hours and we had asked repeatedly but they were not listening. In the room there was no hot water and when we asked for it to be turned on they said it wastes alot of water so they didn't turn it on. We had ordered food and we had to eat on the floor of our room as according to them the restaurant couldn't be used which we were not told when ordering the food. When the food arrived it was cold. When we called the staff they said it was hot but it got cold in 2 minuets. The staff were not ready to listen or provide good service. I have never been to such a terrible hotel ever!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Krishna",
      "rating": [
        3.8
      ],
      "address": [
        "Station Rd, Kothwali, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Prime location near railway station. Spacious rooms, clean bathroom but ambience is not that great. Could be upgraded to attract more travellers.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Room was good, Service also good,  Location Near by Railway Station.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Location is in the market traffic entry is closed from 6 am to 9 pm. Rest rooms are very good..they don't have restaurant but you can order room service..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very old infrastructure but maintained very nicely. Most of the interior is of white color which is tough to maintain. Window AC, small LCD screen television, bedding are it's lackness as compared to other new properties. Staff is trained. Parking for four wheelers is tough to find till 8:00p.m.. Located in front of Railway Station at Station road which is easy to approach.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Awesome rooms. Very neat and clean. Owner is very good and courteous towards his guests. They are having group of hotels ranging room rent from 500 to 4000.  For your stay in Barmer, you can opt this as your first choice.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Marwar",
      "rating": [
        3.8
      ],
      "address": [
        "QCP7+M76, NH 68, Barmer, Barmer Magra, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "I can't explain about your hotel very bad service , staff always ask have u cigarettes and beer we want\nVery poor food quality price is too much high break fast was not good\nDon't stay in this hotel",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Hotel Marvad is a luxurious haven nestled in the heart of a vibrant city. Renowned for its impeccable hospitality and world-class amenities, it offers an unforgettable experience to its guests. From the moment one steps into the elegant lobby, they are greeted with warmth and sophistication.\n\nThe hotel boasts a range of exquisite rooms and suites, each meticulously designed to provide comfort and relaxation. The rooms are adorned with tasteful decor, plush furnishings, and modern amenities, ensuring a delightful stay for both business and leisure travelers. The panoramic views of the city from the windows add a touch of grandeur to the overall experience.\n\nDining at Hotel Marvad is a culinary journey filled with flavors and gastronomic delights. The in-house restaurant showcases a diverse menu of delectable dishes, crafted by skilled chefs using the finest ingredients. Guests can savor gourmet meals while enjoying the elegant ambiance and impeccable service.\n\nFor those seeking relaxation and rejuvenation, the hotel offers a well-equipped spa and wellness center. Here, guests can indulge in a variety of treatments, massages, and therapies, allowing them to unwind and rejuvenate their mind, body, and soul.\n\nHotel Marvad also caters to business travelers with its state-of-the-art conference and meeting facilities. The spacious and well-appointed event spaces are equipped with modern technology and can accommodate a range of corporate events, conferences, and social gatherings.\n\nBeyond its luxurious offerings, Hotel Marvad takes pride in its commitment to sustainability and responsible tourism. The hotel implements eco-friendly practices, such as energy conservation and waste management, to minimize its environmental footprint.\n\nIn conclusion, Hotel Marvad is a true gem in the hospitality industry, providing an exceptional stay experience. With its elegant accommodations, culinary delights, wellness facilities, and commitment to sustainability, it leaves a lasting impression on every guest who walks through its doors.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I visited Barmer during my tedtalk last week - my stay was arranged here. A very calm and comfortable place - the rooms were very big in size and equipped all necessary things i.e. fresh towels, shampoo, soap, dental kit, refrigerator, TV, AC, digital locker, closet, etc. everything. Only the tea maker was not available. The staff was also very cooperative - only thing was that the room service was not there and their kitchen used to shut very early in noon and even in evening.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Best place for party meating",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's a small beautiful hotel. Lived there for 8 months.  Food is nice. Staff is great and cooperative. They'll customize food for you the way you liked. Sometimes I didn't liked the food and they allowed me to make it in kitchen. They'll even prepare Jain food for you if you would ask then or if you have any allergy they'll provide food specifically made for you. And yes there is buffet system. Rooms are great. Spacious too. Comfortable and price is up to mark too. But usually this place always runs out of room.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Manuhar Inn",
      "rating": [
        4
      ],
      "address": [
        "Nh68, opposite krishi mandi, RIICO Industrial Area, RICCO Housing Colony, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Taken a 4 hour halt in mid night. I would prefer this stay if you want to take rest. Good rooms and service. Staff are good and helpful.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel room is very best and service are veery good and fesility hot water a/c and parking also gud service food and breakfast lunch dinner available and manager was good nature and hotel room rent was low price and best quality room",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It is a very nice hotel in Barmer, pocket friendly, The manager is very helpful, Room Service is also good. Should be considered if travelling to Barmer.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice hotel above banking complex.\nWalking distance from sindhari chauraha for private bus and roadways bus depot",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Small city hotel, economy, bare essentials, safe, clean, courteous. Next door dhaba ie diner serves very good inexpensive hot hood, all native cousine, mostly catering budgeted purses. But it's good. Hotel is safe, responsive. Beds are good and firm mattress. Good stand alone air conditioner.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Desert Inn",
      "rating": [
        4
      ],
      "address": [
        "Q92V+PRH, Roy Colony Rd, Madhuban Colony, Laxmipura, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Such a nice palace it has been peaceful anvirvement",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Budget Friendly Hotel With Good Services. Staff.\nRoom Was Clean Well Maintained With Comfortable Beds.\nFood Quality Is Awesome.\nBar Facility Also Available.\nThank You 🙏",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We visited on Nov. 22 & booked four room for family. It is budgeted hotel and located near barmer railway station. Rooms were clean with basic facilities.\nCons: 1. There is no parking facility available.\n2. Hot water only once time available.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good food quality with slightly poor room service",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's a nice budget hotel centrally located close to the Railway station and Bus Stand. Parking, lift and room service facilities are good. Rooms were spacious, comfortable, flat television, wardrobe, dressing mirror, air conditioner, toilet neat and clean with sufficient amenities. Multi cuisine restaurant and bar. Overall this was the right choice to have an enroute break.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Vedant",
      "rating": [
        3.6
      ],
      "address": [
        "BA-6, NH-15,, QC37+CJ7, Near Sindhari Chouraha,, Mahaveer Nagar,, Mahaveer Nagar Phase 2, BSNL Colony, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Good hotal in barmer\nBest staff\nAnd hotal manager Mr. manoj fauzdar is also kind hearted person\nSo if you come in barmer plzz  Must visit Vedanta Hotel once",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "They aren't even able to provide any glasses\nto drink water. The location and food are awful. I had no chance other than staying here because of some reasons, i would recomend to not to stay here if u are searching for a good hotel for a long stay.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Third class service  on hotel vedanta not satisfaction answers nd price issue in bill",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Food was good but the people serving were a bit lazy and you know restful type",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Badmer is a city where you can find many hotels but they are not good in service as customer requirements",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "OYO 71802 Raj Palace Hotel & Restaurant",
      "rating": [
        3.7
      ],
      "address": [
        "Agrawalon Ka Mohalla Road, Kothwali, Barmer, Rajasthan 344001, India"
      ],
      "reviews": [
        {
          "text": "Worst hotel experience ever in my life l. Room are like any 3 grade hotel, bedsheets are not clean ,owner behaviour is very bad , electricity cut for 2 -3 hours during my stay,water supply stoped after few hours and owner gave us water for daily uses by bucket .",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Had worst experience. Picture was something different and in real, it was something different. Nobody was there to attend us. we waited almost one hour to check-in.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Goods-\nNice place for breakfast, lunch & dinner. Food quality is OKAY.\n\nBads-\nSome waiters are under legal age of working. They don't look professional and appear like they have not taken bath in many days. The manager shouts at them in front of customers.\n\nBad customer experience.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Poor hygiene... non-trained staff.. disrupted supply of hot water... Hotel is good for single guests only...\nThe hotel food is popular in the area... good for spice-lovers.. But never book a stay here with breakfast included ...the Make my trip must scrutinize the hotel well before rating the hotel... One cannot expect a toilet boy to serve or cater food in the room.... !!",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I took it impromptu, but found it great, rooms are at very low budget friendly prices, food is great, service is great, hygiene is also maintained at room and food as well.\nWalking distance from railway station.\nI would recommend it for short stays.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    }
  ]
}