{
  "places_with_reviews": [
    {
      "name": "WelcomHeritage Parv Vilas Resort & Spa, Kasauli Hills",
      "rating": [
        4.7
      ],
      "address": [
        "Gandhigram, Dist.Solan, Kasauli, Himachal Pradesh Dist, Kasauli, Himachal Pradesh 173229, India"
      ],
      "reviews": [
        {
          "text": "Our group stayed for one night and we had a fantastic experience. The food was delicious and the service was excellent. Special thanks to Rizul and diwankar the Front Office staff and his team, for ensuring everything was organized perfectly. He made our stay hassle-free and enjoyable. We highly recommend this place for a wonderful stay with amazing food. Can't wait to visit again!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Had an amazing time. Room was amazing. Food is very good.\nSpecial mention to Front Office team who made the stay memorable. He went above and beyond and showed great hospitality. Value for money property.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I had the most relaxing mini vacation in this hotel. Super impressed with the hotel. Rooms were exquisite.\nLocation has stupendous views but a bit off the beaten track.\nHospitality was top class.\nFood was varied and wonderfully prepared.\nAnd the best part was the staff. From house keeping to spa to restaraunt to reception and the managers, they were genuinely Warm and superbly trained.\nHighly highly recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Fantastic stay~food~Services, loved overall experience at kasauli hills parv villa. Sunset is amazing from Restaurant terrace. Amazing curated cocktails and hand licking snacks. More imp kids ~ enjoyed the games at inside the hotel (kids zone).\nStaff is well trained and educated.\nProvides :-\nvallet service - yes\nIrd 24*7 - yes\nParking space - yes\nInternet speed - very fast\nSpa- yes\n\nWhat you want in your staycation.\nWe enjoyed our short trip.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Simply it was lit. Had an amazing stay with my family for 2 nights.\nFood is upto the mark try italian specially ❤️\nCheers to the best staff & management ✌🏻",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Barog Heights",
      "rating": [
        4.1
      ],
      "address": [
        "Hotel Barog Heights, Old Kalka Shimla Highway, Barog, Distt - Solan, Barog, Himachal Pradesh 173211, India"
      ],
      "reviews": [
        {
          "text": "It is situated on the peak of a mountain. And because of this the views are amazing. One can feel the real nature from the top.\nIn all seasons, hotel barog heights is covered with clouds and the weather is better than many hill stations. One can easily enjoy here.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It was an excellent experience at Hotel Barog Heights. This is one of the best hotels in HIMACHAL. Overall, you don't often find excellent services in Himachal hotels, but at Barog Heights, you'll experience good management, staff behavior, food quality, and spacious rooms. Every person in the hotel is humble.\n\nThe owner is truly great — down to earth and a very humble and gracious host. I don't understand why some people would give low ratings to this hotel.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I recently stayed at Hotel Barog Heights and had an exceptional experience. The hotel's ambiance was inviting, and the staff, particularly Manager Shanti, went above and beyond to ensure my comfort throughout my stay. Shanti's professionalism and warm hospitality truly made my visit memorable. The room was spacious, clean, and offered breathtaking views of the surrounding mountains.Hotel was build in 90s and needs some updating but overall  hotel's amenities exceeded my expectations, and the food at the on-site restaurant was delicious. I highly recommend Hotel Barog Heights to anyone looking for a relaxing and enjoyable getaway, thanks to Manager Shanti and the rest of the wonderful staff.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent location .\nSituated at 6700 ft\n1 hr 20 min drive from Panchkula\nRooms are spacious , clean and reasonably presented .\nHotel shows some signs of ageing but compensates for staff promptness and service provided .\nSpecial mention of manager Shanti , who ensured that the process starting from booking to checkout was smooth and hassle free.\nBook directly with them by calling them and avail best discounts .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "This hotel is on a hill overlooking the Solan Valley and is something out of a 90s Bollywood movie. It offers panoramic views, good food, good rooms, courteous staff and good ambiance. The staff will try to fulfill all your requirements with such zeal. The drive up to the hotel is a little steep and difficult. There is however, a monkey menace here.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Suryavilas Luxury Resort & Spa",
      "rating": [
        4.3
      ],
      "address": [
        "Suryavilas Luxury Resort & SPA, Suryavilas Link Road, Green Hills Engineering College Rd, Link Road from Gandhigram, State Highway 2, Kumarhatti, Nahan Road, Solan, Himachal Pradesh 173229, India"
      ],
      "reviews": [
        {
          "text": "This is a perfect place to stay if u want to to rejuvenate in real sense. The hospitality is amazing.  The food was first class. I mean we didn’t find even a single item which was not good in taste. The Spa experience was not up to the mark. Rest all was amazing. Must vist",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The accommodation was luxurious and meticulously maintained, offering breathtaking views of the surrounding scenery. The dining options were exceptional, with a diverse menu to cater to every palate. The highlight of my stay was the spa experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This resort gives you pleasant environment and so beautiful rooms. Here  they providing well disciplined service to the customer. This is my first experience in this resort and so happy with their hospitality.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A perfect place for stay. Safe environment, familier staff , and the location is just a heaven. Calm stay in peace between nature. Thanks for the excellent service from the staff . Highly recommended to stay here.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Awesome location, perfectly in lap of nature, it offers you immense peace and you get up in the morning by chirping sounds of birds. Simple serene environment. Perfect location to breathe some great quality of oxygen and stay away from hustles of metro life.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Jungle Lodge Resorts",
      "rating": [
        4.3
      ],
      "address": [
        "Kasauli Hills, Dharampur - Basholu Road, Dharampur, Himachal Pradesh 173209, India"
      ],
      "reviews": [
        {
          "text": "Beautiful property with great ambience. Location is little away from crowded roads of Kasauli. Property is very well maintained and green. Staff is good and managers also. Live band during dinner made the dinner all the more enjoyable. Food is really good. Overall a lovely and memorable stay with family. Will definitely recommend others for a peaceful and calm stay with kids if you are visiting Kasauli.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I am a senior citizen who has just visited along with my wife and daughter in Jungle Lodge from Delhi and found that the Manager at the reception needs to  learn humility and way of talking with guests. The overall service was excellent along with tasty food.\nHowever, one thing I will specifically request the management that if possible, optional arrangement of mercury light may be done so that if after sunset a guest wants to read , he/she should be able to get necessary lighting.\nBarring the behaviour of the manager and lack of lighting facility (TO READ OR WRITE), the overall experience was good.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We booked a two room apartment and got one OUTSIDE the property with a different entry altogether which was not even safe. The whole idea of spending the weekend here was to enjoy the property but we had to walk all the way to the resort again and again which was very inconvenient. Also, the floor and the bed were making creaking noises that we could not even sleep in peace. Very dissatisfied!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Had a wonderful and relaxing stay in their pool villa. Quiet and beautiful location nestled amongst pine trees and away from the city hustle. Perfect place to relax and unwind. Our rooms had all modern day facilities with a private pool and jacuzzi. Service and hospitality were spot on. Indoor and outdoor games facilities are also available at the property.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Poor !!\nVery Poorly and unprofessionally  managed  property.\n1) Nothing is free irrespective of whatever prices you have booked for.\n2)Very untrained,rude arrogant and unprofessional staff.They will not even pass a smile or wish you through out your stay.Since smile is free so may be the reason they don’t want to spend on you.\n3)Never seen such rude and arrogant front desk staff.First point of contact you will get a feeling that they are your office boss and you are reporting to them.\n4)Actually you will get a feeling that you are admitted in a boarding school,where you have to spend your time as per their mood,schedule and resources.what you want that doesn’t matter to them at all.\n5)They will not let You enjoy your moment.Its a crime there,(Trust my words).Restaurant is good but they don’t know how to run it.its a city type restaurant where you will get music only on weekend.And if u have booked during week days then your trip has gone for a toss for sure.They will do everything to spoil your time and mood so that you should not come out of your room and bother them.\n6)Once money is paid then you are their enemy,since nothing is left now.\n7)Dangerous housekeeping process.They will bring tea coffee refill supplies in the same tray where they have kept chemical and dirty dusters for room cleaning.Tea bags are open packs with sting hanging and kept with floor cleaning liquid.Mineral water and phenyl in same bottle.same tray kept side by side.\n8)Tea for 120 ₹ in a dirty and smelling flask.Maggie is 299 ₹ without veggies.\n9)They will switch off common music speakers also which plays intrumental music.So that you quickly finish and go back to your room.\n10)All staff looks very casual and over the phone  scrolling reels for hours.They doesn’t bother even if guest is complaing for something.\n11)A front desk staff with a cap (don’t remember his name) will behave like just pay the bill and get lost. He will start behaving right from the time of checkin and will continue till you check out.No knowledge of local area and sitseeing etc.But his ego and attitude is in some other level  for no reasons.\n12)Upon escalating issues to the operation manager GAURAV ,he will not bother to even speek to you rather then upon following up he will send a message with staff to tell you that if you have any issue then come to reception to his desk and talk to him.Where he will dominate the conversation with that arrogant  front office staff.\n13)I booked for 3N 4D,so upon asking is there any live music or DJ tonight ,they will look at you as what are you asking.whatever you got is enough,don’t ask for all these. And then they will switch if common speakers also to tease you.\n14)Then to have something by own I requested for a candle so that i can light it and have a candle light dinner with my kids.first they will say they don’t have. I suggested them to get it from local shop just opp resort .They said i will send a staff to your room pay him he will get it..On getting angry that after paying so much you even can’t offer a candle,then within 30-40 seconds candle was at my door without a match stick to light.so hopeless staff.\n15)You will not see other guest also outside their rooms,since no one comes out as the staff doesn’t behave professionally.\n16)No choice in breakfast ,even restaurant manager don’t have any clue what they are sieving next day.he will in fact ask you “Aaj kya mila tha”Then he will guess may be kal aap ko poori bhaji milegi.What king of manager is he??\n17)No choice in chinese ,just basic soup and rice noodles .In gravy they will serve u manchurian only.Thats too spicy.\n18)Property has lot of potential but staff doesn’t have any interest.They are on paid holiday.Staff can do lot in existing resources but who cares…abbot the guest since they paid so forget.\nManagement should pool up their socks.\nOverall-Not a good choice if you want a break from stress and your day today routine.Their staff will give you more stress.Both with their words and even without saying anything.\nWastage of money.Not worth to stay.Not good for family.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "The Pinewood Barog",
      "rating": [
        4.2
      ],
      "address": [
        "Barog, Himachal Pradesh 173211, India"
      ],
      "reviews": [
        {
          "text": "I often stop here while being in Barog to have tea / coffee & snacks in their open sitting area. Their open restaurant is all covered with flowering plants & fruit trees. It has got ample parking space and a kiddies corner too with few swings.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I attended a Wedding here, venue was good but the whole venue smells like open severage & gutter.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It's nice place for 2/3 days stay. Very convenient ftom Chandigarh and reasonable charges besides good customer service.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had lunch here on our way to Shimla. The food was fresh and delicious! The location of the hotel is also great with amazing views!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Grabbed lunch at the restaurant: Good food. Quick service. Very affordable prices",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Pine Drive Resort",
      "rating": [
        4
      ],
      "address": [
        "Milan Center, Khalli, Kumarhatti, Himachal Pradesh 173229, India"
      ],
      "reviews": [
        {
          "text": "Pine Drive Resort offers cozy rooms at a fair price, providing excellent value for money. While the rooms are comfortable, it's important to note that there is no elevator, so guests booking rooms on the top floor should park their vehicles at the rear of the resort for convenience. Overall, a pleasant stay with good value for the services provided.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The location is amazing. Easy check-in. The place is clean, enjoyable food and hospitality. Mr Shubham helped us.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "What a lovely place with a scenic view of of the city. The environment and the vibes were amazing. The food too was delicious. Must visit place if you’re in solan!!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The atmosphere is serene.\nOne can enjoy nature' s beauty from that top. They have amazing back garden or lawn setting.\nWhat a view from that top with those Pines.\nFood could be better.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Food was good .. rooms are also ok .. but there is no sim card signal and they dont have wifi services .. after 11 no one is available",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "House of Lights Solan",
      "rating": [
        4.7
      ],
      "address": [
        "Deoghat, Solan, Himachal Pradesh 173211, India"
      ],
      "reviews": [
        {
          "text": "We had a horrible experience with house of lights. Its not a hotel for family at all. Management is worst. We booked 1 apartment here.  rooms were in bad condition. No water in washroom. Every time someone has to use washroom we have to call them to start the water supply.  No amenities were provided we went to local shop for every little thing like. Soap toothpaste etc. will never recommend this to anyone.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Staying here was a nightmare for me. This place is not a hotel it's a lodge. A family cannot stay here. This place is for mostly young people who wants to chill. I had booked homestay but they just gave me the lodge room which quality may not cost more than 700 rupees but I was charged 4000 ₹. Amenities were poor than a simple lodge. There was no security outside the hotel. Staff was not properly dressed.\nIt looks like bar and lodge to me. I could not sleep whole night because of shouting of other guest who were mostly drunk.\n\nJust save your hard earned money and peace of mind.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Best hotel to stay in Solan with great ambience and with great view. Rooms are super clean specially washrooms. Ashwin is a great host helpful in every manner. Thank you ashwin",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Good place to visit. You cannot imagine from the road the view from this property. You need to go there to experience the same. Highly recomended",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "One of the best stay in Solan so far\nOur Host Mr Ashwini was very supportive\nHe helped us in every possible way.\nReally loved our stay there",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Le Halcyon",
      "rating": [
        4.9
      ],
      "address": [
        "Hotel Le Halcyon, Barog Hills, Koron Kenthri Road, Kasauli View, near Kheel Mor, Kumarhatti, Himachal Pradesh 173229, India"
      ],
      "reviews": [
        {
          "text": "The property has a great ambiance with clean and cozy rooms. The staff is polite, helpful and well-mannered. The food is delicious and the property has good hygiene and safety standards. The property has a beautiful garden and a play area for all ages. a great place for couples and families to stay. Overall, a pleasant and comfortable stay.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "One of the best properties ever visited. Neither too far from the town but still has an offbeat location with a lot of peace and breathtaking views. We found out the rooms to be spacious and cozy having beautiful views from the balcony. Additionally the staff was also very cooperative and planned out a excellent Christmas event. Thank you team for a comfortable stay.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Had kitty lunch here. We really had a blast. Food was tasty, well balanced in spices and service was cherry on the top. Very economical. View was awesome. Beautiful scenery around. Overall 5💥star",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Mr. Sharma Manager is very great person food is are excellent. We are from Nufarma and we enjoyed very much . Rooms are given five star . Recmonded to all family friends,and all unmarried couples.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "We went there with friends, our stay was superb here. This is a newly built hotel. Here are some of my observations:\nWhat was good:-\n- Newly built rooms\n- Spacious rooms, neat and clean\n- Rooftop for bonfires and parties\n- good views, with big balconies\n- Staff is well behaved\n- Food was good too in restaurant\n- Amenities- Electric kettle, Hair drier, dental kit, hot water available all the time, centrally AC. (4 star property)\n\nWhat can be Improved:\n- Parking available for 3-4 cars only\n\nOverall it was a quite good experience and value for money. I would surely love to visit again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Mountain Crest Hotel",
      "rating": [
        4.4
      ],
      "address": [
        "Mountain Crest Hotel, Chester Hills, Mall Road, Solan, Himachal Pradesh 173212, India"
      ],
      "reviews": [
        {
          "text": "This is NOT a Hotel\nThey are service apartments.\nNot built as hotel rooms.\nNot recommend for short stays.\n\nStaff is friendly at best but not trained in hospitality. Bed sheet was torn and dirty.\n\nBiggest drawback is the location. It’s a steep 2 km downhill trek from the main road. No shuttle service available. Cab is available on request but charges Rs 300!!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice and cozy studio apartments.\nGreat restaurant with awesome food.\nHas mini theatre with recliner seats and spa and massage therapy too.\nThe massage therapist Mr. Shekhar Sharma did a great job.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Villa was really nice service is very good by care taker deepak and the food was excellent by the chef Vineeta...",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Used the restaurant services during our stay of 5 days in Chester Hills, and delighted with the food and service. Every meal we had they were nice to customise as per our requirements and quick to deliver to our apartment. The staff is friendly and welcoming. The ambience of the restaurant is good and modern. The location and view are undoubtedly the best in Solan.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Overall experience was nice room were clean and comfortable, however, this place is like a high rise society of NCR in a hillstation, good for a halt but not enjoying the nature.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "CENTAROSA RESORT",
      "rating": [
        3.9
      ],
      "address": [
        "Majhgaon Village, P.O. Shamti, Rajhgarh Road, Himachal Pradesh 173212, India"
      ],
      "reviews": [
        {
          "text": "A beautiful place for functions having a big pillar less hall, rooms are spacious and well kept neat and clean. Food is also delicious.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "We booked it for a wedding. Venue and main event service was top notch.\nRoom service could have been better.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Over the years, This has been the worst experience for me and my family.\n\nYou will find yourself constantly asking the staff to bring things that you expect in a 3 start hotel.\n\nThe response time is extremely poor. To give you an example, there was no hot water in the morning and the staff did not resolve the issue even after constant follow ups.\n\nI am giving one star for location.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are above average, amenities are missing like WiFi, intercom etc, Airtel works good there, jio might , vi sucks. They don't offer room service.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "So this place is really good at some things and bad at some as well. First the staff is good, the space they provide you as per budget is also well... Like I've been to places who charge 2k for really small room, but here the room was very big as well as the washroom. The room was clean as well, all the towels and mattresses were well cleaned and odour free. I didn't had chance to taste the food so I'll not review it, but there was a vast selection of dishes to choose from. The thing I didn't liked about this place is the way it's used, or designed. For example there were only two lights in the room, both of them above the bed, and there was no light above or in front of only mirror in the room, so it's really tough to do makeup or anything via mirror. The washroom was great and large but again the lights were very dim. The furniture is very old I must say, and tasteless as well. Except this, the place was stay worthy and at a good location.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}