{
  "places_with_reviews": [
    {
      "name": "Jalsa Banquet hotel & marriage gardean",
      "rating": [
        4.2
      ],
      "address": [
        "Near sawariya temple,kukshi bypass,khandwa, baroda highway, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "It's a nice place to stay. It's an on road property & ample amount of space for a large gathering. Rooms are spacious & clean. Staff is supportive.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This hotel is surely in my recommendations at the city.\nFood is good and reasonably priced.\nWith about Rs 300-500 per person.\nPortion size is good too\nAmenities are basic and good.\nThe preferred stay should be an executive room on the top floors.\nHospitality is heart warming.\nServices provided a quick and very polite.\nJust one drawback - they did not have tissue in the room which was quite troublesome.\nOverall experience is appreciable.\nWay above the expectations from that city.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Spaciously well maitained greenery on the open ground. Rooms are clean with big windows. Best place to stay",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very spacious and nice hotel and banquet and garden. Enjoyed.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good place to stay near khandwa, value for money, Big rooms. Friendly Staff.\n\nThe location is outside Khandwa, very poor mobile network in Room,\n\nHotel wifi is good,",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Sakhi Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Near, 2VWW+7F5 Bus Stand, Rajghat Rd, opposite Krishi Upaj Mandi, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "It's  good resort espically for weeding having good staff and members makes it more beautiful and I have visited twice to this resort and I hope this type of quality would be maintain",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms are spacious but bit unclean and no hot water facility. They provide hit water by bucket. Suggest to keep room cleans and start hit water facility for bathing",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "best wedding junction of nimar region barwanj",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent place for having receptions and weddings",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Reasonable rooms with ample of space",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Krishna Bhog and Restaurant",
      "rating": [
        3.9
      ],
      "address": [
        "Anjad Rode, Road, near Punjab National Bank, near Panjab National bank, Anjad, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Delicious food, please try jawar ki roti and amari ki bhaji here , unforgettable test very good experience",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Room service in the morning wasn't good. Actually I had to go down to the reception to ask the reception guy and room service guy to get up in the morning to give me hot water to drink @ 7:00 AM.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good food. The renovated interiors are the cherry over the cake.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "If it's urgent, please don't even think of having your meal here. It's the worst place as far as services are concerned, you will be waiting after ordering and they will be busy preparing their parcel service.\nEven for simplest of meals they are going to take 1 hour.\nAlso, the quality is not upto mark, washroom are worst, kitchen is worst.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is overpriced and taste was kinda okay you should find a better place to eat. I had visited this hotel 3 times and the experience was okaish but the food doesn't justify the price",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel The Grand Saraswati Palace",
      "rating": [
        4.1
      ],
      "address": [
        "Segaon, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Staff behaviours is very good here and they follow all your instructions regarding the food you want. Loved the place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The hotel is very safe and the staff is very helpful and cooperative , very polite and the food is a must try. Every item is well cooked and delicious with large quantities at affordable prices",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice ambience, nice taste.\nBetter experience considering locality.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Spacious and clean premises. Every dish was prepared with love and the taste was finger licking. Recommended for food lovers. Also, they'll provide an open aur hall and a hall for birthdays, parties' and other small family programmes (100 people).",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "good test and cool place\nsuitable for family",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Rama Shree",
      "rating": [
        3.8
      ],
      "address": [
        "2WJ6+G8W, Park Avenue, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Worst experience in this Hotel.\nNo basic amenities are  provided, also whenever asked for something, the response was there is lack of staff. The staff is highly illiterate and shows attitude to guests.\nIts better to stay at any other property in Barwani than this place.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Worst experience of my lifetime staying at this property. The hotel not even deserves 1 star rating. The present ratings have been put by the staff itself.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I recently stayed at this hotel, and my experience was disappointing. The hospitality was subpar, with staff members showing little concern for guest needs. Cleanliness was a major issue; the rooms were not properly maintained, bed was having bed bugs(got rashesh) and hygiene standards seemed lacking throughout the premises. Overall, I cannot recommend this hotel due to its poor hospitality and cleanliness standards.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Horrible experience, there is no restorant in hotel , and if you ask something they are charged extra service charges rather than food bill, in room lots of mosquitos , very bad experience,I can't sleep overnight, please don't go there",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "A good hotel to stay in Barwani...Centrally located on main road, all buses stop here ... Overall a convenient location in entire Barwani",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Shiv Shankar & Restaurant",
      "rating": [
        3.8
      ],
      "address": [
        "Indore Road, near Axis Bank Branch, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Beautiful restaurant and hotel in barwani city with variety of food options. Hotel rooms are clean and furnished. Good service given by the hotel staff. Best place to celebrate birthday parties and conferences.Must visit once",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good Hotel for staying. The food at the restaurant is good.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "A very good lodging experience. Clean rooms good service and resonable rates. Probably  only better place in badwani.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "A excellent veg resta in badwani,food service and interiors everything is awesome...a best place for party and family fooding",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Impressing food test and best room facility at barwani.\nPlease try tomato cream soup.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Aman Palace",
      "rating": [
        4.1
      ],
      "address": [
        "Infront Of Ranjeet Club, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Worst room... Worst owner... Everything is the worst. Waste of money and time.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Please anyone share me the contact no of the hotels.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Not gud",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good Future",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Sawariya",
      "rating": [
        3.8
      ],
      "address": [
        "Anjad Road, 2WH9+XWP, Segaon, Chopati, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Beautiful hotel and tasty food. Price is affordable. Facilities are available here. Parking and other facilities are available here in very low price.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel environment is the best 👍\nHotel service is very good🤍\nthe food is very tasty🤤",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Overall Good Experience but Room need some Upgrades!",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Best restaurants in our area",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Food is good and good for family.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Aanand Palace",
      "rating": [
        3.3
      ],
      "address": [
        "Rajghat Road, Opposite Gurudwara, New, Bus Stand, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "Services are very fast... Food of taste is really tasty & yummie... Staff is very good... One of the best in Barwani",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Good 🙏👍",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Not a great quality food,\nNor a definable price,and a mediocre service.\nInstead of compromising on 1,your doing on all!",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Very bad hotel hotels rooms is smellling food is goood but price very large",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "One of the worst hotel worst service\nRooms are leaking smelling\nNever book this hotel\nNever ever",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Hotel T92 Family Restaurant",
      "rating": [
        3.9
      ],
      "address": [
        "2VRW+4F2 Shiv city colony, New Bus Stand, Rajghat Road, Barwani, Madhya Pradesh 451551, India"
      ],
      "reviews": [
        {
          "text": "One of the worst hotels in barwani. unprofessional and food is also not good is like store from 1 2 days old.\nyou can try another one hotel like aman palace and anand palace shree ji both are good as compair to this one",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are clean and ready to stay. Food options are also available here, on ground floor restaurant. Near bus stand and manorama hospital.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Food is awesome at the restaurant. Hospitality at its best. Warm hotel staff. In close vicinity from bus depot.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "These hotel is good stay and food are also testy nice place and here kaju Kari is best I like it",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Food quality is good and the staff is very service oriented. Rooms are fare enough in mid price range.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}