{
  "places_with_reviews": [
    {
      "name": "Hotel RamKrishna Executive",
      "rating": [
        4.2
      ],
      "address": [
        "3870, Bhavani Peth, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "I recently had the pleasure of staying at Hotel Ramakrishna in Barshi, and I wanted to share my fantastic experience. From the moment I arrived, I was impressed by the hotel's cleanliness. My room was spotless, and the entire property maintained a high standard of hygiene.\n\nFor fellow vegetarians,  is a dream come true! They offer a fantastic pure veg restaurant on-site, serving delicious and satisfying meals. I never had to worry about finding vegetarian options outside the hotel.\n\nno smoking and hard drinks not allowed in hotel area and rooms.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Realy good & super hotel for family's. Test, location, cleanness, & specialy service very good.\n\nOur family like to visit again and again\n\nThank you",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Superb place to stay with family. All staff are helpful and very cooperative. Food quality is good and reasonable.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms are enough but bed size is too small not enough for 2+1, Fan position far from bed,cupboard are to closed from doors, might possibility for chield enjury,missing clothes hooks, lots of empty space, having small fridge but not working 😕, most of TV channels runs only for 10 min,main problem is no ventilation missing net for windows",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Delayed service, Drainage smell in bathroom, Afternoon time no one available at reception, exhaust Fan not working, Food rate is too high as per C category city like simple small cup of coffee at price Rs.40",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Yogiraj Exclusive Lodge",
      "rating": [
        4.5
      ],
      "address": [
        "Infront of, ST Stand, Barshi - Tuljapur Rd, near sonali lodge, Zaregaon, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "Ambience is very good, you feel like you’re in 3 star hotel. From outside it may not look very big but inside rooms are specious for a couple. More cleanliness is required specially commode. Restaurant is missing but there are plenty options available nearby. Staff and service is good.  Tariff is also low compared to similar amenities in other cities.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Best place for stay in Barshi town. Rooms are very spacious and comfortable. Staff is cooperative.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nice room cooperative staff and food quality also best. When you visit barsbi stay at yogiraj exclusive.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "It's good place to stay. Being mumbaikar, I was looking for a value for money and wanted a good hotel for a day. The rooms are cleaned and staff is very friendly.\nOverall good lodge.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Amazing Staff and Clean Rooms. Would Recommend to all",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Apple Hotel&Lodge",
      "rating": [
        3.8
      ],
      "address": [
        "Gadegaon Road, Barshi Byp, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "Food Menu is good for a stop over . Had to stay here due to vehicle break down . Good staff and neatly maintained rooms.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "ok",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Grt to spending 2-3 days with lodging...service is  vry gudd👍👍👌👌👌",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Bad service\nNo AC room",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice place for dinner and also snacks",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Status",
      "rating": [
        3.8
      ],
      "address": [
        "6MVW+527, Subhash Nagar, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "It is a horrible, horrible hotel...they don't have a phone in the room to call the reception and ask for necessities. They didn't bother cleaning the bathroom before we checked in! The toilet seat has urine drops on it and the entire bathroom floor was muddy! Very, very disappointing.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The taste of the food is good but the size of roti is little bit small and they gave sabji only one time",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Affordable room tarif with clean rooms\nThey have free breakfast included in room tarif.\nThey got very less space for parking which is drawback.\nFood is also ok not bad and not too good also.\nThey AC and non AC rooms.\nStaff is well behaved and polite too.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Though Barshi is one of oldest municipality, to be precise 1863, repeat 1863, somehow it has never flourished.\n\nIt still remains to be a town, a trading town and a gateway to Marathwada region.\n\nWith a few engineering colleges and a few other faculties established, the town is developing into a small city.\n\nWith one of the first cancer hospital, the town has now a good number of speciality hospitals.\n\nNaturally the hotel industry in this town is turning a page for development.\n\nIt is with this background I am submitting my review for Hotel Status.\n\nIt is located now in the central area, accessible from bus stand, Govt offices, hospitals, educational institutions, malls and market.\n\nThe rooms are clean and tidy and are with basic facilities like attached bath and toilet. The have about 18 rooms, a few with AC and a few standard ones.\n\nFood and beverages are available during specific time only. That too one has to inform in advance.\n\nThe place strictly serves only vegetarian food.\n\nConsumption of alcohol is strictly not allowed.\n\nSimilarly consumption of non vegetarian in hotel premises is not tolerated.\n\nThe tariff is modest. As of today, that is November, 2022, it is between ₹950/-(Non AC) to ₹1200/-(AC) for double occupancy room. for twenty-four hours.\nThus there is no fixed check in / check out time. You can check in any time and day would be counted accordingly.\nThis may be a good place for parents visiting their wards at one of the engineering colleges :) 😊",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Mind blowing\nUnexpected Service also\nIn such a small town they have very fantastic management.\nReasonable price,\nClean and hygienic bathroom\nFood 🍲 is also unbelievably delicious 😋",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Gauri",
      "rating": [
        3.7
      ],
      "address": [
        "Kurduvadi Road ,Barshi,Maharashtra , INDIA., Barshi - Pune Hwy, Chatrapati Colony, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "Bundal rom and no room service bad lodgling",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Bathroom was not cleaned properly and room was too messy 😞",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Bathroom not clean",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "beautiful views,\nLarge parking,\nFunction Hall is bigger,\nPandharpur ...Barshi highway touched best one hotel for stay with family or friends.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Hotel service very nice and good service super",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Shiv Darshan Lodge, Barshi",
      "rating": [
        4.1
      ],
      "address": [
        "C.S. No. 924/4, Dharmadhikari Plot, Adarsh Nagar, Paranda, Chowk, Gadegaon Rd, Adrsh Nagar, Barshi, Maharashtra 413411, India"
      ],
      "reviews": [
        {
          "text": "Poor management n small rooms. No space for even extra bed. Not recommended with family",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We had booked rooms for marriage. Rooms are very small. No ventilation, and lot of suffocation. Check out time is 12 noon. Food is not available. The most disappointing is rude behaviour of the Manager. Later I came to know that he is the owner. He don't know how to talk to the customers. Avoidable.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best service and best staff, food and rooms are good. Rooms are in proper condition, neat and clean.\nAffordable and reasonable.\nStaff are helpful. A happy stay.\nWould like to visit again...",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's really good lodge , Only the think is little far from bus stand around 2km and there is no dinner as well as lunch facility, So make sure you had you lunch and dinner before checking .Staff are very co operative and supportive . I suggest you to try once and tarife rate are also genuine ..You can book this hotel through goibib in good discount.\n\nThank You",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very nice hotel. Good staff behavior. Service is also nice. Very clean rooms and other places.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Shree Chopra Palace",
      "rating": [
        3.8
      ],
      "address": [
        "Chinch Rd, Adhyapak Colony, Bhim Nagar, Barshi, Maharashtra 413411, India"
      ],
      "reviews": [
        {
          "text": "Only for wine 🍷 Alcohol 🥃🍾🍻🍺 दारू lovers, not recommended for family.. friends can enjoy, service is good, veg nonveg both options available 🍗🍛🍺🍾🍻",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Food is good 👍 one of the best biryani I had ... My kids love the food...",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Loved the food.  Very spicy and tasty.  Awesome restaurant in barshi.  The staff was good and very pro-ctive.  I tried vegetarian options,  but I'm prettier sure,  non-veg food wool be equally good.  And with family.  They have family section as well.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Food quality good and service prompt.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good taste little crowded in evening time",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Gokul Signature Lodge",
      "rating": [
        3.8
      ],
      "address": [
        "gokul towers ,shivaji nagar shivaji college, to, tahsil road, near bank of maharashtra, Shivaji Nagar, Patil Plot, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "Ventilation is not proper. If the windows close then ventilation  problem.but cleaness is good best locations",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The entire building is beautifully decorated. Fantastic Architecture. Rooms are beautifully decorated.\nCleanliness is well maintained.\nHome made Breakfast is served hot with love.\nYou will not find a good place to stay in Barshi.\nMany food joints are on walkable distance from hotel.\nI have stayed there since 2020,last visit was Oct 22.\nI liked it.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I booked it from a website there it showed me Rs1200/- including tax with complimentary breakfast. When I checked in at 04:30 am in morning the owner started arguing about we did not get any sort of booking and said if u want a room it'll charge you Rs1700/- no complimentary breakfast. I had no other option at 04:30am so the owner got his ball in his Court! Took Rs1700/- took my adhar card for proof and said he'll return it to me by morning. In morning while checking out the owner said he misplaced my adhar card😡 how careless staff! Pathetic place! Arrogant owner and staff. Cheaters.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Cant accept online booking, no tv in room, single 1 towel for 2 person,",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Extremely surperb hospitality by the staff. Deserves appreciation in all the area. Loved the ambience and service. Room are pretty good. Highly recommended in this area.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Capital O Yash Regency",
      "rating": [
        3.9
      ],
      "address": [
        "Subhash Nagar Byp, Subhash Nagar, Barshi, Maharashtra 413401, India"
      ],
      "reviews": [
        {
          "text": "Distance is so more bus stop.\nRestaurant food quality is good.\nNice place is night stay.\nI stay last 2 time Barshi",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good test . Very Slow service..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good place to stay at cheap rate. Restaurant is also there. Good quality food. Very good place at barshi",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good place to stay. Staff is very polite and customer centric.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Unhygienic washrooms , not properly maintain",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "बार्शि",
      "rating": [
        4.3
      ],
      "address": [
        "7M3C+G3G धर्माधिकारी प्लॉट, गाडेगाव रोड, आदर्श नगर, बार्शी, महाराष्ट्र 413401, India"
      ],
      "reviews": [
        {
          "text": "don't kiss me",
          "languageCode": "en-US",
          "rating": [
            4.3
          ]
        }
      ]
    }
  ]
}