{
  "places_with_reviews": [
    {
      "name": "Ginger Chandigarh, Zirakpur",
      "rating": [
        3.8
      ],
      "address": [
        "Dhillon Plaza, Chattbir Rd, Bir Chhat, Zirakpur, Chandigarh, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "The hotel is located at an accessible location with multiple options to eat around the plaza nearby. As per my preference, its a good place to stay for a single day only if traveling for leisure.\nThe aesthetics of the room and lobby is below satisfactory. Didn't feel cosy and relaxed by interiors. Breakfast was decent.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I recently stayed at Ginger Hotel Zirakpur and was impressed by the polite and helpful staff. They went out of their way to ensure my comfort and satisfaction during my stay. However, I believe there are areas for improvement. The cleanliness of the washrooms needs attention, as well as the quality of the towels, which were not up to standard. Additionally, the wifi connection was too complicated to set up, causing inconvenience. Overall, while the staff's hospitality was commendable, addressing these issues would enhance the guest experience significantly.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Overall my stay was excellent... Especially I was pleasantly surprised when my room was upgraded to Presidential Suite...location, room facilities, cleanliness, staff behavior, nearby facilities were all great.\nHowever, the quality and efficiency of F&B service was highly disappointing. Both dinner buffet and breakfast were disappointing. Lack of food refill, poor supply, undercooked food items, unclean tables, staff shortage, etc. were very evident. The basement car parking was very dusty and dirty. Definitely scope of improvement.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "We stayed in hotel for my son's wedding from 13 Feb 24 to 14 Feb 24. Wonderful service, proactive staff, near & clean rooms, awesome buffet breakfast & great lunch. The staff was very innovative and made our function success. All the guests came for wedding were very happy and had sweet memories. I would recommend everyone to go & enjoy once. I convey my sincere thanks to the Sh. S Ganguly ji, Sh. Krishna ji and other staff for their efforts to make our functions a great success.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "We stayed for four days. Staff is good. Bfast is good. Other meals were also good. Location is very good. You have a dmart across the road plus all famous eating joints within 500 metres. Special mention of Krishna Ananya Rupinder and Atul, in staff, about being friendly and helping.\nIf you have work at Panchkula, its a bit far.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Palms Banquet Zirakpur",
      "rating": [
        4.4
      ],
      "address": [
        "NH,zirakpur, near, mcdonold, Zirakpur, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "A great place for big and luxury wedding.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Big parking . Nice ambience n big banquet hall",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great venue for wedding... I liked their decor... But i think it's more suitable for people with a good budget and >500 gathering",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautiful n so nice place. Decoration so beautiful 😍",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "A good place for small get together and kitty parties. Serves chiefly Punjabi food. Nothing special to mention.\nI visited this place for one more time on 18th & 19th to attend a marriage in relation. I found that it is a place that can accommodate may be 1000-1200 . A professionally managed place with nice decor ideas.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Lycoris Hotel",
      "rating": [
        3.1
      ],
      "address": [
        "North View Park, Zirakpur, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "The location of this property is just great. Here to attend a celebration. The entrance and the hospitality is warm enough to keep up the spirits. The rooms are also very spacious and beautifully decorated. The food here is also a treat to one's tastebuds. Overall experience is nice so far",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Extremely comfortable and spacious rooms, stayed over for one night. The staff is extremely friendly and helpful. And the food is one of the best I've had in Zirakpur.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Serious behavioural lapse by the Manager of the property. He dont talk nicely. Have a very rude tone to address anyone. When asked a water boiling kettle, they provided a really dirty one upon asking why this was dirty, they said it is not washed for the last one year. Who gives one year soiled kettle to their guests.\n\nThe manager of the property and his tone of talking with anyone was the real issue. Do not visit this place only and only because of him.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Nice hotel staff, service, food all things are excellent good location zerkpur underground  parking  frond office very polite and friendly  best experience",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "This hotel is good, had comfortable stay here.\nStaff is also very humble and helpful.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Paras | Chandigarh & Zirakpur 3 star Hotel with Swimming Pool | Banquet Hall & Lawn",
      "rating": [
        3.5
      ],
      "address": [
        "Paras Plaza, Ambala - Chandigarh Expy, Shakti Nagar, Bhagat Singh Nagar, Dera Bassi, Bir Dandrala, Punjab 140507, India"
      ],
      "reviews": [
        {
          "text": "One of the worst hotels I have ever stayed in. Although the rooms are quite good and comfortable. But the services of the hotel are very pathetic. This is just because the management is not involved in making the things better. The management made us change the room 4 times in a day for issue like water leakage, floor cleaning and door lock issues. But sadly the fourth the provided was the worst in hotel. No toilet roll in washroom, washroom light was not working, toilet flush was not working, no water supply in washroom. Your can understand how horrible stay it was. And there was no manager concerned about such issues despite of ample gentle reminders. Never recommend anyone this hotel",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "The dining experience was exceptional as well. The on-site restaurant offered a diverse menu with delicious dishes, and the breakfast buffet was a great way to start the day.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "The largest 3 Star Property in Derabassi.\n\nEquipped with all the amenities but more importantly has a very friendly and welcoming staff.\n\nGreat place to spend good times with families and friends.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "The room was impeccably clean and well-appointed, providing a beautiful view . The attention to detail in the room decor and amenities truly made me feel pampered and comfortable throughout my stay.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Beautiful location, Clean rooms, Amazing service and yummy and hygiene food it gives me the immense experince at hotel paras",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "RONTA WORLD HOTELS",
      "rating": [
        4.3
      ],
      "address": [
        "Ambala - Chandigarh Expy, Zirakpur, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "Stayed here with my group of 10 people and had great experience.\nRooms and washrooms are hygienic and of very good quality. Nice service, yummy food. Staffs are friendly. Owner Mr. Rohit is a gentleman and always active and helpful.\n\nOne should stay here anytime.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The best hotel with the best budget tag.\nFood served in room is really great.\nRoom service is fine.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Room was a bit stinking - not dirty although. Bedsheets and Bathrooms were clean. Size of the room is sufficient.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Such a nice Hotel Staff of this hotel is very good. Room service is very good. The food of the hotel is very tasty 😋. Such a nice Hotel.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice hotel at good location with decent service.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Blue Sapphire",
      "rating": [
        4.1
      ],
      "address": [
        "Ambala - Chandigarh Expy, Road, Dera Bassi, Bir Dandrala, Punjab 140507, India"
      ],
      "reviews": [
        {
          "text": "Rooms were decent. Firm mattress and bed. Bathrooms need a shower separator or wiper. They should provide 2 towels instead of one and there is no hand towel. Food below average. Service was fine. Lots of parking. Accessible location.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The rooms are good, food options mostly restricted to N. Indian cuisine. But unfortunately it has worst housekeeping services. If they really want to stay in the race, they need to buck up in that front .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best service!! Our family enjoyed the stay .. the food was great and the service was very prompt!\n\nThank you so much for giving such a great stay",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I have celebrated the brithday party very nice place , service all good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good place to stay, good food and hospitality.\nNeed to increase varieties in breakfast, south Indian food should be introduced.\nThis will be good for professionals who visit for buissness purpose.\nOverall ok",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hote Shivam Lodge",
      "rating": [
        4.7
      ],
      "address": [
        "ATS Road, Shiv Puri Colony, Dera Bassi, Punjab 140507, India"
      ],
      "reviews": [
        {
          "text": "The rooms are very spacious, with hygienic and well maintained washrooms. The In house kitchen is aslo with an apt service\nThe rates are so reasonable as compared to others hotels in the same area. The stuff from the Managaer level to waiters and cleaning stuff are courteous and well behaved.. my stay was hospitable and memorable here..",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Excellent good sarvice\nNice hotel and facilities\nGood food quality",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "They charge you even to breath fresh air.\nPathetic service, to sit in balcony have have to pay, for bonfire u have to pay, for wifi you have to pay, room cleaning is not available after 5pm, linen and bed sheet smells badly,if you asked for extra towel you have to pay,\nAll-over a bad experience",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It was an good experience. hotel were really good that too at such an affordable price. staff was polite. and highly recommended.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I have been staying here since last year. The service is quite impressive, Staff and rooms are amazing. Food is prepared ny professional chef and quite delicious.\nI would recommend everyone to stay at this property.\nHave a lovely stay",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "CITI INN GRANDE HOTEL",
      "rating": [
        3.9
      ],
      "address": [
        "SUSHMA HOMEWORK, opp. BURGER KING, Zirakpur, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "Good place for staying for short time!\nNice furniture and ambiance, the servants was good!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I found it online but booking was not getting through. Lastly called the reception and booked on 21June. Room was not clean, dirty cover and bed sheet. Ordered lunch and used Plate even with ketchup pouch in it was provided. after calling it was replaced. They never came back to pick plate and used bowls after lunch till we called to do so. worst experience ever. will never use this again(being frequent visitor to Chandigarh) or recommend anyone.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The best hotel I’ve ever been privileged enough to stay at. Excellent property, and it only gets more breathtaking when you walk in. Front desk staff is extremely efficient, pleasant and helpful. The room was spacious and clean. Overall, I had a great experience there.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Worst service, worst hotel, worst management.  We had our rooms at fifth floor and lift was not working. The manager was very rude and dint listen to our requests at all.\n\nDo not come here ever.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Pathetic and Unhygienic experience in City Inn Grande hotel stay. It's a common space to companies and few rooms belong to hotel on different floors. Those are not maintained well enough. Nobody listens to your complaints. Avoid if you're staying with your family. Washrooms are less tiny space. Exhaust won't work. Bed linen were full of hairs. Floors were dirty and full of dust. I fear of getting allergies.Manager Arvind and staff Mahesh were not responding . You can find lot of options nearby with good rates and good hospitality.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Casa Regalia Homestays",
      "rating": [
        4.6
      ],
      "address": [
        "SUSHMA Homework, Ambala - Chandigarh Expy, opp. BurgerKing, Zirakpur, Punjab 140603, India"
      ],
      "reviews": [
        {
          "text": "From some of the best apartments in Zirakpur. Nearest to the main highway. KFC, Burger King and all the food and clothing factory outlets are nearby. Rooms are spacious and good. The bathroom was little smaller in my apartment otherwise it was good. The kitchen is good and filled with all the modern amenities and cutlery. A very good place to stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Stay is at prime location. Great ambience and supportive host Mr Sunil. Looks exactly the same as in photos. Everything was provided in the kitchen to cook meals.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I had a wonderful experience at this place! The location is excellent, right on the main highway, making it easily accessible. The indoor parking facilities were a great convenience, ensuring that my vehicle was safe and secure. Mr. Sunil, the host, was always available on the phone and responded quickly to any inquiries or requests I had, which made my stay even more pleasant.\nThe room facilities were top-notch, exceeding my expectations. The comfortable beds and clean linens provided a restful night's sleep after a long day of exploring. I especially appreciated the option to cook in the kitchen, as it allowed me to prepare my own meals and saved me from dining out every night.The overall atmosphere of the place was welcoming and cozy. The attention to detail in the decor and amenities provided a homely feel. The cleanliness of the rooms and common areas was impeccable, giving me peace of mind during my stay.\nI would highly recommend this place to anyone looking for a comfortable and convenient accommodation option. Whether you're on a business trip or vacation, the combination of its excellent location, good parking facilities, attentive host, and well-equipped rooms with kitchen facilities will surely enhance your experience. I am already planning my next visit and can't wait to stay here again.\nRating: ⭐️⭐️⭐️⭐️⭐️ (5/5)",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Location is excellent and on main highway. Good indoor parking facilities. Host Mr Sunil always available on phone and respond quickly. Room facilities are good and one can cook in kitchen.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The place is good for stays but there is no food service, you prolly will have to swiggy it or make it yourself",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Aman Hotel And Restaurant | Dera Bassi Zirakpur",
      "rating": [
        4
      ],
      "address": [
        "HVJ4+7G3, Gulabgarh Rd, Ganesh Vihar, Bhagat Singh Nagar, Gulabgarh, Punjab 140507, India"
      ],
      "reviews": [
        {
          "text": "We went to their restaurant today 29/01/2024 we ordered ( dal makhni , kadhai paneer , butter chicken , fish curry) the dal makhni was sour in taste and the kadhai paneer had too much green chillies in it a normal person cant eat on the other hand the butter chicken was too sweet like they had added sugar manually to make it sweet . When we complained they said we can’t do anything. Worst experience no body should come here 👏🏼",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The food was very good and the hotel was also good in every way.\nLoved the service.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Amazing place .. spacious rooms.. best room services. Helping staff and main thing for our makeup artist they have better lightings in their rooms",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Waiters are unprofessional, sitting is good. Food average. Rates are  bit higher than the surroundings.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Went for dinner, soup had an insect, the food was served after waiting for 1 hour, pathetic services, rude waiter, owner should close the restaurant services",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}