{
  "places_with_reviews": [
    {
      "name": "Stella Hotel",
      "rating": [
        4.2
      ],
      "address": [
        "Barnala Bypass, Hazura Kapura Colony, Guru Gobind Singh Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Stayed here for one night in an executive suite room with family. Location is right on the highway and easier for travelers to access. Room size is decent and Food is also good. However, the service and room amenities needs to be revamped to a 4 star standard.  Overall satisfactory but need improvement.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Great hospitality and staff, amazingly organised private functions. We were a group of 20+ and they made us feel like home. Not to mention food was also great",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I recently booked 25 rooms and had a dinner party at Stella ( basement hall ) -\nthe  rooms including Executive, Royal & Dlx - all very neat & clean - comfortable . Thanks to Vijayji for adjusting even last minute changes.\nThe party was superb - Mr Vipin took personal care to make it success- everything turned out good - food, service. Dj etc\nAbove all - Mr Neeraj Garg( owner ) is very cooperative & humble person.\nThanks to Stella and its management.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "An average hotel with decent rooms but very poor service. Have been staying here for a week and am planning to stay for a whole month but now considering changinf the hotel.\nRooms are clean, how ever small things  like the telephone, cloth hook were broken in my room.\nService is very poor, reception staff not helpful at all, had been asking for a room change for 5 days, but every time i call them they cook up a story and tell me all rooms are booked. Hot water gets switched off on its own, on one occasion no water was available in the bathroom, a bucket of water was then later sent instead when asked for.\nRestaurant service is below average, wait times are very high, have been served cold rotis on multiple occasion.\nThe hotel charges prices of a 4 star hotel but gives the experience of an oyo room. Very dissapointed",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good rooms available... Hotel restaurant have few options but at high prices.. Good parking option... Rooms prices are near about Rs 3000 to 8000/-",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Sepal",
      "rating": [
        4.2
      ],
      "address": [
        "Goniana Road, opposite Hotel Sepal, Parjapat Colony, Mata Jivi Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Hotel Sepal in Punjab offers a delightful stay with its exemplary service and elegant rooms. The ambiance is peaceful, catering to both business and leisure travelers. With its delicious cuisine and prime location, it ensures a memorable experience. Highly recommended for those seeking comfort and quality in Punjab.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good ambience of the Hotel. Ample inside Parking Space. Food taste is good now as compared to earlier.\nNeed to improve the cleanliness of washrooms.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice location and accessible to all prime locations. Supprotive staff and rooms were excellent",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very good hotel. Also service are very good. Really like this location.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Great place for staying. Food are higenic and rooms are neat and clean.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Antique Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Shakti Vihar, National Colony, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Good for a mid sized function due to limited parking availability. In house parking is certainly low as compared to other resorts available on connecting highways to city.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good palace. Upto 500 person gathering is ok. Limited car parking inside.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Location is awesome but service is very slow. Never expected from these level of property",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ambience of the palace is so good. Very good place for any special ocassion or parties.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The guard  at the main entrance should have been properly instructed. He didn't  allow the candidates inside without hard copy even when it was clearly written that soft copy would be sufficient.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Sapphire",
      "rating": [
        4.2
      ],
      "address": [
        "Barnala Bye Pass Road, Basant Vihar, Chandsar Basti, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel and banquet in bathinda city. We stayed three for 1 night and then we have ring ceremony next day at the same hotel. Overall experience was wonderful. Rooms are very spacious and good and very clean as well. Room service was also good. In terms of food i think little improvement is required in taste and varieties in buffet. Like we have morning breakfast included in our rooms so they only served one type of juice i.e. mixed fruit juice which can be improved and varieties may be added. Other than that everything was good and staff was very friendly as well.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel Sapphire in Bathinda offers a decent stay with satisfactory amenities. The buffet breakfast provides a good start to the day. While the overall experience is commendable, the room prices could be more competitive. A slight adjustment in pricing would enhance the overall value for money, making it an even more attractive choice for visitors.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Highly recommended for booking of function in nearby area.. food quality also very nice",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good place to have ceremonies lik marriage with small gatherings, engagement, bday parties, anniversary etc... Food tastes good and they can arrange in very less time",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Great experience ,,, ring ceremony of my daughter here in hall,,neat and clean,, good service, great taste,,, good behaviour of staff,, home atmosphere,,, full marks,, God give great success to lovely people of this hotel",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Comfort Inn Tulip Heights",
      "rating": [
        4.3
      ],
      "address": [
        "Mittal City Mall, Goniana Road, Vishal Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "My stay at Comfort Inn Tulip Heights was nothing short of fantastic! From the moment I stepped in, the warm and welcoming atmosphere made me feel right at home. The staff was incredibly friendly and attentive, always ready to assist with a smile. The room was spacious, clean, and well-equipped, providing a perfect retreat after a day of exploring. The amenities, including a comfortable bed and a well-appointed bathroom, exceeded my expectations.\n\nThe hotel's central location made it convenient for me to access nearby attractions, and the complimentary breakfast was a delightful start to my day. I must commend the hotel's commitment to cleanliness and safety, which was evident throughout my stay.\n\nOverall, Comfort Inn Tulip Heights impressed me with its hospitality, comfort, and attention to detail. I wholeheartedly recommend it to fellow travelers seeking a delightful and hassle-free experience. I look forward to returning on my next visit",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I stayed here for a business trip and I was impressed with their warm welcome and professionalism by their staff. Room was spacious, clean and having all amenities required during stay. Had breakfast which was well served and tasty. There was dormitory for drivers who are accompanying you which is a point to be notified. I recommend others to stay if you are planning to stay nearby this location.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "My recent stay at Comfort Inn left me thoroughly impressed. The hotel not only boasts a comfortable and inviting atmosphere but also provides top-notch service.\n\nOne standout element of my stay was the exceptional service delivered by Ms. Sukhpreet. Her dedication to ensuring a pleasant experience for guests was evident in every interaction.\n\nIn conclusion, Comfort Inn, coupled with the exemplary service from Ms. Sukhpreet, exceeded my expectations. I wouldn't hesitate to recommend this hotel to fellow travelers seeking both comfort and outstanding customer service.\"",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great hotel in a quiet part. Staff was amazing. Special for Honey Very accommodating. Breakfast was great and afternoon snacks and drinks. We had two families with 5 rooms. Really a true gem of a hotel. Can’t wait to come back again.It was nice experience with this. All staff behave so nice, food and rooms were also good. Overall wonderfull stay with this hotel, sky garden new resturant is very nice , food cuisine is ok international",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "\"I recently had the pleasure of staying at Comfort Inn, and it was truly a delightful experience. The hotel's ambiance and amenities exceeded my expectations. The room was clean, well-appointed, and provided a comfortable atmosphere for a relaxing stay.\n\nI must commend the exceptional service provided by Ms. Sukhpreet. Her professionalism and attentiveness significantly contributed to my positive experience. She went above and beyond to ensure that my needs were met and made me feel genuinely welcome.\n\nOverall, my stay at Comfort Inn was outstanding, thanks in large part to the excellent service provided by Ms. Sukhpreet. I highly recommend this hotel for its comfort and the exceptional staff that makes the guests feel truly valued.\"",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Blazing Star Resort",
      "rating": [
        4.3
      ],
      "address": [
        "6XM4+CM, National Colony, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Very good marriage palace,neat and clean, decoration is up to mark, suitable for 600 people's Gathering, large parking space,staff at palace is very cooperative,I give 100 out of 100,👍👍👍👍👍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Amazing marriage place indoor hall best location for photography,big parking,neat and clean",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best Location for photoshoot and videography and party.\nVisit for enjoy our party with family and friends best Sitting areas and clean of everything so go and enjoy now .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Appropriate space for parking, good infrastructure,  decorations are also good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Spacious, clean atmosphere. Enough parking space. Nice location",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Park View Resort",
      "rating": [
        4.3
      ],
      "address": [
        "Street no 13, Barnala Bypass, Barnala Road, 6, Street Number 13, near Green Palace, Guru Gobind Singh Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Nice family place.\nGreat place for family parties.\nNice open space, good parking space,\nAmbient interiors.\nAttended a friend's wedding here, and it was a great experience for me.\nNice arrangements for big gatherings can be made here.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Huge hall can be designed according to wish and good servives except the music system",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice place for wedding events in Bathinda",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best Location for photoshoot and videography and the service is very good they will provide best quality of foods and visit us for song video shooting .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beautiful resort, beautiful elegant hall, brand new furniture, neat and clean, ample parking & open space",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Krishna Continental",
      "rating": [
        4
      ],
      "address": [
        "Bibiwala Road, Near Old Bus Stand, Batinda, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "We booked 16rooms here…their basic hygiene is pathetic..we booked 16 rooms for family guests well in months advance.. basic things like hand towels are not provided. How do they expect guests to wipe their hands after wash? Basic hand wash or soap is not provided?? Looks like they don’t want their guest to wash hands after toilet. They provided just one towel for double occupancy rooms. After checking with them they said that if guest asks then they provide hand towels. Do you really expect each and every room to ask you basic things??? Food is  good, service at restaurant is good. Overall I feel there can be better place available in city to make your guests stay.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The washing room dont have tissue paper,\nRoom service forget to keep your complimentry drinking water in room.\nWhich i called in mudnight and they are saying ok will provide failed to answer why this was not kept in room.\nHand towel was not in room had to ask\nThan only got it.\nVery poor room readiness is just worst.\nHence giving two star 🌟 Location and ambience\nServices canot give less than one star given still exterior is Good 👍parking and lawn👌",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Love this property for its hospitality and food.\nStaff is very good.\nMAP plan is not given which is one thing they should improve upon.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Best couple and family Room safe parking 24/7 service",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Yesterday night we organised an engagement function in this hotel.\nThey totally spoiled our function .\nThere manager from West Bengal made very huge promises during booking regarding there service and quality but seriously speaking there service and quality both are a big ZERO.\nNO FOOD QUALITY\nNO STAFF MANAGEMENT\nI had never seen this kind of pathetic management.\nThere bengali manger cheated us....!!!!!\nI suggested all of u never do any arrangements there....\nThey are BIG CHEATERS\nSpecially Bengali Manger a Big CHEATER\nNever go for that..!!!!\nI think the people those who are giving good reviews regarding this property are fake or hired by hotel..\nIt is a worst experience of my life..",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel melody",
      "rating": [
        4.1
      ],
      "address": [
        "Dr Mela Ram Rd, Panchvati Nagar, Vishal Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Overall good place, neat and clean. Needs Little bit improvements in preparation of food and service",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Melody is situated Opposite Mittal Mall.\n\nFamous for its Rooftop Pool Party, Restaurent, Rooms and Banquet along with Kitti/party halls.\n\nFood and service is very good. Further Bar is available.\n\nOne can visit with family, official party as well.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Place is good for parties, get-together, marriage ceremony and stay. Room were clean and comfy. There was only one problem that I faced that was parking.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The best hotel I've ever experienced is a true gem. Impeccable service, luxurious accommodations, and breathtaking views make it a standout. From gourmet dining to spa indulgence, every moment is sheer perfection. An unforgettable stay, setting the gold standard for hospitality. Worth every penny for an unparalleled experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very very poor service , i pay 2500 for one night they decline to give a singal plate , very bad service ,\n\nToo poor .....\n\nAgar app yha ahho tooh apni crocary sath laka aho , kyu ki inki management inha allow ni karti .\n\nI req for plate 3 to 4 time but such a poor service ,",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "The Signet Royale",
      "rating": [
        4.7
      ],
      "address": [
        "Chandigarh Road NH-7, Barnala Bypass, Guru Gobind Singh Nagar, Bathinda, Punjab 151001, India"
      ],
      "reviews": [
        {
          "text": "Nice option as Hotel, Banquet Hall and Roof Top Restaurent..\n\nBest parts are Roof Top Restaurant with please environment.\n\nA little thing to be improved is Sitting Arrangement… because sitting is round table which is not good for small family like 3-4 persons and kids.\n\nMoreover the unit can get higher customers.\n\nFood quantity is low but quality is good.\n\nRooftop restau & Bar is good idea. Further nice place for small parties .",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "First time visit\n.Having good experience with all service staff.\nAll staff having friendly nature.\nRooftop have a nice ambiance with waterfalls and big screen to watch Matches and entertainment programs.Dinner is awesome.\nLove to come again for Lunch.\nBeautiful Place to spend time with family\nTrip typeFriends\nRooms4.0Service5.0Location5.0\nHotel highlightsLuxury · Great view · Great value\nFood & drinksDelicious food.We will come again for having food .",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice location just near the highway and outskirts of city. Rooms were nice and spacious, only thing we found was floor was little sticky but that because we changed room to lower floor and could be the reason of not fully prepared room otherwise the room given by hotel staff earlier was totally superb and great giving it a premium service.\n\nSuperb breakfast service with variety of options. Overall stay was pleasant they accept all the online booking and hassle free payments and I would recommend to go with the booking of this hotel blindly",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Friendly, accommodating staff, willing to help with a smile. Facilities,  The room is spacious and clean. Receptionists are  very kind . There was a manager Sudershan Thakur that helped to serve us during the set dinners, he was very helpful and polite.\nThank you",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Awesome food with best sitting arrangement compared to various  hotel and restaurant. Rooftop  sitting areas   with  water fall is amazing  idea. ..🏖️",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}