{
  "places_with_reviews": [
    {
      "name": "Taj Bekal Resort & Spa, Kerala",
      "rating": [
        4.6
      ],
      "address": [
        "Kappil Beach, Thekkekara, Bekal, Kerala 671319, India"
      ],
      "reviews": [
        {
          "text": "🌴✨ Thank you for the amazing stay at the resort! I absolutely loved how the resort seamlessly blended luxury with nature. The staff was incredibly kind and professional, making our experience even more enjoyable. It was also great to see that the resort was kid-friendly, creating a welcoming atmosphere for families. Overall, it was a fantastic experience that I would highly recommend to others! 🌟😊",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "From arrival to departure, this hotel excelled. Impeccable service, luxurious amenities, and stunning decor created an unforgettable experience. Spacious rooms with breathtaking views, exceptional dining, and top-notch facilities including a spa and fitness center made for a perfect stay. Highly recommend for an exceptional and memorable experience.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Beautiful property and absolutely loved the stay here with my family.\n\nThere was a slight delay during check-in, but the situation was handled properly. The rooms were big, clean, and beautifully furnished. Our room had a private verandah with an outdoor swing, fountain, bathtub, and garden area. The room had easy access to backwaters.\n\nThe food was tasty, and the breakfast buffet had a huge variety with various live counter options. We also ordered room service multiple times, and every meal was delicious.\n\nThe service was effortless. Our stay was made memorable due to staff's hospitality. No one other hotel chains can match the finesse of Taj's service and hospitality. It was absolutely brilliant.\n\nThe property has multiple activities that will keep you occupied for the stay. It also has private beach access, which adds to the experience.\n\nI would definitely love to visit the property again. Highly recommend this place.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We were there in February for our anniversary.. The best place I stayed I could tell.. The hospitality is top notch.. Our rooms with wooden swing  opened out to the backwaters.. Enjoyed that swing.. Great food great staff so helping and always be at our service.. I recommend the night bamboo rafting.. Don't miss that.. We would love to go again..",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Undoubtedly one of the most exotic resorts in India. Beautiful property and amazing workforce makes the vacation memorable. The private beach is just the experience you would look for when you go to coasts. Multiple activities for a sumptuous time spent.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "The LaLiT Resort & Spa Bekal",
      "rating": [
        4.5
      ],
      "address": [
        "Padinhar Road, Udma, Kasaragod, Udma, Kerala 671319, India"
      ],
      "reviews": [
        {
          "text": "One of the best resort I have visited till now. The receptionists were really helpful and friendly. Great staff who knew how to serve the customer.\nThe scenery was beautiful and it was a relieve to walk in such a quiet and peaceful environment. The view of the sunset from that point was mesmerising",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Great location, amenities and service.  River and beach are close by. They have facilities for kayaking, bamboo rafting etc.  Buffet breakfast was good with a spread including local dishes. Overall, we enjoyed the time spent at the resort.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This review is about the restaurant only. We came here for lunch, and the food was excellent! We were a mixed group of Indians and non-Indians, and the staff took into consideration all our individual requests. The food was high-quality and fresh. Service highly professional, everyone was attentive and quick. Would love to come back for s stay)",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We had a pleasant and peaceful stay at the resort. Everything from check-in to check out was smoothly handled by the well trained staff. Special mention to Nileema, guest relations at the reception, who ensured we had a comfortable stay throughout. The breakfast buffet had a good spread, evening high tea could be improved to add some snacks. Dine-in menu has a good variety. The resort itself is a haven, spread across backwaters and private access to the beach. Good to visit again for a break from the mundane.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This resort specially the architecture and swimming pool area gave me Thailand vibes.. I love our stay.. Food is great and their hospitality is great.. They do have some activities few are chargeable but worth taking it..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Oaks Residency",
      "rating": [
        4.2
      ],
      "address": [
        "Bekal Fort Rd, Kottakunnu, Kerala 671316, India"
      ],
      "reviews": [
        {
          "text": "Within walking distance to bakel fort. Good rooms.\nNice hotel for short stay in travel with accessibility to main road. No breakfast available as per them.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good place to stay near to Bekal fort on highway side. Rooms are good, neat and clean. Helpful front office staff.\nRestaurants are there adjacent to, but breakfast is not available. Most of restaurants nearby open from noon to late night with non veg options.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "very good and spacious rooms. well maintained property. no option for breakfast was available and the restaurant beside the hotel was not open. overall good experience.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Made a last minute booking at Oaks... And I was surprised with the quality of the rooms, prices were very reasonable.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Situated very close to bekal fort and bekal beach. The rooms are comfy and spacy.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "KALANAD RESIDENCY AND CONVENTION CENTRE",
      "rating": [
        4.4
      ],
      "address": [
        "KALANAD, BUS STOP, Kalanad Road, near KALANAD, Kalnad, Kerala 671317, India"
      ],
      "reviews": [
        {
          "text": "Newest convention centre in Udma. Easily accessible. Around 700 seats in the hall. Spacious dining area with 700 seating capacity. Separate dining section available for ladies. Ample parking space with shade. Good management and staffs. Smaller hall also available for small functions. OYO rooms and other shops are present on the same building. Only problem I felt was that the seats are all at the same level. So the people at the back may find it difficult to get the view of the stage.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I thoroughly enjoyed using the wedding hall and dining area. Everything was excellent, and I have no complaints. I would happily recommend it to others; there's ample parking and enough bathrooms available.\nThanks to the administration.\nBrgds\nP Karan",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best Convention center in Kasargod\nSeating capacity of almost 700\nWell maintained\nFully air conditioned hall\nParking space is ok\nOverall 5✨",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best convention centers, very spacious, neat and good management system excellent services overall the best hall for any program!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very spacious and well maintained auditorium",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Capital O 41077 Kalanad Residency",
      "rating": [
        4.2
      ],
      "address": [
        "Badar Masjid, Bus Stand, Kalanad Road, Kalnad, Kerala 671317, India"
      ],
      "reviews": [
        {
          "text": "I had contacted them last week for the booking of yesterday and they mentioned it will cost 1400/1500 for one night for 3+2 pax single room with two double beds. I have informed to do the booking and i will reach by 9-10pm only and will checkout by 6am. On 14/Apr i contacted them again as i was little delayed due to block and some road maintenance going on. When i reach there by 10.30pm they told it will cost 2000 for the room. I told that i have contacted earlier and mentioned 1500 only and i have the voice recording for the same, but the person there not willing to hear anything or the voice record. He keep telling the same again and again. In that time i have no other choice to give the cash they mentioned and take the room as i have already travelled around 380km and was with my family which includes two small daugthers they also need some rest. Its not about the 500 rupees we given extra but the attitude of the person and only looking for money.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice option for a stay near the NH. Easily accessible and has ambient parking space.\nClean rooms and average washrooms.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Easy access to NH\nI piad  rs. 1000 a night.\nService is poor\nClean and have lift facilities",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are quite neat and clean for a comfortable stay at the centre of Kasargod!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent Stay, Highly Recommended!\n\nI recently stayed at kalanad residency and it was an excellent experience from start to finish. The room was superb, with modern amenities and a comfortable bed. The staff was friendly, accommodating, and provided exceptional service. The hotel's location was convenient, and the overall experience exceeded my expectations.\nPrice was affordable.I highly recommend kalanad for a fantastic stay. Rating: ⭐️⭐️⭐️⭐️⭐️ (5 out of 5 stars)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Shrigo Resorts and Spa",
      "rating": [
        3.8
      ],
      "address": [
        "92VJ+QX, Pallikkara II, Kerala 671316, India"
      ],
      "reviews": [
        {
          "text": "Excellent customer service. We had a wonderful stay here at this quiet place right next to the fort, surrounded by greenery and peacocks. The owner was very welcoming - he took us to his family’s theyyam which was absolutely amazing and our best experience in India so far. He introduced us to members of his family then we watched the different theyyams and had a delicious lunch there. This special memory will last us a lifetime. You have to be lucky to see it, it only takes place there every 3 years or so. Thank you so much!",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "SCAM if your expectations are based through make my trip photos! AC was not working, rooms are unhygienic, fungal smells and mosquitoes all around the place. Resort does not have food in house which is too inconvenience. After all this trouble they offered no resolutions or compensation so basically waste of time, money and energy.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Beautiful room, spacious and peaceful location.\n\nHygienic and cleaning standards at peak.\n\ncourteous staff, friendly and flexible.\n\nValue for Money, highly recommend to family and couples.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The room is dirty. Filled with dust and the whole place has a haunted place now. It's full dirty, no maintenance, no restaurant. Not worth 500 Rupees.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Location wise it is a very good one very close to seashore and Bakel Fort. It doesn’t have a restaurant.  Rooms  are very good. There is no activities that you can do inside the resort, except for simply relaxing",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Sea Park",
      "rating": [
        3.9
      ],
      "address": [
        "C24G+4G2, SH57, Tharavadu, Bekal, Pallikkara II, Kerala 671318, India"
      ],
      "reviews": [
        {
          "text": "One of the best spot to have tea and snacks. They have large collection of pickles and pickled fruits as well. Just opposite of the shop you can enjoy the view of beach. The breez of sea wind will give you a relaxing feel. They also have a large variety of milk shakes sarbath and juices. The evening snacks also tasted good. It's located in the NH and can be easily accessible. Have ample parking space as well.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Sea Park Kasaragod!, it was amazing! . They have such a wide variety of pickled foods and vegetables that it's a paradise for pickle lovers like me. The flavors were incredible. If you're a fan of pickled goodies, Sea Park is definitely the place to be. Trust me, you won't be disappointed!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Not a  hygienic place. They don't even bother about serving customers. We went and preferred outdoor seating. Nobody cares about the customer waiting for the order to be taken. Tables were left the way the last customer used. The guy cleaning the table next to us was not bothered about us and walked away without Cleaning our table. So we decided to leave the place without having anything from this hotel. Shawarma was already prepared and kept without any cover. Don't know about the taste and quality of the food served here. From the first look, my opinion is, it's better to skip this hotel",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I had an exceptional dining experience at this wonderful restaurant! Their wide variety of pickled vegetables and fruits is a true delight for the taste buds. Among all, the pickled corn stole my heart with its tangy and crunchy goodness. The Gobi Manchurian was a perfect blend of flavors, and the potato spring roll was crispy and flavorful. The porotta roll was a unique and satisfying treat. The ambiance was inviting, and the staff was attentive and friendly. If you're a fan of pickled delights and crave delectable Indo-Chinese dishes, this restaurant is an absolute must-visit!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I visited the place on March 2 2024.\nAnd had chilly chicken and porotta.\nIn the chilly chicken i can only see bones and very little amount of meat. Also 80% onions.\n\nLucky that I didn't order anything else.\n\nEven the water also, they will be selling in a bottle.\n\nFrom the outside we think of a good atmosphere. But sadly it feels like sitting in a jugad place.\n\nIf they made good food with enough quantity + better atmosphere maybe it will be better. Servicing guy is \"OK\". Restuarant feels like overrating. There will be some salted fruites, vegetables to try. I didn't tried it because some random people coming and picking up. So better to avoid taking some when everything is disoriented.\n\nFor me visiting the place once again will be less than 5%.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Bekal Palace",
      "rating": [
        3.8
      ],
      "address": [
        "Near Palakunnu Temple, P.O. Uduma, Kappil, Kasaragod, Bekal, Kerala 671319, India"
      ],
      "reviews": [
        {
          "text": "I stayed in Delux room. The interior was good and staff where good as well with excellent support. Breakfast was yummy. The concern is no mirror or wash basin outside the bathroom. Also near shower area there is an toilet paper holder which gets wet when we shower so remove toilet paper and keep in wet place before taking ahower",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Its Good but when I visited last time they was under renovation.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very bad Service and front desk night staff and night security is very ruled with staying guest no any well hotel ethics knowng staff accommodated this Hotel, not recommended to stay this hotel. And all the staff attitued is very bad and without qualified/unprofessional.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "A great place to spend time with family. Beautiful location and very peaceful. Rooms are clean and well maintained. Good food with not too many options but the preparation is great. The staff tries to do as much is possible..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "We opted for a non AC room as it's not summer. The room was great for the price (around Rs 2000/day). It's nothing less than a room in a 3 star hotel. Highly recommended for budget travelers. Hygiene is good",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Bekal Home Stay And Resorts",
      "rating": [
        4.1
      ],
      "address": [
        "Kappil beach road, PO, Palakkunnu, Udma, Bekal, Kerala 671319, India"
      ],
      "reviews": [
        {
          "text": "Very disappointed with the room, 105,a single room alotted for 2persons.Room lacked basic facilities.\nFood was not satisfactory, both in quality and quantity.\nBehavior of the staffs were very rude and aggressive.\nI don't recommend this place for visitors.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms get a 5 star for size, spaciousness and tastefully done interiors. But, and this is a big but .... Plumbing is leaking, electric points not functional, just one charging point that doesn't work, in some rooms AC and / or fans were not working. Shower was weak, no hot water despite the small geyser being turned on. This is all out together deserve only 2 star. Luckily it was a hot day and a cold shower was good enough. We had the whole place to ourselves so that helped. Service was excellent. Our hosts were actually from Karnataka, wouldn't  understand Malyalam and the preparations were coastal Karnataka but yummy. They also helped arrange transport - autos, car/tempo traveller and provided guidance on local buses to Kasargod, etc. Location is easily accessible from the main road but the beach is a short walk away. The alternative we had considered ShriGo was a beach front property next to Bekal Fort. Wondering if we could have opted for that rather than this. But that's hindsight and again lots of ifs and buts.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of the worst service ever, cooking quentity was not good they are seriving very muvh poor, current issues not soo highgine best im suggest don't go thare...",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Ten min walk from Kappil beach. Well maintained property. Our host, Pradeep Bekal, was a gracious and informative host. Food , both veg and non veg, are made on order. Enjoyed our stay.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very bad experience. Worst service. Manager is very rude in nature. They only served rice and dal in veg meal and for the non veg people only half egg and a bowl of gravy without chicken. In the room no charging point... Very bad experience",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Bekal fort inn",
      "rating": [
        3.9
      ],
      "address": [
        "TMT BULDING,NR OVER BRIDGE,MADOM ROAD,BEKALPALLIKARE, Pallikere, Kerala 671316, India"
      ],
      "reviews": [
        {
          "text": "Excellent services.\nAffordable charge and friendly environment.\nI would appreciate the staff and their approaches and the interaction.\nI got more services than I paid for. Neet clean and excellent artworks inside the rooms and walls.\nHighly recommend choosing these residents.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very much affordable budget hotel.. Location is good to access.. but noise disturbance is there as the rail passes just next to the property, to be frank. pleasant owner & staff... Clean rooms& bathrooms...Ideal for a stopover and refreshment..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Location and price wise this place is good. But not maintained properly. Looks like rooms when constructed were good but nobody cared or maintained it properly. Limited staff. Cobwebs hanging on wall and ceiling. Toilets not clean. Mosquitoes. Not recommended for family. If you are travelling via the highway then very easy to reach as its on Nh66 taking a slight left to the slip road when driving towards Mangalore direction. Parking is not hotel's space but area below the bridge with some junk and garbage heap around. Sleeping can be tough if you like silence as one side you will hear vehicles on the highway and worst thing is train going behind the hotel. This place is sandwiched between railway track and Nh66.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The location of the place was very convenient. Rooms and bathroom were clean. Mr. Ratheesh was so helpful in providing everything we needed and made us feel secure and homely. The staff bought us medicine and breakfast also. Overall, our experience was great...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "1. the room is located near a railway track\n2. reception lady is nice but a male staff behaviour doesn't look good\n3. air-conditioner  isn't good compared to the room price, AC couldn't produce enough cooling\n4. Continues powercut is a very hectic issue rather than the above issues",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}