{
  "places_with_reviews": [
    {
      "name": "Hotel Kapson, Begusarai",
      "rating": [
        3.7
      ],
      "address": [
        "In Front of Sri Krishna Indoor Stadium, Lohiyanagar, Subhash Nagar, Begusarai, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "The music album had a diverse range of tracks, catering to various tastes within the genre",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are ok. Extremely small in size. Location is good. Service is very bad.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Best Hotel in Begusarai. Best room service and beautiful restaurant. Enjoyable",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Staying at Kapson executive suite, the management is hilarious.\nThe one and only hotel who does not provide anything free or complementary including a bottle of water, bathroom kit, in room tea kit.\nI would request company official not to approach this hotel.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Went here for lunch! Great service. Staff was polite. Washroom was clean. Good parking space. Good food. We had roti and mixed Veg gravy. Recommend going here if you’re visiting Begusarai",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Tahiti Resort | Best Hotel in Begusarai",
      "rating": [
        3.8
      ],
      "address": [
        "NH 31, Singhaul Dih, Begusarai, Bihar 851117, India"
      ],
      "reviews": [
        {
          "text": "The staff was not there....when asked the girl at the reception named rajeshwari was extremely rude...she was unhelpful...told her that I'd lodge a complaint against her n asked for her name n designation she refused to provide that as well. The staff was not even able to provide the key to the room which was booked before hand.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Fraudulent behavior!\n\nPlease do not book directly with this hotel - it has been a nightmare to get the booking money back from these guys even after a month. The hotel staffs are charging unnecessarily exorbitant amount as they want to leverage the unavailability of good, clean places in this small town.\nPlease only book through makemytrip or similar platforms where you will not have to deal with these uneducated staffs.\nAlso they are putting misleading information on google by mischievously putting self proclaimed  best rating in Begusarai.\nPlease be very aware before booking this place.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The resort is more like a hotel than resort. You will not find mushy garden , the children playing area has rusted and there is no resort like ambience around. They do not serve complementary tea and do not provide electric kettle. Even drinking water above one litre for a day is chargeable. The quilt received was yellowish and broken hairs of previous guests was noticed. The room was spacious with good air condition, refrigerator and TV. Overall, the place needs sophisticated hotel management to match up with the sophisticated charges.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Poor maintenance,over priced , breakfast was horrible , for 1/2 pc of lemon they charge for fresh lime soda , towels were not supplied ,TV was not working , bathroom condition was pathetic, Handfosset was leaking , restaurant staff was rude , paver blocks were distorted and old lady with us fell down . We had to wait for more than 30 mins as the receptionist was absconding in the night at around 11",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Best Hotel is in Begusarai.Staff are very good in  behaviour and nature.hotel's resturant is nice and food also . But Tahiti hotel is expensive.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Plaza Inn",
      "rating": [
        3.9
      ],
      "address": [
        "Rajput Complex, GD College Road, Collegiate Rd, near GD college, Vasant Vihar, Begusarai, Barauni IOC Twp, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "The Room was comfortable and The behaviour of the manager was nice but the geezer was not working at the moment. Overall the service was good you stay over there. It was a safe place.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "the room was good, manager was also good but the bathroom amenities are not only pathetic but very unsafe, u can see the open geyser plate, open wiring, broken plugtop and do see the wood scale provided by hotel to switch on or off the …",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel is nice and decent service. But the owner of the hotel is an interesting person. He does not know how to run a business, infact he only capitalises on money. If he see an option to earn more than given rates he is in.. But the caretaker here is very nice and gives option to customers for pleasent stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Me and my family had an awesome stay at the hotel Park Inn. It was a delight to find a quality hotel inside the city limits of Begusarai. Rooms are well-appointed and the service was exceptionally good. The hotel staff went to great lengths to make our stay comfortable and enjoyable. I have lived in the US almost all my adult life and usually stay at upscale places when traveling. I must say that the hotel Park Inn exceeded my expectations.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Well behaved staff & plessure environment,awesome experience....",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "HOTEL KDM PALACE",
      "rating": [
        3.8
      ],
      "address": [
        "NH-31 Harhar Mahadev Chowk, C4C9+6H3, NH 31, beside kdm palace, Kaushal Colony, Kapasiya, Begusarai, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "It was an awesome stay at KDM palace begusarai, situated in very well connected location, staff was very supportive and always ready to serve you, food was also good 👍\nWill visit soon also recommend to our nears and dears 😊",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It was amazing experience with d service of this hotel.Good rooms good facility.Go for it guys.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Well positioned just beside NH in the mid of the city,  having different kind of food options.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Service was not good enough.\nWe asked for blanket but did not received till my stay at hotel.\n\nNot value for money.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Room service person was washing glass in washroom which really was disappointing. Rooms are not worth for money",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Panhas Garden & Resort",
      "rating": [
        4.4
      ],
      "address": [
        "Panhas, Garden & Resort, near Krishi Bazar Samiti, Begusarai, Panhas, Bihar 851218, India"
      ],
      "reviews": [
        {
          "text": "It is a very nice place ☺️",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The place is good for party and functions. It's clean and space is enormous for upto 500 above that it gets a bit crowded. The lawn is maintained and clean so are the rooms.\nWel they hai 4 rooms that are well maintained and a very big hall that's designed very well.\nThe charges are a bit high but that would stand upto your standards. If you are looking for a place to stay for the baratis you should go for nearby hotels.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautifully decorated air-conditioned hall. Spacious area. Good looking garden and lawn. Dine serving areas nicely decorated with plants . Rooms are also available.Clean and spacious fresh up rooms. Insufficient parking area.\n#panhasgardenandresortbegusarai",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Panhas garden and resort near krishi bazar samiti begusarai.\nPanhas garden is a reliable name in the in this industry to delevery the best experience to their customers.\nThis has helped them to build up a loyal customer base.\nPanhas garden and resort started their journey in the year of 2021 and ever since they have ensured that the customer remain at the centre of their business operation and philosophy.\nPANHAS garden is also listed in banquet hall, fully AC banquet hall for marriage ceremony, coperate meeting, birthday celebration etc.\nIt have capacity of 500 and above person at a time.\nYou can make payment through Cash, Cheque payment, Debit Card mode.\nPANHAS garden and resort is available in 24*7\nMonday to Sunday 9AM morning to 7 PM evening.\nThank you ❣️😊❤️🥰",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The resort provides good service.\nI have attended a wedding here. I was impressed by the atmosphere of the resort and the service by waiters .\nFood is healthy and tasty",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Ghar Dwar",
      "rating": [
        4.7
      ],
      "address": [
        "Chowk, near Ulao, Ulao, Begusarai, Bihar 851134, India"
      ],
      "reviews": [
        {
          "text": "Good food sarve.....",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great experience... truly enjoyed",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It's really gr8 spot of enjoyment with ur family nd loving one's. My opinion everyone must go there once",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Celebrated my birthday here..Comfortable stay and excellent service. Kudos to the management.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Amazing service and fully neat and clean and very cooperative staff members ...thank for the service..keep it up",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Itihas",
      "rating": [
        3.6
      ],
      "address": [
        "Station Rd, Tilak Nagar, Sarvodaya Nagar, Begusarai, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "Room is good and kept clean and hygienic.\n\nFood is OK but can be better and should be less oily.\n\nLittle maturity needed in staffs but they understand what is being requested for but ... but overall good place to stay.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "We stayed here for exam purpose. This hotel has a large ac hall at the ground floor with bathroom facility. All the other hotels and dormitories were fully packed up for exam so we have to stay in this hotel's hall with others. They charged us 500/- per head per day only for accommodation. We have checked in at 5AM but the hotel check out time was 12PM so they charged us 1500/- (we were three people) for only 7 hours. We stayed for 2 days. The first day was completed only in 7 hours. And the 2nd day was from the 1st day's 12PM to the next day's 12PM. We have paid the whole amount of 3000 at the time of check in and asked him (maybe that was the owner) to write it down in front of us. But he said he'll do it and not to worry. But at the time of check out another reception boy told us only 1500 payment was done (that was written). It was very much disturbing for us because we don't have any proof without the cctv camera footage of the hotel's reception. But at that time the one who took the whole amount from us was not there and the reception boy who was there maybe saw us when we paid the full amount, so that boy let us go. So we had terrible experience. Otherwise the hotel was good. The image uploaded here was the accomodation provided by the hotel for everyone in that hall who have stayed there. They charged us 500 per head per day (first day was for 7 hours) for this.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Cheap and best hotels in begusarai bihar. amazing facilities available in the room.\nYou can visit.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Back Side of Bed is Very Dirty plz see attached pic\n\nWhen asked to clean @7pm Reception person told\n\nPahle Batana chahiye tha Rat me adami nahi rahta hai\n\nTV is not working\n\nNo hot water is available in this season for bath need to use cold water\n\nBreakfast available after 8:30am no early arrangements",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Not made for living purposes.service is very poor.all food items are over rated.\nbehaviour is not good.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Bina Banquet Hall",
      "rating": [
        4
      ],
      "address": [
        "C3HX+3J7, Singhaul Dih, Begusarai, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "Space is sufficient to accommodate 2000-2500 people.Fully AC hall and rooms are available in Banquet",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice ambience, big hall as well as spacious rooms for marriage purpose.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Besin blocked, outside not clean\nRest are fine.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Director of banquet hall manoj ji a good person.\nAnd his behavior is awesome.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Best place for party celebration.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Motel Sayonara",
      "rating": [
        3.7
      ],
      "address": [
        "Near Railway Station, NH 31, near Bus Stand, Sarvodaya Nagar, Begusarai, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "Very good experience.\nVery good nature of all staff.\nDeliciou Break-fast & dinner also available.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nearby the railway station. Super delux rooms are good. Service and food quality is also ok.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Visited this hotel last week and for the very first time.\nWas delighted to see the big rooms that were also very clean and tidy. Staffs were very humble and well behaved. Foods served was very nice. And the best thing was that it came all at the minimum cost.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Staff are the king, they are not here to serve you. You can expect befitting reply from them.your orders wouldn't be served on time, they frequently forget such things. Only Deluxe rooms are cozy, if u want economical better search other properties.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Food served was excellent... pricing also affordable, value for money!!\nThey need to work on trained serving staff- waiters, that's the only hitch.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Aashiyana hotel restaurant & banquet",
      "rating": [
        4.6
      ],
      "address": [
        "काली स्थान रोड, opposite to tanishq, Bishanpur, Begusarai, Hemra, Bihar 851101, India"
      ],
      "reviews": [
        {
          "text": "I have visited the restaurant many times I want to highlight some things about the restaurant and the services of goods and behaviour are good and the environment is also friendly but some problems like they said cabin is free but it is a scam you need to pay 500 minimum order value and staff ask for tips you didn't give they will insult you and the food and drinks mentioned in menu are not available if you are going with family or friends I will recommend it but if you going with special one the restaurant is not cost worth there 😕 many other restaurants please visit there not good for couples now",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I visited this place. this place is awesome but service is very very bad . I go with my family in couple area seat is provided I ordered one plate egg noodles rs180 and one water bottle but I paid 500  why it's  good for any new guest .",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "service and food taste quality is awesome 💯💯.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Bill No-1368.I went to the restaurant for the first time and first of all I found the sitting space as well as resturant area very compact.I ordered butter na, but it was lachha Paratha in the shape of butter nan. Fried rice price was Rs 180+GST, but there was no mushroom, paneer. Very oily fried rice. Yes Paneer Punjabi was good. We all loved.\nRestaurant was forcing to pay the bill through cash/gpay, refused to take card payment, which shouldn't be.I didn't liked this term and condition. Restaurant should have evey payment options.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Best Restaurant at this location. Quantity is very good and price is also reasonable. staffs are polite and well trained. you can come here to chill out with friends and relatives.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    }
  ]
}