{
  "places_with_reviews": [
    {
      "name": "GreenTouch Resorts",
      "rating": [
        4.8
      ],
      "address": [
        "Hosahalli cross, Kollegal Rd, Malavalli, Karnataka 571430, India"
      ],
      "reviews": [
        {
          "text": "The place sure is a get away destination from the busy day to day urban life. Not very far from the main road, the resort is surprisingly calm, lush green and engaging in many ways. The staff is very friendly, welcoming and warmly accommodating. There are big open spaces to play just whatever you wish to, or to just sit around and chat. The breakfast and lunch were delicious. The staff was so humble that they even went out of the menu and prepared something for our family, on request. The place is, all in all, so calm and relaxing with the right company, that we didn’t feel like leaving the place. A must try if you are looking for a weekend escape with not much traveling.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Wonderful ambiance and good staff. Spacious rooms, well maintained wash rooms and hygiene food. Overall family visit resort with all amenities for children.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Service is good, location is best in monsoon season, resort ambience is great, less crowded food is great.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I hd a great experience at Green Touch and would definitely recommend it to others........ The food is delicious and healthy, the service is excellent, and the atmosphere is relaxed and inviting.\nBest place to visit with friends and family ...",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "We thoroughly enjoyed. The staffs were always very  helpfull  . The food was excellent...",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "South Indian city",
      "rating": [
        "Unknown"
      ],
      "address": [
        "South, 746W+3F6, C.M.Samudra, Karnataka 571417, India"
      ],
      "reviews": []
    }
  ]
}