{
  "places_with_reviews": [
    {
      "name": "Palm Galaxy",
      "rating": [
        3.9
      ],
      "address": [
        "NH-2, Etmadpur, Agra, Dharera, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Best Experience At This Place, Good Place For Staff Meeting Any Ocassion. Good Food.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Mattress are not comfortable in the rooms. One may get survical pain after sleeping.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good hotel however, in the outskirts of Agra. Good rooms, Good food and Good staff. Only challenge is to find any ola, Uber for commutation.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good place for wedding events.\nShould have a proper safe parking facility though.\nAnd valet parking too is required.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "So hotel palm galaxy has been built atop the rashtradeep restaurant, an old and famous dhaba which has evolved into a fine restaurant. It has decent, clean rooms which can be used for short business/couple/family trips. Food can be a limitation here though, since Zomato and swiggy are not available and the restaurant serves mainly Desi Indian food.\n\nThe service is decent, I had a minor electricity issue which took time to fix but the staff was apologetic about it so that's good.\n\nOverall though, it offers good value for the cost they charge and I'd be okay with a second stay here if the need so arises.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Satkar Hotel - Best Wedding Venue in Tundla, Best Wedding Lawn in Tundla, Pure Vegetarian Restaurant, Couple Cafe in Tundla",
      "rating": [
        4
      ],
      "address": [
        "Agra Rd, near fh medical college, Tundla, Mohammadabad, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Hotel service was was really amazing. Food was also tasty. Room was good but its expensive for me. But dine experience was really awesome.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "According to me this place is quite expensive and the some of the dishes(veg.maggie,chole bhatoore and burger)was also not worthy.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "On prime location near by FH medical College tundla, food and ambience is very nice, you can enjoy in ac hall also in open area.. choice is yours,just come with your family and friends and have fun",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Best place for family dinners as there's no place in tundla where you can get such a good ambiance + well mannered staff and THE Best food all together at a single place. Will visit again.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Food was nice but the staff was a little bit bad like they did not even talked properly like they were in a rush I said them to wash the plates properly 1 time but they said like we don't have this much time and when he gave the plates they were not washed and bathroom was so dirty in simple words the food was good but service was bad",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Royal garden hotel and guest house",
      "rating": [
        3.9
      ],
      "address": [
        "Railway Station Rd, Kothi No 1, Tundla, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Does not a good experience but is average experience on my site stop was good 🔥🤟",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Its a good hall for party located in tundla station road.\nIts location is very good cause its on main road.\nThe lawn is very spacious. Having capacity to hold large parties.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is a nice place for weeding and party. It is greenish field with proper designing and completely look very nice. The field is medum size not too large and not too small. There is proper rest room for the weeding guest and i can go there many times, so it is nice weeding resort..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good restaurant. Excellent food!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice place fir wedding",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Flagship 72863 New Satkar Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "Agra Rd, near F.H Medical College, Tundla, Mohammadabad, Uttar Pradesh 282007, India"
      ],
      "reviews": [
        {
          "text": "Overall a decent stay. Had to change rooms and pay extra for it, service was great, food was amazing, and it's near a highway quite outside the city so travel becomes a hassle.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very well managed hotel. So neat and clean room,bathroom. Staff behaved nicely to us. Thank you",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Its better to avoid this facade hotel. Don't fall for the outer beauty. Rooms have bugs.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Food quality is very good but very expensive",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's nice to stay here . Nice services and good staff",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO 36958 Rama Hotel & Restaurant",
      "rating": [
        3.5
      ],
      "address": [
        "Subhash Chauraha, in front of bus stand, Tundla, Tundli, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "The Most Dramatic Hotel I Had Ever Stayed In... They Don't Take Online Bookings, U Have To Book Rooms After Reaching The Hotel At Their Fixed Price... The Staff Have Their Own Tantrums, They Don't Take Orders Before 10AM... The Hotel Staffs Are Very Arrogant... They Don't Accept Their Mistakes They Start Arguing With U... On A Personal Note I Don't Prefer Anyone To Book This Hotel...🤬🤬🤬",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Staff nature is very good. Honour Mr. Padam Gupta & Aman Gupta both are gentle man. Everyone treat the coustomer very politely. Good taste is gud. Rooms luking wise good. Lift also available in this hotel.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "I have used oyo services many times in my life but this time my experience in oyo was very bad because there was no responsible person who can listen and solve our problems here light It is a big issue because the light keeps going on every one or two hours and because of that such can not be used, because of this I did not like this hotel at all nor did I like the behavior of the hotel management. It seemed to me that the hoteliers did us a favor by booking the hotel.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Great food at affordable prices. Loved the ambient atmosphere inside the restaurant, even the service was swift and great.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Don't go this hotel ever. The owner is a drunker.. he don't know how to talk with clients. They have 4 to 5 Gunda type people's.. they threatened to clients and increase the rate at the time of check out",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Hotel J.S. Restaurant",
      "rating": [
        3.8
      ],
      "address": [
        "Baghel Market , In front of Royal Garden Station Road, Dist, Tundla, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Worst experience so far, upon check in I informed for a 3 days stay. The person agreed. Next day he got a booking for marriage at higher price and asked me to vacate as I was offered room at a low price. What unprofessional behaviour, greedy owner and very rude. That is the reason they don't flourish. Highly not recommended",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "After an unexpected train delay we sought overnight stay near to Tundla Junction. Average facilities but it was good to have a shower and bed for night. Bathroom let it down by Indian standards.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Would recommend not to come to this hotel.very dirty rooms , not well maintained, front office person behaviour not good. rooms were available but here they would show you expensive rooms.No hot water..Worst hotel .",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I highly recommend that you never stay at this hotel.they were very rude and they missguide you. very high charges for a small rooms with a thin blanket.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Some main course were tasty like Mutter paneer, dal fry. Overall ambience and service needs improvement. However, given the town , this is more manageable restaurant option. The hotel is pathetic. Rooms are horrible. Don't stay at all.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Parivaar Hotel and Family Restaurant",
      "rating": [
        3.3
      ],
      "address": [
        "Railway Station Rd, Kothi No 1, Tundla, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Please find my review in points below.\n\n1. Good ambience.\n2. Hygienic.\n3. I ordered Dal Makhni and Kabli Naan. Both were awesome and delicious, specifically Dal Makhni which had a unique taste.\n4. The service was good but could be improved slightly.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Parivaar hotel is approximately 2 km from railway station. I have visited tundla many times but this hotel for accomodation for the first time. This is perfect for budget accommodation and short stay. Very reasonable in cost around Rs 800 per night. They also have restaurant which serves normal food and nothing fancy. Overall this is a good stay for transit or if you have some work in tundla. I would also recommend this hotel for people visiting for annual satsang program.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Stayed in the hotel and ate at the restaurant. Food was well-made and tasty, though service was quite slow (it took 30 minutes to make us coffee, and the restaurant had almost nobody else in it). Servers were friendly. Room was okay. There was a tv, AC, fans, a balcony with a nice view of the street, a big bed (bring your own sheets/blankets), and a bathroom. The bathroom had a Western-style toilet, a sink, and a shower (which was essentially just a pipe that shot one stream of water out of the wall). Overall, this was what I expected from a hotel in a small town in India.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Decent hotel, i was in a single room, the price is really low, they charged 600 rs each day and the most important thing is, both the TV and AC don't work. And i think they're completely aware of that. And rooms are clean",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Stayed in hotel in the last fortnight for 2 days.rate for ac room quoted as 1200₹ non ac room ₹800.on persuasion came down to 1000 & 600 respectively.i opted for non ac.room etc was ok.there was a TV,geyser  .a restaurant also which are a rare sight in tundla.but restaurant ok for family get-together but not for an individual as it works out costly.generally ate at a close-by dhaba type jt.quite reasonable with dal,roti,chawal.bagal maine beer/wine shop as well for those interested in it.bagal maine Jio mobile,clothes,general merchants store+a local delicacy bedai(stuffed kachori/jalebi/dahi/chai shop .very easily accessible to rly.station.auto raat bhar chalti hain.i had to take a morning 4 o'clock train.wondering whether would get conveance but got it within 5 mts.hotel needs maintenance but in a tundla type down town it is a good place to sleepover and rest.no doubt rates were further negotiable but I didn't bargain further as I found it a good proposition for passing of my time.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "SPOT ON 48578 Hotel Star",
      "rating": [
        3.5
      ],
      "address": [
        "NH2, Etmadpur Nagar Palika Office, Etmadpur, Agra, Etmadpur, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "These hotels are just for couples who spend one or two hours.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Staff  Very bad\nNd room ac  not working nd room is not clean\nBad experience",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "It near ION DIGITAL ZONE kuberpur aagra tundla highway.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Worrang place",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Ok for just for staying a night",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "OYO 70541 Radha Krishna",
      "rating": [
        4.2
      ],
      "address": [
        "Resort, Near, Tundla, Tundli, Uttar Pradesh 283103, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel 🏨 and staff",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Awesome 👍👍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good service",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good hotels",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "HOTEL SARHANA",
      "rating": [
        4.3
      ],
      "address": [
        "NH2 HIGHWAY, ROAD, KANPUR, Tundla, Uttar Pradesh 283204, India"
      ],
      "reviews": [
        {
          "text": "Very hospitable staff ..... must to visit ..... food is super delicious . Everything about hotel was exceptional. Rooms were Clean ,roomy, stylish and great value for money .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very hospitable staff room so hygienic and clean and hot water geyser available and food also delicious 😋",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice Clean hotel. Had a pleasant stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "very nice service and food interior so cool❤️🤤🤤",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Excellent food taste must visit on hotel ❤️☺️☺️",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    }
  ]
}