{
  "places_with_reviews": [
    {
      "name": "Hotel Mayura Velapuri Belur",
      "rating": [
        3.8
      ],
      "address": [
        "Temple Road, 5V78+V59, SH110, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "I stayed recently on April 2024. Overall good. I choose room with AC deluxe double room which was in first floor. But for elderly people bit difficult mosquitoes were there but they will provide repellent. Room is neat and clean. Everything is there. Good for families or couples. Make sure that you booked room in ground floor or in first floor coz if you face difficulty in climbing steps then you will face same problem which I had it. I didn’t taste their food coz of some bad reviews but there are many restaurants in walkable distance.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "7th to 9th Apr24 two night stay, Pleasant place to stay, we received good service and hospitality from the staffs. Restaurant service was good and very quick, veg food taste was very good. Its near main location of the city near chennakeshava archeology temple. Optimal price for the stay and cool place, surrounded with trees and good maintenance. Suggestion could be to have mosquito to the windows for 4 double bed family room.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "A really terrible hotel.\nStaff are untrained, have no respect for clients and are unsmiling unprofessional.\nExtremely noisy as on a very busy main road and no double glazing.\nNo maintenance seems done for many years.\nFood in restaurant not good (salty and 90 pct gravy) and even worse service than the hotel.Internet terrible after 10 pm. If you hqve paid for breakfast, its extra if you want an omlette\n\nGood things.  Great location near temple. Parking.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Room service isn't available and the restaurant did not function properly. There are insects inside the room. The coffee cups in the room were so dirty and the TV doesn't work.The whole experience was mid. Can stay here in case of emergency.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Suite 4 has a drawing room, a bedroom with attached bath, an Indian wc, a kitchen, and a backdoor. There's high sloping roof and 4 people can sleep. Only bedroom is air-conditioned. There's room service available. Restaurant is ok. Bathroom is ok. Suite is good",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Mayura Yagachi",
      "rating": [
        3.6
      ],
      "address": [
        "Chickamangaluru, Road, opposite Yagachi Dam, Chikkabydigere, Belur, Attalgere, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Personally I liked this hotel. Since its a government hotel not too fancy. But its very spacious unlike other private hotels in the city. It has ample space outside for parking. Rooms are comfortable. AC and geyser were in working condition. They provide extra bedding too for visitors in larger groups. Restaurant is okay types. Simple food is being served, which is good. Yagachi dam is nearby and also the water sports is in close proximity. This hotel is not too far from the city.... We stayed for two nights and it was a good choice indeed. Had a great time.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I liked the rooms clean and spacious for the price. The rooms are well maintained. The property is huge but still requires lot of improvements and there are lot of things they can include like indoor games, garden, there was some work happening expecting for some developments. The restaurant was good but not great though the taste could be a little better. Staff are helpful and soft spoken. Overall I would definitely recommend in case u are looking for stays in beluru",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Ambience is excellent. Surroundings are lush green. Food is quite good. Staff very helpful. Located near yagachi dam, away from hustle bustle of the town.\nOnly negative is that there is no wardrobe in the room. They should keep a large sized wardrobe in rooms and keep furniture, walls and bedsheets clean. Also Wi-Fi speed is poor.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Pathetic hotel, not maintained properly. Food is below average and staff totally useless and not bothered. Not even well lit room. All you get is one CFL light.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Whenever we're en route to both our hometown and Bangalore, we consistently choose to stop here for lunch. The location is delightful and cozy, and they provide excellent service along with exceptionally tasty food.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Samanvi International",
      "rating": [
        3.8
      ],
      "address": [
        "Hotel Samanvi International Rsk Complex, Sbg Bridge, Main Road, 5V9C+C95 SBG BRIDGE, NH-234, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Very good location.rooms are clean and big .well maintained.food is tasty.they provide fresh towel.toilet was clear and had ೨೪/೭ hot water service.totaly very nive to stay in this hotel",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Exceptional service, luxurious amenities, and breath taking views. The perfect escape for relaxation. Highly recommend this hotel for an unforgettable stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice place to stay.\n\nPrice is on the higher end, service could be improved for the customer by giving shampoos, brushes etc.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "For some reason our online booking didn't work. When we got there they said they could still accommodate us, but would charge ₹2500 instead of the ₹1216 online price.\nNeedles to say we left and found a different hotel.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Mark my words and do not plan to stay in this Hotel. I booked it through Oyo but when I reached there Hotel denied to provide rooms saying it’s all occupied. But when I called Oyo and gave them left right and centre then they spoke to the hotel and I got rooms. There were rooms available but they were giving it for high price I guess to people who didn’t have any prior booking in the hotel. When I asked the reception lady, she started misbehaving.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Sumukha Grand",
      "rating": [
        3.8
      ],
      "address": [
        "110, Lakshmi Devi Temple Rd, Opp Govt hospital, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Had dinner on 16/04/2024. Ordered masala dosas, naan and paneer curry. We were 15 members. 5 of our team who ordered masala dosas got affected with food poison. They serves old food for dinner. Dont know about breakfast or lunch. Please enquire before hand and order the food.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Worst experience. Restaurant is not at all hygienic. The water jugs were so dirty. Many people from our group were suffering from the unhealthy and non hygeinic food prepaeation.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Not Much on the Menu\n\nDid not stay here, but came for Dinner\n\nParking: Parked at belur temple as space availability was a constrain\nIts just around 400 mts away from the temple premises\n\nAmbience: nothing to vibe about\n\nSeating: Can seat 30-40 at a time\n\nMenu: South & north Indian Available\n\nWait Time: Reasonable\n\nFood: Taste was somewhat ok, no complain about it.\n\nValue: Felt bit Overpriced.\n\nCleanliness: No washroom Just a sink to wash your hands\n\nHospitality: Noting to brag about it\n\nLot of option were unavailable at 7.00pm itself.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "No Taste No Neetness Bad experience Don't go Anyone Waste of Money",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel is good to have breakfast. The taste is good and hygiene is upto the mark. One can try idli Vada and set dosa.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Sunshine International Boarding And Lodging",
      "rating": [
        4.4
      ],
      "address": [
        "5V65+H2R, JP Nagar, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "We had a fantastic stay at this hotel with excellent rooms, friendly and patient staff, and a perfect location. The Non AC standard room we booked was reasonably priced, and the hotel staff were exceptionally helpful. The room service was prompt in responding to intercom calls, making it convenient to order food. The hotel's location is ideal, within walking distance from Chennakeshava Temple. Additionally, the hotel offers wheelchair availability, functional elevators, working TV, hot water, and comfortable, clean beds.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a worst experience staying in the hotel. Charged 3 star hotel price but the service I received is like normal hotels(if normal hotel price is 1500 but they have charged 3 times more than this). Asked them to clean the room but no one list bothered about it. I asked some extra refreshment things bcoz they haven’t kept in the room and the hotel guy asked me to pay extra.  No restaurants available but there is an option to order from outside and if I order also need to pay extra charges!.\n\nBreakfast was included in the booking and I received a written slip to have the breakfast outside and it was only 2 plates for 2 person? If I want to have extra then I need to pay! And for refreshment I have paid it from pocket.\n\nPlease don’t waste your money!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very nice... Just 550m away from chennakeshava temple...  Rooms were clean and 24hr hot water.. Shaving kit, dental kits also as complementary .. Over all best one..",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had an amazing stay at Sunshine's. The place is at walkable distance from the temple. The facilities were also good and the room was clean. Was impressed with the dental kit provided along with the other toiletries.\nI would highly recommend this as your stay if you're planning to visit Belur.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's a decent place to stay. Rooms are a bit small, but they're clean and well maintained.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "STAYMAKER Belur Guru Comforts",
      "rating": [
        3.3
      ],
      "address": [
        "Old, Market, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Ideal location.\nLooks wild, but once you check-in, it is not that bad.\nThe manager is good and very friendly.\nAnd the in-house kitchen is good.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "This is not a place for families. Situated above a bar and has reception in 2nd floor. Wouldn't advice in a million years.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Located in the center of Belur town with good rooms and bathrooms. Good value for money hotel",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Don't even think about it if u are going with family, bcoz so many alcoholic guys are their.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "This not sefty in girls",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Vishwas Comforts",
      "rating": [
        4.3
      ],
      "address": [
        "opposite Channakeshava Temple, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Location is exactly infront of the temple. Nice and clean rooms with hot water facility (geyser) and affordable pricing. If you are visiting Belur to see Chennakesava Temple this is a comfortable stay. Only catch is you have to park your vehicle outside but you will have a decent parking space available as it is opposite to temple",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It is just in front of the temple. Rooms are well maintained with hot water facility.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Location of the lodge is good in residential area and nearby temple. You can see the temple. But clean and comfortable is fair",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Overall very satisfied and peaceful stay at Vishwas comforts. Had booked 2 rooms and stayed along with family. Owner aunty is very polite, humble and genuine person. I really appreciate the genuine hospitality. No issues/discomfort/complaints of any sort what so ever. Family too liked the place. This would be my first priority and recommendation to others.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Not too worth for the money, very basic, tv won’t work, don’t expect too much, owner aunty can help but difficult. No soap/shampo provided, one towel upon asking, no room service, hot water 25/7.\nNo dedicated parking.\nTemple Bojanalaya will remain closed randomly, one need to go little down for a good restaurant.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "OYO Pushpagiri Comforts",
      "rating": [
        3.9
      ],
      "address": [
        "Mudigere road, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "The rooms are okay but there is no room service for water. You have to go to ground floor to get water from a canteen. The staff is also quite less in number. For the price they charge the service is not the best. Parking space is not there you have to park your vehicle in a park around the corner for it to be somewhat safe. No kind of ventilation in the bathroom. So be ready for some smelly bathrooms. The rooms are big enough but not very well maintained. And for single person the room is very small and the room didn't have air conditioning for the single bed room.\nNearby good food shop is around 4-5 kms away so plan your dinner and lunch accordingly. I don't know whether you can swiggy or home delivery at this place or not. Better for shorter stays. Longer stays might become problematic.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Didn't give rooms even though full amount was paid online to OYO, this is because of differences between Hotel owner and OYO. This happened during dasara holidays. The sufferer at the end is me & my family as a tourist who had been with  trust and confidence that my holidays will be used to full extent in happiness & enjoyment. I had to waste half day in search of other hotel and had to pay extra for approaching late. I also had to pay half day charge to my taxi for no mistake of him. This is the hospitality we get for trust, confidence and honesty.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very bad staff, rude, no parking space available. However they are affiliated with oyo but they imposed their bad relationship with oyo to the customer reaching their hotel in the midnight with family with expectations of smooth check in. However they made me wait for an hour and forced me to pay offline directly to them and get the money paid online to refunded at your own risk. A Never expected experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very clean and Hygienic Rooms. Reasonable and Affordable price. Best lodge to stay in Belur town, and you can vist with yours family, Friends or for Business. And I need to share this, Owner and Crew were very Kind and Helpful.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice location.. friendly staff, clean rooms and affordable price..just parking is a challenge.. otherwise big thumbs up",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "OYO 16537 Guru Comforts",
      "rating": [
        4.3
      ],
      "address": [
        "Old, Market, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Pathetic place. There is no car parking facility. The entrance is so narrow. Blankets are very dirty.\n\nThere was power cut during the night time and they do not have backup.\n\nHot water won't work. It takes more than 2 hrs to fill one full bucket of hot water",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Room was good but there was issue with hot water and wifi. Not so costly.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A good stay with all the basic amenities. The rooms were neat, clean & well maintained. The staff friendly & helpful as well. It is located in the heart of the city & very close to Cheena Keseva temple. Do keep in mind the final entrance is bit tricky & not updated correctly in google, so check with them in advance. Overall, I will recommend this stay",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Least maintained. Lots of Cockroaches. Not worth the money.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Awesome place!! Great rooms, comfortable stay and definitely fits in the pocket!! the rooms are in the budget!! Tidy neat and clean rooms, has a great ambience!!They have a rooftop garden, bathrooms are posch with jaguar fittings, 24 hrs hot water, AC is cool, they deliver food at your rooms and have a retaurant at the ground floor!!Safe Dedicatedsecure parking for the car and close the shuuters . The hotel even has a wine shop close at 100 mts. The staff are more than willing to help great hospital8ty!!!¡awesome place and great confort!! thank you team!! you are FAntabulous!!!Kudos!!!!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Paryatan",
      "rating": [
        4.2
      ],
      "address": [
        "5V76+CXG, Temple Rd, Belur, Karnataka 573115, India"
      ],
      "reviews": [
        {
          "text": "Economical lodge with basic amenities... Car parking available.... Best price in belur located near hoysala temple... Suitable for family",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Clean rooms , hot water available always.Easy access, polite receptionist. Limited but manageable parking. Neither cheep nor costly.Walkable distance from the temple and eateries etc. On the whole OK.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice lodging at belur near chennakeshwaswami temple 👌",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms little cramped but with 24 hours hot water, Aquaguard machine, very near the temple. Very affordable at 1000/day (April 2022). However no room service, have to walk a little for good restaurants. Has underground parking and that's a huge plus point.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A very good hotel at an affordable price. Clean rooms and a good bathroom. Close to the temple. Recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}