{
  "places_with_reviews": [
    {
      "name": "Hotel IC Inn",
      "rating": [
        3.7
      ],
      "address": [
        "Near Railway Station , Gothi Market, Ganj, near Shani Mandir, Housing Board Colony, Ganj, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "Average food taste with average stay rating... Even after booking before 10 days... their exhaust ws not working.. so faced many complaints with relatives... after an argument they changed our room next day... also not provided bath soap n other accessories... charged high as compared to the service given...",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Hotel IC Inn is at walking distance from the railway station. Decent decor, big common area with seating arrangements. Rooms neat, cozy and comfortable. Staff is okayish. They are new it seems that's why they don't know how to treat customers and satisfy them but they are hospitable and obedient. Fountain near the stairs needs maintenance and a bit of decorations to look better.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice hotel. The owner and staff are very friendly and overall provide a great experience with decent rooms and food. Would love to visit again!",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Great hotel in Betul for closed programs and stay can accommodate 1000 people nice behaviour nice owners",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I have stayed in this Hotel in Betul, MP in 3rd- 4th week of September, 2022 for a long period of 10 days for my office work. My overall experience with the staff and manager was very good. Service was provided in a timely manner and was very good overall. They had a cordial behavior and a helping attitude.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "HOTEL SONI",
      "rating": [
        4.1
      ],
      "address": [
        "Front of new betul school, Kothi Bazar, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "Bad experience  no wifi no tv and tv with no signals poor condition with smelling room p",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Bad bad bad worst. staff misbehaves. rooms filthy. asks for extra funds citing reason that bathrooms are shared and for attached bathroom customer needs to pay extra. policy on booking sites states nothing about such issue or option.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "If I had an option of giving negative rating i would have gone for that. Unprofessional staff they came down to the standard of quarreling and abusing customers. Stinking rooms and sanitation issue in washroom smelling like sewers. Leaking taps and showers. Water from washbasin was spreading in the bathing area.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent Hotel, worth for Money,\nVery good and polite staff, even owner is good.\nNo complaints about room service, everything you need, they will arrange it, even if it's midnight.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Visited this Hotel for transit stay , was ok. book on OYO you will  get good deal. opt for pay at hotel. you can have look on room then decide. staff is okay. as of now parking is available in next plot . Not so secure. don't keep valuable in car. Always keep them with you. wifi is not available, but stated. bed are not good , i see sand. charging port are good. AC is good. Toilets are OKAY. wifi is not there. 1 star for price 1 star for AC.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Abhashree",
      "rating": [
        3.7
      ],
      "address": [
        "College Rd, Civil Lines, Ganj, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "In morning hotel Abhashree team will serve you complimentary vegitable juice .\ngood location peaceful & nearby Market well behaved staff .",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good service according to price but in morning hot water not continue in tap i bath in cold water.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I stayed in Suite room. Room was large but needs maintenance. The hotel doesn't have any restaurant but room service is available with limited option. Staff are friendly and happy to serve. Location is good , close to the market, court, and railway station. Room at Rs. 3300 per night is pricey, considering the kack of facilities that at such high price one can expect. But there is not much choice in a small town like Betul.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very nice hotel,\nService staff very cool",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Ground floor washroom is very unhiygenic and  very dirty",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Shambhavi",
      "rating": [
        3.8
      ],
      "address": [
        "Ganj, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "Very bad experience. The hotel owner and the manager are ready to fight for small things and are not well behaving. The hotel charges full advance payment for the days you want to stay, and if you want to check out early, then they fight for the refunds. They even blame the customer for stealing things from the rooms. Didn't share the free wifi even when asked for. Good hotels are available nearby, so avoid it unless there is an emergency.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I have booked 10 rooms for guests and have quite a satisfactory experience.\n\nThe only concern is no discount for bulk booking and the welcome drink is missing on arrival.\n\nGenerally you get breakfast free but here you have to pay for breakfast.\n\nAlthough the food quality is very good. As it is serviced by the rasoi kitchen.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Deluxe room is expensive compared to other hotels.  1500+tax.  Room does not have basic amenities like hand towel, hand wash, shower gel, moisturizer, tea or coffee packets, dental kit etc.  Only 1 bottle of water is available.  The TV has the facility of only free channels.  The electrics are not proper and the fan does not run properly.  AC is good.  There is no non veg facility in the restaurant. 24 hour stay facility is good.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very good place for Meal at Betul,, good quality of food",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Hotel building looks good, inside its fine. Room cleanliness is ok, got mixed experience with hotel staff.\nFound it ridiculous that they don't have filtered water available and bottled water is charged. So basically not even single bottle of water is provided free OR filtered water.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Landmark",
      "rating": [
        3.7
      ],
      "address": [
        "Taigore Ward No 21, Civil Lines, Main Rd, Housing Board Colony, Ganj, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "\"Comfort in the Heart of Betul\"\n\nHotel Landmark is a gem in the quiet town of Betul. Its perfect location combines the tranquility of the town with easy access to local attractions. The service here is commendable, adding to the overall pleasant experience.\n\nThe ambiance is particularly cozy, making it a welcoming retreat for any traveler. A stay at Hotel Landmark promises comfort and convenience in a charming setting.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Highly recommended. I spent an entire weekend there. Everything is great, from clean rooms to tasty food. The hotel manager was polite. I would love to stay again sometime in future.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Safe car parking available. Food is good. Cleanliness is an issue. Towels provided were not as good. On request to change them, they said that all are like the same. But Price is very affordable.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Room Quality are Good But Front Manager Have lots of Attitude and Arrogance worst Room Service i Had Ordered Break Fast and after 45 minute somebody call me and Saying Sir what was the your Order and if  I talk about Towel , I don't know.  How many years ago would they have washed it last.it was the first hotel which has not even given a bottle of complimentary water even after charging high charges of Rooms 2300+GST",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good location in Ganj area main road  Betul city.  Nice building with lots of parking Spaces available in front of Hotel. Upper floor rooms are good but ground floor rooms are very bed conditions.  Washrooms are neat and clean.  But bed bedsheets are very dirty.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "HOTEL OM",
      "rating": [
        4.7
      ],
      "address": [
        "HOTEL OM, Hotel Om At Om Residency, Itarsi Rd, Sadar, Agnihotri Colony, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "The hotel is in bit remote location, but we liked the parking space, rooms and service. Stayed here for a night during our travel from Bangalore to Kota, Rajasthan. We have tried their food as well, it was nice.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Wonderful property with such a nice stay...want to visit again n again with such type of property..thank you Om Residency Betul.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "rooms are spacious, food is great. Room service is good. They provide extra beds, dental kits and bed sheets. Overall it’s a good hotel. Would recommend 👍",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Fantastic rooms. Close to everything in Betul We came here for a wedding and the Hotel Om became a much-appreciated sanctuary.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "every thing is just good\nstaff are very helping\nbest experience of stay",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Kantishiva",
      "rating": [
        3.7
      ],
      "address": [
        "Kantishiva Multiplex Campus Opp. Betul Railway Station, Housing Board Colony, Ganj, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "My room was so \"strategically\" designed that I was able to hear all the sounds of movies theater adjacent to the hotel, the entire night. Staff were also not providing service. On the top of all, water in the bathroom stopped due to \"certain issues\" and I was asked to use someone else's bathroom rather than fixing the same. Also we had to wait for drinking water for a considerably long time.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This place in Betul is the best stay you can have here.\nRooms are spacious but Bathrooms are not good.\nStaff is helpful\nThere is no restaurant in Hotel but they arrange from outside.\nThey also provide plates,spoons and bowls to eat.\nThe hotel seems under construction but it is way better than others here in Betul.\nLocation is also very good...near to Railway station",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This is the good hotel and beautiful room\nsarvice",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice hotel in chitoorgarh. Near to the fort area. Clean, hospitable, great service. You have restaurant and sheesha lounge along with Gaming area to keep yourself engaged. Manager is very good as we checked in late and he was kind to comply . Enjoyed our group stay here. Affordable with quality. Keep it up!",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Awesome place to stay at Betul at reasonable price. Attendant Mayank was really helpful customised large and extra bed for us, bedsheet and pillows were dirty and not changed. Betul Station is just outside so you can a good chai.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Ramkrishna",
      "rating": [
        3.6
      ],
      "address": [
        "Kargil chok, बैतूल, मध्य प्रदेश 460001, India"
      ],
      "reviews": [
        {
          "text": "Rooms are ok. Hotel is at par according to Betul location. Staff are very understanding. But surely in need of renovation. Parking space is avialabe. Nice optiin for food are there near by such as Indian coffe house and also lots of street vendor",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Good atmosphere good feeling\nAnd management is very good 👏👏👏\nCome and eat the 👅",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I went to the wedding of my friends and stayed for 2 days cleaning was good but could be more better and can more things in the room to make better services.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "So excellent work hotel to visit",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I had an opportunity to stay here for a couple of times. The stay here was comfortable and the complementary breakfast was good. I dared to try tasting Masala Dosa, a South Indian dish, and I was not disappointed. The hotel is also closer to railway station and bus stand. The only issue was that it had a bar attached restaurant..",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Elbee Lodge",
      "rating": [
        3.7
      ],
      "address": [
        "MP SH 26, Hanotiya, Madhya Pradesh 460004, India"
      ],
      "reviews": [
        {
          "text": "Very nice authentic farm life experience. Room were clean and good. Few rooms were still in construction.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A gem\nWe where on the road and walked into this place on the outskirts of Betul\nReally clean place , excellent staff and hot water\nWhat a surprise , beat all the star hotels hands down",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice lodge\nBeautiful Lodge between BETUL to Betul bajar road or BETUL nagpur road\nEasy to go, easy to see by any vehicle.\nYou can go by any style like walk,driving,bus,auto,motorcycle,car etc.\nNice environment here, nice food availability here, nice Room availability with cheap rates\nNice bathroom with cold and warm Water\nToilet availability here for every Room\nYou can go Balaji Pooram temple from here\nSo welcome.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "It's good place for functions like merriage and other events.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Place is elegant.its next to ring road.those who travelling through and looking for a stay.its good place.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Rimoon",
      "rating": [
        3.6
      ],
      "address": [
        "Genda Chowk Sadar Betul, Sadar, Betul, Madhya Pradesh 460001, India"
      ],
      "reviews": [
        {
          "text": "I’ve had the worst experience, dirty pillows, hairy mattresses, non functioning jet sprays. The location is very nice in terms of accessibility. But i decided to leave when i saw a rat bigger than the size of my palm going out of the room casually using opening in the AC.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "They don't accept oyo bookings and demand extra charges upon arrival. A word of caution.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "A good place to rest midway while travelling on MP - CG route. Don't expect a luxurious stay. Good enough to spend the night. Ask for rooms with a balcony, the rooms do not have any ventilation. Sonu is very helpful and assist you in getting good etc.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very bad experience,\n\nI booked this hotel via Oyo for 925rs\n\nBut during check-in they said that ill have to rs 1500 and of course i denied.\n\nHad to face a lot as i was with my family.\n\nBetter opt for HOTEL LANDMARK, Its cheap around 750 rs for double bed, thats where i called it a night.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "This is the worst hotel i ever seen. They offer room with lots of mud and dirty floor and  second room did not have door in the bathroom . 3 class hotel and staff .",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    }
  ]
}