{
  "places_with_reviews": [
    {
      "name": "Kaimur Palace",
      "rating": [
        4.3
      ],
      "address": [
        "1A, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Very big area for free space suitable for marriage and any party function.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Well",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Kuber",
      "rating": [
        3.7
      ],
      "address": [
        "Ward No.10, Kachahari Road, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Rooms were clean but not so spacious... TV not recharged....food is delicious compare to other nearby hotels and expensive too due to heart of city located",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I have attended a ring ceremony of my family member on 27th nov 2023, service was not good, for few hours lift was not working, immatured staff and their cloths was stinking and dirty, hotel cleanliness was worst.. overall very poor experience",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The food was tooooo tasty highly recommend",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice hotel in budget of 1250 to 2000. It is in the main town of Bhabua just near Civil court and police station.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good place to stay,good food,good staff,good location",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Sivoy",
      "rating": [
        4.3
      ],
      "address": [
        "Ward no.3, Azad Nagar, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "All things are best here. There is nominal charges of rooms which can affordable to anyone. Rooms are well organised spacious and every basic amenities are available. Services are great...\nThanks @Hotel Sivoy",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best place for family stay around the trip.\nExcellent room service and place is extremely clean and hygienic. Worth a stay. Will always recommend",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very nice hotel and very good staff sivoy hotel",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Don't  judge a book by its cover is true for this hotel. Entrance and reception is not very impressive but room and service is very good. They don't  have restaurant but arrange food from Green city restaurant without extra cost. They have dedicated parking and arrangement for Driver's stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great and very well kept hotel\nMy favourite place to stay in Kaimur\nNonetheless it has its pros and cons\n\nPros\nStaff is very good and courteous and also are very accommodating\nThey will mostly carer to all your needs\nThe rooms are reasonably clean and new\nRates are competitive\n\nCons\nNo pantry and kitchen so it’s difficult for. Them to maintain a flow of food although they still manage the basics for you\nTea coffee and even breakfast etc can be ordered and the staff will bring",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Bhabua Police Line",
      "rating": [
        4
      ],
      "address": [
        "2JV4+368, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Amezing please\nThere is a most amazing Shiva temple or lovely garden.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Popular college   in kaimur district",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "For police as name suggest\nNot good for family\nI suggest not to go if with family\nGood for bachler budget line hotel",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's totally misbehaving with each and every single man like talking very very rudely and",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very good government hospital",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "OYO 66806 Hotel Maa Mundeshwari International & Restaurant",
      "rating": [
        3.7
      ],
      "address": [
        "11 Ward No.1,Near Durga Talkies,Chainpur, Road, Azad Nagar, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Rooms are dirty...owner is greedy... But staffs are cooperative...No food services ...no pure drinking water service available... instead you can buy water bottle from out side....",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Don't stay in this hotel.. Hotel staff's service and behaviour is too bad.... They are charging so much and give no service according to the hotel rules.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Located just near the fort in city(perfect location),the hotel is clean and provides u great hospitality.The hotel owner Mr.Amit singh is very helpful and will guide u throughout your stay.The staffs were very helpful.The hotel provides u almost every facilities from good rooms .\nThe rooftop cafeteria of hotel was great.wen i say food was great(i mean it :))Overall experience was awesome.I'll recommend dis hotel to every couple and families:). You wont regret,just be there:)\n\nDate of stay: November  2020\nTrip type: Travelled with friends",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good behaviour of all the staffs. Budget friendly you must visit in the hotel when you are in bhabua.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Couples allowed h yha pr?",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Maa Mundeshwari Palace",
      "rating": [
        4.4
      ],
      "address": [
        "Bhabua - Mohania Rd, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Very nice palace.. but it requires some more improvement...",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very nice hotel to stay......staff are so polite and obedient. Room service is excellent.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "My trip to mata mundeshwari temple was exhilarating and epic",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good place for staying and marriage function with excellent service",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Kohinoor Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "Chainpur Rd, Ward No 4, Patel Chowk, Ghosi Mohalla, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Very bad .\nAt first the behaviour of the hotel manager was not good.\nThe rate of rooms is at a high price while any exam is there in the city.\nQuality of rooms is not good, tv is not working.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel is clean and provide u great hospitality .the hotel owner Mr Israel gaddi is very helpful and will guide u thougout your stay . The staffs Were very helpful . The hotel provides u almost every facilities from good rooms",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "One of the Best hotel in Bhabhua 15 km from Bhabhua road railway station.\nJust at Patel Chowk Bhabhua, But rooms are not budget friendly it may cost 1000₹ ~ 2000₹ per room for 24 hours... Tea and Foods are also provided as per request.\nRoom crevices are so so..\nOwner and staff of hotel are friendly and humble in nature.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very affordable.. and central location.. reasonable price for a great buffet! Only disadvantage was the repair work that was going on.. but except that, really good place to stay.. Very classy hotel has everything in it's favour and to top it all very reasonably priced. Very courteous and attentive staff. Such plush decor such a delight for eyes.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's good to stay for day or two , staff are good but there is one things wifi access can be improve it is problem , but I am rating just because of room and bathroom is good , it is well connected with market so easily you will get it anything or hotel person also provide you.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Vrindavan",
      "rating": [
        3.7
      ],
      "address": [
        "Bus Stand Rd, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "There is no parking area beside the vrindavan.\n\nAnd low quality of management",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "They have only 8 rooms and some washrooms are not clean and garden area is good but he dont open his top ruf",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "First of all it is not a hotel instead it is a banquet hall. A good place to arrange party",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Most beautiful inside the room and hall and\nRoom and hall space to more enough .\nFor marriage and meeting purpose are so good as compare to others..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Low space for krishna dance. Krishna dance should be open sky.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Kaimur",
      "rating": [
        3.8
      ],
      "address": [
        "2JQ6+HV8, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Hotel Kaimur offers a mixed experience. On the positive side, the hotel provides good amenities and comfortable accommodations. However, the negative aspect lies in the staff's behavior and the pricing. Unpleasant staff interactions can mar a guest's experience, and this is a crucial aspect of hospitality. Additionally, charging Rs. 5000 for a single day might seem steep, especially if you were visiting for an exam, which can be stressful enough on its own. It's important for hotels to strike a balance between their services and pricing to ensure a more satisfactory stay for their guests.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "No more cleaning room,\nNo water gives you\nSafety is good",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Location is good but maintenance and cleanliness is not upto mark.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very Very excellent..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "So bad hotel no facility",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Ashok Vihar",
      "rating": [
        4.9
      ],
      "address": [
        "Ward no - 1, near South Bihar Bijli office, Rampur Colony, Bhabua, Bihar 821101, India"
      ],
      "reviews": [
        {
          "text": "Totally tremendous experience!!... everything there is just top notch, from clean environment ,  to comfy habitat...it has commendable infrastructure with enormous prerequisites...not forgetting helpful workforce/ staffs...at this price point  it's worth the money.. highly recommended...what else you need?? Just go for it!!!",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Best hotel around these areas all types of facilities available.\nOverwhelming staffs members..\nGood surroundings.\nStaying in these areas please visit for your convenience..✨",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very polite and professional staffs.\nAmazing and affordable venue for all type of social gathering.Highly recommended.👍\n.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Hey hotel is providing luxury, safety and comfortability in your affordable budget, come and enjoy your every special moment... Your event their responsibility 😊",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very nice hotel and very nice facilities\nAmazing rooms and amazing hotel staffs\nHelp us to manage a trip with in city and this is perfect hotel and nice hotel staff and amazing food and everything .",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    }
  ]
}