{
  "places_with_reviews": [
    {
      "name": "Taj Skyline, Ahmedabad",
      "rating": [
        4.6
      ],
      "address": [
        "Taj Skyline Ahmedabad, Sankalp Square III, Opp. Saket 3, Sindhubhavan Road, nr. Neelkanth Green, PRL Colony, Thaltej, Shilaj, Ahmedabad, Gujarat 380059, India"
      ],
      "reviews": [
        {
          "text": "My 3-day stay at the Taj Skyline, Ahmedabad was nothing short of exceptional! From the moment I stepped in, I was greeted with unmatched hospitality and service that made every minute of my stay comfortable and memorable. The hotel itself boasts luxurious amenities and elegant decor that speaks volumes of its class. But the highlight for me was definitely the breakfast buffet. With an array of delicious options, it was a gastronomic delight that started my days on the highest note possible. The quality, variety, and taste of the food easily make it one of the best hotels in town for anyone looking for an exquisite culinary experience. Highly recommended for anyone visiting Ahmedabad and looking for top-notch accommodation and service!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I spent 2 nights at Taj skyline on my partners birthday last year. I must say the stay experience was truly magical and the services were exceptionally over the top. We felt so fresh and rejuvenated the entire time. I had requested for minimal decoration of the room and to my surprise it was just perfect. The pool is a definite highlight and both days, they offered poolside snacks and drinks. Our room was on 9th floor and the view from room was exceptional, especially the city view and highway from the top looked sparkling. Our breakfast experience was again over the top, the live music just made the experience even more pleasant. All in all I will highly recommend staying in the hotel.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The stay experience was truly magical and the services were exceptionally over the top. We felt so fresh and rejuvenated the entire time. The pool is a definite highlight and both days, they offered poolside snacks and drinks. The live music just made the experience even more pleasant. All in all I will highly recommend staying in the hotel.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "\"Exquisite flavors, impeccable service, and breathtaking views – Taj Skyline Ahmedabad Restaurant offers an unparalleled dining experience. From the perfectly cooked dishes bursting with authentic flavors to the attentive staff who ensure every need is met, dining here is an indulgence for the senses. The ambiance, elevated by stunning skyline views, creates an unforgettable backdrop for a truly memorable meal. Whether it's savoring traditional Indian delicacies or exploring international cuisines, each dish is crafted with precision and care, promising a culinary journey like no other. A visit to Taj Skyline Ahmedabad Restaurant is not just a meal, but a luxurious escape into gastronomic bliss.\"",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This was my 2nd stay here and just like the 1st one the team nailed it.\nCelebrated my anniversary here, from the surprise cake to the  decoration , service was top notch.\nCan’t talk about the delicious food here.\nEverything is just beyond good.\nThank you to the entire team and Gaurav at the front desk.\nOur anniversary turned out to be beautiful because of you all.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hyatt Regency Ahmedabad",
      "rating": [
        4.4
      ],
      "address": [
        "17/A, Ashram Rd, near Sabarmati Riverfront, Usmanpura, Ahmedabad, Gujarat 380014, India"
      ],
      "reviews": [
        {
          "text": "I recently had the pleasure of staying at your esteemed hotel, and I wanted to take a moment to express my sincere appreciation for the exceptional service and comfortable experience I enjoyed during my stay. From the moment I arrived, I was impressed by the warm welcome and attentiveness of your staff. Every interaction, whether at the front desk, in the restaurant, or with the housekeeping team, was marked by professionalism, kindness, and a genuine desire to ensure my stay was nothing short of perfect.The attention to detail in every aspect of the hotel's amenities and services did not go unnoticed. The room was immaculate, the facilities were top-notch, and the dining experience was truly exceptional. It's clear that your team takes great pride in maintaining the highest standards of quality and comfort for your guests.I want to extend a special thank you to the whole team for going above and beyond to make my stay truly memorable. Your dedication to excellence is truly commendable and sets a standard that other hotels should aspire to achieve.In conclusion, I want to express my gratitude for providing such a wonderful experience. My stay at your hotel exceeded all expectations, and I look forward to the opportunity.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Visited this hotel recently and had a fantastic experience! The food was delicious, the view was breathtaking, and the service was top-notch. The prices were reasonable too. Overall, a perfect stay. Highly recommend! Additionally, the ambiance was inviting, and the staff was exceptionally friendly and accommodating.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hyatt Regency Ahmedabad is a luxurious hotel that offers a truly exceptional experience to its guests. From the moment you step into the grand lobby, you are greeted with warm hospitality and impeccable service. The hotel's contemporary design is complemented by elegant furnishings, creating a sophisticated and inviting ambiance throughout.\n\nThe rooms at Hyatt Regency Ahmedabad are spacious, well-appointed, and exude comfort and style. Whether you choose a standard room or a suite, you can expect modern amenities, plush bedding, and stunning views of the city skyline. The attention to detail in the room's decor and amenities truly enhances the overall stay experience.\n\nOne of the standout features of this hotel is its dining options. From fine dining at the elegant restaurant to casual bites at the café, the culinary offerings are diverse and delicious. The staff members are attentive and go above and beyond to ensure that every dining experience is memorable. Overall, Hyatt Regency Ahmedabad is a top-notch choice for travelers looking for luxury, comfort, and exceptional service in the heart of the city.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The Hyatt Regency is a luxurious hotel known for its exceptional service, elegant accommodations, and modern amenities. Guests often praise its comfortable rooms, convenient location, and exquisite dining options. However, some reviews have mentioned occasional issues with noise or maintenance. Overall, it's a highly recommended choice for travelers seeking a top-tier hotel experience.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This is a basic, luxury business hotel. Has all the amenities. Nothing super fancy or extravagant. Found the staff to be courteous and kind but I guess lacked some basic knowledge. The breakfast was great and the room view of the river was spectacular. If I come on a business trip to Ahmedabad again, I will stay here.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Shree Balaji Agora Mall",
      "rating": [
        4
      ],
      "address": [
        "Tapovan Circle, Bhat Circle, Between 200 ft, Sardar Patel Ring Rd, Motera, Ahmedabad, Gujarat 382424, India"
      ],
      "reviews": [
        {
          "text": "One of the best shopping malls in this area multiple restaurant shopping outlets available inside. Theatre is also available here . Some of the restaurants here servee 24*7 all days.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good enough but not that much great.\nHad a selfie point at its entrance, mall had various activities like arcade games, air hockey, bowling alley but overall I felt the mall is contested.\nHad much more restaurants there like every 5 metre you can find a restaurant.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The mall is having a good variety of shops and in-house a play zone and a movie theatre along with a food court.\nIt also has a reliance smart bazaar, and cafe mast hai in it's boundary.\nThere is a book stall and rides for children.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Front view is good ..\nGood parking space in basement..\nAmple amount of activities for kids..\nGame zone at 3 Rd floor with bowling as well..\nThreatre, restaurant also available..\nScary zone is also there\n\nBut this mall is not as good as it was expected..\nDoes not have good brand shops , even many of the outlets are vacant",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It is just beside my home and we are frequent visitors there for movies at s.b. multiplex to dinner date at masala county, for a picnic, for shopping, for kids rides, bumper car,horror house, 7d cinema, VR ride, and what not.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Courtyard by Marriott Ahmedabad",
      "rating": [
        4.4
      ],
      "address": [
        "Ramdev Nagar Cross Road, Satellite Rd, Satellite, Ahmedabad, Gujarat 380015, India"
      ],
      "reviews": [
        {
          "text": "The place had a pleasant ambiance and cozy vibes. I visited to celebrate my young niece's birthday at their momo cafe. It was a delightful experience; my entire family thoroughly enjoyed the evening, especially the dinner buffet. The service was excellent, and we had no complaints whatsoever. They offer other dining options as well, and based on my experience at their coffee shop, I believe they will be equally good.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Was last here 10 years ago. Still a great place to stay. The staff are very professional in their roles. Amazing service. The food was excellent quality. Even though bit dated did not matter. The accomodation and service made up for this. Thank you all for the genuine service you provided.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I have enjoyed the food over here. And It was very delicious. I enjoyed the taste of all the items. Service is also nice. Everything was very special. I have not gone through the rooms so I can't say anything about the rooms.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Lovely and beautiful ambience at first impression. Most friendly and helpful staff- Especially, reservation and  house-keeping. Room was specious, clean, luxurious and housekeeping team has decorated it nicely. Room itself was well equipped and comfortable. I was very pleased with my stay with my family. Special thanks to reservation team for helpibg to sort out the concerns  and finally my stay become memorable.\n\nJust sharing memories at marriot:\nhttps://youtu.be/kwEB3RqTxbs?feature=shared",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The Courtyard by Marriott Ahmedabad offers a delightful blend of comfort and elegance. The spacious rooms are well-appointed, providing a relaxing retreat after a day of exploration. The hotel's courteous staff ensures a warm welcome and attentive service throughout your stay. With modern amenities, a well-equipped fitness center, and delicious dining options, it caters to both business and leisure travelers. The central location adds convenience, making it a commendable choice for a stay in Ahmedabad.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "The Grand Bhagwati",
      "rating": [
        4.3
      ],
      "address": [
        "Plot No 380, NH 8C, Sarkhej - Gandhinagar Hwy, opp. Gurudwara, Bodakdev, Ahmedabad, Gujarat 380054, India"
      ],
      "reviews": [
        {
          "text": "Nice lodging  and boarding which is completely pure vegetarian, highly recommended for vegetarians.\n\nThe rooms are spacious, clean with well maintained.\n\nThe hotel also houses tow big hall which can be used as conference or convention hall for functions as well.\n\nThe breakfast which is included in fare was also tasty and well prepared. The buffet is also economically priced at 800+ taxes with multiple variety of food.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We went there for a seminar from our office. The services were awesome and most importantly the food was top notch. We were more than 250 people but they maintained quality and taste in food, even there was continuous cleaning of restrooms going on. So overall 5 stars for sanitization, food and services.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "\"An exceptional experience at The Grand Bhagwati! From the moment of arrival, everything exceeded expectations. The service was impeccable, the facilities were top-notch, and the ambiance was delightful. The staff was attentive and friendly, ensuring a comfortable stay throughout. Dining options were fantastic, offering a wide array of delectable dishes. Overall, a flawless and memorable stay that I would highly recommend to anyone seeking a luxurious and enjoyable retreat.\"",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It was nice to have dinner here.. service and food was awesome.. pasta here is likely to hve once u visit...\nThanks for good service and good food ....",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great place, great ambiance great food as well.. lift system is a bit confusing.. otherwise.. it's a great place to throw a party",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "ITC Narmada, a Luxury Collection Hotel, Ahmedabad",
      "rating": [
        4.7
      ],
      "address": [
        "Survey # 104 A, Judges Bunglow Rd, I I M, Vastrapur, Ahmedabad, Gujarat 380015, India"
      ],
      "reviews": [
        {
          "text": "My visit to ITC Narmada was absolutely incredible! I had the opportunity to go there shortly after its grand opening, and the experience was nothing short of luxurious. The hotel's ambiance is strikingly fancy and fresh, capturing the essence of modern elegance with every corner I explored.\n\nThe highlight of my visit was the lunch. It was not just a meal; it was a culinary adventure. Every dish served was a delight to the senses, beautifully presented, and bursting with flavors that left me longing for more. The chefs at ITC Narmada truly know how to turn food into art.\n\nMoreover, the attention to detail in the design and décor of the hotel added to the overall splendid experience. Everything from the lobby to the dining area was adorned with beautiful elements, making every space look picture-perfect.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Best experience, kid friendly...\nAs we had a birthday, they decorated the room with ballons and also provided cake.. Cake was very tasty. Service is incredible. Staff is polite. As we had a 1 yr baby with us. They also provided us with milk and juice according to our needs..\nRooms were very clean and hygienic..\nI would definitely visit again and also recommend it to others",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "As a virtual visitor, you'll find ITC Narmada, a Luxury Collection Hotel in Ahmedabad, to be an exquisite blend of modern luxury and traditional charm. From the moment you step into the grand lobby adorned with intricate artwork, you'll be immersed in a world of opulence.\n\nThe rooms boast elegant decor, plush furnishings, and state-of-the-art amenities, ensuring a comfortable stay. The dining options are exceptional, offering a culinary journey through local and international flavors, curated by talented chefs.\n\nThe hotel's facilities, including a rejuvenating spa, well-equipped fitness center, and sparkling pool, provide ample opportunities for relaxation and rejuvenation. The attentive staff members go above and beyond to cater to your every need, ensuring a memorable and seamless experience throughout your stay.\n\nWhether you're in Ahmedabad for business or leisure, ITC Narmada promises a luxurious retreat that exceeds expectations.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We chose ITC Narmada to celebrate our wedding anniversary and we couldn't have asked for a better experience.\nThe staff was courteous and friendly, and greeted us with smiles and warmth.\nThe hotel had a soothing and inviting aroma.\nOut of several restaurants we chose the buffet dinner at Adalaj Pavilion, which was a feast for the senses.\nWe savored the variety of cuisines like Indian, Asian, French, continental, and Gujarati, and appreciated the quality and freshness of the food.\nThe service was impeccable and responsive, and we were touched by the lovely cake for our anniversary and the cute pink raspberry mini cake for our daughter.\nThey really made us feel special and pampered. We thank ITC Narmada for making our anniversary a memorable one and we highly recommend it to anyone looking for a splendid and luxurious experience.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Absolutely incredible! I had an opportunity to visit ITC Narmada for an IPL match meet up, and the experience was luxurious. The moment you step foot in the lobby adorned with intricate artwork, you’ll be immersed in a world of opulence. The service here is impeccable, from the doorman dressed in flamboyant clothing, to the check-in process, everything is flawless. And every corner is picture perfect!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "DoubleTree by Hilton Ahmedabad",
      "rating": [
        4.5
      ],
      "address": [
        "Ambli Rd, Vikram Nagar, Ahmedabad, Gujarat 380058, India"
      ],
      "reviews": [
        {
          "text": "It is a nice new hotel.  Great security and very nice staff.  The in-room refrigerator did not work.  That was a little disappointing.  Good water pressure and temperature.  The maid service was excellent.  The bed was always made.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Visited Ahmedabad after years, was amazed to see the changes the city has gone through. One of them being all major Hotel Operators opening their hotels in Ahmedabad. it's located at a very convenient location Ambli Bopal Road, Near SH Highway.l, most of the city is easily accessible from the hotel.\n\nThe property is very well done and has all the amenities that are required by the guests. The Staff is cordial and very well behaved and they serve with a smile.\n\nThe room where i stayed was spacious... Actually quite big, the bathroom was also good and stocked with all things required. Housekeeping and Room Service was also up to the mark.\n\nThe all day restaurant WAVE where we had breakfast was also good. It had a wide variety of delicacies for us... Enjoyed it...\n\nImportant : - For guests travelling from other States can apply for a Drinking Licence for the duration of their stay and then can purchase Alcohol from their Liquor shop legally, but can be consumed only in the room.\n\nAll in all a good experience... We enjoyed our stay...",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The ambience is delightful, creating the perfect atmosphere for a relaxing time. The staff is polite and go out of their way to make you feel at home. Their dedication to building lasting relationships with guests is truly commendable. Definitely recommend for hang out and enjoying delicious food!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I enjoyed my stay at this place. Staff are very well mannered and polite. They are ready to serve guests in the best possible manner.\nAn outdoor coffee shop / sit out is good in the evening ..\nOverall I would love to visit again..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Convenient and relatively quiet location but room furnishings are relatively old and carpeting not sufficiently cleaned. Staff are slow to respond to guest requests. Room service food did not meet expectations even though it was relatively expensive. Hotel has hundreds of chirpy birds nesting along the hotel's facade and they are constantly releasing their droppings onto the side glass, which makes quite a mess.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "THE HILLOCK AHMEDABAD",
      "rating": [
        4.7
      ],
      "address": [
        "THE HILLOCK AHMEDABAD, Opp. The CBD, 200 ft, Ring Road, nr. Vaishnodevi Circle, Ahmedabad, Gujarat 382421, India"
      ],
      "reviews": [
        {
          "text": "Today our meeting had at Rayburn hall & lunch arranged at The Masala House. It’s was excellent Service and yummy food. This hotel is perfect for conferences. Ambiance was grand, seating also very comfortable during conferences. We got great support from Sales, front office, housekeeping team. We booked 10rooms for 03 nights with conference hall. Wonderful experience for all employees. Highly recommended to all corporate for conference.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great ambiance. People are warm and helpful. The restaurant service was impeccable. Quality of food served was also quite good.\nThe restaurant is quite big, with long tables. It tends to get noisy as the crowds increase. It would help if they could virtually split the restaurant space to provide some privacy, even if it means a marginal loss of seating capacity.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Wonderful experience for my family and friends. Booked for 45 people all dishes in buffet are amazing, delicious, everyone enjoyed a lot. Great hospitality by entire team. We will recommend to everyone. Our experience with hillock today becomes memorable.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It was an absolutely amazing experience of the hospitality. A great place to do events. We enjoyed a lot, they're shifted our event at Wellington hall. It's great surprise for us. Our event goes so well everyone likes food, service, ambiance. Just because of this change our ring 💍 ceremony function becomes so memorable moments. Special thanks to Jaideep, Shakun, Ahshay and entire banquet team. Highly recommended to everyone.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Amazing stay here. We've stayed for 2 days, the area in which this hotel is located is so good. Amenities are good too. And the rooms are amazing. They've also upgraded our rooms based on the availability and you would definitely the ambience. Even if you would want to have some peaceful time in the room, you could do that for the whole day.\nWe have also had the complimentary breakfast and it was yummy.\nA worth and peaceful stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Renaissance Ahmedabad Hotel",
      "rating": [
        4.4
      ],
      "address": [
        "Behind Ganesh Meridian Complex Sola Road, Sarkhej - Gandhinagar Hwy, Vishwas City 1, Sola, Ahmedabad, Gujarat 380060, India"
      ],
      "reviews": [
        {
          "text": "The Renaissance Hotel boasts an excellent location and competitive pricing, making it an appealing choice for travelers. Situated in the heart of the city, it offers convenience and accessibility to key attractions. However, the service falls short of expectations, indicating room for improvement. Staff attentiveness and efficiency require enhancement to match the caliber of the location and pricing.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Stayed here for a conference. The room is spacious enough and comfortable, the only concerned is the bathroom, it’s open and just didn’t meet my preference. The facilities and services were okay. The food was delicious and especially on the buffet lunch, met my appetite. Overall it was great experience to stay here.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Visited for brunch buffet on a Sunday. The spread wasn't very impressive as they didn't have anything for breakfast , had lunch options only. The Dessert spread was good, and had many options. The non-veg options didn't taste too fresh. Positives - Hotel Infra, Staff and Live Music.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We are regular at Renaissance restaurant i.e. at R-kitchen. They serve well curated buffets and ala carte menu.\nThe food is really good and I must not forget to appreciate their restaurant manager Mr Ashish.\nThe staff is also very humble and caring.\nWe always have a very great time having our meal there.\n\nMust visit Restaurant",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I had 10 day stay here and I wasn't disappointed. The room was quite and clean . The food was good with some good variety . I especially liked how the staff were friendly and acted quickly if I needed anything. I especially commend the housekeeping team Zakir & Megha these two really have made it seamless for me. The front office team is also amazing and really mind their guests.i would definitely recommend the hotel if you are in the city for a while . An easy 9.0/10 for me",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Crowne Plaza Ahmedabad City Centre",
      "rating": [
        4.5
      ],
      "address": [
        "Sarkhej - Gandhinagar Hwy, near Shapath V, Prahlad Nagar, Ahmedabad, Gujarat 380015, India"
      ],
      "reviews": [
        {
          "text": "Crown plaza is a good luxurious banquet hall. We had annual function there. We took dinner there. We danced there. We had great evening there. Ground floor decoration was really good. I had great experience there. I stay in same city but rarely I go to this kind of costly banquet hall. Anyway if you have good money or someone is organizing party don't miss to go there.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent\nOur experience hosting a business event at Crowne plaza Ahmedabad  was simply outstanding. Abdul and his  team delivered flawless support, ensuring smooth operations at every turn. The venue offered was clean with  modern amenities and attentive service, contributing to a highly successful and enjoyable occasion. I enthusiastically recommend it for any future events",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Our stay and overall service was good. There was one person - Vijay(pool supervisor), he made sure that we had everything we need for Jacuzzi, sauna and steam room. Extremely polite and helpful. Great service. Happy customer!!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I attended an event held at its luxurious banquet hall. Ground floor decoration was really good. I had great experience there and enjoyed the buffet post event very much. You are looking for hosting a grand event, I would recommend crown plaza.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Special thanks to Ganesh from house keeping, who kept our rooms so clean n tidy. Always smiling, humble and helpful. Thank you for all help and looking after us. Almost felt like home.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    }
  ]
}