{
  "places_with_reviews": [
    {
      "name": "Hotel Chatkara",
      "rating": [
        3.6
      ],
      "address": [
        "Bhagalpur, Korha, Bihar 812002, India"
      ],
      "reviews": [
        {
          "text": "Hotel  offers a delightful and memorable hospitality experience. From the moment you step into the elegantly designed lobby, you are greeted with warmth and efficiency by the attentive staff. The hotel's attention to detail is evident in every aspect, from the stylish decor to the well-appointed rooms that provide a comfortable and luxurious retreat.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Ya it was\nNice dormitory to spend a night basically for Exam purpose.\nIt was a very reasonable price .\nNear Bhagalpur Zero mile.\nAll basic necessities are available there.\nLots of options for Food and Tea.\nIt's a great help for Students who appear for Online Exams at Bhagalpur Online centre",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Average place to stay there",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "🫰",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Best for value of money",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Ashoka Grand",
      "rating": [
        3.8
      ],
      "address": [
        "Patel Babu Road, Bhikhanpur, Bhagalpur, Bihar 812002, India"
      ],
      "reviews": [
        {
          "text": "I had a great experience. I arrived at the hotel the day after my booking day due to train delay. I requested them to give me room for 1-2 hours to just freshen up. They had no need to help me at all as my arrival was after the checkout time of my booked day. But, the receptionist and the management was so kind that they accepted my request, and were sweeter to keep my bags when I was out for work.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The room was really clean and very spacious. The WiFi was good and the staff very friendly. Hot water was working in the bathroom and you also have a kettle. I didn't go to the breakfast. The bad point is that it was really noisy, the road was always crowded. And it is really expensive for India, I stayed in places as good as this one for 3 times less this price.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I booked this hotel for ring ceremony and the services they provided were pathetic.. They promised a lot and did nothing.. First of all there were scarcity of hotel staff. They served cold food to the people. There were not enough staff to handle the gathering of 100 people.. And the taste of the food was below poor.. Please anyone don't book this hotel for any purpose they will just loot your hard earned money and you will regret later... Take this as a warning.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very Poor Service\n3rd Class Dharmsala\nThis is not a hotel, this is old type of dharmsala. Food quality is very poor. Sometimes they served food from outside. Milk tea is not available in the kitchen.\nStaff behaviour is totally unprofessional. They just hired normal guys with high attitude. Hotel management is also having this type of unprofessional behaviour.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice hotel with quite good rooms. Food available at a reasonable price. Service is a bit late but the staffs are quite friendly.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Vaibhav",
      "rating": [
        4.1
      ],
      "address": [
        "Kachari Chowk, MG Rd, near Indian Oil Petrol Pump, Bhikhanpur, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "have not stayed in the room so not sure how the rooms are but have visited their restaurant many times and can say it's quite good. Food taste is good, service is also prompt and fast.\nI think Vaibhav has one of the biggest dining hall in the city. so you almost never need any reservation before visiting the restaurant.\nPrice is on higher side. meal for 4 usually costs around 3K per visit, but As taste, ambiance and service is good, it justifies.\nA few bad experiences with the restaurant are occasional bad taste and once I got chicken slices in my veg pasta, that too when Navratre was being celebrated. most of the non veg eater don't eat non veg this period and I am pure vegetarian.\nShocked? even I was.  But it had happen with me many times in different restaurants around the world.So I didn't cared much about. But I felt bad when they even charged me for the pasta.\nAt least as a gesture of sorry they shouldn't charge for it.\nrest every is good with the restaurant and despite a few more minor bad experiences with the restaurant. I and my family usually prefer to be there for outings.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The service at the hotel restaurant was terrible, and the person at the reception was incredibly rude. It felt like they didn't care about the time or our experience at all. Yar hotel khola hai ya chutiyo ka foj ekattha kiya hai.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel Vaibhav is a great choice for travellers looking for a 3 star star hotel in Bhagalpur. This Hotel stands out as one of the highly recommended hotel in Bhagalpur. Hotel is rated 3.4 out of 5, which is considered as very good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The room was unhygienic, full of mosquitos, so could not sleep in night. The noisy AC was another reason of disturbance. Rooms are very old. The staff behavior is kind of unprofessional and immature type. Receptionist tried to be over-smart. Over all does not meet expectation.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Located at heart of Bhagalpur. Delicious food is served. Enjoy roof top dinner with beautiful scenery.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Max Inn",
      "rating": [
        4
      ],
      "address": [
        "R.N Tower, Sahay Road, RBSS Rd, Bhikhanpur, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "The hotel is decent at the price and service is good. It's in a calm neighborhood so good for a peaceful stay for business trips. It's close to the airport and railway junction. The food is also quite good in terms of quality and quantity. Liked it!!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The hotel property is good.\nBut in providing service point of view not so well.\nThey try to manipulate you in their own words.\nSo think twice before choosing this hotel.\nReally disappointing experience I have.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms are good but lacking the cleaness.The Service is very poor.The reception is not prompt.They usually takes a full day to resolve a simple issue.Never try to pick the call.Food quality is good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Despite my prior & confirm booking they kept me waiting till 10:00 pm for a room. Because they were busy to provide room to some of their favourite people.\nNo TV, No Phone nothing was working.\nThe mattress and blanket were totally dirty.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I visited this hotel .\nThe quality of the food was the worst.\nI visited with my family on 25th October at 10 pm and the next morning each of us were suffering from food poisoning.\nThe price was too high to fit the quality of the food. Street food is better than this hotel. If you want to stay healthy, then stay away from this hotel.\nThe hotel should be inspected by authorities. Who's gonna pay for the treatment of my family?\nPlease work on this.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Chinmaye Inn",
      "rating": [
        4.1
      ],
      "address": [
        "7X4W+H5J, Rai Bahadur Sukhraj Rai Rd, Katahalbari, Khanjarpur, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "Hi, I have stayed in this hotel and took banquets for corporate event. As per me if you are planning to stay in this hotel please keep yourself away otherwise you may face many hazards likewise, it’s a OYO kind of hotel -so you can understand, they won’t have any commitment, they won’t believe in relation, they don’t understand gst or tds deduction, they don’t have basic manner how to treat client.\nEven food is not hygiene- my friend fall in food poison after having food here.\n\nF&B manager and reception manager always do bad behave and they forget everything after pay commitment and ask for extra money.\n\nSo, plz keep away from this hotel.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The food and the aesthetic vibe of the restaurant was pretty good. Mr Govind and Mr Anand were really helpful and provided us with good recommendations for the food available.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I will rate this hotel 5 out of 5 star best thing is about staff is very cooperative and helpfull and one of the best manager abhishek who helped me alot thanks to him for his best service and the food was really delicious and fresh yumm too.. I will recommend everyone to visit this hotel once it will be memorable for you.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Place was super cool with beautiful ambience and food was mouth watering.\nSpecial thanks to Mr Govind Kumar, captain and Mr Ram Vilas, steward for their gesture and excellent customer service.\nThumbs up 👍",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good service and staff members were so cheerful and well maintained and the food was delicious and amazing in taste overall everything was good and great and environment was clean and the food was",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Rajhans",
      "rating": [
        3.9
      ],
      "address": [
        "Kachari Chowk, MG Rd, Adampur, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "Bhagalpur does not have too many options. But Hotel Rajhans International was quite a good experience. Proximity to the main road exposes the personal cars to a lot of dust, but the concierge service promptly appointed cleaners for the same. Very helpful staff gave regular reminders for morning breakfast.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I stayed here for my friends wedding and I had a great time.\nRooms are nice and spacious with ample natural light.\nAc +\nFan +\nGeyser +\nStorage space +\nTv +\nRoom service +\nElectric kettle with tea/coffee sachets +\nBasic toiletries provided.\nParking +\nPlus it has an in-house Beauty parlour, restaurant, ice and spice, conference room, banquet hall etc.\n1 minute walk to the main road.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very poor service. They cheat you by giving full portion of food when half is available. Bathrooms are extremely filthy. Taps do not work and are jammed. The furniture in the room are all eroded. Overall very substandard place. Don’t go there.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Don't go here (saloon) Too much High charges in Men's saloon & even not giving service Good. Even in Saving blades not changed. When asked they misbehave.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "V.good hotel have its own men and women hair salon and parlor,ice cream parlor,etc.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Vidya Residency Sarai Chowk Bhagalpur",
      "rating": [
        4.3
      ],
      "address": [
        "Sarai Chowk, Golaghat, Old City, Bhagalpur, Bihar 812007, India"
      ],
      "reviews": [
        {
          "text": "Never been to their rooms as I am a local and have visited their restaurant only. So consider my review is for restaurant\nRestaurant has two sections, one is open air section and another is covered air conditioned. Both are good place to sit and enjoy quality time with your family. Unfortunately being a roof top restaurant one can expect good views but unfortunately nothing remarkable can be seen from here.\nAmbiance is good overall and service staff is attentive. Unfortunately cleaning is the section where the restaurant lacks a bit.\none of the costliest restaurants in the city, so be ready to pay big money.\nBig price can be accepted if food is good. But now a day’s food is not as good as it used to be. Still one of the best food served in city.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Below is my input after staying at this property.... I hope it will help someone to decide on right hotels in Bhagalpur.\n\n1. My booking was including Breakfast, but they deducted the amount. This was unfairly done. Commitment to customer should be on top priority.\n2. They will make you wait after you checked out and paid the amount. You will not be allowed to go till they done with their investigation inside room. Look like they consider every customer as a thief or something??  This behavior is not good at all by this hotel.\n3. No hot water.\n4. Power outage.\n5. Wifi will stop working after sometime.\n6. Bathroom was not neat and clean.\n\nStill I gave 2 star for look and feel. Apart from this I would not recommend this hotel to anyone, especially couple and family.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We stayed two nights here and the stay was comfortable. The hotel staff is superb and they went above and beyond to make us comfortable. There was an issue with hot water in the bathroom but the staff provided us with water in a bucket for shower. Overall it was a good stay and I will recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It's splendid place for any type of occasion, along quality of service and delicious food. Awsome stay will be memorable. With all room amenities.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Worst hotel to stay ever! Staff is so unprofessional! There was no hot water in this hotel..I went down to complaint to reception that there is no hot water but they were not paying any attention to it.. Horrible service. Don't ever stay at this hotel.This hotel people at reception are extremely rude. Their manager Subhash kumar srivastav doesn't know how to talk to customers and he thinks and when I told him on call that there is no hot water in room he was shouting on call. Worst hotel ever . They also turn off the Lights at night. It's a request don't ever stay at this pathetic hotel.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Bhawna International",
      "rating": [
        3.8
      ],
      "address": [
        "MG Road, near Head Post Office, Adampur, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "Building is well mentioned, established at busy and main route of bhagalpur. price comparatively high but one of best hotel of Bhagalpur.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Don’t ever book the hotel for any kind of event like marriage, engagement since the Manager Chauhan is really the fraud person\nMy engagement was there on 31st March they charged me per plate and the item which where mentioned in the menu wasn’t provided on the event day even the manager Chauhan said while booking that we provide 2 complementary ac room on the event day and then on the event day he denied for the same\nThese guys make fool and think that they are the boss of Bhagalpur no one can do anything with them\nI would suggest never to go to that place since the manager itself is Fraud",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Best hotel for stay in bhagalpur",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "My first experience is very good 😊",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice service and air conditional room free parking available here\n\nThanks",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO Hotel Eleven",
      "rating": [
        2.7
      ],
      "address": [
        "NH33, Sakhichand Katra, Bhikhanpur, Bhagalpur, Bihar 812002, India"
      ],
      "reviews": [
        {
          "text": "Everything is very worse, when I had gone to checked up for room with my partner 👬 then he used a very bad words for us they don't respect theirs customer, if you come here to read reviews then I'm telling you truth buddy please don't stay here they won't respect you and they will not good behave with you , please oyo team don't preferre this type of hotel who don't know how to behave with customer, and cancel there license because they behave with us very worse and they also behave like criminal I feel very insecure. please if you wanna go this hotel then you had better to go out another hotel expect this. 🙏",
          "languageCode": "en",
          "rating": [
            2.7
          ]
        },
        {
          "text": "The room is bad and dirty and the staff does not provide a good room and also takes extra money 200 or 250.",
          "languageCode": "en",
          "rating": [
            2.7
          ]
        },
        {
          "text": "Very close to bus station... Bhagalpur\nReceptionist charge extra money!!! I pay 1700rs only for 9H😑",
          "languageCode": "en",
          "rating": [
            2.7
          ]
        },
        {
          "text": "I booked through booking.com , upon reaching there the manager played trick with me he asked me to cancle the room from booking.com and give money ₹1150 to me directly, the room provided was very dirty even cloth hanger was not there, washroom was of smallest size i have ever seen. the manager told me that the owner (who is a dentist) practice on the same building is persuade the manager to play trick with the guest as most of the guest are couples(as per manager)\n\nStay in this hotel only if no other option is there, and yes Not at all recommend for family.",
          "languageCode": "en",
          "rating": [
            2.7
          ]
        },
        {
          "text": "Hotel is very poor condition\nCriminal types of staff\nAlways issue of electricity\nAlways extra money charges\nDifferent types of ladies are coming always\nLook like a sex workers\nI have no words to type of reviews\nSo please don't book this stupid types of hotel",
          "languageCode": "en",
          "rating": [
            2.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Galaxy 16",
      "rating": [
        3.9
      ],
      "address": [
        "Behind Hanuman Mandir, S.M. College Road Choti Khanjarpur, Chowk, Bhagalpur, Bihar 812001, India"
      ],
      "reviews": [
        {
          "text": "The hotel is well managed and also neat and clean, elevator is also available,staff are supportive and very polite,room service is just wow,and the hotel is situated in a very good location,hotel offers you a food service also,also you can book it for family function.Overall good experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "My experience at Hotel Galaxy 16 in Bhagalpur for the Birthday event was very disappointing. The unprofessional behavior of the hotel manager and the overall poor services were notable drawbacks. To make matters worse, several items promised in the menu, including the soup, were not provided. I recommend potential customers to explore other available options for a more satisfying dining experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Had a small function there.. great ambiance.. amazing service at affordable price...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice hotel, Spacious hotel, co-operative staffs, all facilities available here",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The rooms are spacious and clean without any view as such...\n\nThe bathroom was clean but the hot water flow was very slow...\n\nThe linen were clean and AC was working fine...\n\nThey have an inhouse restaurant and the food quality is good...\n\nThey don't have any car parking attached with the hotel, its around 50 mtrs away...\n\nOverall a good stay... recommended.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}