{
  "places_with_reviews": [
    {
      "name": "AMRIT HOTEL",
      "rating": [
        4.2
      ],
      "address": [
        "SURVEY NO 788, NR OVER BRIDGE AHMEDABAD - MEHSANA HIGHWAY, GJ SH 41, Chhatral, Ola, Gujarat 382729, India"
      ],
      "reviews": [
        {
          "text": "Good place to stop for food. Good and fast service and what's most important is that the food is really tasty! We ordered Dosa and Chinese Manchurian noodles and we loved it!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Had a great experience of having meal here. They have provided quickest service. Very nice hotel.\nMust visit with family for having delicious meal. Nice staff.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This hotel is so amazing. The waiteress were welcoming and kind. The room was super clean and comfy. The hotel is so luxurious and affordable. The food taste so delicious. The chicken so tender and tasty. I highly reccomend visiting❤️❤️",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice food. Specially Makke di roti Sarso da sag. Food quality is great. But need improvement in plates and seats. Service also good.\nNice picture point with scuter and bullock cart.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had a nice experience of  having dinner at Amrit hotel and I will recommend to hotel management that they must  have to concentrate on their staff for fast services without making the customer dissatisfied with waiting.\n\nOver-all food quality was good.👍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Embassy Kalol - Best Hotel, Budget Hotels, Family Hotels",
      "rating": [
        4.6
      ],
      "address": [
        "Mahendra Mill Rd, near JP Gate, G.I.D.C. Estate, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "On of the best Hotels I have been in a while, great room service, kind staffs, and clean rooms. I would love the recommend this to everyone.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Best hotel in kalol with professional behaviour from staff and they helped us in whatever we needed.\n\nThis hotel budget is good .very good environment .\n\nHotel staff is also good but one problem is winter time bcoz hot water is not early .after 7 o 'clock hot water is ready...",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Overall, a really good hotel. Nice room, comfy bed. Good location, friendly staff on the desk.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice rooms with good hygiene.\nStaffs are cooperative and services are best.\nAffordable prices.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Niche place for being relaxed,I budget this hotel water filter condition are very nice 🙂 nice",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Planet",
      "rating": [
        4.1
      ],
      "address": [
        "Babasaheb Ambedkar 3 Rasta, Opp. S.T. Workshop, N.H. No. 8, Dist. Gandhinagar, G.I.D.C. Estate, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "The sleek design and modern amenities cater to both business and leisure travelers. With top-notch dining options and attentive service, it's a standout choice for urban explorers.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel Planet is one of the most popular, comfortable and convenient hotel of Kalol, Gandhinagar, North Gujarat. All the staff and attendants of hotel is courteous, responsive and very cooperative. This Hotel is quite peaceful and well maintained. All facilities and services required for a comfortable stay is available here. Room Service is available for breakfast, lunch and dinner, however dining facility is also available in the restaurant at ground floor.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I absolutely love this hotel! Every time I stay here, I am consistently impressed by the exceptional service and wonderful amenities. The staff is incredibly friendly and attentive, making me feel welcomed and valued throughout my stay. The rooms are comfortable and beautifully designed, providing a perfect blend of relaxation and luxury. The attention to detail in every aspect, from the exquisite decor to the delectable dining options, is truly remarkable",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent place for vacation with family . Good connectivity . Nice atmosphere . Price awesome",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel planet is one of the most popular comerbatbel and convenient hotel kalol are nice ☺️",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Parivar Kalol",
      "rating": [
        4.1
      ],
      "address": [
        "Hotel Parivar, Mahendra Mill Rd, near I d f c Bank, near J p Gate, G.I.D.C. Estate, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "Room is Very Clean, But Some machine noise inside, I called 3 times on Reception but not received call, Bathroom tap is leaking",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Labour living here and laughing and gossiping loudly at night and early in the morning",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Hotel is fine... actually it's new and still some work is pending so Lil Messy but overall is fine... cleaning is not good..staff is good but still need to work on cleaning and room service",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Not clean rooms and toilets showers are un repaired",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good experience. Good services and great room. Really very nice place to stay for Industrial visitors, Buisness Trip , Short and long time stay and cleaning staff Is also good , Good behaviour with the customer.\nIf you are looking for stay in kalol must go to hotel parivar.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Ananya",
      "rating": [
        4.1
      ],
      "address": [
        "Third & Fourth Floor, Kamla Amrut Complex, opp. Railway station, Navjivan Mill Compound, Memon Market, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "Extremely unprofessional and rude staff behaviour. Owner is good.\nUnreliable if you plan your stay . They can refuse to honour\nyour advance booking",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Room service in Hotel Ananya is very good but food doesn't taste good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "This hotel is the best hotel in Kalol, considering the price they charge for 1 days of stay.\n- Connectivity is best (in front of Kalol Railway Station)\n- Staff is well behaved and cooperative.\n- Food is Good\n- Rooms are clean\n\nI will definitely suggest Hotel Ananya for the stay in Kalol.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "A decent place to stay. We took a night halt here ,as we had a follow on journey the next day... Food was absolutely fantastic....no issues with parking.. completely safe..... courteous staff...",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good clean hotel and good staff with very friendly owner. Will keep on booking this place whenever need arises.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Silver Inn",
      "rating": [
        3.9
      ],
      "address": [
        "4th Floor Shukan Avenue Opp.Sindbad Hotel Ahmedabad Mehsana Highway NH.No 8, Kalol, Gandinagar, Pratap Pura Village, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "Location is good , but housekeeping is very bad, no washroom cleaning&  rent are too much according room service",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's an Oyo hotel for couple so it's only for couple it's to romantic you can spend a night their...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "clean rooms,  on the highway itself, hot water was available, since it was in the mall,  we were able to order dinner from a restaurant in the mall, poha was served for the breakfast, which wasn't so good in taste. over all value for money.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good Location place in the city near mall&Highway.Good services provided them hard workers&Hotel staff......\nNice staying place in city",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Ok",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Cobra Hotel Inn",
      "rating": [
        3.7
      ],
      "address": [
        "2, GJ SH 41, Saraswati Society, Ambika Nagar, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "Under renovation so quite rooms are not clean, no sign board available for hotels but very good location near by Ambica bus stand",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "standard room very dirty, I will filling bed stay ,very bed hotel in Gujrat ,bed sit very old and darty,choice is very dirty,,?\nThis place looks terrible and the beds were dirty, but we managed to get someone change the sheets. They're not used to foreigners. It took a couple of hours to check in. Check that the shower in your room is working.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Because of my opposite side college garden",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Reasonable price , good location",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The room is not clean.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Primeland",
      "rating": [
        4.2
      ],
      "address": [
        "4, Mahendra Mill Rd, Industrial Area, Kalol, Gujarat 382725, India"
      ],
      "reviews": [
        {
          "text": "Good hotel in affordable price.good staff, clean room, clean bathroom",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very bad smell in the room and bathroom, no response and resolution provided.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice Hotel, Rooms are also good. Very Polite & Helpful Staff.\n\nMuch recommended for stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Best hotel.   Best room    space.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel is good but rooms are too small but yes A.C also available so its good",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Panchvati Area, kalol",
      "rating": [
        3.8
      ],
      "address": [
        "Sudarsan chowk, Borisana Village, Borishana, Kalol, Gujarat 382725, India"
      ],
      "reviews": [
        {
          "text": "Beautiful Calm Area.\nWith all types of facilities.\nLike Hospital, Bakery, Temples, etc\nPanchvati Area is like Heart of Kalol.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "@nails_by_janvi__\nSee the beautiful perfect art of nails",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Royal Hill",
      "rating": [
        4
      ],
      "address": [
        "Pratap Pura Village, Kalol, Gujarat 382721, India"
      ],
      "reviews": [
        {
          "text": "Best hotel in Kalol with AC rooms. Very cooperative staff . On main highway road in Kalol so location is good .food services are also best with many food varieties available on the ground floor like pizza , Gujarati,Panjabi,snakes,icecream,pastry,vadapao,.tea etc",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice hotel in Kalol.AC hotel. Cooperative staff . On main highway road.many food option available on the ground floor like pizza , Gujarati,Panjabi,snakes,icecream,pestry,vadapoun,.tea etc",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "One of the best experiences of my life. Everything was as per expectation. Excellent food , nice place to have with family .",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "This restaurant and hotel very nice and room AC are all members helpful so visit again this hotel",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Situated in the heart of the city,  Hotel Royal Hill offers a perfect blend of convenience and comfort.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}