{
  "places_with_reviews": [
    {
      "name": "The Royal Oak",
      "rating": [
        3.9
      ],
      "address": [
        "Bunder Rd, Near Bus Station, Belalkanda, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "The hotel is okay, food is good stayed here with family on a trip to Murudeshwar which is about 15 minutes away from the hotel.\nOverall experience was just okay, although I felt it was a bit pricey for what is being offered\nCleanliness & presentation of room could be improved.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Horrible Food. Rooms are claustrophobic. Charging so high for food yet u cannot eat the food cause it's highly salty. Both vegetarian and non-vegetarian food are horrible. Better to have food from outside. Landline phone is broken. Reception is not responding even after two hours of multiple inquiry. Just horrible. U will get much better hotel at half the price at Murudeshwar.  Even the glasses were broken and the hotel didn't care to replace them. Charging ₹35.00 for local brand water. Just hopeless.\n\nJust check in at some other hotel.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Worst rooms, there are ants everywhere and only remedy they said is will spray Hit. That too when there are kids, old people and want to us to inhale the strong smell entire night. The rooms they provided are not even worth a penny. There is no room maintenance and no quick response from the staff. We checked in at 4:30pm and went out around 5pm by the time we came back room was filled with the ants.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The hotel is OK. Felt it is overpriced for the services they offers Unfortunately there are less options presently in bhatkal. Location is very near to the highway that is only advantage.The veg hotel at ground floor felt unhygienic  as house flies were there.Also food taste was average.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I booked deluxe room. It was a 16X8 feet room with 7X2.5 feet washroom. Worst of all nightmare is NO VENTILATION. Not even in washroom. What kind of hotel is this? I would recommend elderly people and couple with kids to be very cautious as this might be suffocating. I cancelled and vacated the 2nd day and moved to elsewhere. These people in the reception was not even courteous to change the comforter after repeatedly asking. It is 13kms away from Murudeshwar temple and this is a best fit if you are checking in at 7pm and next morning visit temple come back and check out. This is not a place to stay like other hotels. Useless to pay so much of amount for that hotel.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "HOTEL KOLA PARADISE",
      "rating": [
        3.6
      ],
      "address": [
        "Belalkanda, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "**Title: Avoid Hotel Kola Paradise in Bhatkal - Terrible Room Service and Staff Behavior**\n\nI regret to say that my experience at Hotel Kola Paradise in Bhatkal was nothing short of a nightmare. From the moment I arrived, it was evident that this establishment lacked even the most basic standards of hospitality.\n\nLet's start with the room service, or should I say lack thereof. Upon entering my room, I was greeted by a strong odor of stale air and mustiness. The linens looked like they hadn't been changed in weeks, and the bathroom was in dire need of a deep clean. Despite multiple requests, the housekeeping staff failed to address these issues, leaving me to endure an uncomfortable stay.\n\nBut what truly set this experience apart was the abysmal behavior of the staff. From the front desk to the restaurant, their attitude was consistently rude and unprofessional. It seemed as though they couldn't care less about the guests' comfort or satisfaction. When I raised concerns about the room cleanliness, I was met with dismissive responses and outright hostility.\n\nFurthermore, the overall maintenance of the hotel left much to be desired. Common areas were poorly lit and unkempt, giving off a vibe of neglect. It was clear that management had no interest in maintaining a welcoming environment for guests.\n\nIn terms of amenities, there was little to no effort made to enhance the guest experience. The Wi-Fi was unreliable at best, and the dining options were limited and overpriced. It felt like every aspect of my stay was designed to disappoint.\n\nIn conclusion, I would strongly advise against staying at Hotel Kola Paradise in Bhatkal. The combination of terrible room service and staff behavior makes it a wholly unpleasant place to spend any amount of time. Save yourself the hassle and look elsewhere for accommodation in the area.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "MakeMy Trip … Hotel room is toooo dirty , Service Staff is toooo arrogant & non responsive, Toilet/ Washrooms are poor , Price is comparatively tooooo much high. Never think to stay in this Kola Paradise, No  proper Hotel Parking for Four Wheeler, Nothing for drivers arrangement.\nNegative Rating to this Hotel.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I don't recommend this place\nNot hygiene no good pillows or bedspread\nWill get better rooms with this price",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "The location is central, but the rooms are extremely dirty. No water for drinking(which is basic when you book a hotel) no toiletries, no towels. The linens were dirty. They also didn’t have extra linens to replace.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Worst stay ever !! I was excited seeing the swimming pool as an amenity, arriving hotel it's worst that there's no pool and bad smell round the hotel highly not recommended and the hotel is very much overhyped to its price.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Ameena Palace",
      "rating": [
        4.6
      ],
      "address": [
        "NH-66, SH 50, Nawayath Colony, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "Great Stay.\nRooms are good and clean. Pricing is vfm. Definitely recommended for stay.\nComplementary BFs if available will make this  stay much better",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Quiet a decent place,.but rates are as costly as a Tier 1 4 star hotel.\n\nRooms are clean and we'll maintained. They don't have a restaurant attached.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Hotel Ameena Palace rooms amenities were very Hygieneic and highly satisfying.Mr Nagaraj receptionist found to be very friendly and polite.Location is also good and have good restaurants nearby.Highly recommended those who are visiting Murdeswer.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Hotel is super..well maintained.\none thing irritates me that the hotel security person asking money for everything. that irritates a lot",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice, clean rooms & bathrooms. I have stayed here twice in 2 months. I loved the ambience of both the rooms I stayed in so far. The crew is pretty good & professional so far. Hope this good service continues for a long time\n\nOne improvement is to make sure the shower is in best condition",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "AL MANAL HOTEL",
      "rating": [
        4.8
      ],
      "address": [
        "Qamri tower, Shamsuddin Cir, Devinagar, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "\"Absolutely stellar experience at the service apartment! Impeccably clean, modern amenities, and seamless service. From check-in to check-out, every detail was thoughtfully managed. Highly recommend for anyone seeking comfort and convenience.\"\n\nAmmar, the owner went above and beyond to ensure our stay was perfect. He even graciously allowed us to stay for a couple of extra hours.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent apartments,  well maintained and included all required facilities for a family stay. Loved the interiors and friendly owner and helpful care takers also reasonable price.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent service apartment. Very neat and clean. Felt like at home. The owner is a kind person, and provided the required extra beds, pillows.  The staff is very responsive and courteous.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very good and clean rooms with AC\nFriendly ownership\nOwner will give all suggestions about all the places.\nService also good.\nEvery will like once they come here.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Good hospitality, supportive staff, we had a great time. Food was great and price was very reasonable. Will definitely recommend this to everyone. All facilities were provided - extra beds, utensils, tea powder, soaps, towels, etc.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Chaya Residency",
      "rating": [
        3.5
      ],
      "address": [
        "Shamsuddin Cir, Belalkanda, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "It's not clean. Night time full of mosquitos and not ventilated rooms and bathroom has not cleaned totally it's not good residency",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Rooms were osum. People in middle class will definitely like it a loot. Room service is also very good...for food below the lodge there an hotel where we get very good tasty foods. People can go to murudeshwar easily as there will  be frequent going many vans for fare just 20rps. Overall it's the best stay.i definitely recommend this hotel. People are very helpful.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very sub-standard hotel with below average staff. Hotel amenities are completely misrepresented on Oyo app. There is nothing here for a family. Just a bunch of smoking and drinking lot who are trying to make some money by running a hotel and listing it on Oyo.\n\nI am equally surprised on how Oyo let this hotel be listed on their site. Everything was broken when we got here. Had to inspect all rooms and choose whatever was the best amongst huge dissent and unruly behaviour by hotel owner and staff.\n\nAvoid this place even if it takes you to travel further for better options.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Good and neet rooms. We just contacted and they did respond and provide us a sharing room. I was happy with the level of service provided. No other openiyan about the same. I'm pretty much impressed. Recomanded for people travelling around this place to visit if your looking to take a room near by.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "located on a crowded place so might be hard to find parking. no lift, rooms just ok ad just clean. manager is great, but the submanager dont understand nonkannada language. the location looks unsafe.\ncan find veg and nonveg nearby. other nearby hotels are farce",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Nilawar Palace Lodge",
      "rating": [
        3.4
      ],
      "address": [
        "Bus Station, opposite to KSRTC Ticket Booking Centre, Belalkanda, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "Room  is good but Owner not follow his word ,on call whatever he told about charges he not follow it starting his manager told different charges for one and half day by counting hours but finally he is not agree think about charges he told and charges he demanding",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Drinking water not available,rooms not hygenic,Overall. Condition is not good",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "I stayed here for 1 day. Here manager Mr. Shakeeb is very polite and helpful person\nRecommended\nThanks",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "This place doesn't fit for family as well as human being because this is \"The worst place\" l ever stay for 1 night.\nNot bathroom and toilet is full of cigarette and hair they clean this place better you can stay in any other hotel not this.\nFinally this place is so stinky.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Firstly .. most of these hotels who claim themselves to be 3 star hotels, go checkout the requirements of being a 3 star hotel.. don’t simply trap people in your money making business.. from what I experienced with this lodge.. we went to check the rooms before booking because I was sure i don’t want to get into anything Thats given online and was obviously mot shocked or surprised when he showed us his non ac room which was not at all good or qualified for a 3 star hotel room.. it was the most basic room with three beds like we see in a hostel room but this was more dull and had s bathroom in it and a lot of mosquitoes around and the overall vibe of the placevwas very off and not clean or family like.. we were in a tough situation since it was night and we were exhausted from travel so we thought wed adjust for a night until this mam had the audacity to tell us the price .. he said itd be 2700 for this room with no ac no proper maintenance or hygiene, with god knows what other trouble.. and I can assure you it wasn’t worth the price he mentioned.. he basically wanted to just make money seeing a small kid and tired people.. because what other option do we have.. so yeah thats how it was for us.. and worry not .. there are better hotels in bhatkal that dont cheat you in the name of 3 stars.. so we went there and not to this hotel .. we just left after that little price chat!\nSo yeah a big  no. No from me !",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "ZAIN LODGE",
      "rating": [
        4.7
      ],
      "address": [
        "Zain Lodge, Zain Complex, N.H.66 Bhatkal, Edapally - Panvel Highway, Devinagar, Rangikatte, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "Good experience with best air condition room, very much comfortable and relax.\nI enjoyed the time,\nThe service after long day traveling or walking city sightseeing was great",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great Location and safe\nAffordable price\nStaff is cooperative and courteous\nRooms are comfortable\nNot hi-fi  but well cleaned and maintained",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Hotel is decent for families and bachelor's\nWhile initially believe to be not worthy, but the service and cleanliness was best,\nGood experience to stay here, peaceful",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Decent lodge with soothing ambience and utter quietness relax and comfortable stay rooms are clean and neat\nPrice are affordable\nServices are extremely great\nStaff manners are good",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "A beautiful hotels staff very nice and friendly extremely excellent customer service ,really like the place,rooms bathroom over all pleasant atmosphere,100% recommend by me",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Mango Grove",
      "rating": [
        4.1
      ],
      "address": [
        "2G6Q+P4V, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "Where's grove or resort. Place is fit for mini event friends party only. No.amenities at all",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best pool & function hall",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "This was huge resort but now it is divided. The place I was had big hall and outside place with sheet on it. It was really hot. And the place for cooking had smoke coming into hall and burning my eye. It has food parking place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Beautiful place...big swimming pool is available..nice views ...full of mango trees ...... spacious home with interior decoration...fit for engagement and wedding parties",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Its not resort ir grove its a marriage hall",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "zam zam guest house jali bhatkal",
      "rating": [
        5
      ],
      "address": [
        "Karnataka Bhatkal, Jali, Jalikodi, Town, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "It's good place for picnic along with family or friends comfortable",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Family entertainment places.full Fun & enjoy moment of the place",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Come to shop and visit it is centre of Mysore",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "It's  beautiful place to picnic with family",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Kola Paradise Restaurant",
      "rating": [
        4.5
      ],
      "address": [
        "Kola paradise building, Belalkanda, Bhatkal, Karnataka 581320, India"
      ],
      "reviews": [
        {
          "text": "Best fish meals in bhatkal starting from Just Rs.60. Loved the meal.  A must visit place for budget meals",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Food was very affordable and tasty, we spent around 400 for a family of 4 person, recommended if you are foodie",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "What taste I was literally shocked to have such a good hotel at this rate .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Cheap and best fish meal in Bhatkal . Near Ksrtc bus stand",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Best fish meal and affordable prices and quality food",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    }
  ]
}