{
  "places_with_reviews": [
    {
      "name": "Bhagirathi inn",
      "rating": [
        3.8
      ],
      "address": [
        "W547+MG6 Land Mark - Bhagirathi Inn, Ghodaghat chowk, Mahabir Pada, Mandar Bagicha Para, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Hotel price is right but room maintenance is not good. Somewhere TV is off, phone is off, switch buttons are not working. Eating and drinking from outside is prohibited He has his own bar, hence he keeps the outside closed and doubles the rate of drinks in his bar. It's loot, nothing else, look carefully and talk to us before taking us to the hotel",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The trip was for business purpose and it was Worth for money. The\nroom was nice and the interior of the room waswell decorated. The\nHotel was very clean. Stcaffs were very polite and courteous. They\nprovided complimentary breakfast and it was very delicious. Stay\nexperience in this Hotel was good.\n\nThis was one of the best hotels in that area. The room was like extra\nlarge and the washroom  as very clean. The only issue was there is\nthe lift. The location of the hotel was very convenient, it was just\nopposite to the bus stop. Breakfast and food provided by them were\nvery tasty. The staffs were helpful. Overall it was a nice experience.\n\nThe location of the Hlotel was near the mairket. It was a peaceful\narea. The Hotel was veery safe and secured. The room was well\nmaintained and was very clean. The food quality was also very good\nand there was a variety of food available n the Hotel. The staff\nbehavior as satisfactory. Overall it was an excellent stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "One of the good hotel in Bhabanipatna.\nEverything is Ok..\nextra attention required for cleanness.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Appearance may b deceiving. Very poor service in every aspect. We Checked In, in 2 of our rooms flush not working, jet spray not working was fixed after 1/2hr. Asked for fresh towels n water jug which were given after a long time n repeated calls. Food is average and quantity n taste(subjective) is not justified as per price. No complimentary breakfast still with the excuse of COVID.\n\nU can check out other hotels to stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The location of this place is really good. Just behind the new bus stand. The rooms are very spacious and clean. Staff behaviour is very polite. Quick service .. The only drawback may be the prices of food items on the menu are a bit on the higher side.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Suramya",
      "rating": [
        4.7
      ],
      "address": [
        "W559+QJM, Bazarpada, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Perfect location to stay in Bhawanipatna. Good location, good service & rooms are very well maintained. Only food was average, rest all areas are good.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great place to stay in Bhawanipatna. Great service. Be careful while ordering food, you may end up ordering too much, if you don't know the quantity they offer. But yes, you'll surely enjoy the food as well.\nKeep it up. 👍🏻",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice new place to stay for our station people in Bhawanipatna, Odisha. The staff is courteous and can speak in Hindi fluently too. The hotel is squeaky clean and constantly maintained. Don't forget to check out the restaurant on the second floor. The menu is quite vast.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice spacious rooms with all basic amenities. Service was also very nice. We had our breakfast at the restaurant. The food was good",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice hotel at good location.But service is extremely slow from the staffs with average food quality.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Amrapali Classic",
      "rating": [
        4.2
      ],
      "address": [
        "AT, Hilltown, Bhawanipatna, Damodarpur, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Neat and clean rooms. Room sizes are very good. Nice behaviour of all the staffs. Prompt service. Food quality is also very nice. Good location.\nAbsolutely value for money.\nWill highly recommend to stay here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the horrible experience I had in this place.. we order for some food which came 1 hour and 20mins later.. I literally had to fight with these guys to get the food .. the other tables were served fine with similar order but I guess we were special",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Though the prices might seem high, the servings are up to the mark. 1000 for 4 people(nonveg) and you'd get a decent meal. Service is great and everyone is polite.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "My one-month stay at the hotel was fantastic. The room was great, and the housekeeping staff's hospitality was commendable. Special thanks to Rishi Ji for exceptional service. Despite the receptionist being a bit slow, it didn't diminish the overall positive experience. The hotel's location, surrounded by beautiful mountains and away from the city, added a tranquil charm to the stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This is a very good hotel in Bhawanipatna\n\nExcellent service, cleaning (perfect) and food\n\nThanks a ton ..we will be back",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Centre Park",
      "rating": [
        3.9
      ],
      "address": [
        "Ghodaghat chowk, Chanchara Para, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Hotel Location, Rooms And Food is very Nice.\nBut I have faced some issues-\n1. Hotel could not provide me 1 Good Kettle for Drinking Hot Water\n2. Hotel doesn't provide Tea or Coffee pouches in the room for self making\n3. No Complementary Buffet Breakfast is available, they only give 2 Items along with Tea or Coffee complementary for 2 higher Class Rooms.\n4. Hotel has charged me for the 3rd item with out showing actual Complementary breakfast Menu.\n\nMy Suggestion go get the benefit.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel Centre Park add the name suggests it's situated exactly in the Centre of Bhawanipatna District HQ. It's an excellent hotel with great ambience, excellent spacious rooms,  excellent restaurant servicing delicious food with best service.  It happens to be my College friend's hotel. He and his son who are managing the Hotel take every care to ensure that their guests go there to feel like home away from home. They go the extra mile. Food here is excellent. Hotel has a Conference Hall for meetings and get-togethers.  Hotel kept in very neat and clean manner. Don't miss to stay in this hotel for a good remembrance which is very nearer to the Bus Station and only about 3kms from the Railway Station. The room rents are also deadly cheap. Enjoy your stay in Hotel Centre Park.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very very good restaurant in the middle of town so easy to find and very good and tasty foods and you can find good and clean rooms.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good, spacious rooms, cleanliness is prioritized. The staff is well-behaved and friendly,  and the service is top-notch. Food is good on taste and quality. The hotel is located in the main town of Bhawanipatna which makes it easier to travel to and fro. Loved the experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice place for staying. Enjoy the cousin",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Bhagirathi",
      "rating": [
        3.9
      ],
      "address": [
        "W545+86H, Jail Road, Pradeshipara, Sambhunagar Pada, Bhawanipatna, Odisha 766002, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel.. If you are viewing some hotel with good environment and services. Then this hotel is best for someone who is searching hotel at a rate of 1k ( present rate)",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "We really  got a horrible  experience  from this hell. These people(one of the manager) have really  unprofessional behavior. No hygiene were maintained low quality room service .they make fake ,unethical bills and maintain a wrong g register of check in and checkout timming.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nestled in the heart of our charming town, the Oldest Hotel stands as a testament to history and hospitality. I recently had the pleasure of dining at the oldest hotel in town, from its rich heritage to its sumptuous cuisine and state-of-the-art conference hall, the Oldest Hotel has everything one could desire for a memorable event.\n\nUpon entering the hotel, the vintage architecture and elegant decor transport visitors back in time, offering a glimpse of the town's past.\n\nThe main highlight of the Oldest Hotel undoubtedly lies in its culinary offerings. The food is exceptional, surpassing even the highest of expectations. The restaurant serves a delectable array of dishes, catering to diverse tastes and preferences. The flavors danced on my taste buds, leaving a lasting impression that will draw me back for more.\n\nAside from the delightful dining experience, the hotel boasts an impressive conference hall, which serves as the perfect venue for both marriage ceremonies and birthday parties. The hall is spacious, tastefully decorated, and equipped with modern amenities to ensure every event runs smoothly. During the birthday celebration I attended, the hall was adorned with elegant decorations, and the staff had meticulously arranged everything according to the host's preferences. The event coordinator was organized and efficient, ensuring that every detail was attended to, leaving the guests free to enjoy the festivities without a worry.\n\nHowever, I must note that the age of the building, while adding to its charm, might result in some minor wear and tear in certain areas. Nonetheless, this is hardly a deterrent, as the impeccable service and culinary delights more than make up for it.\n\nIn conclusion, the Oldest Hotel in town is an absolute gem, catering to all needs from exceptional dining experiences to hosting unforgettable events. Whether you are a history enthusiast, a food lover, or someone looking to host a special occasion, this hotel will undoubtedly exceed your expectations. I wholeheartedly recommend the Oldest Hotel to both locals and visitors alike, as it truly embodies the essence of our town's heritage while embracing the contemporary demands of modern hospitality.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very bad experience we had .The manager behaviour was too rude and unethical.they don’t care about their guests. manner less .  Bloody uneducated small town cattle class fellows.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Bhagirathi is my favorite hotel in Bhawanipatna, because from there I find all the places nearby.  The rooms here are of good size and quite safe, especially I like the desi chicken here. You will like all the non-veg chicken items here.  In vegetarian options, you should try seasonal vegetables like ladyfinger or barbatti.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Binayak Hotel",
      "rating": [
        3.7
      ],
      "address": [
        "W559+RFM, NH201, Bazarpada, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Great stay, and very hospitable staff. Close to a very good breakfast centre as well.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "One of the worst experience I ever seened before ..they don't update checkout time to customers...and charged full-day costing..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "In a short time amazing taste.....waoooo superb 🤩🤩🤩🤗",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Nice rooms to stay but worst place to dine, never ever try the Vinayak Special. I still regretting…foods are I don't know delicious or unhygienic one can know after it enters the stomach.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good n budget friendly hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "The Royal Midtown",
      "rating": [
        4.4
      ],
      "address": [
        "chowk, Statue Square Rd, near midtown hotel, in front of town hall, Bazarpada, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "♥️♥️♥️Great, Truly Royal....The rooms are well maintained and the staff is cooperative. The food was also very good. Hotel is at the Heart of The Town...Overall had a very good experience. Looking forward to coming back again soon.....♥️♥️♥️",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The location of this hotel is really good.Rooms are spacious and we'll decorative..staff behaviour n. Food taste are awasome..nice budget hotel...value for money",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "A nice budget hotel at prime location in Bhawanipatna...Rooms are spacious,clean,services also superb...Room service is available for fooding...Overall a very good place to stay away from home in southern Odisha...",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Neat n clean and spacious rooms. Food quality n service are awesome ...just wow",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Well mannered staff. Good place to stay. Food is ok",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel odishi",
      "rating": [
        3.8
      ],
      "address": [
        "Daily Market Rd, Bazarpada, Bhawanipatna, Odisha 766002, India"
      ],
      "reviews": [
        {
          "text": "According to price room is not value for money. Service boys are just tautor . Drinking water (filter water)  not available.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Very friendly staaf and this hotel located in a good place",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "This lodge is in perfect location.\nService is also good.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It is in the heart of the town. The hotel is in the first floor and the ground floor is a market place. Room are budget room comparing to the location and facilities and cleanness.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Small and decent rooms for a quick and short stay. The mosquitoes are a big problem here.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Ganapati Residency",
      "rating": [
        3.9
      ],
      "address": [
        "Near Parmanandpur Chowk, Kesinga Road, NH-201, Kanakpur, Bhawanipatna, Parmanandapur, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "They took lots of time for order\nIf there was an option for zero rating I would been gave that.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "staff is so good and room very clean",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good food at reasonable price.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Not Good Please Avoid Trying It, Speaking As A Residency Of Bhawanipatna!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Budget hotel in town, one can get lunch and dinner from the downstairs hotel.\nNo wifi available, easily commute  to other location in town, for boozers bar is close by only.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Sai Guest House",
      "rating": [
        4.2
      ],
      "address": [
        "Mahavir Para Rd, Bazarpada, Bhawanipatna, Odisha 766001, India"
      ],
      "reviews": [
        {
          "text": "Good Hotel to stay. Nice staffs and management also. Affordable prices are  there.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very bad sarvice by workers",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good .",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Its was an awesome stay\nPrice is reasonable\nService is good\nRooms are neat and clean",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "one of the best neat and clean with best service by staff of Bhawanipatna.with economicall lodge",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}