{
  "places_with_reviews": [
    {
      "name": "Dhanaulti Jungle Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Chamba - Mussoorie Rd, Dhanolti, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "I had a fantastic stay at Dhanulati Jungle Resort. The manager's outstanding hospitality and assistance with my car's heating issue showcased exceptional service. The food and overall service were top-notch. The breathtaking view made it one of the best places to stay, offering both affordability and quality service. Highly recommend for a memorable experience.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Love this place. We have good trekking experience here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "View is very beautiful, but much expensive related to location and other nearby options.\n- No privacy, clear sound from adjoin room.\n- Electricity issue.\n- Ordered gulabjamun and we really don't like it, and didn't eat even than they charged.\n- Just a room with good parking facility, no adventure, no bonfire, nothing included not even complementary basic products in the room.\n- Keys were not available to lock the room from outside however the was earlier told by property manager or owner, so we managed,\nBut not enjoyed the stay at all, it's a day trip location.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I'm writing this review while in Room No १० of resort on १३ May २२. Noticed following points while stay\n१. Very unprofessional approach of staff, rude behavior, very delayed response, bilkul thake huwe log.\n२. No toilet paper toilet, no towel in tiolet, TV not working, remote missing, half of room lights are not working, smelly rooms, blanket stinks.\n३. You can hear even the wishpers of adjacent room, no privacy\n४. Previous night I stayed in one of adjacent resort, their prices were much lower and services were much much professional.\n५. Advise don't stay here unless have no other option, doesn't juatify it's rates at all. Vert poor experience. Perhapa that's why they take all the charges at the time of enrtry itself  ,  whereas yesterday nearby reaort took money only on check out time.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We visited in April 2023 and have no complaints at all. It was off season so we got room for just 1500. Rooms were clean. Owner Mr. Digambar is gem of a person. Parking is there. Kitchen facility is there. Location is just 200 mts from Eco park main entry. First floor rooms have lil smell due to humidity. Ground floor rooms are gud. All rooms are with balcony and gud view. They have bon fire arrangement along with many adventure activities. Must Visit place.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "LA Riqueza Dhanolti View - 9811998192",
      "rating": [
        4.9
      ],
      "address": [
        "Chamba - Mussoorie Rd, near Eco Park, Dhanolti, Kempty Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "Friendly and helpful hotel staff, very attentive to the needs of guests. They cooked special breakfast for us ( 4 people group), tasty food organized taxi, showed place for meditation. Amazing mountain view, funny monkeys, quiet area. So, I definitely recommend this place for rest.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "I had a very pleasant stay. The food was brilliant and the service top notch. The staff was very polite and professional. My TV unit was not working and they swiftly changed my room. If I come back, I will definitely stay here again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Had a nice cosy short stay at this property. The staff is very welcoming polite and co-operative which made the stay more comfortable. Food was also good and served with love. Kid had a great time playing Table tennis. Will be visiting more of there properties now.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "We stayed  in La Riqueza for couple of days. The staff, Rooms and service was amazing. Polite and professional staff. Tidy and Clean rooms. Food was amazing. We had in room service and Buffet. Both were amazing. View from the room was nice.\nOverall it was wonderful experience staying at this property. would like to visit again and will recommend to others as well",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very good property. Beautiful view around. Had a very pleasant stay. Very good room service. Delicious food. Honey bhaiya will always be ready to help whenever needed. Overall best property and service.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Glamwood Resort Dhanaulti | Dhanaulti Hotels",
      "rating": [
        4.7
      ],
      "address": [
        "Chamba - Mussoorie Rd, near ECO Park, Dhanolti, Kempty Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "Very nice staff....\nPlace is really peaceful and very nice to stay...\nSo relaxing.....\n\nFood was also awesome... with pure pahadi taste....\n\nWould love to visit again the same place.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Best property with the best view. The views were so beautiful. The staff was so comforting, especially Panditji, felt like home. The staff was really friendly and helpful, literally helped us with everything. We needed a birthday cake too, the staff went all the way 10km and got one without even charging any extra pennies. They also had bonfires arranged in the common area along with music, which was undoubtedly the best experience!\nFood was amazing and really delicious and they have room service too! The food tasted so good and homely!\nAnd hospitality was at its best! The rooms were very clean and the washrooms too. Overall an excellent experience and would love to stay at this place again!!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Need to focus on cleanliness of rooms and lenins , improve the parking ramp its design damages the bumper due to uneven slope while climbing. Reducing stars for not taking feedback adding your lenins pic the way we found the room . Focus should be giving a fresh and welcome feel to guest on arrival. You have location advantage just focus on these areas.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very beautiful place .  Staff members are very sweet .   Amazing view ... Iam loving it . Every lone should come here and enjoying the view .",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Awesome View, Services are good, staff is very supportive and interactive, specially Mr. Nautiyal Ji.\n\nFood is also tasty and fresh.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "GMVN Dhanaulti Heights",
      "rating": [
        3.6
      ],
      "address": [
        "Chamba - Mussoorie Rd, adjacent to Eco Park Amber, Dhanaulti, Kempty Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "Rooms are not old and not maintained properly by GMVN and lights are low and some are not working and nobody is there to change.\nGMVN IS NEGLECTING IT'S PRIME PROPERTY.\nLocation is gem.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Pathetic rooms. Booked Super Deluxe Room @ 4000/- , but the service what we get as compared to private property is far inferior here. Room is totally damped. Too cold. Very untidy and Unorganised. This property not at all worth of the price paid. Many options are available here. One can come over and look for the preferred spot. This place is not in high demand. Better to book on spot.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Small trip,  hotel on main road, easy approach, good parking, rooms need maintenance by government, big hotel but needs lot of maintenance",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "We stayed here for 3 days. But i found it to be the worst gmvn of all the hotels of this chain . Beds are dirty they are reluctant to provide fresh towels too. Basic amenities like tv too is missing. No intercom working. Even in heavy rain they made us walk to the restaurant,food was not provided in room. Room and toilet is full of moths and insects. Not at recommended.and one more thing water suply to the washroom too was lost in morning time when we were in hurry to leave and check out from the hotel",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Property is great, But being Sarkari, Their Service is pathetic. they don't care Whatever you say, they will do whatever they want to.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Mount View Dhanaulti Dreams | Hotel in Dhanaulti",
      "rating": [
        4.3
      ],
      "address": [
        "Apple Garden Buranskhanda, Dhanolti, Kempty Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "5+ stars to the best view i ever had in mountains. Location is superb and the staff is really friendly. Well built and maintained property. Amazing view of snow covered Himalayas. And yes, ample parking space for cars/bikes. Food also is very good. Overall experience is excellent, gonna consider this property for my further travels for sure.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Perfect place to stay in Dhanulti.\nThe rooms are really nice and hygienic. View from the room it self is 😍. Morning from this place was amazing.\nRoom service is also very nice. Food needs improvement.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A nice budget hotel. The view is excellent and the staff is very helpful and polite. Rooms are basic but good enough for one night stay. Decent food is available though options are limited. Enough parking space available.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Found it a very soothing place. The location and service of the hotel was fantastic. Mr. Sanjay, the manager is a very hospitable man. Overall we had a great experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It was a memorable experience of us to stay this hotel. View was awesome.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Sunrise Resort",
      "rating": [
        4.2
      ],
      "address": [
        "batwal dhar, Chamba - Mussoorie Rd, Dhanolti, Saklana Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "Absolutely loved staying at Sunrise Resort. Warmly greeted by Mr. Manveer ji, who is gem of person. The food was excellent with a wide variety of options on the menu. Special thanks to the chef Mr. Diwan Singh Ji Panwar. The rooms were beautiful, comfortable and cozy with incredible views of the mountains from all corners. The service and hospitality of the staff was very warm, courteous and helpful. Amazing views from my room balcony made it truly a memorable experience. My stay at Sunrise resorts, was truly special because of the beauty, peace and tranquility of this unexplored gem of a place but there’s also lots of activities for the adventure seekers. Well equipped wifi and extremely helpful host Mr. Manveer Panwar ji. Many Thanks to the team for looking after us so well. Highly recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Beautiful location food is great\nWe enjoyed bonfire with my family\nThe palace is neet and clean view is Beautiful mountain view\nMr manveer is great host\nThanks for comfortable stay with my family",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The most exquisite resort with the great view.\nThe staff is caring and helpful.\nThe place is clean and hygienic.\nGreat rooms with very reasonable prices.\nThe service is fast as well. You can ask the owner / staff for any suggestions and they will go extra mile to help you.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Beautiful place. This stay is situated nearby main road. So you don't have to Trek or walk.\nRooms are in hur shape and have large glass windows that give the mesmerising view of the valley.\n\nRooms are available in three categories.\n\nThey have kitchen and cab service. Kitchen is open from 7 am to 11 pm.\n\nBoth veg and non veg available.\n\nSurkanda Mata mandir is 4.8 kms from this place.\n\nIf you like walking, you can walk down to eco park. Or take a cab which will charge anywhere between 150 to 200.\n\nYou can see valley on both the side of the road. Lush greenery and pretty flowers.\n\nBest part is the flowing clouds throught. You will be amidst clouds.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Perfectly placed in the laps of lush green mountains. Filled with the necessary amenities. Homely ambience, friendly staffs.\nFood is simple yet savoury.\nThey host bonfire every evening with your choice of music.\nWhat matters most is the peace of mind and the ecstatic view the hotel provides.\n(Review for stay in month of June)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Apple Orchard Resort",
      "rating": [
        4.1
      ],
      "address": [
        "Lagga Goth, Ward Jaunpur, Dhanolti, Kempty Range, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "We didn't find this resort worth. No activities and indoor games were out of order. Service is ok and bonfire, room heater is chargeable.Tents are more for bachelors. Didn't find it well organized.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The place is amazing. The staff was very helpful and maintains deceny. The only problem were Other guests who think they are above law and order. Yet the manager did take an immediate action and tried to maintain the dignity and privacy of the resort and it's other guests.\nHat's off to the manager.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Great view. Tasty food (not too expensive). Good service. Room price - ₹2500. Safe parking. Badminton, pool table, carrom available.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Perfect accomodation in a cheap budget. Beautiful location..but have to go off road for some 300 m . Can be challenging for small car if it has snowed or rained. Spacious and clean rooms.however geysers don't work in some rooms. The location is the best. The staff is supportive.. food is also fresh and nice. The views and area are perfect for dhanualti. Bonfire can also be arranged for large groups",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Staff is very supportive and polite.\nBest time to visit Jan and Feb. Only thing to make sure if you are going with your own vehicle then  please take front wheel chain that will help to drive easily on snow else it will be difficult to cross 1 km down hill track.\nRest every thing was perfect.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Camp O Royale | Resort In Dhanaulti",
      "rating": [
        4.4
      ],
      "address": [
        "Near Dhanulti Eco ParkLambdhar, Chamba-Mussoorie Road, Dist. Tehri, Garhwal, Dhanaulti, Kempty Range, Uttarakhand 249001, India"
      ],
      "reviews": [
        {
          "text": "It was really a nice experience. Hotel was so neat and clean. And vibe was also very amazing ✨",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I have a great experience here. Me and my friends enjoy so much there.All services are best. View is awesome . We enjoy a lot",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I came here with my friends and school as a school trip . I have just a wonderful experience here as there is a very fast service and many facilities . Rooms are also too good and too luxury also secondary the thing that blow my heart away was food . Food was too delicious . I can't explain in word. Moreover the location was also beautiful . There is calm and peaceful environment at top . Furthermore for our fun there was many games and DJ . So I will prefer just to go no need to think about Camp o Royal it true ly fell royal .\nThanks\nStudents of St Francis Convent school .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "At very good location with better view and some outdoor games options. Its at hight so better to carry normal snakes with you so that travelling time will be less 🙌",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It was the best place i have ever visited. i had such a wonderful experience. I visited this via school trip and the time spent here with my friends was just amazing. The facilities, rooms, food was very nice .\nI would definitely suggest you to come here\nFROM - ST. MARIYAN'S",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Rock Resort",
      "rating": [
        4.4
      ],
      "address": [
        "Chamba - Mussoorie Rd, Dhanolti, Uttarakhand 248009, India"
      ],
      "reviews": [
        {
          "text": "The resort was pleasant and reasonably priced. A nearby market adds to the convenience. The staff is helpful and the rooms are clean and well-maintained, with decent room service. This site offers a pleasant experience in addition to other things like surroundings and wildlife. Greatly advised.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It was a reasonably priced, pleasant resort. Also nearby is a market, which is convenient. Nice and clean rooms with superb room service and helpful staff are available. This area provides an enjoyable experience in addition to its surroundings. Strongly advised.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This Resort is a charming gem that embodies peace and serenity. Surrounded by the majestic Deodar forest, this small-budget haven offers an enchanting retreat from the hustle and bustle of city life.\n\nThe resort's simplicity is its allure. The peaceful ambiance envelopes you upon arrival, setting the tone for a tranquil getaway. What truly sets this place apart is its proximity to nature; the adjacent Deodar forest acts as a natural backdrop, enhancing the sense of calm and connection with the environment.\n\nThe delightful culinary experience is another highlight. The flavorful and delicious meals served at the resort not only satisfy the taste buds but also showcase local culinary expertise. The staff, with their cordial and accommodating behavior, further elevate the experience, ensuring guests feel welcomed and cared for throughout their stay.\n\nOne of the most appealing aspects of the Dhanloti Resort is i\n\nBoth the Eco Park (Dhara) and Eco Park (Amber) are within walking distance.\n\nIn conclusion, the Rock Resort is a delightful escape for those yearning for a peaceful retreat amidst nature's beauty. Its budget-friendly nature, coupled with tasty cuisine, cordial staff, and proximity to nearby attractions, makes it a commendable choice for a serene holiday getaway.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The cost of the lovely resort was fair. The nearby market adds convenience. Friendly staff, superb room service, and clean, tidy rooms are all features of this hotel. With its position and surrounding nature, this site gives a pleasant experience in many ways. Excellently advised.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It was nice resort with reasonable price. Market is also near which make ease. The rooms are nice and hygienic with a good room service as well as cooperative staff. This place offers a good experience with various stuff like location, nature with it. Highly recommended.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "ViewToria Resort",
      "rating": [
        4.7
      ],
      "address": [
        "Badwala, Dhanaulti, Dhanolti, Uttarakhand 249180, India"
      ],
      "reviews": [
        {
          "text": "What an amazing spot to spend the weekend in Dhanaulti! The resort is perched on a ridge with fantastic views on both sides. The club house is built with large windows, meaning you get to lounge/dine with a view. Its a great space set up to host, we enjoyed the ping pong and games! Every dish that came out of the kitchen was superb. We enjoyed a wonderful weekend in mountains, lacking no comfort. i highly recommend staying here!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Nice scenic location, road accessibility, parking available, rooms are super neat and clean.\n\nGood for a weekend getaway and relaxing in serene  environ.\nMorning and evening sunrise and sunset are more often to give golden view of Himalayas on clear days.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The owner really needs to work on the bed mattress,  the toilet and lighting of the area including parking place . They are very well mannered people who want the very best for their customers .If they get orthopaedic mattress from the sleep company that has gel technology and make strong beds along including modern bathrooms they will indeed do well. We did not stay there because what we wanted was missing entirely as tourists.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I recently stayed at  View Toria resort in the Himalayas during a motorcycle trip, and it was a phenomenal experience. The resort offers stunning hill views, especially the mesmerizing winter line during sunsets and sunrises.\nThe rooms were clean, comfortable, and cozy, perfect after long days of exploring the nearby trails (there are a couple of them). It is ",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This resort has an enthralling view of the higher Himalayas. Watching the sun set is an amazing experience. Great room service and finger licking food . We had a warm welcome by the owner and the staff. Would love to visit the place again.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}