{
  "places_with_reviews": [
    {
      "name": "Harela Inn Luxury Hotel Restaurant North & South Indian",
      "rating": [
        4.6
      ],
      "address": [
        "Harela Inn, Kshetrapal, Bhimtala, Badrinath Highway, Chamoli Gopeshwar, Uttarakhand 246424, India"
      ],
      "reviews": [
        {
          "text": "Rooms were okay but the commode seat was found broken and the main door was not latchable. But the service was horrendous.\nThe management replied to my initial review, which I totally disagree with. Food was not available as standard. It was made to order that too with full of reluctance.  Despite asking they said as per my wish,  the ordered food was prepared after occupancy of the table.\nIf according to the reply that's the best then I am sorry it's not of the quality I deserve after paying hefty to the tour operators",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We stayed here for a night on our way to Badrinath on 27th October, 2023. The rooms were spacious and clean. Bathroom had 24*7 hot water. Resturant was good and prepared breakfast for us at 6am. Great stay, happy to recommend.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Great location, courteous and polite staff, good rooms, yummy meals - few things which will come to your mind if you have stayed here. It's a beautifully maintained property. Special mention of the chef who made each meal so yummy that it was just an icing on the cake",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I am checking out of this hotel today. I booked this hotel for two days and had an amazing experience. The room, service and behaviour of staff was of 5 star quality. They served yummy food with generous quantity. They provided proper food for my driver too. All in all its an amazing hotel in a budget price. Anyone visiting Badrinath I recommend not book a hotel in Badrinath as people over there are quite unfriendly. So, it's better to come down to Harela Inn same day after darshan of Shri Badrivishal.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "very nice food, clean & staff is too good.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "HOTEL HEAVEN",
      "rating": [
        3.7
      ],
      "address": [
        "HOTEL HEAVEN BUS STAND CHAMOLI,UTTRAKHAND ,INDIA, Chamoli, Uttarakhand 246424, India"
      ],
      "reviews": [
        {
          "text": "Shining rooms gave me a great time experience of my life .\nNeat and clean room , nature and natural views ,Assisting staff .\nAll service are excellent",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Lovely staff..\nOwners are very friendly and listen to your queries and solve them immediately..It is a nice place to stay...",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are pretty clean and well maintained but some of the basic needs (Towel, gyeser,  soaps, etc) in rooms are not available when you enter. You need to ask every time to get something.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Best please for stay\nMy whole team like it and service is amazing.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Best Hotel to stay\nVery polite owner\nBudget friendly",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Rudra",
      "rating": [
        3.9
      ],
      "address": [
        "Sagar, Gopeshwar Mandal Rd, Gopeshwar, Chamoli Gopeshwar, Uttarakhand 246401, India"
      ],
      "reviews": [
        {
          "text": "This hotel is just 3kms away from thw city and rooms are good as per the price. You can stay here.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's a good stayover, perfect view, some cleanliness issue is there but quality of service and food overcomes it, u can use all out to keep insects away at night provided by hotel, we asked local veggie cooking and we were provided with pahadi bhindi. Perfect pics were taken by us.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Affordable and clean rooms near Rudrnath trekking start point in Sagar. It's a good option for those who wants to visit rudranth-4th Kedar. Food is basic but healthy and tasty.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel located on Gopeswar - Mondal road, just few minutes away from Rudranath gate beside lovely fountain. Rooms has lovely scenic beauty of vally. Rooms has got primary facilities with gyser. Hospitality of owner is very good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Large and spacious room. No wardrobe. Geyser water is hot. No tower or soap in the bathroom. Comfortable beds. Restaurant has a limited range of food, but service is quick and the food is good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Peace Palace And restaurant",
      "rating": [
        4.2
      ],
      "address": [
        "Hotel Peace Palace And Restaurant, Badrinath Highway, Bhimtala, Chamoli Gopeshwar, Uttarakhand 246424, India"
      ],
      "reviews": [
        {
          "text": "Location is good.\nOwner is good.\nFood is good.\nServices are poor.\nWifi was not working\nTv set top box was not working.\nStaff was arrogant.\nRoom service not available.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel has a river flowing just adjacent to it. Clean rooms, good service and awesome view.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice Hotel in badrinath road  💕\nDelicious South Indian food  😋\nFriendly staf",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel located in best place and staff is very friendly and food quality is so good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel in main road\nClean and spacious rooms\nBudget friendly\nHot water and power back up available",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "नगर पालिका आवास",
      "rating": [
        3.8
      ],
      "address": [
        "C8R9+MWR, NH 107A, Uttarakhand 246401, India"
      ],
      "reviews": [
        {
          "text": "So poor",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "SATOPANTH INN LUXURY HOTEL & RESTAURANT, GARHWALI, NORTH & SOUTH INDIAN",
      "rating": [
        4.7
      ],
      "address": [
        "Bhimtala, Chamoli Gopeshwar, Uttarakhand 246424, India"
      ],
      "reviews": [
        {
          "text": "Friendly nature people.\nAnd they did service too ..\nWe enjoyed stay at this place for our Kuari Pass trek.\nFood is tasty ..\nService needs to improve more.\n\nRooms are good.   need to maintain bit well.\n\nLocation is excellent. River side view,  on road only.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Booked one room for 2 hours as we were traveling from Kedarnath to Badrinath and wanted to get fresh midway. The rooms were nice. The food in their hotel and the view were great. The hotel is a bit costly as it is on the main highway. The hosts are nice. Overall recommended.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Firstly i must say u won't have to compromise on the budget as it's very very budget friendly.\nRooms are clean and good with beautiful view.\nFood is very delicious.\nGood staff and good service overall.\nHighly recommended place.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This place is awesome surrounded by scenic beauty,clean rooms with basic amenities and delicious food.Staff is amazing treat u like a family.\nDefinitely recommend this place for their hospitality and amazing service.\nThey truly mean what they quote-“Come in as guest and leave as family”",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "A great food quality with an awesome service given by the staffs. Before or after bardinath trip, this Satopnath INN restaurant is recommended. Visit again and again and taste the great food with a great view of mountain and water.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Nirmal Palace",
      "rating": [
        3.8
      ],
      "address": [
        "Nagrasu, Chamoli, NH-58, Badrinath Road, Joshimath, Joshimath, Chamoli Gopeshwar, Uttarakhand 246422, India"
      ],
      "reviews": [
        {
          "text": "Best hotel near by chamoli on badrinath highway\nRooms and service is good. Food is good.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Really good place to stay in a budget.\n\nRooms are clean and airy.\nLocation is awesome, on the highway with river view.\nService is too good.\nFood is also good.\nHuge parking space.\nVery economical.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Awesome place 👍👍 alaknanda river view",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel is Good and also provide good facilities.do not know much about kitchen facility but food is also of satisfying quality\nTop floors rooms are nice and also good to stay with family\nThe main problem is than there is landslide\nArea nearby the hotel.\nSo in mansoon one could be terrified  here",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel is beautiful and view from the terrace is superb. Services like food, hotwater and parking space are available here. Staff are friendly they help you if you need. Thank you 🙏🏼✨",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Surya",
      "rating": [
        3.8
      ],
      "address": [
        "Badrinath Rd, opp. Taxi Stand, Chamoli, Uttarakhand 246424, India"
      ],
      "reviews": [
        {
          "text": "The Hotel is situated in outskirts of Chamoli-Gopeshwar. We had a break and stayed here on the way to Badrinath.\n\nIt was a nice stay, The room sizes are pretty good and very economical in rates.\n\nThey have their own restaurant and you can have good food over there in economical Rates.\n\nThe view is pretty good and one can stay over here and take a break when traveling to Badrinath.\n\nJai BadriVishal ❤️\nHar Har Mahadev ❣️\nIncredible India 💝\nJai Hind Jai Bharat 🙏🏻",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Abhishek the Manager works hard to give you good experience. Thank you Abhishek for the hard work you put in and making  it a good stay for us.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Worst experience of uttarakhand!\nOwner is lier, once he takes money, all his words will vanish and he will start to show his true colours..\nBelow was my experience -\nWe booked the dormitory room as we were 9 members. The hotel's owner always takes money in advance and once you pay, he starts to show his true colours. The dormitory room was filled with high no. of Mosquitos and spiders. The common washrooms and bathrooms were super ugly. Additionally, this place has no camera's installed outside the room and common area. During our stay, someone started banging our room door havely in midnight between 1am to 3 am and we had to call police.\n\nSo please be very careful before you make any bookings here.\n\nThis place is haunted as well so choice is yours.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Worst experience of uttarakhand!\nOwner is lier, once he takes money, all his words will vanish and he will start to show his true colours..\n\nBelow was my experience -\nWe booked the dormitory room as we were person. While booking, we had already said we need hot water for bath as we have child and old person in our group. He said he will provide and will be cooperating, which is included with the hotel rent.\nThey have a policy of taking the money while booking.\nSo, there was my mistake. I gave the money.\nNext, when we need hot water, he says we have to pay Rs 50 for the hot water, that too for 2lt hot water.....\n\nSo there is his words, a very rude person when money is given!!\n\nRooms are filled with mosquitoes!!",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Great hotel the food was really good and the view from the rooms was mind-blowing the rooms were very spacious",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Dev Darshan Hotel and Cottages",
      "rating": [
        4.2
      ],
      "address": [
        "C878+XX3, Koteshwar Chopra Rd, Mandal, Gopeshwar, Uttarakhand 246401, India"
      ],
      "reviews": [
        {
          "text": "View is amazing from hotel rooms are fine and services are good so overall fine but it can be better.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A nasty room I have ever stayed in my life. Curtains, bedsheet, and blankets were stinging; toiletries were not provided in the room. Please don't stay here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "ARE NEAT AND CLEAN, NICE VIEW OF NATURE, DECENT STAFF AND PEACEFUL PLACE NEAR GOPINATH TEMPLE",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Placed at a perfect location on the mountain top which is easily accessible via road. The rooms are super clean and spacious. Loved the stay here. 100% recommended",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Its location is awesome. Top of the gopeshwar . From balcony it has awesome view.  Room is quite good 👍. staff is very polite.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Astha Guest House",
      "rating": [
        4.7
      ],
      "address": [
        "Mandal, road, near Hyundai Motors, Gopeshwar, Uttarakhand 246401, India"
      ],
      "reviews": [
        {
          "text": "\"Exceptional hospitality, cozy accommodations, and a serene atmosphere make this guest house a top choice for a relaxing getaway. The hosts went above and beyond to ensure a comfortable stay, and the attention to detail in the decor and amenities truly sets this place apart. Highly recommend for anyone seeking a memorable retreat!\"",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Rooms are okay if you have to stay one night but prefer other options, if available. Owner, who is a young lad is helpful for errands. Nothing special abt room, it wasn’t cleaned properly. Fan was dirty. Switchboard broken. Not suitable if travelling with family. View is as you would get at a hill station, nothing to rave abt like some of the reviews here.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Absolutely stunning hotel with remarkable attention\nIn affordable price",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "\"Affordable price, excellent location!\nQuite smooth reservation process, very friendly service at the desk, clean & large room\nHomely friendly hotel\nOnly stayed 2 nights but the hotel has standard rooms and very clean and concerned privacy.\nComfy and close to everything\nCan be easily reached and most of the shopping centers and sights are nearby. The room was comfortable.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Rooms are neat with amazing view of himalayas",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}