{
  "places_with_reviews": [
    {
      "name": "Resort Prakriti Unwind",
      "rating": [
        4.7
      ],
      "address": [
        "Vikasnagar - Chakrata Rd, Koruwa, Thana, Uttarakhand 248196, India"
      ],
      "reviews": [
        {
          "text": "Prakriti Unwind isn't just a resort, it's an experience. The location is simply unbeatable, nestled amidst stunning mountains with a view of the sunset that will leave you speechless. But the beauty doesn't stop there. The food at this resort is equally impressive. I was thoroughly impressed by the quality of the ingredients and the skill of the chefs. The flavors were fresh, delicious, and truly unforgettable. What truly tied everything together was the exceptional staff. Their warm smiles and attentive service made me feel right at home. They were always happy to answer questions and offer recommendations, ensuring a truly enjoyable dining experience.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We recently stayed at Prakriti Unwind in March for three days in a luxury suite. The resort is commendably pet-friendly, which was a major plus for us. The rooms were comfortable and well-maintained, and the resort is conveniently located approximately 10 kilometers before Chakrata town.\n\nThe food was exceptionally delicious, adding to the overall quality of our stay. However, we would like to offer a couple of suggestions for improvement:\n\n1. It would be beneficial to expand the non-vegetarian options in breakfast and dinner. Currently, breakfast offers only eggs, and dinner includes just one chicken dish.\n\n2. We chose a room with a bathtub, but the water flow in the bathroom was disappointingly slow. This made it difficult to shower, let alone fill the bathtub, which would have taken hours. We hope this issue can be addressed promptly.\n\nOverall, we enjoyed our stay and would consider returning in the future. Thank you for a pleasant experience.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We had an absolutely wonderful stay! The beautiful views from our room were mesmerizing, and the cozy atmosphere added to the charm. The staff's hospitality was exceptional, making us feel truly welcomed. The room was immaculate, and the amenities exceeded our expectations. The food was very good and delicious . Overall, a perfect retreat with top-notch service. Highly recommend for a memorable hill station experience!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The experience has been excellent. Very peaceful place. The owner and staff people are very courteous. Mr Amit is very kind & helpful. It's a perfect family place. Food is delicious. Even though there are many sight seeing places but lots of people including us decided to enjoy the resort by curtailing a few places.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Recently visited this place with office colleagues. Must say  our stay in this resort was amazing. Delicious food, polite considerate staff and beautiful location.  It's a little in an isolated area with chilly windy vibes. They have lot of indoor and  outdoor fun activities. Overall it's a place worth to consider.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Dopaar by the Brook",
      "rating": [
        4.7
      ],
      "address": [
        "near Tigerfall, Chakrata, Kanaser Range, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "Best location to stay I have ever seen in Uttarakhand, Lovely and humble staffs, food was awesome. They treat their customers like a family member. Thanks for making our trip enjoyable. Love to visit again. All the rating and reviews about this property are totally genuine.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This was such an amazing place for an excursion.\nWe were a group of 15 people and we never expected such kind of property, treatment and the food we got at such high altitude was so amazing.\nNikhil and his wife were so welcoming along with the people that helped us during the stay.\nMust visit",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Amazing place in nature vicinity with big gaarden facing river stream in front.\nTiger fall is just 2 km from this place.\nRooms were neat and clean.\nIt's pet friendly resort.\n\nStaff is very humble and cooperative.\n\nLittle overprice in off season, however worth to stay overnight.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "What an amazing place to stay in the wilderness,  next to a stream. Beautifully made property, looked after by the owners themselves. Cozy wooden huts. Delicious food!!! Wasn't expecting so much variety on the menu. Such serene location. One can spend days here without having to go anywhere...",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The Doopar by the Brook Hotel's amazing scenery and outstanding staff left me in complete wonder after my visit. My palate was left with a lasting impression by the culinary experience, which exceeded even the expectations of a five-star hotel. An already incredible experience gained even more amazement from the night view. A visit to this remarkable location is strongly recommended.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Tiger fall eco resort",
      "rating": [
        4.6
      ],
      "address": [
        "Tiger Fall Rd, Kanaser Range, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "Amazing view and also pet friendly! Staff is very helpful and appreciable. Food is decent and the resort is well maintained. Loved staying in the tree house. The small trek to reach the resort is beautiful. It is in a secluded place with greenery and fresh air. Would love to visit again",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had an amazing stay here. If you are looking for some calm and a place which is close to nature or water bodies this is the right place you should land on!\n\nOver and above all the staff, rooms, services all were so good.\n\nThanks team for mangaing everything so well and nicely.\n\nWe will be missing this place badly😊",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I like this resort. Food was amazing. The hotel is located in the middle of tiger fall trek. The hotel view is brilliant. So it deserves a 10 out of 10.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had a lovely stay and were very well taken care of by the hotel staff. Everyone on staff is kind, polite, and warm. They are always ready to assist you whenever you need them. Location alone is enough to make you love the resort. The food and tea were excellent (usually this is not the case in hotels).  Furthermore, the resort's surroundings were beautiful and serene, making the entire experience even more enjoyable. The tree house was a great experience, but got quite cold at night (we stayed during October). The second night we stayed in the loft room, which was clean and comfortable. They even arranged a cab service for us to tour around the city and ensured we were safe when it was getting late while we were returning. Chakrata is beautiful, tiger fall eco resort makes it even more beautiful. I am all heart-eyed for this place and can't wait to visit again.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Great place for a quick mountain retreat! Close to water bodies and a cleaning atmosphere Tiger Fall Eco resort has luxurious rooms and on top of that the staff is exceptionally friendly!! Must stay if you are in Chakrata",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Deodar Dream Resort - Hotels in Chakrata",
      "rating": [
        4.3
      ],
      "address": [
        "Koruwa, Uttarakhand 248196, India"
      ],
      "reviews": [
        {
          "text": "The Perfect place to stay in the mountains.\nLocation are just beside of NH707A.\nRooms were well neat & Clean.\nWe reached here at 8.00 pm and found a well ❤️‍🩹 lightening, Airy, decorated and slow music.\nQuality of food was superb.\nIf you order from your room, waiter will receive your order and they served the food wherever you want i.e. in Outside the room, in the grass, in the tables, also if you want in your bed too.\nPrices were just reasonable.\nParking available.\nI will suggest you to visit once.\nYou can play here multiple types of games like Badminton, cricket.\nYes one thing you can miss is Sunsets & Sunrise only, otherwise a best place to stay here",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Lovely little wooden cottages that have been kept and maintained really clean. No damp smell and the linen is fresh. Best of all is their entire farm land and lawns bustling with various pets like Jerry, the golden lab, rabbits, guinea fowls and more. The staff was really sweet and helped us with whatever we needed in minutes. It's a nice and large open property with beautiful views of the Deodar hillside on one side and the sunset in the valley on the other. Food is reeeeally good and homely. Not at all spicy or oily and we realised we were overeating every meal as it was so tasty and simple. You'd be lucky if they made you tandoory stuffed kulcha/parathas for breakfast.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This resort is at the best location to have a peaceful time though the location is now known to everyone and crowded.\nBut the mornings are beautiful and peaceful.\nThe food is good and a well managed resort.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I had visited this place during the month of Oct 2023 along with my friends. we were 27 people in total. The location, rooms and amenities were excellent. The staff were very courteous (Mr. Sandeep and others).\n\nThe food prepared was too good, every small details were taken care of.\n\nLastly, Muffin and his small buddy (Labradors) are so playful and happy to see everyone visiting their resort.\n\nGood going and best wishes. Will make it again soon",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place for night stay. This is a peaceful place. Food is also good with limited resources. Distance of Chakrata market is  around 10 KM from this resort.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Snow View Hotel",
      "rating": [
        3.7
      ],
      "address": [
        "PV2C+GRX, Banglow 35, Chakrata, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "Hotel has a beautiful location and has immense potential. Furniture and facilities are average and maintenance is below average. Food quality is OK. Service is satisfactory. As Chakrata has very few hotels, management of hotel needs to improve facilities to make it user friendly.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Spacious rooms with average bedding style. Kitchen open till 10 pm. You have to place order for non veg before 8 pm. You can ask for bon fire. Nice view from the parking. Cool place in winters.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The rooms are really very nice ,which makes us  remember of the vintage Vilas . at least one visit is must",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The place as a whole is very nice. Huge open area - most of them are common areas. Lovely views. The Rooms aren't great.\nI read about a lot of reviews after I booked the place and I wasn't really expecting much after that. But then, it was not that bad. Food was quite good. I think everything apart from rooms were fine.\nRooms were small ( several options were available , I don't know about others but the one we stayed in was a mountain view double bed room ) . Hot water never came, probably solar heaters dint work as sun was not up that day. Rooms felt congested with no ventilation. Curtains and towels dint look that tidy",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Don't book by just seeing lowest price. By default they will give u tent even if u search for room. And there is no refund. Rooms condition are not that great as well. Cost wise it's higher for very simple room.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Munaals Nest",
      "rating": [
        4.5
      ],
      "address": [
        "Gawsa Bridge, Chakrata, Gawsa Bridge, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "I would want to start by saying that I had an amazing stay at Munaals, it’s such a cozy and beautiful place. I visited here and it’s a must visit if you are looking for a weekend getaway. Secondly, the food is amazing here❤️ plus the staffs are really friendly and helpful specially Azim Ali, he is sweet guy :) Also Chauhan uncle (owner) he is really friendly and takes good care of his guests. I truly recommend this place to everyone. The rooms were clean and comfortable.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "1. Family suite is expensive and we were charged extra. Even more than the normal 2 single occupancy rooms.\n2. Rooms were not fully ready though we reached at 4.30 pm.  Room service is too slow.\n3. No intercom. Had to call on mobile nos. Of different staff multiple times.\n4. No Water bottles in the room.\n6. Complementary breakfast has no options. One has to ask for butter, curd, etc. It is given in small quantities like rationing.\n7. In room dinning is expensive.\n8. No other food option nearby. Completlely dependent on hotel service.\n9. Single heater in the family suite which was charged more than 2 single occupancy rooms. Mostly all facilities were given like it is a single room like tea bags, milk powders, etc.\n10. Many things were given only after asking and reluctantly.\n11. Best to have taxi tieups from outside and not from Munnals nest.\n12. Must search for all other options before finalising this property.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Property is good. Clean .The staff is very cooperative. The owner is very soft spoken and well behaved. Food is good",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Its a good place to spend time in. I am really impressed with the staff service. Although they should work on few things like food order service. They have two pets, one is a dog and another one is a cat. They are so cute and friendly and should be kept open for the guests. All over it was a nice experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "my best experience. Beautiful rooms, neat and clean stay, courteous staff and super tasty food. Could not have asked for more. And being a pet parent - was a bonus because they have 2 beautiful dogs and a cat. If there was an option of rating 10 out of 5, I would have done that for my stay and experience in Munaals nest..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Himalayan Paradise",
      "rating": [
        4.5
      ],
      "address": [
        "Kanasar Range, Tiger Fall Rd, Chakrata, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "It is a beautiful cozy place,\nStaff is the most polite I have ever seen.\nThe owner really cares about their customers and the quality of the services you get here is 6 stars. Food is amazing breakfast and dinner is included in the price of the room which is rarely find anywhere.\n\nThe rustic wooden feel of the rooms and every small element of this hotel is just beautiful. If you are travelling to chakrata, you won’t get a better place to stay than this.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Amazing stay it was. The staff was very sweet and hospitality was top notch. Good food along with great view.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Service time is only from 6 am to 10 pm.\nThe location is near the cantonment area.. No littering and foreigners are allowed.\nLocation is the best\nPrivacy is less since room is made mostly of wood and stones therefore the sound of people talking can be heard at another room. If you have a large family then this hotel is not recommended since this is a silent place with people meditating, viewing sunset and sunrise, birds churping and so good things with climbing the mountains and other nature friendly things.....",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Beautiful resort, very clean and quite. The pets were so cute and the food was really homey. The rooms are panelled with teak wood so no insects come inside and the bathroom was also insect free. The view is amazing from the resort, it's like you're living among the clouds. Had a great experience with Rajesh and Amit, the owners.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Awesome Location and Awesome People.\n\nWe visited this place in September 2023, and stayed for 2 nights. We received really good services from the staff, esp shout out for Mr Sunil Ji and Mr Kapil Ji.\n\n#Good Things:\n\nDelicious Food\nSpectacular View from balcony\nAmbience\nBeautiful Rooms\nKids friendly space\n\nP.S. If you are a pet lover, there are 2 cats and 1 dog to play along.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Burans & Restaurant",
      "rating": [
        4.1
      ],
      "address": [
        "Vikasnagar - Chakrata Rd, near Vill. Korwa, Chakrata, Koruwa, Uttarakhand 248196, India"
      ],
      "reviews": [
        {
          "text": "We visited to this hotel for the few days. Here are our experiences:\nGood: 1. Hotel is at 9 kms away from Chakrata Market and is at quite place with good hill side views.\n2. Parking available\n3. Rooms were manageable however hill side view was quite good\n4. Food was good however it was at expensive side\nBad:\n1. No one visited to clean the rooms/bathroom. Even though, we called them for the same still no one visited same day or next day. When we asked the same thing to their manager, he was not accepting our feedback, kind of rude and started arguing(attitude like he is a local guy). Sum up conversation: He meant to say that it's our(visitors) responsibility to request him again and again for the rooms cleaning. Rule: It is hotel management responsibility to ask for the cleaning, rest upto visitors whether they want or not.\n2. Hostel kind of rules are there. You cannot go outside at night as they have to close the gates at 10 pm sharp and then open at around 7 am morning, in between no one is there to help or assist.\n3. Be aware with spiders in the rooms.\nOverall: If you are looking for a peace from your hectic schedule then visit Chakrata. This place is less crowded, quite and have few places to visit.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "If you are planing to visit chakrata i would recommend  you to boom your stay in chakrata and avoid this place. As it is 11km before chakrata. Also food is bad. Rooms area clean but food is really bad",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Amazing hotel with wonderful views from room, staf was very courteous and the manager Mr. Suni tomar was a fabulous man who has helped and guided very well.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It was a good experience overall. The owner is very cooperative! The location is super awesome. The food quality and the room was overall fine. The only drawback i noticed was that no one was available in night to attend to customers. However the feedback was taken positively by the hotel manager and he assured that someone would be there even in night in case of exigency.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good experience with food. We only stopped for lunch.\n\nHope to stay with them in future.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Babutaal Resort",
      "rating": [
        4.8
      ],
      "address": [
        "9th milestone tigerfall / Lakhamandal, road, gwasa bridge, Chakrata, Uttarakhand 248123, India"
      ],
      "reviews": [
        {
          "text": "Rooms are not very good as they are not very clean. No tv no refrigerator. The beds are too soft and u may found them uncomfortable some times.\n\nAlso, u have to pay extra for bonfire.\n\nLocation is quite good and there is a waterfall just adjacent to the hotel.\n\nService and food was good too but I found food to be a little overpriced",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Babutaal Resort is very serene nice n clean place to stay peacefully...It's in lap of nature,natural spring, mountain,it's just wow,amazing place to chill out with your family n friends...Staff there was very laborious n their service is too fast with pleasing behaviour...love this place,highly recommended for those who want peace, Everything is there to stay comfortably, free WiFi,geysers, electricity,fantastic room service ...",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Nice location. Situated on Tiger Falls road.\nAmple parking space for 8-10 cars. There's  a stream flowing right beside the property. You can take a dip or enjoy a bonfire alongside it.\n\nNot wheelchair accessible. But the staff helped a lot.\n\nRooms are spacious but the quilts were a bit dirty in a couple of rooms. Had to get those replaced.\n\nFood is good. Veg and Non-veg options both available.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The location of the hotel is truly breathtaking, and I was absolutely mesmerized by the hidden waterfall situated within the premises. The tranquility and beauty of the surroundings made it a perfect place to live, even if just for a short time.The level of service provided by the staff was exceptional.Thank you once again for providing such a remarkable experience.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "We stayed for last two days in this resort. There are many impressive things about this resort.\n1. Service and hospitality of staff was awesome. They were prompt and ready to serve. They didn’t say No to any request. So a nice reception.\n2. Location: this resort has stream within resort which makes it a beautiful place to stay. The sound of stream 24/7 is very relaxing.\n3. They don’t have TV set in executive room which I think is good as it allows kids and family to sit together and talk.\n4. Food was good and staff was responsive to requests.\nHope this will help you.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Chakrata Inn Resort",
      "rating": [
        4.5
      ],
      "address": [
        "Chakrata Inn Resort, College Road Vill. Tugara Purodi, Chakrata, Tugara, Uttarakhand 248196, India"
      ],
      "reviews": [
        {
          "text": "Stunning eco friendly environment with beautiful Mountain View.  Location is very peaceful, all the hotel staff are very attentive and friendly. The restaurant food is delicious. We found our bed to be very comfortable and our rooms were very spacious, with everything we needed. We would happily visit again.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Had a very relaxed stay . Great service , food was amazing, calming greenery , everything was just up to the mark .The resort ambience was lovely and very serene .What more could one ask for ! We look forward to coming back .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I loved staying up here, hospitality, food, ambiance everything was great and lastly the view from room balcony is beautiful..must visit.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Food was good but service was not good enough. Its better to book a cheap hotel or some other resort. They need to improve service. There were a lot flies in restaurant and there was no activity other than bon fire and some music on speakers. View from the resort was also not that great. At least they should improve customer service and make sure that rooms are clean and bathroom is getting hot and cold water always.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The Very nice property and staff is really good. We had 3 rooms booked for 3 days and experience was awesome. Nice stay with courteous staff and have good food. Will share with our friends and family too.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    }
  ]
}