{
  "places_with_reviews": [
    {
      "name": "Country Inn Nature Resort, Bhimtal",
      "rating": [
        4.2
      ],
      "address": [
        "Bhowali-Bhimtal-Haldwani Rd, Mehragaon, Bhagtpura, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Stayed in this resort for two nights, we were a family of six and stayed in three cottage rooms and overall the rooms were good…. there were a few small things which did not work like the blinds rolling up etc. but the staff was extremely helpful wherever needed. The breakfast spread was good but the taste was not that great. We asked them to set up a bonfire just for us in front of our cottages and they obliged(obviously had to pay for it)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The place was quite good. The rooms were very spacious. The 2 things not up to the mark were the breakfast and the room looked pretty old (but it was clean).",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Super location super hospitality super food and Super experience. Cheers to the Country Inn Team.\nThe first thing i did after coming back from vacation is to grab Their stock. Hoping it to be Multibagger and i will give back every penny to them back. This is kinda once in a lifetime experience. Open air dinner Bonfire good food. Bright Moon in clear sky bone shivering cold and quick turnout for service. Superb experience.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We were here with our group integra the impeccable service and hospitality of your staff made our retreat most enjoyable. We were very impressed by the responsiveness of you and your staff. The room allocations were done with effortless ease as we arrived there. The chambermaids did and outstanding job in ensuring that the rooms were in order and cleaned. We look forward to seeing you again in future. An enjoyable and comfortable stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Loved our stay here with our family and friends. The property is beautiful with greenery all around. The breakfast spread is decent but the restaurant in house is way too expensive. Karaoke night was a fun element .The staff is good. The property is old and a little run down. The only disappointment I have is that they should have redone the rooms. The beds are old and shaky, the curtain blinds are not fixed properly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Lake Resort, Naukuchiatal",
      "rating": [
        4.4
      ],
      "address": [
        "near Latitude29 By The Lake Resort, Naukuchiatal, Saikhola, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "My first visit to The Lake Resort was in February 2023...it was a family trip... we had a wonderful stay... the view from the resort in one word is mesmerising.\nThe property itself is beautiful...you feel so close to the nature during your entire stay.\nThe staff is so well groomed... polite and at the service all the time.... had arranged for a family lunch and it was perfect...all credit goes to The Lake Resort team\nAn ultimate place to stay....highly recommended",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The Lake Resort has been our go-to haven, offering tranquility by the lake, yet secluded from tourist bustle. Its location between a lush forest and Naukuchiatal Lake ensures every visit feels like a serene retreat. The cozy, comfortable rooms complement the natural beauty, making stays peaceful and restorative.\n\nDining here offers variety, from North Indian flavors at the resort to international dishes a short walk away at Magic Forest Cafe. Activities like kayaking and a games room, alongside ample space for kids to explore, enhance the experience, blending adventure with relaxation.\n\nThe Lake Resort epitomizes a serene escape amidst nature, perfect for rejuvenation and family time in Uttarakhand's picturesque hills.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Rooms - good size and very cozy . No complains at all.\nThey provide room heater as well .\nLocation - it’s a big property with very nice scenic view . Lush green forest , mountain and lake - it has everything one can ask for .\nVery peaceful area .\nFood - it’s very good . They hVe 2 cafe. They serve all continental , Italian food , and Indian food . Tasty food . Pizza from latitude 29 cafe is very good .\n\nService - very quick service . Staff is decent and helping .\nGood place to slow down the life and enjoy your vacation .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The location is picturesque,  however is spoiled with the management.\nUpon arrival we were given a dark and dingey room, with bare lighting. Upon several requests an electrician was called upon who then finally put an extra light.\nHowever, the horror doesn't end here. The room itself seems like hasn't been cleaned in ages. The carpet stinks and the walls are completely clamped and dusty.\nMoreover, the washrooms don't work. The flush stopped working after 1 time and the water gets clogged in the washroom. Upon complaining about this, the hotel sent someone who not only didn't do any repair work, but made the washroom even more dirty since he wore his shoes and went in.\nTheir linen is in a pathetic condition. Seems like rats have eaten away into it.\nPaying almost 10k for such a room is completely pathetic.\nThose coming here, please beware about your stay in this resort which they claim is the best.\nIf you don't believe me, see for yourself in the images posted with this review.\nThe Lake resort thank you for making my stay even more pathetic and miserable.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "A brilliant location to begin with, the lake boasts a great population of fish (although fishing is not allowed). They have boats available for a ride on the water, lovely breakfast spread available as well. The rooms leave a bit to be desired in the case of privacy, but if it rains and you're fortunate enough to be nearby. It is a lovely time sitting in the balcony, getting good food and reminiscing about the times past and times to come.\n\nWould definitely recommend a stay, lovely cafes nearby as well. A bit pricey on the food side, but then again, getting good quality food here comes with a price tag attached.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Sea Hawk Hill Resort Bhimtal | A Luxury Boutique Resort | Nainital-19Km | Wedding Hotels | Adventure Camping | Cottages",
      "rating": [
        4.6
      ],
      "address": [
        "Nal Damyanti Tal Road, Bhimtal, Near, Bhimtal By-pass Rd, Bhimtal, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Stayed in premium cottages with family and kids, Rooms were clean and very good, washrooms were also good. Play area for kids is available and also activities available on property. Property is well maintained and staff is courteous. Food was tasty. Stay for 2 nights was wonderful.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Great service, clean room, ample open space, clean swimming pool. Excellent staff.\n\nI like overall ambience, too many activities for children like pool table, carrom, fuse ball, zip line, cycling.\n\nFood tastes same as delhi's Punjabi restaurant.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The resort boasts well-appointed rooms equipped with modern amenities to ensure a comfortable stay. The on-site restaurant serves delectable cuisine, and the friendly staff is always ready to assist with any requests. …",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Our stay at Hotel Seahowk was enjoyable, thanks to its peaceful location, friendly staff, and comfortable accommodation.   This hotel boasts a range of amenities, including a well-maintained swimming pool, a spacious dining area serving delicious local cuisine, and comfortable rooms. The rooms are spacious and tastefully decorated, with comfortable beds and large windows offering panoramic views of the surrounding landscape. Additionally, they offer fun activities and games.\nWe would recommend this hotel to anyone looking for a relaxing getaway in Bheemtal.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "It's written 4 star property..and have spa\nBut nothing like that..I stay there for 4 days and in my room there was no hot water and asked them to get it checked....they said after taking out 1 full bucket of water,,then you will get hot water...so I skipped my bath and used my friends bathroom\nFood was also ok ok...same menu everyday in breakfast...so monotonous\nFor kids the play area is old and rusted...swings are not in good condition ....you are charging 8000 per night charge and this type of service is not accepted...\nWould neither visit again nor recommend to anyone",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "The Fern Hillside Resort, Bhimtal (Nainital)",
      "rating": [
        4.2
      ],
      "address": [
        "69, June Estate, Bhowali Range, Bhimtal, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Overall, a wonderful stay for our 3-day trip at Bhimtal. The road to the property is much better than other reviews say, it can still take some getting used to driving 2 km up the hill. Food was good, we ate most meals at the hotel and had got all the help we needed",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I loved the stay at Fern, first my daughter got sick and Vinita and Shradha from front desk made sure, our date time is changed, after reaching myself got some health issue and she made sure it is taken care. Food is awesome, staff is great and humble. will come back again.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The property is good but staff is not cooperative every thing is chargeable here even water also, they’re only making money\nIndore games are chargeable and it’s timings is only two hours they give excuses that rooms are near so you can not play games. before using swimming you have to wear swimming suits if you don’t have you should buy from here, really live singing times 6 pm to 7 pm by the karaoke 😂 ridiculous please don’t book this resort.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Our stay was very comfortable. Staff was very friendly and providing and taking care of everything. The best part of this resort is food. Breakfast and dinner was awesome. We came here on 24 Dec so Christmas celebration was too good. We danced and enjoyed every bit of stay. Pankaj and Anand Sir helped us a lot and make our stay enjoyable.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I recently stayed at The Fern Hillside Resort and had a delightful experience. The food was delicious, the service was prompt, and the staff was exceptionally courteous. The views from the room balcony were breathtaking, offering a perfect blend of nature and tranquility. The only inconvenience was the road to the hotel being under repair, requiring a wait for a local taxi to transit between the hotel and parking. Despite this minor drawback, the overall stay was enjoyable, and I would highly recommend the resort for a peaceful retreat.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Rosefinch Sarovar Portico Bhimtal",
      "rating": [
        4.3
      ],
      "address": [
        "June Estate Rd, Bhimtal, Harinagar Chanddeva, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "This place is quaint and cozy. You ll love it.\n\nStaff at Reception and for Check in are Good.\n\nFood at Restaurant is Expensive but good.\n\nHowever, serving staff at Restaurant is arrogant at times for no reason. I believe we are there to de-stress and not to take attitude from them and increase our stress. F & B Manager is too polite to handle them.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We visited the top three highest-rated hotels in Bhimtal before deciding on this one. It’s a small boutique hotel with 35 rooms. Despite its narrow and steep access road and limited parking, the location is fantastic. The rooms are impeccably clean, with well-maintained bathrooms and a central heating system. Nearly every room offers a stunning view of Bhimtal Lake. The staff is highly professional and efficient. While dinner was exceptional, breakfast fell short, with limited options and average quality. However, the hotel boasts charming outdoor seating areas, making it the best choice among Bhimtal's accommodations.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The spacious rooms and friendly staff makes this location a worth visit. All the rooms are lake facing, so you get a view of the Bhimtal lake. The food is quite decent at the restaurant . Do try their masala chai for hi tea. They have a shuttle service till parking, which is convenient. Do take care of monkeys which keep on coming to the balconies so keep the sliding door shut.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best property in Bhimtal in terms of location, cleanliness, hospitality and food.\nIt's located just 200m away from the lake as well as the Nainital bypass road.\nProperty was well lit with XMAS lights. We also had a bon fire in the eve. The staff is extremely hospitable. The breakfast was quite exhaustive. The views from balcony are gorgeous and the property has ample of courtyards.\nWould love to visit again.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Stayed here for 2 nights in the month of March 2024. Property is very good. Opposite the lake, all the rooms face the lake but from all the rooms view is obstructed by the trees. No advantage of a luxury room as Dlx rooms are also big, additional seating advantage with luxury rooms may be useful only if you tend to relax in the room only. Beware of monkeys. Family rooms for 4 are spacious but only 1 toilet. Food is good. The staff is cordial. Can visit nearby saattal, naukuchia tal, kainchdham. Adventure sports like paragliding are available @2000 INR per person. Nainital is about 1-1.5 hrs away depending on the traffic. Overall a very good property. Still during the office season one may prefer staying in Nainital.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Neelesh Inn - A Luxury Lake View Hotel (20 kms from Nainital)",
      "rating": [
        4.3
      ],
      "address": [
        "Nainital near bhimtal lake, Bhimtal, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Our stay at the hotel was exceptional! The staff was friendly, the room was spacious and clean, and the amenities were top-notch.I can't say enough good things about this hotel. The location was perfect, the service was impeccable, and the views were breathtaking.\nFrom check-in to check-out, our experience at this hotel was fantastic. The staff went above and beyond to make our stay memorable.This hotel exceeded all of our expectations.\nWhat a gem of a hotel! The attention to detail in every aspect of our stay was impressive. We felt pampered and well taken care of the entire time .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It was very serene and pleasant stay amidst of mountains and Bhimatal lake. We opted for superior lake facing room and the view was spectacular! Room was tidy, neat and clean. Tasty food, lovely outdoor deck and helpful staff. Enjoyed our stay 😀",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I had an incredible stay at Hotel Neelesh Inn. The lake view from my room was breathtaking, and the attention to detail in every aspect of the hotel was exceptional. The staff were incredibly hospitable, and the dining experience was unforgettable. I highly recommend Hotel Neelesh Inn to anyone seeking a luxurious retreat in a stunning location. Can't wait to return!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Amazing experience! Had visited with friends. It has all kinds of facilities you would expect from a good resort. Also, the dinner was amazing. Very spacious rooms.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We stayed at Neelesh Inn for a day, the property in first impression is beautiful!\nIt is huge, has 27 rooms, the view is mesmerizing as it is just next to bhimtal lake. The rooms are good in size, they have heaters in the room which are very impactful. Coming to the food, they serve delicious food as well. The breakfast buffet was great too. The variety is there and each item tasted great.\n\nDefinitely RECOMMENDED!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Harshikhar",
      "rating": [
        4.4
      ],
      "address": [
        "Lake, Bhowali-Bhimtal-Haldwani Rd, near Bhimtal, Bhimtal, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Their Pinewood Restaurant serves delicious food with breath-taking lake view. Also during  evening hours, a singer performs there with his Karaoke System. You may  sing one or two songs, if you feel like.\nVery soothing atmosphere.. superb service👍🏻\nLocation is On road running along with the Bhimtal Lake. Parking is a bit typical.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Visited this place for On Board training by our Company.\nThis Hotel is situated at the bank of Bhimtal and gives a full view of the mesmerizing nature around.\nI have shared the pics of the hotel and the views which can be seen, I hope you will like it ! ❤️\n\nAlso, I would like to share the experience in following points:\n- Location 5/5\n- Natural View 5/5\n- Rooms 4.5/5\n- Room Service 4/5\n- Food 4.5/5\n- Food service 4.5/5\n- Reception service 5/5\n\n(This is a personal experience, ratings might vary person to person)",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hotel Harshikhar one of the best hotels I have visited.\nGreat Bhimtal view, good ambience, good staff, good food and great service.\nLoved each and every food item I ate here and loved that they made everything without Onion and Garlic specially for us.\nHad a good and memorable stay.\nStaff also consists of a mind blowing singer, do ask for a song.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Wonderful hotel with a breathtaking views.very nice ambience all over. Rahul, Vishal & Toddler welcomed me with warmath as soon as I stepped in, served me gently, and addressed me all about hotel and town.this is an amezing hotel quite and clean. Worth to stay here.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "If you are coming to Nainital/Bhimtal, this is the best place to stay. This place is so beautiful. The rooms are clean and have all the facilities. This hotel’s staff (Mr. Pyare Mohan, Mr. Anoop, Mr. Munna Lal, Mr. Rahul and all others)is so polite and shows the utmost hospitality. I have never come across a hotel which has such good food, great hospitality, positive vibes, clean and perfect balcony-lake-facing rooms(clubrooms). They have the best chef who can cook anything with such a flavor. Everything we order was delicious. Also, they have good variety in their buffet. All of us had such a comfortable stay at this place.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "The Lake Hill Hotel - Bhimtal",
      "rating": [
        4.3
      ],
      "address": [
        "Near main boat stand , Bhimtal Daant, Daa, Bhimtal, Harinagar Chanddeva, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "Best located hotel in Bhimtal.\nIt is located at centre location of Bhimtal walking distance from boating stands & with nearby shoping options.\n\nIt has restaurant which serves breakfast, lunch & dinner.\n\nFood is hygienic.\nWe stayed for 3 nights @ Rs. 6000 per room with breakfast included.\n\nBest part is Balcony from where one can enjoy the Lake view whole day.,😄😄\n\nIt also operates a Beautiful Aquarium+ Cafe in middle of Lake - to enjoy the evening.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The lake hill hotel, unfortunately is not what it seems on the photos and pics.\nProperty is not at all well maintained.\nReception area was not very clean or well kept. When we entered the room, I saw a lot of stains and marks on the walls. Using the washroom, I found the hand towel to be really dirty and the bath towels were not very clean as well. The bedsheet had hairs all over and it was stained as well.\nAlso the restaurant didn't live up to the hype.\nEven the location of the hotel is not on the front side, its on the back side of the taal so there is not much to do around.\nPaying so much for this kind of exp is not at all senseful. Better look for properties in nainital or on the other side of the bhimtal.\nWouldn't recommend anyone to stay there in regular season, may be in peak season you will find some crowd or something interesting but again the exp when compared to the money they charged was hopeless. Basic utilities were not upto the mark even after paying around 7k for one night.\nBetter stay in hotel Alka on the nainital mall road or even you really want a hotel in bhimtal there are other options available in this price category, go for them or book some cheaper hotel nearby because its a waste of money for this kind of exp.\nI hope they see this review and work on their service.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It's a cheap old 2 star hotel. Light kept getting cut almost every hour.\nRooms were below average and the toilet seat was broken.\nTook 30 mins to unload our luggage and bring to our room.\nThe road downstairs is very noisy and there's traffic all the time.\nUnsafe as power cut happened many times while people were taking shower ( can't see in the dark and may slip and fall)\nThey also charged me for an extra mattress but denied to refund the amount.\nThe only good part is the lake view and location",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I had a very bad experience with the staff. I was there with my family, there was no water available from 6 AM to 11 AM in the hotel. After informimg the staff they didn't even helped us but misbehaved as well. They were not at all ready to provide a solution due to which our whole day was wasted. Even after telling them to get us connected with their seniors they had no response. We faced a lot of problem as there was not a single drop of water. Very very bad service from the staff.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "It was a pleasent stay. Nice food. Nice view. And staffs were very polite and Quick service provider. Room no. 101 ritesh",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Merak Resort, Bhimtal",
      "rating": [
        4.4
      ],
      "address": [
        "Mehragaon, Bhowali - Bhimtal Rd, Bhimtal, Bhowali Range, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "I had a fantastic stay at the Merak Hotel. It was a family event and get together organised over there. The staff was incredibly welcoming and attentive, making us all feel right at home. The room was spacious, clean, and beautifully decorated. The view outside the balcony was heavenly. The hotel's amenities were top-notch, from the delicious on-site restaurant, swimming pool, lush green lawns and ample parking space. I thoroughly enjoyed my time there and can't wait to return for another visit. Highly recommended!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It’s very beautiful hotel 🏨 in bhimtal . And service was very nice , people around helpful and polite. I just want give big thanks to ( Mukul ) he was very humble and nice . I appreciate his work .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The Services of this Hotel are very Good.\nStaaf and Receptionist are quietly well behaved.\nPool was extra ordinary. View of the nature is awesome.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Best locality\nFriendly staff\nGood food\nNice place to hangout with friends and family",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Its an great Exprience at Merak Resort all the staff was very helpful and hard workers to the food was amazing .\nFront office  Ms. ZARA was fantastic very profsional and friendly with all the Group member am really appricate her Work. Hope i will visit again soon",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "The Nature's Green - A Luxury Resort in Bhimtal, Nainital",
      "rating": [
        4.6
      ],
      "address": [
        "Sattal Rd, near Naldamyanti Tal, Bhimtal, Bhagtpura, Uttarakhand 263136, India"
      ],
      "reviews": [
        {
          "text": "\"Home away from Home \". A great experience staying with The Nature's Green Resort. Everything was perfect and immaculate. The staff, cleanliness, location, services, food, ambiance and booking process.\nMorning view of sunrise, evening sunsets, night bonfires..It was indeed a getaway. Highly recommended for people looking for a complete mountain package. The resort is located at a prime location with all the tourist places in nearby vicinity.\nThe humbleness and coordination of staff feels like a family. Loved the stay!\nAll the best team Nature's Green.. miles to go 👍",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This is a must visit property... Right from the moment we entered and till the time we checked out, the experience was amazing. The staff was friendly and helpful. They made our stay enjoyable and comfortable. Views, Rooms, Food everything was on top. I would recommend everyone to experience at this resort.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I had an amazing experience staying in The Nature's Green Resort. Food was amazing and staff was very polite. Especially Ankit and Prakash took very Good care of us.\n\nProperty is very clean and beautiful build.\n\nI give 5/5 ratings and highly recommend this Resort to travellers'.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had an amazing stay.. the resort is located away from all the city hustle so its very relaxing to be in between the mountains. The rooms and washrooms very clean and beautiful, food at the restaurant was also very good. The staff was very helpful and courteous, they also prepared less spicy food for our toddler",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I recently stayed at Nature's Green Resort, and it was an absolute delight. The lush surroundings and well-maintained grounds provided a serene atmosphere. The staff's hospitality was outstanding, always going the extra mile to ensure a comfortable stay. The variety of amenities, from the inclusion of billiards and table tennis added fun.The buffet offerings for both breakfast and dinner were diverse and delicious, catering to various tastes. The convenience of having such a range of activities and dining options within the resort made the overall experience enjoyable and memorable. I'd gladly return to Nature's Green Resort.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    }
  ]
}