{
  "places_with_reviews": [
    {
      "name": "Tanishq The resort of fun",
      "rating": [
        4.1
      ],
      "address": [
        "Vijiyaraje sindhiya Gaurav Path Road Back side of, govt college, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Its a good place for celebration whether its small or bigger. Food is also good in the restaurant.\nThere are few rules and regulations : -\n1. Strictly Vegetarian\n2. No eating inside rooms\n3. Swimming inside pool charges are separate\n\nOtherwise good location and sizable area.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Tanishq The Resort of Fun transcends ordinary getaways, offering an extraordinary fusion of comfort and entertainment. The resort’s commitment to cleanliness is commendable, with spotless interiors and well-maintained surroundings that immediately set a positive tone for the stay.\n\nThe strategic location is a highlight, providing a peaceful retreat away from the hustle and bustle, yet conveniently accessible. The resort's services are impeccable, with a staff dedicated to ensuring a seamless and enjoyable experience for every guest.\n\nThe parking area is spacious and well-organized, providing a hassle-free arrival. It's evident that thoughtful planning has gone into creating a welcoming space for guests from the moment they step onto the property.\n\nThe pool and garden areas are true gems of Tanishq. The pool is pristine, inviting guests to unwind with a refreshing swim. The manicured gardens add a touch of tranquility, providing a picturesque backdrop for leisurely strolls or moments of quiet contemplation.\n\nAmenities at Tanishq are designed to cater to diverse preferences. From recreational activities to wellness facilities, the resort has curated an array of options to ensure a delightful stay for individuals, families, or groups.\n\nAn additional noteworthy feature is the provision for hosting special events. Tanishq accommodates bookings for weddings, birthday parties, family gatherings, and small programs. The resort’s versatile spaces and attentive staff make it an ideal venue for memorable celebrations.\n\nIn summary, Tanishq The Resort of Fun stands out not only for its fun-filled ambiance but also for its commitment to cleanliness, strategic location, top-notch services, spacious parking, inviting pool, and well-maintained gardens. It's a haven where every detail is carefully considered to create an exceptional experience for guests seeking relaxation and enjoyment in equal measure.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's good property, kind staff and decent service. But can be improved looking at the price they charge, the category they consider them self, still things can better up.\nBetter management of property, availability in kitchen, timings can be extended. Phones need to repair, it was dead.\n\nOther wise staff was kind behaviour was good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I had a wonderful experience at the Tanishq Resort. One of the best hotel/resort I’ve ever been privileged enough to stay at. Beautiful building. It  gets more breathtaking when you walk in. High quality rooms, and high quality service. Special mention to Mr. Himanshu. He was delightful and eager to help! Thank you Himanshu!\nFood was delicious. Kitchen staff to cleaning to helpers, everyone was very polite, and well behaved and helpful.  Will recommend to everyone for a weekend, official, personal trips or destination wedding etc.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms were full of houseflies and whashrooms are too dirty . Bedsheets and pillow covers are messed .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Raj Palace, Nimbahera, Rajasthan",
      "rating": [
        4.2
      ],
      "address": [
        "Marjivi choraya, Nimbahera Bypass, NH79, Nimbahera, Sigri, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Nice place\nFamily Restaurant,\nFood is good and tasty.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very good food .super quality staffis really good and polite behaviour.owner is also very good",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel's food and drink offerings exceed expectations with exceptional quality, variety, and attentive service.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The experience could have been better if the service staff would have been more attentive. The waiter serving us was super rude and arrogant. The table across us was full of dirty plates and filth. When we asked that to be cleaned, he asked us not to sit in the AC hall. It was his job to clean which he eventually did after we complained to the manager but attitude problem in service staff is a big red flag 🚩 for me.\n\nThe food was ok",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good food with best quality",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Royal Paras Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "JMHF+QCH Besides Paradise School, College Rd, Vikram Nagar, Ramesh Nagar, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Nice place to stay although maintainance is undergoing at the hotel they are providing good services.\nRooms are spacious and comfortable food quality can be improved.Overall you can choose this place if you are visiting this center.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It was an amazing experience to stay here. Rooms was very nice and clear.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Wonderful place, visited 5-6 times...",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Power cuts for more than 1 hour and they say they cannot do anything  about it. They don't have generators also. And charges of hotel is above 2K and they call themselves a star hotel !\n\nSelf was not able to charge laptops and mobile, but nobody cares about it.\n\nNot a good hotel for anyone.\n\nHotel does not care about customers requirement and concern.\n\nAll the best !",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "It's good but the problem is that they have 2 gardens and one of the 2 has a lot of wild grass growing. They don't even cut it out.\nThe reason for 3 star is also that the pool over there is very small. It's about 25 m and the maximum dept is about 4.5 feet\nVery good hotel in the town. Well furnished a/c rooms. Located on main road. Having big lawn to arrange marriage or other parties. Big parking lot and conference Hall.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "SPOT ON 43460 Kanchan Resort",
      "rating": [
        3.8
      ],
      "address": [
        "JMPG+68M, Nimbahera - Chittorgarh Rd, Atal Nagar, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "In summary, my recent stay at Kanchan Resort presented a well-rounded experience. The resort's design with two entrances and two buildings is convenient for events, especially weddings. The rooms in one building were comfortable, accompanied by an efficient lift service. Despite facing challenges with water availability and less-than-satisfactory staff response, the lush green garden and meticulous cleanliness of the property added to the positive aspects.\n\nFurthermore, the inclusion of a spacious hall and a domed area for open ceremonies, shielded from rain, direct sunlight and any other weather conditions, showcased the resort's commitment to providing versatile and accommodating spaces for various events. Despite the water availability issue, the overall experience was positive, with the resort's attention to detail and thoughtful amenities making it a recommendable destination.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Visited first time Nimbahera to attend wedding function. Place is ok type. Rooms were good but bed quality was very bad. There is big issue of power off and resort should have quality generator. It was taking too much time to start generator whenever power getting off. Resort Garden is good. People (resort people as well catering people) should maintain hygiene as I seen very poor quality of hygiene maintained during function.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Awesome Hotel ,where you can enjoy openly because of wide field area of that Hotel",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good place for marriage and other functions.\nEnough space for parking.\nHowever entrance is no clearly visible from road.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are spacious but not neat and clean. Outer area for function is quite spacious.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "CK Hotel Nimbahera",
      "rating": [
        3.9
      ],
      "address": [
        "Eidgah Chauraha, Udaipur Rd, RSEB Colony, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Taste is so good. Complete satisfaction. Service and hygiene is also up to the mark.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "You can stay here, however, geager was not working and it's overvalued. Like paying ₹1500 for room is costly.\nPlus for food you need to go out somewhere.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "today i order special ck pulao, and they gave me the sweet rice only, its very cheap thing, i expect more quality in this",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Best hotel, restaurant and resort in Nimbahera.\nOne of the best in Chittorgarh in terms of taste, service and management.\nLocation is amazing.\nOverall one of the best hotel for premium and luxury class people.\nLuxurious rooms with all basic amenities. Superb service.\nMulti-cuisine restaurant with an excellent taste in each dish. Good service.\nA well maintained resort with a superb swimming pool.\nOverall a brilliant place for a hangout or party or for organising functions.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "In Nimbahera, \"CK Hotel\" is renowned name for quality service.\nVery good place, well maintained & serve great food in Breakfasts, Lunch and Dinner !🍽️🍽️🍽️🍽️🍽️\nThere is well equipped swimming pool for Refreshing.🌊🌊\nStaff is well trained & well behaved. Management is too friendly. 👍👍👍👍👍\nAC halls n Rooms are well furnished n equipped. ✌️✌️✌️✌️✌️\nThere is a good amount of open space to walk n for parking too. 🚉🚉🚉🚉🚉\n\nValue for money 💎💎💎💎💎\nService 💎💎💎💎.💍\nLocation 💎💎💎💎💎\nRooms 💎💎💎💎💎\nSwimming pool 💎💎💎💎\nCleanliness 💎💎💎💎💎.💍\nFood 💎💎💎💎.💍",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "HOTEL CHETAK AND FAMILY RESTAURANT",
      "rating": [
        3.6
      ],
      "address": [
        "Nimbahera Bypass, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "The food was very good, just like home",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Food quality is good, service was super fast. Good place to go with family. They have separate family room",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Quit Good Place For Booking for  10 people Especially For Bachelors we are here for 7 days staff are very very kind polite and Friendly.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Nice place for Dinner. Service in time. Hygiene condition. Cool atmosphere. Quite environment.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Cheap and cheerful place on NH 79, just outside the town called nimbaheda. The food here is decent with good quality. The place is pure vegetarian hence avoid if you want non veg food.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Pride",
      "rating": [
        3.9
      ],
      "address": [
        "Near, JK Boundary Wall Rd, Adarsh Colony, Raza Colony, Adarsh Nagar, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Enthusiastic front manager, convenient location and large size rooms all good but cleanliness of room, bath and corridor was missing.\nThey must focus on cleanliness.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good place to sleep or lie down for a few hours if you're attending a wedding or something nearby.\n\nProblems:\n- unclean sheets\n- slow service\n- they will put lot of sugar in tea, so make sure you tell them to adjust according to your needs.\n\nGood:\n- has LCD TV\n- nicely furnished room with huge bed and good sofas\n- cheap: I had paid 1000 for 1 day, although I barely stayed for about 10hrs.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice hotel but not good rooms and services there is combine restorent and bar.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The experience was nice but the lift was not good. One time it stopped when I was in it . It can carry only four people although it was written that it can carry 8 peoples",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel STAFF have good communication skills",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Sapna",
      "rating": [
        3.7
      ],
      "address": [
        "Chittorgarh NH-79, Chittorgarh, Nimbahera - Chittorgarh Rd, Ahir Nagar, Kamdhaz Nagar, Nimbahera, Rajasthan 312024, India"
      ],
      "reviews": [
        {
          "text": "A hotel by name. Rooms are below average.\nSituated 1km away from NIMBAHERA railway station towards chittorgarh. You can have booze and eat together. Staff is supportive.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very nice beer bar the service here is very fast and the rate is also normal",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Only proper non vegetarian Bar cum Restaurant in Nimbahera.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very good hotel and room service. Varieties of Veg and Non VegTasty food made available. It has a bar and above average ambience.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "We ordered non veg food but taste is horrible",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "HOTEL CITY STAR AND RESTAURANT",
      "rating": [
        3.5
      ],
      "address": [
        "JMCP+749, Shanti Nagar, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Nice food and good service",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Nice Home",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Worst place ever, the food is not eatable to animal, late service, fake company item used in food, no discount, all food rate are double, not suitable to family, served cold food.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Bekar hotel. And staff. AC room me AC he but uske remote nhi. Night me AC off kr dete he. Then pucho to hotel chodne ka bol dete he...",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Vishwakarma",
      "rating": [
        3.7
      ],
      "address": [
        "Opp. Bus Stop, Mandi Chowraha, Bapu Basti, Nimbahera, Rajasthan 312601, India"
      ],
      "reviews": [
        {
          "text": "Pls ...Dont ever visit...they are cheaters...if you are staying in a room.. If somebody is there who pays little extra than yours...they will forcefully asked you to vacate the room and shift you in another room. That really hurts. No areation at all. Conjusted rooms... Everywhere you can feel bittrr smell. No food... Not a pleasant stay.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Co operative.\nDidnt cost much too.\nNice budget rooms in the heart of the city",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A good option to stop at the bus station area of ​​Nimbahera city",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Satisfactory stay. Beside the Bus stand , in the centre of the town. Easy approach. Economical.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good rooms at less cost... It's just beside of nimbahera bus stand..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    }
  ]
}