{
  "places_with_reviews": [
    {
      "name": "Abhaneri Village Safari Camp",
      "rating": [
        4.5
      ],
      "address": [
        "2J76+P74, Abhaneri, Jassapara, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "It was an extremely beautiful place and we enjoyed there. Delicious food and received a warm welcome.\nI will definitely recommend this place. Rooms were cozy and clean.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I had an outstanding staycation. The tent accommodations seamlessly blended luxury with nature, offering every modern amenity amidst serene surroundings. The service was impeccable and the food was so delicious. A must-visit for a unique and rejuvenating getaway.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Had an amazing weekend getaway here. The location was lovely, the food was great and filled with variety. The service was upto the mark and absolutely loved the rooms. Would love to recommend it to all .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The staff and service is really good. They were very accomodating to our requests. Food is really delicious. On top of all my Famliy and my Son had a great time here.\nThe place is an awesome getaway from the hustle bustle of a busy lifestyle.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "It was a amazing experience. Food was very delicious. Lovely place for kids and to enjoy quality time with family. I recommend it to all.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Chand Baori Restaurant",
      "rating": [
        4.8
      ],
      "address": [
        "Chand Bawri, Step Well, Abhaneri, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "Amazing Rajasthan typical food.\n\nThe restaurant is just 2min from Chand Baori Stepwell attraction. The staff were very friendly and welcoming.\n\nMainly Vegetarian but also Vegan friendly.\n\nAll the dishes we had were delicious. Very well prepared and presented, with lots of herbs and interesting flavors.\n\nWe definitely recommend this place!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Hello! We came there for lunch and ordered sweet lassi, Dal Tadka (with lentils), Palak Paneer (with spinach) and butter roti (bread). We asked non-spicy and finally for the first time the food was truly non-spicy and we enjoyed the taste of every ingredient. Lassi so far was the best one here. The dishes are extremely tasty, we were so happy for our lunch. The place is family-owned and very well-curated, you perceive cozy atmosphere of a countryside and relax in a peaceful environment. Strongly recommend this place, thank you!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Nice food, excellent service. They are trying to be all organic. The plates etc were all leaf plates. Just behind they have their own farm where some of the veggies they serve are grown there.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "We stopped at Chad Baori on our way to the restaurant and it was a very nice experience.\nThey made food not too spicy for us and the guest were very nice and talkative.\nThey also showed their garden and where they produce nick and vegetables.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Amazing restaurant with delicious home made food . Super friendly family atmosphere. Among the nature this restaurant is situated amoung the green 💚 fields of wheat and mustered.  Lovely people .",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Shahpura Abhaneri Resort",
      "rating": [
        4
      ],
      "address": [
        "Opposite Abhaneri Step well (Chand Baori), Abhaneri, Baswa, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "Just 5 minutes walk from the stepwell this hotel is an oasis - lovely gardens, a swimming pool (a little murky but still great to swim in) and beautiful rooms. Not much choice on the menu and the electricity and water occasionally goes off, but worth it to stay in such a lovely place. We visited as part of an Intrepid tour, my favourite hotel of the trip.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A great place to stay thanks to mister Neeraj Sharma who keeps doing everything to let the travellers feel comfortable. It was extremely nice to enjoy the gardens, the swimming pool and the extremely comfortable rooms. Thank you mister Neeraj Sharma.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very lookings hotels Shahpura abhaneri Resort excellent service excellent room excellent food",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very very very disgusting experience. Charges extremely high prices for the rooms which is absolutely not worth full seeing the hospitality and service. Rooms aren’t maintained according to the charged prices. Jacuzzi in the suite room is only for display as it has no water supply. Very rude behaviour of the owner. No hot water supply even during peak winters. There’s only two staff in the hotel doing all kinds of work. Please don’t opt this hotel as its just a waste of money and time.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The property is just opposite to Chand Baori.\nIt's a very quiet place.\nThe staff are always smiling and ready to prepare your meals.\n\nWe got the opportunity to be hosted by the owner  Mr.K.K. Singh. His warmth and hospitality show through all his actions throughout our stay.\n\nThe rooms were very spacious.  The furniture and decor were very tastefully done.\nThe food was very homely and tasty.\nWe enjoyed camp fire and star gazing too.\nCan't forget to mention the company of the peacocks, peahens and squirrels!",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "chaudhary hotel and guest house",
      "rating": [
        5
      ],
      "address": [
        "XHWC+JJ2, Bandikui Rd, Syalawas Khurd Rural, Peechupara Khurd, Rajasthan 303313, India"
      ],
      "reviews": [
        {
          "text": "Good one",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Gurudev kripa hotel & resturent peechupara khurd",
      "rating": [
        3.5
      ],
      "address": [
        "XHWC+RCG, Peechupara Khurd, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "A place to get breakfast, lunch and dinner on the way.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "It is a petrol station not an hotel",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Place experience l am interested this place",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Nice food",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "A good conversation",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Sanjay Anday Vala",
      "rating": [
        "Unknown"
      ],
      "address": [
        "2H29+F99, Peechupara Khurd, Rajasthan 303326, India"
      ],
      "reviews": []
    },
    {
      "name": "Lokesh kumar prajapat",
      "rating": [
        5
      ],
      "address": [
        "XJJ9+RVQ, Mariyada, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "blind",
          "languageCode": "en-US",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Vikas bainsla",
      "rating": [
        5
      ],
      "address": [
        "XHMW+HXQ, Bawanpara, Rajasthan 303326, India"
      ],
      "reviews": [
        {
          "text": "Super",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Rukamani seva sadan",
      "rating": [
        5
      ],
      "address": [
        "XHHF+5PQ, Todabhim - Thana Rd, Goojarwas, Rajasthan 303313, India"
      ],
      "reviews": []
    }
  ]
}