{
  "places_with_reviews": [
    {
      "name": "Ramada by Wyndham Alleppey",
      "rating": [
        4.2
      ],
      "address": [
        "Nehru Trophy, Punnamada, Finishing Point, Alappuzha, Kerala 688013, India"
      ],
      "reviews": [
        {
          "text": "The service here is excellent! The hotel it's clean. The rooms were functional. We did have some trouble accessing the channels on the TV and the AC didnt really cool as much as we'd like but it was comfortable and suited our needs. The Venice restaurant had great food and a variety of drink options. The highlight was the houseboat experience. We booked an exclusive ride so it was nice and private with plenty of food, air conditioning, and comfortable seating inside and out. Would recommend staying here!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Everything about the place is perfect.\n\nWe visited for dinner and were treated with exceptional service and a great spread for a buffet dinner.\n\nThe staff were exceptionally well trained, and had great attention to detail.\n\nThe spread for dinner was great and the taste was exceptional.\n\nThe ambience, the location, the service and staff ensured we had a great evening.\nHad a good experience here. If you want to relax and have some good food this is the place. The view from the rooms is good, a balcony would make it even better but we couldn't get one. Really good buffet options.\n\nOverall a pleasant stay.\n\nWould highly recommend.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel is situated at the finishing line of the Nehru Trophy Boat Tri race.\nThe lake view from the room is very beautiful.\nThe Houseboats are available from the hotel for few hours stay or overnight stay.\nThe staff are good, cooperative.\nThe hospitality of the Hotel staff is excellent , but not so professional.\n\nThe rooms are value for the money and they are spacious too.\n\nBuffet breakfast was good.\nIn the restaurant local taste items are less.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It was a really good experience. The property is located quite close to the Alleppey Back waters and also to other beaches around. Rooms were pretty clean and was equipped with state of the art facilities. Good aesthetic vibes all around the lobby. We're greeted with Tilak and the staff was very helpful and welcoming! Would love to visit again!!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We were a group of 8 people the majority of senior citizens. The stay was amazing and memorable. All three rooms were upgraded to the premium Lake view and Mr. Amal was promised that while taking the reservations. Thank you team Ramada.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Sterling Lake Palace Alleppey",
      "rating": [
        4.3
      ],
      "address": [
        "Thirumala Ward, Pallathuruthy, Chungam, Alappuzha, Kerala 688011, India"
      ],
      "reviews": [
        {
          "text": "we have had a very good experience in this beautiful property.\nyour restaurant is excellent with a reasonably good complimentary breakfast.\nthe beautiful and peaceful walkways are really a plus point to the resort.\nthe swimming pool in the centre of the lake to be worth mentioned.\non the other hand the room service has to be improved.\nyour information centre has got no clue about the activities going on in the resort!\nwe do appreciate the positive and helpful attitude of the staff all around.\nin total it was a very nice stay in this marvelous atmosphere and wish to come back again!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Built on an island on the backwaters, the property is stunning, surrounded entirely by water. There are plenty of activities inside the property and you will be too occupied to go to the town during your first couple days of stay in the place. A complementary sunset boat ride was included with our booking - a must have experience at Alappuzha. Make sure to watch the cultural performance that is conducted every evening!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Having recently dined at a local establishment, I find myself compelled to share my thoughts on the disappointing culinary experience I endured. From the moment I stepped through the door, I was met with an ambiance that promised much but delivered little. The decor attempted to exude sophistication, but it felt forced and contrived.\n\nAs for the food, it fell far short of expectations. The menu boasted a variety of options, but the execution left much to be desired. My appetizer, touted as a delicacy, arrived lukewarm and lacking in flavor. The main course, purportedly the highlight of the meal, was overcooked and bland, leaving me struggling to find any redeeming qualities.\n\nFurthermore, the service was lackluster at best. Our waiter seemed disinterested and inattentive, disappearing for extended periods without explanation. Requests for refills and condiments went unanswered, leaving us feeling neglected and frustrated.\n\nOverall, my experience at this establishment was thoroughly underwhelming. While I had hoped for a memorable dining experience, I instead left feeling disappointed and dissatisfied. I cannot in good conscience recommend this restaurant to others, as it simply does not meet the standard expected of a reputable dining establishment.\nWould not recommend this hotel to anyone.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The resort provided a luxurious stay and served as an excellent escape from the city.\n\nService was exceptional.\n\nThe swimming pool surrounded by water was one of the nicest features.\n\nGym, indoor activities, complimentary cruise ride, complimentary breakfast, and free transportation inside the resort are all added benefits.\n\nThe cruise begins at 5 p.m. daily and lasts one hour across the Alleppey backwaters.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We recently stayed at resort ⛵ for a quick family getaway. Despite the short stay, we were impressed by the resort's beautiful location, lake view and well-maintained facilities. The room was spacious and comfortable, providing a relaxing environment for our overnight stay. The staff was friendly and accommodating, ensuring that our needs were met promptly. Although we only had one night, our experience left us eager to return for a longer stay in the future. Highly recommend for a peaceful retreat with family.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Uday Backwater Resort",
      "rating": [
        4.6
      ],
      "address": [
        "Punnamada, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India"
      ],
      "reviews": [
        {
          "text": "Rooms are quite spacious and good. Service in general is good, but staff looks new and need some more training. Entry is through a very narrow road which is difficult via Google maps as well. Evening activities are recommended to ensure there is something to do in the evening.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The stay was amazing. The hotel is beautiful and very well maintained. The restaurant at the hotel was very good and the staff helped us to celebrate our daughter's birthday. They arranged for everything and were available for queries at all the times. Very prompt staff. Service is excellent. Highly recommend to everyone.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The experience was good. The property is beautiful and is maintained. The staff is courteous around the hotel. The in house restaurant is very nice as well. The food tastes great and the staff is helpful, warm and nice.\n\nWe got all the services what we requested for , thanks to the entire staff , the reception and restaurant staff.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The place has a good vibe and great view.\nWith heated swimming pool and ferry rides in the backwater it's a perfect weekend get away.\nGetting to the place is a bit hard but definitely worth it.\nFood is good quality and you can play indoor and outdoor games.\nWould love to come back here again.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Stayed at this backwater resort in Alleppey.\nWhile the rooms were comfortable, the price seemed a bit steep for what was offered.\n\nThe food, however, was fantastic, but unfortunately, the staff seemed slow and disinterested, lacking basic hospitality training. Service for ordered food took unreasonably long.\n\nOn the bright side, the property's location was breathtaking, offering stunning views of the backwaters surrounded by coconut trees and nature's beauty. The supportive guards added to the experience.\n\nOverall, the location was perfect, but improvements are needed in staff efficiency and service quality to match the serene setting.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Pagoda Resorts Alappuzha",
      "rating": [
        3.7
      ],
      "address": [
        "Chungam Road, Mullakkal, Alappuzha, Kerala 688011, India"
      ],
      "reviews": [
        {
          "text": "Even Though the room looks old it is very well kept and clean and it smelled like a garden. We slept like two babies. The bathroom was also clean. Since we came in an electric car the only drawback I found is even though there is a Tata EV charging station within the compound, it is not yet functional. Otherwise the surroundings and the hotel is well maintained.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Decent resort for rate and location, it’s old resort not done much maintenance, decent rooms , breakfast too good , ample parking space and other amenities. Pool I won’t say really great water is old as the resort they should clean and change water frequently . Location is really good you can reach all parts of major aleppy within no time …",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "There are good restaurants nearby, but you can use online platforms to get food at your doorstep. Rooms were clean, good space, and good furniture. Staff service was slow and fir some you have to make repetitive instructions and requeste for menu and food.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Had wonderful experience in the resort.\nServices were excellent.\nVery nice place to have a marriage reception. Food they served for function was tasty.\nI prefer pagoda resort to my friends.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Horrible Rooms:\nI stayed with my family for a day in a Deluxe Superior Room.\n—> Room is having a tube light only.\n—> Room has a spider web\n—> it looks like I am staying in a room of a 500 per night.\n—> horrible experience of staying ever.\n—> cherry on the top the worse food ever from star rated hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Punnamada Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Punnamada, Finishing Point, Alappuzha, Aryad South, Kerala 688006, India"
      ],
      "reviews": [
        {
          "text": "A resort filled with greenery.  The backwaters gives an added advantage to relax and enjoy the water, the house boats. The rooms are spacious, comfortable and clean. The food served is hot and tasty . Staff is very humble and helpful.  All together had a  great time with family. Thank you 😍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A 5-star resort represents the epitome of luxury and excellence in the hospitality industry. Such resorts typically offer a combination of top-notch services, amenities, and facilities to provide guests with an extraordinary and indulgent experience. Here are key aspects that define a 5-star resort:\n\n1. **Accommodations:** Luxurious and spacious rooms or suites with high-end furnishings, premium bedding, and advanced technology for comfort.\n\n2. **Dining:** Multiple fine dining restaurants offering a diverse range of cuisines, often with renowned chefs creating exceptional culinary experiences.\n\n3. **Service:** Impeccable and personalized service with attentive staff trained to meet the highest standards, ensuring guests' needs are anticipated and fulfilled promptly.\n\n4. **Amenities:** Extensive and upscale amenities such as spa and wellness facilities, swimming pools, fitness centers, and recreational activities to cater to various interests.\n\n5. **Attention to Detail:** Meticulous attention to detail in every aspect of the guest experience, from the quality of linens to the design of public spaces, contributing to an overall sense of luxury.\n\nA 5-star resort strives to exceed expectations, providing a lavish and memorable stay for guests seeking the utmost in comfort, service, and sophistication.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had a bad experience last year in this Punnamada resort. We were 8 people.The resort is extremely dirty and poorly managed.The resort seriously needs to evaluate options for improving general cleanliness. Rooms cot with fungus, water also was muddy during our time of stay. They simply told us it was because of their maintenance work. Unprofessionally took care. But food was really good. If you're looking for a hygienic rooms and stay opt for another.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The spa was really nice, if a bit overpriced. The views are simply beautiful. All the staff were really nice to talk to. You might have to receive some furry visitors at night though. Overall, really good :)",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The property is beautiful. It's located on the lovely punnammada backwaters. The furnishing is done in a way that it gives it a vintage look. The food is decent and the staff is polite. If you want to laze around band have a relaxed holiday, it's the perfect place to be in.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Time Square Boutique Hotel",
      "rating": [
        4.3
      ],
      "address": [
        "PitchuIyer Jn, Cullen Rd, Erezha, Mullakkal, Alappuzha, Kerala 688001, India"
      ],
      "reviews": [
        {
          "text": "We stayed here for just over three weeks and, overall, it was excellent. The suite was very comfortable and a decent size. All of the staff - particularly at reception, room service, housekeeping and security - were very friendly, helpful, courteous and always willing to help and do more to make our stay exceptional.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I entered this hotel with a slight appreciation as I was not familiar with the area. First and foremost  we had the complementary breakfast which was sumptuous and filling. The staff there was extremely accommodating. The studio room, was clean and the beds inviting. The washroom was slick and span. Overall we came back smiling and content.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The rooms were well maintained and were totally worth the price. The complimentary breakfast was also good. Free wifi service was available.\n\nThe service of the staffs was extremely great!! Everything asked was provided within a short span of time itself ⭐️⭐️⭐️⭐️⭐️\n\nThe food at the restaurant was great and tasty.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Really a nice place to stay.\nGood service especially in check-in and check-out timings they are flexible in that.\nGo for it if need a wonderful stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Fantastic hotel. Welcoming and helpful with all our needs. Picking us up from airport and taking us to houseboat cruise and then taking us to munnar\n\nStaff friendly and nothing was to much trouble. Restaurant also very nice\n\nOverall brilliant stay",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Classic Regency",
      "rating": [
        4.7
      ],
      "address": [
        "Hotel Classic Regency, Railway Station, Ward Beach, Alappuzha, Kerala 688012, India"
      ],
      "reviews": [
        {
          "text": "I recently dined at this remarkable hotel and was blown away by the exceptional food, elegant ambience, and breathtaking view. Each dish was expertly prepared, bursting with flavor, and the restaurant's atmosphere seamlessly blended comfort with sophistication. The view from the dining area added an extra layer of enjoyment to the experience. The pool area was impeccably maintained, providing the perfect spot to unwind. Overall, my experience exceeded all expectations, and I can't wait to return for a longer stay, captivated by the hotel's hospitality and charm.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "What a gem! [Restaurant Name] exceeded all expectations. The attention to detail in both presentation and taste was impeccable. The menu offers a fantastic variety, and every dish we tried left us wanting more. A must-visit for food enthusiasts!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I’ve stayed here a couple of nights and the rooms are fresh, clean and have everything you need.\n\nThe staff are so friendly and helpful, nothing is too much trouble.\n\nThe restaurant has a good and varied selection of food from Indian, pizzas to international food. I only ate Indian dishes and there were all delicious. The breakfast is good and they’ll cook fresh omelettes for you.\n\nThe location is right next to the train however I haven’t heard any noise.\n\nThe rooftop pool is wonderful with lounges, tables, chairs and umbrellas if needed. They also have a small but good gym.\n\nI recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "\"Highly recommend. The picturesque surroundings, coupled with the warm hospitality and impeccable service, made my stay truly memorable. The room was spacious and well-equipped, ensuring a comfortable stay. The hotel's restaurant served delicious local cuisine, and the on-site amenities, like the pool and fitness center, added to the overall experience. Will definitely be returning!\"",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The Classic Regency hotel is a charming and elegant establishment that exudes old-world charm and sophistication. From the moment you step inside, you are transported back in time to a bygone era of luxury and refinement.\n\nThe hotel's decor is tastefully done with a blend of traditional Regency style and modern amenities. The rooms are spacious and well-appointed, with plush furnishings and luxurious bedding. The attention to detail is evident throughout, from the fine linens to the elegant furniture.\n\nThe staff at the Classic Regency hotel are courteous and attentive, always ready to assist with any requests or inquiries. The level of service is top-notch, with a personal touch that makes you feel like a valued guest.\n\nThe dining options at the hotel are also excellent, with a variety of delicious dishes to choose from. Whether you're in the mood for a formal dinner in the elegant dining room or a casual meal in the cozy bistro, you're sure to find something to suit your taste.\n\nOverall, the Classic Regency hotel is a wonderful place to stay for those looking for a taste of luxury and elegance. With its impeccable service, beautiful decor, and delicious dining options, it's sure to make for a memorable and enjoyable experience.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Venice Iva Residency",
      "rating": [
        4.8
      ],
      "address": [
        "Thottumkal Junction East of District Court, Kidangamparamp, Thathampally, Alappuzha, Kerala 688013, India"
      ],
      "reviews": [
        {
          "text": "This is a great hotel we stayed with friends. Out of the three hotels we stayed in Kerala, this one was the best in every way. The stay,    the staff, breakfast, the individual attention and in quick check & check out. Above all the property in and out very clean up to the mark as all hotels are supposed to be to impress the Guests.  This is the hallmark of hospitality.\nThis is not only my opinion but my friends also agreed with me.\nThey deserve 5 stars rating. Hats off to them for their hard work.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Overall, my stay at the hotel was satisfactory. The location was decent, but not exceptional. However, the standout issue was the lack of attentiveness from the staff. Many seemed preoccupied with personal conversations rather than attending to guests, which was disappointing. Additionally, I found the security team to be unhelpful when it came to parking my car. Improvement in staff training and security assistance would greatly enhance the overall guest experience at this hotel.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "It was a Very nice stay with my wife. Rooms are spacious and clean.All staff are very polite and gentle always had a smiling face. The person i was met at reception Mr Hari is very nice and always ready for help.They also gave us a gift at the time of checkout. Overall great experience there. God will make them more successful in future.❤️🙏",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "The staff here were exceptional! We were unlucky to get food poisoning on our previous leg of the trip. My wife was sick as a dog, she ended up in the hospital. The staff organised transport for us.\nWhile staying at Venice the staff did everything the could to make sure we were okay and looked after.\nWe honestly couldn't have asked for a better place to stay while we had to endure that sickness.\nThe bed was really comfy, the shower had good pressure, plenty of hot water.\nThe room was massive, A/C and fan combo kept us cool while we had a fever.\nOverall, for the price we couldn't have asked for any better",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Couldn't praise the staff more.\nThey helped me so much when I became unwell (due to food at a previous hotel).\nI stayed here for days to rest and they went above and beyond to ensure I was ok.\nThere is a hotel restaurant with food, plain options like soup available for foreigners.\nGreat hot water system for showers.\nComfy room with no weird smells.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Paloma Back Water Resort",
      "rating": [
        4.3
      ],
      "address": [
        "Thottuvathala, Kainakary, Kainakary South, Kerala 688501, India"
      ],
      "reviews": [
        {
          "text": "Best place to stay in Alleppey.  The hotel is well spread out and the rooms are spacious.  The rooms overlook the lake and the views are spectacular.  For a premium you van get the executive rooms with your own sink pool.The swimming pool is a good size and clean with towels readily available. The staff of Paloma are their  greatest asset. They are very friendly and helpful. The chefs prepare an amazing array of dishes and are ready to make it to your taste and likes. Do take the complimentary evening boat ride, worth every minute. We'll done team Paloma and thank you for making our stay an absolute delight. Till next time.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A Serene Retreat….\n\nNestled amidst lush greenery, my recent stay at Palomar pool villa property was nothing short of magical.\nThe villa itself was a sanctuary of luxury, with spacious rooms adorned with elegant furnishings and amenities but the star attraction was the private pool.\nThe attentive staff ensured that every need was met, from arranging soothing spa treatments for my parents to organizing exciting excursions - shikara ride, speed boat etc\nWhether I was enjoying by the pool with family  or indulging in mouthwatering cuisine at the restaurant, every moment was filled with relaxation and bliss.\nIf you're looking for the perfect getaway to recharge and reconnect with yourself, look no further than a pool villa property.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Stayed here for 2 nights as a part of my Kerala Trip The property is beside the lake.The Deluxe rooms are not that great but Premium lake view rooms are really good.They also provide 1 hour complimentary Shikara ride and fishing rods.\nThe only let down is the food.The quality of food was really bad and it needs a lot of improvement .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This resort is quiet interiors where you won't find nothing nearby. You also cannot venture outside the hotel because there's nothing outside its gate. The property is so amazing along with the lake view so that you can just chill in the evening and in the pool. I must say this is one of the best properties I have visited in recent times, but, but, the service is not at all up to the mark. You need to make repetitive calls for anything you require, be it for housekeeping or room service. There are very limited options for vegetarians and the spread in the breakfast was also quite limited. The only saviour of this property is the lake view and the rooms which are quite good. The hotel also provides complimentary one-hour shikara ride which you can enjoy, but there's lack of manpower, personnel to cater to the needs of the guest when we visited in the first week of December 2023. But this resort has got a wonderful sunset view.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great water resort in Aleppy. Little far from town is only negative. We feel great surroundings and extraordinary rooms make us feel great. Beautiful scenery and views. They offer free shikara 1hr ride for the members who are staying in this resort. All photogenic locations around. Lake view rooms make our stay more precious. Must check in resort if you are interested in that budget range.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Royale Park",
      "rating": [
        4
      ],
      "address": [
        "near Pitchu, Junction, YMCA Rd, Vazhicherry Ward, Sea View Ward, Alappuzha, Kerala 688001, India"
      ],
      "reviews": [
        {
          "text": "The sea food was really tempting and good.\nI just feasted on the sea food dishes than go in for a meal.\n\nThe traditional meal with all the ancillary side dishes are a treat..\n\nThe sea food used to be much better in the past and has to make a come back for sure.\nRP is known for its quality.\n\nThere’s a rush during the peak lunch hours and dinner hours..\nBook your table to have a hazel free dining.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Came today to pickup/order food and F&B staff has been extremely non courteous !\nI would put it as a rude way of handling a customer.\n\nNot sure this is bcos of a busy day but we have ordered food umpteen number of times and such a behaviour has been for the first time !\n\nBeing in service industry not one day schedule can change the attitude towards customers I guess as customer service has to be a daily schedule affair.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It is good for business as well as family stays.\nIt can be used as a transit hotel where in you don't need to spend much time at the hotel.\nIt's a very decent stay. Everything is up to the mark.\nFood is good.\nProximity to the Houseboat is a big plus.\nThe auto rickshaw Stand is just outside the hotel.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I will have to say, that this hotel is best in termsof rooms, service and food. Good rooms, spacious and very nice breakfast. Breakfast is on ala carte basis. Dosa was wonderful. Plus this is located amidst the Allepey city. So market is huge. There is also a dominos opposite to this.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We had recently visited the restaurant...and was amazed by the wonderful food spread that they served...\nThe rates where economical,the food was fantastic and the service was fast.\n\nThank you soo much team Royale Park for giving us a wonderful traditional experience.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}