{
  "places_with_reviews": [
    {
      "name": "Hotel Alchi Zimskhang",
      "rating": [
        4.5
      ],
      "address": [
        "Hotel Alchi Zimskhang, Alchi Chhoskor, Alchi, 194107"
      ],
      "reviews": [
        {
          "text": "Every time I come to Alchi, I always stayed here. This is probably the best hotel in Alchi.\nThe hotel is close to Alchi Monastery. Very good location.\nThe owner and staff are good, helpful and attentive to every guest. The chef served congee during breakfast per our requested.\nIt is recommended to open the windows in the room slightly to allow ventilation. Otherwise, you will have altitude sickness.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Tried the restaurant after visiting Alchi Monastery. its just few minutes walk from there. We ordered paneer dishes, rice and roti, it was average. We also tried Leh special Apricot juice from here. It's highly recommended to this while you are in Leh. They have really cozy seating areas located outside.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We enjoyed the stay. Very close to the Alchi monastery. Very professional and polite staff. Food was excellent. Rooms are spacious and well-lit. This review is for the new wing. Will recommend this place.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent stay...All staff members r super..they go out of their way to make our stay wonderful...Rooms r super clean...food is super... excellent location..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Best hospitality! Right from the owner to manager, staff, chef everyone takes personal care. The rooms are spacious with balcony overlooking the mountains. The best experience is the Apple Tree garden restaurant - delicious food & perfect ambience.\nAway from the hustle of Leh, perfect place to stay for couple of nights. The Alchi monestry itself is a 2 min walk and amongst the best in Leh",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Duke",
      "rating": [
        4.4
      ],
      "address": [
        "Srinagar - Leh Hwy, 65W7+8VQ, Saspul, 194402"
      ],
      "reviews": [
        {
          "text": "The rooms are clean and spacious, the staff, co-operative and helpful. Mr Raghu needs a special mention for his smiling countenance and agreeable nature. Pricing is very reasonable but above all the location and views from the backside facing rooms are absolutely stunning!\nOverall an awesome experience.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Situated in a very beautiful location with mesmerizing views from the hotel backyard.\nAbsolutely stunning views even from the rooms.\nService is good, rooms are clean and tidy, bathrooms are clean. We loved our stay here for a night after a long bike ride.. The food was also good.\nThe special mention is for the hotel rooms with stunning views and the backyard. Sipping hot tea in the cold weather and seeing the snow capped mountains hits you differently.\nAbsolutely recommended place to stay and enjoy.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Loved the stay. The location is prestine, quite & serene. The rooms are spacious & clean. The staffs are very friendly and helpful. Special mention for Mr. Raghu for servicing to our needs with a smiling face always.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great room' with view excellent food great food great service provider by Mr. Raghu during the stay\nWi saty with our film unit so much thanks manager mr.raghu",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "veary comfortable stay in duke neat and clean beautiful location courteous staff manager mr. raghu isveary help full person overall veary good expperience\nthnks to again mr. raghu",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Samdupling Alchi",
      "rating": [
        4.6
      ],
      "address": [
        "Alchi Monestary, Jammu and Village, Alchi, 194106"
      ],
      "reviews": [
        {
          "text": "Had a lovely experience at this hotel. The management were warm and welcoming and went out of their way to ensure we were comfortable. Lovely people!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Well maintained, good service's\nSpecially owner cooperative person\nThanks a lot for your well service",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice hotel for the conditions with a very old monastery in town. Roof terrace with a beautiful view. Friendly and attentive operators.",
          "languageCode": "en-US",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Thank you very much for your help.",
          "languageCode": "en-US",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Alchi Resort",
      "rating": [
        4.6
      ],
      "address": [
        "Alchi Road, 65J8+VQC, Alchi Gompa, 194106"
      ],
      "reviews": [
        {
          "text": "Calm, serene, idyllic place near the Indus. Perfect place to do short, easy treks in the summer. A bit on the smaller side, but clean and decent accommodation. Nice garden full of apricot and apple trees. Also sipping Chai in common sit-out with a view of the mountains is a nice way to unwind.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Clean, comfortable, excellent dinner and breakfast. Charming owner. Highly recommendable",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice place near indus river...good hotel",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice Resort",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This B&B is of a good standard in Ladakh. Hot food, hot water, and short power outage at night.\nBut every B&B is covered with apples and the air is clear and makes people happy.",
          "languageCode": "en-US",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Moljoks Heritage House",
      "rating": [
        4.8
      ],
      "address": [
        "Moljoks Heritage House, Suspol, Saspul, 194101"
      ],
      "reviews": [
        {
          "text": "I will warmly recommend Moljoks. Good and varied food and great service in a beautiful new dining hall. The rooms have excellent facilities and at the same an authentic atmosphere in a well-restored heritage building. The views are beautiful and the location is close to the Saspol caves and Alchi.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "A very scenic place with beautiful rooms ,perfect combination of tradistional Ladakhi structure with modern hospitality,perfect place for make your holidays or weekends relaxed and memoriable from hustle bustle of the city life , nearby to Saspol Caves , and Indus river, must visit place.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Moljoks Heritage House is a beautiful place to visit for those seeking a peaceful and authentic experience in a beautiful heritage setting.\nThe heritage house is beautifully designed and decorated in earthen hues creating a peaceful and relaxing atmosphere that allows visitors to unwind and enjoy their surroundings. With its friendly staff, delicious food, and with a breathtaking view, this establishment is a one of a kind heritage property in Ladakh!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Our group stopped here for lunch .Newly refurbished property with superb restaurant created in wood and glass with view down to the river.Above the river in an orchard /garden.Still a work in progress.\nFood and service excellant.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Excellent property. Stunning view. Strongly recommended if service is not a criteria. Even baby had to sleep without food",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Denmo Home stay, Saspol, Leh, UT Ladakh",
      "rating": [
        4.3
      ],
      "address": [
        "NH1, Suspol, Saspul, 194402"
      ],
      "reviews": [
        {
          "text": "Very clean room\nVery nice family and peaceful village saspol on natural highway nh1. Near to state bank of india ATM. Beautiful garden and parking available there. Delicious food\nFriendly owner and staff..",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beautiful home stay in saspol vilage.\nBeautiful garden. Home food 🍲\nNice mountain View and near sbi atm\nClean bathroom and clean room. Big paking available",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good view and beautiful rose garden",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Beautiful garden 🏡 good food",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Homely home environment!! The nature and it's beauty, blooms in full swing",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Lotsava Guest House",
      "rating": [
        3.8
      ],
      "address": [
        "65FF+H78, Alchi Rd, Alchi, 194402"
      ],
      "reviews": [
        {
          "text": "Comfortable country guesthouse in a very quiet location. Buffet food was very good and Bozo the local dog was a blast.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Accommodation was good but the food was excellent, apple orchard was there too,eat as many as u can",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good rooms, view and wonderful hosts.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Loved it",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "good",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Potala Hotel Alchi",
      "rating": [
        3.3
      ],
      "address": [
        "Jammu and, 65FF+47P, Srinagar - Ladakh Rd, Alchi, 194402"
      ],
      "reviews": [
        {
          "text": "Very affordable and comfortable place..for a night stay in Alchi village",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Well I didn't stay here, but I did visit to have lunch and honestly it was a good experience.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Small place beautiful village",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Lower Ladakh Guest House",
      "rating": [
        3.8
      ],
      "address": [
        "Alchi Ladakh, 65FF+695, Alchi, 194106"
      ],
      "reviews": [
        {
          "text": "Nice restaurant, tasty food, friendly people",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Heritage Home Alchi",
      "rating": [
        4.4
      ],
      "address": [
        "Near the alchi monastery Gate ,Leh,UT Ladakh Leh, UT, ladakh, Alchi, 194106"
      ],
      "reviews": [
        {
          "text": "We stopped at this place while going to Alchi monestry. It's famous for apricot juice.\n\nWe had apricot juice and maggi. The juice was thick and tasty. You must try if visiting Alchi monestry.\n\nThe place was surrounded by apricot trees and was so beautiful.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best hotel in ladakh. you can see the huge mountains from the hotel, the view is totally amazing. I recommended that, you should go once in a lifetime.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very Nice place to stay and calm adem, enjoyed the apricot juice",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Food is average, prices are too high. It's not recommended place.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    }
  ]
}