{
  "places_with_reviews": [
    {
      "name": "Lemon Tree Hotel Alwar",
      "rating": [
        4.1
      ],
      "address": [
        "MGB, Shanti Kunj, Malviya Nagar, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "We had a very unexpected amazing experience at the hotel. The food was very good and the behaviour of the staff was excellent. They were so humble and helpful. They even packed us dinner for our journey ahead. The service was extremely fast. the rooms were clean and the bathroom shower was amazing. All the staff, especially at the reception and dining were great. I would definitely love to come back to the hotel for future stays. Kudos to the staff for providing with such a wonderful experience.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Stayed at Lemon Tree Alwar from 20th December till 24th December 2023.  It is a nice and cosy place to stay.  Since we had booked our room much in advance, we got it at a good price.  The room was overall clean, however the chair upholstery needs to be changed as it was not very clean.  The bedsheets could have been cleaner as there were some stains on it.  The room also requires to be painted as the wall paint was pealing off at some places. Some of the sockets in the room was not functioning.  The buffet breakfast was decent.  We had fish at the hotel which was very well made.  Overall the staff was also very helpful.  This hotel seems to be a little out of town so a problem if you have come with a driver as there are no decent and reasonable place for drivers to stay within 1 km of this hotel.  The dormitory at the hotel is not good specially during the winter season.  I have lived at Lemon Tree hotels in other cities also, this one is not as good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The dining facility CITRUS is good and safe ambience is good Chef Mahesh Ji was good worth trying his preparation staff was cooperative, i had booked 2rooms, there was issue in one of bathroom it had foul smell, had to keep exhaust on, also the room freshener was sprayed on request ideally House keeping should have taken care off,",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Lemon tree, Alwar - I stayed here for three nights. I was allotted dirty room, which was not serviced after earlier guest's checkout. Then they gave me another room. The room ac was not working. The staff, instead of repairing, kept denying it. The toilet in the lobby was pathetic. Disappointing.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Service, food qualities and staffs  were best in past when it was running in the name of HOTEL CLARK-INN. It change its name from Clark in To lemon tree then there is homely service, low quality foods , high billing rates and insufficient parking area. Dress code is not there, waiter are not smart and punctual. Most of the staffs are out of hotel management education and trainings",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Red Fox Hotel, Alwar",
      "rating": [
        4
      ],
      "address": [
        "A Block, Malviya Nagar, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Good location. Easy to locate. Parking available. Rooms are apt. Ambiance is good. The restaurant served good food. A small bar is also there. The pool is also well maintained. Check in and check out was smooth. The staffs are cooperative. Overall a good stay.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Booked 11 rooms for a marriage party for 4 days. Was offered a decent group booking package. A free meaningful room upgrade was given complimentary.\n\nThe rooms were value for money. Delux rooms are really comfortable. Room cleaning was regular and effective\n\nThe breakfast spread was sensible and well prepared. The service was with a smile\n\nThe hotel is centrally located.\n\nAll in all, very happy with the stay",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good hotel to stay in Alwar. The location is on main road. Rooms are good enough in size. Complimentary breakfast had good variety and the food was delicious. Staff is well trained and courteous. Parking space was available in the hotel.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A good modern hotel. Very neat and clean. The rooms we stayed in were very spacious. We got a free room upgrade as well. It has a good, but small restaurant/ cafe. Food quality was good. Overall a nice experience.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel is located at Malviya nagar main road so easy to reach. Hotel staff are helpful and you can get auto to nearest tourist spots easily outside the hotel.\n\nFood quality is good and reasonable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Naman",
      "rating": [
        4
      ],
      "address": [
        "HJ8V+53V, Alwar - Bhiwadi Rd, opposite naman hotel, Dayanand Nagar, Daudpur, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Don't go on the rating people. This hotel is pathetic.The rooms are pathetic and very dirty. Everything was very dirty. Lift was not working. Pathetic service. No water was provided in room. Shower was broken. Staff was rude. No toiletries and towel were provided. This was not only is, even other guests were complaining about this.\n\nAt night we got calls from other rooms 5-6 times to provide water, towels and toiletries.Even reception contact number was not provided",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I don't understand why peoples are rating it. No proper rooms no clean washroom. Totally unhigenic place",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Not much better service and not much options available",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It nice hotel.\nIt runnig nicely before government interfere.\nBefore the of all bar and alcohol shop are 1 km far from road.\nSo they stop there restaurant.\nThere was food very nice they have banquet Hall.\nThis three star hotel.\nbye bye.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Service is not working but hospital was big so good",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Sparrow Hotels",
      "rating": [
        3.9
      ],
      "address": [
        "Sparrow Hotels, MGB Complex, Manu Marg, Kabir Colony, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Well I would say it's value for money hotel with amazing premium rooms and interiors. The buffet breakfast is actually out of the box, so many varieties with delicious taste.\n\nStaff is super awesome and the rooms are properly clean. Washrooms and other stuff is very well maintained.\n\nAuto geyser so no need to switch on water geyser. Staff was properly dressed up. Everything is actually luxury here excluding the pool thing.\n\nThere is no issue in parking as they have space for that and they have 3-4 hotels so you can park anywhere in the premises.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The property is very worst if it comes to Sparrow Inn by mgb hotels. Services are very poor. Everything is chargeable here, even water is chargeable. Food services are very slow. Buffet menu is also not worth the amount charged for Breakfast and dinner.  For cleanliness, the room was not clean. The rooms are very small and washrooms are very dirty.  I would not recommend to stay at this hotel.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Awesome hospitality in Sparrow residency.\nShikha mam was really very helpful and cooperative. Other staff members were also helpful. We have occupied room no: 2005,2006 which were neat and clean with well-equipped amenities.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Would give it a zero if I could. Staff was rude. Come here if you want ugly service.sleepy service,poor food quality.took an hour to get food.i have ever experienced.go anywhere else...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Found this hotel online while visiting alwar.\nWithout much expectation I stayed there but they hospitality surprised me.\nStayed at Sparrow Residency, the facilities were good as per the price charged.\nThough i stayed alone still i can say that room is enough for a couple.\nToilet and bathroom is also good.\nThey have a mini refrigerator in room.\nHot water is 24hrs available.\nAlso you get a nice hill view from the room.\n\nService staff is quite responsive.\nI did receive proactive calls for breakfast and dinner.\nApart from this i got Support for laundry and other services also.\nBelow guys responded well when asked\nMaintenance: Mahendra\nFood: Pradeep/Khemchand\nRoom service: Lokesh.\n\nA big thumbs up to this place.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Foji Raj Dhaba",
      "rating": [
        4.2
      ],
      "address": [
        "RJ SH 25, Malviya Nagar, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Foji Raj Dhaba offers a culinary excellence, impeccable hygiene, and outstanding service. From the first bite to the last, every dish tantalizes the taste buds with its flavors. The environment reflects their commitment to hygiene, ensuring diners feel safe and comfortable. What truly sets foji raj dhaba apart is their exemplary service and staff behavior. Attentive, knowledgeable, and always with a smile, the staff elevate the dining experience to new heights. Whether you're craving delicious food, a clean environment, or exceptional service, they delivers on all fronts.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Ultra slow service with average food taste and really poor hygiene found 3 flies in one glass and 1 in another. Inside also tables r full of flies. No cold water in the month of march. No next visit from me",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Awesome Food. We are staying in Neemrana Hill View Resort. Had our lunch yesterday at Dhaba.. and now having Tea. Loving it.\n\nNo Onion, No Garlic and still awesome taste. Highly recommended",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It was great to visit Foji Raj Dhaba\nFood was awesome.\nYou must try tea if you visit fojiraj dhaba.\n\nBest part it is pet friendly place you can bring your pets too.\n\nFollowing the culture to serve needy people every month from last 18 years is really commendable.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Turely impressed by Quality of food hygiene and hospitality.... A very homely place. The owner meets every guest and gives lot of respect .... Value for money... Must try",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Cygnett Lite Alwar",
      "rating": [
        4.1
      ],
      "address": [
        "Near samola circle, alwar- rajgarh bypass 200 feet road, Roopbas, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "I had booked the complete property for two days for my wedding, here's my review\n1. Overall the food was good but the persons from DJ team picked up few of our plates.\n2. The setup of decoration was worst because the stage that was installed there was not upto the mark and the gallery was not made as per the promise.\n3. Owner doesn't have etiquette to handle the client. He acts rude sometimes and he also changed his words at the last moment.\n5. The owner did false promise at the time of booking.\n\nOur experience could have much better if the owner has some experience in handling clients.\n\nNEVER RECOMMEND THE PLACE FOR WEDDING OR ANY OTHER FUNCTION.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The best staff I ever experienced. They made special food for my 1 Yr old baby, which he enjoyed. Good room and Good food made our travel and stay more comfort",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Convenient location, very good ambience, well maintained rooms, good food and excellent service. A very good option for stay at Alwar with family.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Food is not good but location and decor was good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I hung out at this place for lunch and a few drinks with a couple of my friends.\n\nThe bar and the restaurant are separated by a wall and have separate entrance gates. It wasn't crowded on that particular occasion.\n\nThe food was good, the ambiance was peaceful and comforting, the service was prompt.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Lemonade Hotel",
      "rating": [
        4.3
      ],
      "address": [
        "33, opposite Lic regional office, Mangal Vihar, Moti Doongri, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Visited this hotel in Jan 24 & The hotel is located good peaceful area but hotel is not properly maintained. Corridors ,Rooms, lifts has an unpleasant smell & dirty . Chairs in the rooms was like not clened from months . On a positive side , the reception & restaurant is good, food is good and the staff is courteous. However , the room lacks value for money despite having basic amenities.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I am happy that the management acted swiftly on my bad experience and tried to compensate for it. For a small business to accept their mistake and act on it was something I really appreciate. It's hard for a small business to build staff loyalty and commitment and I really appreciate the effort undertaken by their management staff to compensate for the mistakes of the ground staff.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I recently had the pleasure of dining at this hotel, and it was a delightful experience. The food was exceptional, offering a perfect blend of flavors, and the ambience created a warm and inviting atmosphere. The attentive staff added to the overall positive experience. I highly recommend this place for a memorable dining experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The hotel is located in a posh locality but is not at all properly maintained. The toilet has an unpleasant smell, and the bedsheets and pillow covers are dirty. Despite requesting a change, the replacements were also unclean and faded. On a positive note, the restaurant is good, and the staff is courteous. However, the room lacks value for money despite having basic amenities.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Just I am coming in lemonade hotel fast of fall just I like first urban village beautiful ambiance and sitting place odam staff vas very polite and helpful so osam and food bass good nice food all of them very execellent and bar vass good enjoy different types of drink lemonade is very best for other hotels it’s all was good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Bandhan Resort Alwar",
      "rating": [
        4.3
      ],
      "address": [
        "Mangal Vihar, Moti Doongri, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "Very nice and spacious marriage garden within city limits. They have AC banquet hall for indoor functions as well. There are multiple rooms all with AC and attached washroom for guest stay. Wedding Food arrangement is currently best in Alwar city",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very spacious lawn and benquet hall. Rooms are also good and clean",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place for weddings and functions.. Plenty of space outdoor seating is good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Adequate outdoor event space for more than 600 people at a time, decent indoor event space for around 150-200 persons.\nA bit disappointed in the case of rooms. Very limited number of rooms and not well maintained. I'd like to give a 3.5 ⭐ rating.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice Location, it's on main road near Income Tax Office. There are huge ground.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Grand Ashoka",
      "rating": [
        4
      ],
      "address": [
        "Bhiwadi, Rajgarh - Alwar Rd, Ambedkar Nagar, Kherado, Rajgarh, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "The hotel is located on the highway. I opted for a super deluxe room which was decent and clean. It lacked some basic amenities like dental kit and slippers. Parking is open in front of the hotel. The vehicle gets covered with a lot of dust. Also it's not safe to park your vehicle overnight in the open. Breakfast was good. I asked for a bellboy while checking out but no one came.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The location is good just on the highway. The staff is cooperative. The rooms are ok but the condition of some rooms needs maintenance.  The quality of food is ok not great.  Drawback is parking which is just on the highway so due to road dust the car gets really dirty.  It's not a wheelchair accessible property,  but one can do with the help of 1-2 people by picking the chair up the stairs from the main entrance which has 2-3 stairs. Then the lift can be used.  The lift is also small in size.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good hotel very nice and clean place food was very good staff was very generous the receptionist was very polite and helpful if you are in Alwar book this hotel it is very much budget friendly ,,,,,",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "All is Heaven for night stay in Alwar... A1 class restro, bar and also drinks & food available at room .. and really so Lovely room service..",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Staff is very unprofessional to speak , ordered food and one order same time cancelled . Staff explaining unnecessary things to us. I belongs to the industry last 25 years but this type of unprofessional people never seen in my life to speak .",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Pavna Palace Hotel",
      "rating": [
        4.3
      ],
      "address": [
        "7, Shanti Kunj, Malviya Nagar, Alwar, Rajasthan 301001, India"
      ],
      "reviews": [
        {
          "text": "it's situated on the outer of the city so you have to make sure that you are either commuting by some paid ride or your own vehicle. walkability is a bit affected by that.\n\ncoming to the service, the staff was well behaved and helpful. they were aware and listening to the folks.\n\nalthough it is quiet mostly due to the less motor activity around the area. rooms are good enough and they have this open space beside the hall, both of which weren't that spacious but it can hold up to a gathering of 60-70 people, not more than that.\n\nit is priced moderately high for the catering. not the best city has to offer but does the job for once.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Pavna palace is a nice hotel with outdoor banquet for small to medium gatherings. Have visited recently for a gathering. The food is good. Lodging and rooms are adequate. Room service is good. It is located right opposite to lemon tree. Out of the two, would recommend pavna palace.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I stayed around three week here. Staff at desk and restaurant are very coordial. Food  was yummy. Buffet needs some more items to add. Overall experience was superb. Recommended to stay here as its at cheap rate compare to lemon tree and excellent service",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place to stay and dine.Have banquet hall enough to accomodate nearly 200 persons. Only veg food available but very nice.\nRooms are good and comfortable.\nDifficulty in parking while there is any big party",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very nice for organizing family get together party we have organised there and food n service was awesome & everything was great at this hotel.. amazing staff that is friendly and makes customers feel welcome.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    }
  ]
}