{
  "places_with_reviews": [
    {
      "name": "MPT Holiday Homes, Amarkantak",
      "rating": [
        4.2
      ],
      "address": [
        "Near Narmada Temple, behind Jain Temple, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "Great place to stay. Narmada  temple is at waking distance. The place is green, quiet and close to nature. The food was good and the staff is polite. Rooms and bathrooms were clean. One thing to keep in mind, google map shows that there is a road from resort to narmada temple for car but that road  is very narrow and you can't take your car from there. If you are going by car you have to take another path which is 2-3 kilometres away from the resort. Resort has ample parking for cars.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I had the privilege of staying in this property and all I can say is that it was worth every single penny spent. The rooms were quite spacious and had all major amenities, the location is also serene where sumptuous vegetarian meals are provided. It's a must to try their kadhai paneer which is outwardly. Perhaps lack of wifi in rooms is the only negative I can think of, however normal mobile internet speed was sufficient to do office works.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "That was amazing experience. Thank you MP tourism for service. Rooms are very clean and tidy. All services are so good. Their foods are awesome.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Jay Narmda Matar Jay! An excellent holiday home. I stayed here 28 years ago when I was just 6 years old. This time I visited Amarkantak to participate in the 31st session of the Indian Art History Congress. So I have decided to book the same holiday home to recreate some great memories. The food is great. The view is great. I really love the place. The room is clean and you will get a huge bathroom.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We visited Amarkantak on 09.01.2024 and stayed on MPT Holiday Homes Amarkantak. Its location is near Maa Narmada Temple. Rooms are very good and services are excellent. Restaurant is satisfactory. We enjoyed a lot. One can choose it.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Narmade Anandam",
      "rating": [
        4.3
      ],
      "address": [
        "MQ74+55Q, Dhuni Pani Road, in front of Saraswati Shishu Mandir, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "Friends I stayed in the resort no 204 for 2 nights with a price per night at Rs 6500/- per day from 23rd Dec to 25th Dec, 2023. The service of the hotel is at the best. However looking at the price its quite expensive.\nBreakfast is at worst as the menu was repeating and quality was also not good.\nStaff behaviour are exceptionally good and very humble.\nFood quality and options to be improved which is at the bottom among standards. Geyser and telephone was not working for my room . However manageble.\nOverall looking at the budget will not suggest to stay at the resort with the quality and type of food provided.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Rooms okay. However the resort is noisy when people arrive in large numbers and stay awake till midnight disturbing the ambience.\nFurther food is okay and breakfast is not good at all. However some of the service boys are good and hardworking..feel pity for them.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Recently visited the property with few friends. Cottages are comfy and warm. Service is very good and staff is friendly. The view from the tree house is amazing",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Recently visited the property with few friends. Cottages are comfy and warm. Service is very good and staff is friendly.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Earlier visited this resort 5 years back, and had a wonderful experience but this time none of the rooms in the resort were booked.  Rooms were filled with moisture as if since long no one stayed there. Though cottages are beautiful but 1st impression this time was awful.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Maikal Hills Resort in Amarkantak (M.P.)",
      "rating": [
        4.6
      ],
      "address": [
        "WARD NO 02,SHAMBHU DHARA, ROAD, BARATI, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "A great option to stay while in Amarkantak. The property is not huge and it works in your favour if you looking for peace. There are independent cottages, which are very spacious, clean and of high quality. Even the bathroom fittings are branded with geyser etc.\nThe location is slightly off-beat, but no issues in commute etc. Google maps shows multiple routes, but only one of them is usable by a car. Contact the property to get the correct route to avoid getting stuck.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very peaceful and natural. The rooms are very clean. If you are looking for a peaceful palace to stay in then it is the best palace for you. Service is also very nice. I am enjoying it a lot with my family.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The resort had an amazing sunrise and good rooms. However the road to the resort isn't much developed. Also there was lack of internet connectivity (for airtel) and there was no wifi. But the view compensated for everything.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Not a resort but a nice little place.\nThis is a small property away from the hustle and bustle of the center of Amarkantak.  There are only 6 cottages, and they have a nicely maintained lawn. Ample parking space is available. Very good service and managed by the owners by themselves and they are really nice. We stayed in the AC cottage and it was clean. Basic, value for money cottage, nothing fancy. The food is ok, can be improved. Airtel/Jio network was good here.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Excellent Services and support received from all staffs Including Owner of the Property...\nSuggest to maintain such Nature's Friend property...\nI and my family enjoyed during stay ...",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Amarkantak Inn & Maikal Restaurant",
      "rating": [
        4
      ],
      "address": [
        "Main Road, beside State Bank Of India, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "The Best hotel in Amarkantak. Very nice polite and friendly staff. Clean good big rooms like 4 star hotels. Ambience is too good. Food is very good. And the key thing is all these are very affordable prices. I strongly recommend this",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms were spacious and the service was great. Food was exceptionally good & the hotel staff went out of their way to make our stay a happy one. Property is very well taken care of and it’s kid friendly. Location is also very good part of hotel with parking space.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Despite the slightly higher cost, Hotel Maikal in Amarkantak offers a satisfactory accommodation experience. The rooms, while not overly luxurious, provide comfort and meet the basic requirements for a pleasant stay. The hotel's ambiance is inviting, creating a cozy atmosphere for guests.\n\nWhile affordability may be a consideration, the overall value is notable, given the reasonable quality of the rooms. The staff's hospitality and the cleanliness of the premises contribute positively to the overall experience.\n\nConsidering the limited options in the area, Hotel Maikal remains a viable choice for those seeking decent accommodations in Amarkantak, even if it comes with a slightly higher price tag.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very Friendly staff , Neat Rooms and Lobby.\nThe hotel manager/ receptionist  is a great singer .Dont forget to hear his karaoke songs in the evenings if u happen to visit this place.\nThe restaurant staff catered to our special food choices.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "At such a remote location, hotel offers luxury stay with quality food and taste. hospitality of staff is excellent. front office staff quickly responded to our needs. Maintenance of property is extraordinary. Absolutely perfect place to stay in Amarkantak.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Eco hill resort - Chattisgarh Tourism",
      "rating": [
        4
      ],
      "address": [
        "MPCG+C2V, Unnamed Road, Angai Mal., Chhattisgarh 481884, India"
      ],
      "reviews": [
        {
          "text": "Great places with friends & family or large group\nThey have paid bonfire available\nSwings , badminton & volleyball available",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Pros and cons are as follows\nPros:-\n1. great location- has good views from the resort complex\n2. Staff is well behaved and cooperative\nCons\n1. Overpriced low quality food. We decided not to order from here again\n2. Staff has very little training.\n3. Place is not well updated in Google maps....when I visited it was still Cher chera resort\n4. The booking website is garbage\nThe costs are over the roof for each room...who tf pays 3k+ per night for a 2 star hotel with no ac\n5. Problem of load shedding\n6. Yellow stains on bedsheets and beds. The sheets are so old it's yellow",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A peaceful and beautiful place to go out with friends and family.\nYou feel the warmth of mother nature.\nBeautiful Sunrise\nSounds of birds\nWhat else you need !!\nA must visit place though",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good resort maintained By Chhattisgarh Govt. near Kabir chabutara.\n6 rooms available . Good rooms for family.\nRent also reasonable 2500/day.\n\nAt top of the hill. Good view... Pine trees are there... Parking facility and drive way are also good...",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's a Chhattisgarh tourism property again. Same like a Baiga resort of chilpi. Old construction required a renovation on some places. Cleanliness is also required. Towels should be provided here. Close to Amarkantak. Kabir chabutara is very close from here. Food is okay. Room service is good. Staff is very cooperative. Location is good. Very reasonable as visited here in off season. Better option if don't have access for ashram stay in Amarkantak.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel The Residency",
      "rating": [
        3.3
      ],
      "address": [
        "Sonmuda Road, 300 mts from Narmada temple, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "This is the worst experience of a hotel that I had. The hotel shows some luxury images and facilities on website but upon reaching there, none of those facilities are available. Still the hotel charges a lumsum amount of money. It shows something and provides something completely different and worse. The behavior of the staff and manager is very bad.\nWe booked a deluxe room, but only one towel is available in the name of deluxe room. There is no soap, shampoo, water bottle, the intercom and tv doesn't work. There is huge problem for ordering food also. We constantly had to go downstairs, to place order. There is seldom anyone available at the reception. We had to constantly call some attendant to answer our problems, still no solution. The attendant keeps transferring the calls to some other person who isn't present/available in the hotel, which comes as an added problem.\nThis hotel is not worth the price at all. The mental agony and irritation faced is huge.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Dear Travellers/Pilgrims,\n🙏🏼 Narmade Harh\nKeep patience, search more accurately before choosing this hotel. Since here is many options to stay.\n\nThis is a high price tag hotel and here is no compromise for long stay (stayed 5 nights). It's having high measured and highest valued \"terms and conditions\" 🙂.\n\nIt's well covered by magical luxury and situated at benefited location. Need average walking, back and forth towards temple/bathing/fooding. Including well behaved staff and receptionist, costly average taste food, high priced water bottle (than MRP) e.g. single piece PURI cost 24 INR without sabji, don't be confused it's not deep fried with pure Ghee, just oil fry 😊.\n\nHowever many other hotels/dharamsala are also situated nearby location of main temple.\n\nSo request to come here if you have no other option.\n\n2200/night (long stay) might have / apologies on my following day-dreaming expected points (since expectations leads disappointment 🙂)\n\n1. water bottle/drinking water in room on check in. this is a sincere manner/basic moral whereas many cheapest hotel provides normal drinking water poured in jug.\n\n2. For long stay expecting interchanging fresh towel.\n\n3. Toilet freshener.\n\n4. Electric kettle (considering luxury;\nbut here I've got furniture, tv unit, wardrobe with 1 hanger,\nuseless hanger on room 103 door).\n\n5. Proper cleaning of spiderwebs on wall, window curtains.\n\nFinally thank you for the hospitality.\n🙏🏼 Narmade Harh",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Never choose it it was my worst experience at this price not at all happy\n*bed is too bad\n*Washroom too small\n*hot water never come\n*staff behaviour too rude\n*bedsheet all dirty\n*they have restaurant but dont have\nvegetables for food\n*location near to temple but outer from entire market\nConclusion total waste of money at this price much more option is there",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The rooms are way too small. The price is excessively high. You will get much better rooms in this price.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "It situated at nice location.\nStay was very comfortable. All necessary gadgets are available in the room like fridge, electric kettle etc. Very good quality mattress was available which creates comfortable sleep.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "BABBA KI BAADI",
      "rating": [
        4.7
      ],
      "address": [
        "Barfani Ashram, Road, near Narmada Temple, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "The hotel is modern and conveniently located next to a Narmada Origin & Temple. The food and the hospitality were amazing. Bonfire 🔥 is sach a very amazing offer.Incredible experience overall ! The Temple facing room was the cherry on the cake and we were well taken care of by the entire staff.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Place is excellent nice and cool for such a small town,  if you are looking for stay only. Food on order can be arranged. Tea you can ask for or you can make of your own. Staff is very soft and prompt.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Beyond poor customer service. The staff  doesn't have the decency of talking to customers. We tried booking it twice and the property got cancelled every time giving us the reason for the higher rate of the property. It's a shame to have such a place in the area of God Mahadev. I would highly recommend everyone to not go for this property anytime in the near future.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very Near to Narmada Mandir Main Temple\nThis is the best hotel in Amarkantak if you have kids with you\nThey have a safe play area for children to play, there are rabbits in the garden and adequate safe space like car parking space is available only in their hotel.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "This Resort is Close to Nature...\nVery Positive Vibes around the Place\nVery Calm place for Meditation n all\nStaff was friendly and Owner Mr Rishabh is very Polite.\nSurely Visit again this place",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Sarvodaya VG",
      "rating": [
        4
      ],
      "address": [
        "Ward no 10, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "Very nice hotel in amarkantak.  Nice room, car parking available.  Restaurant facility is also available on site. And they will  make you fresh food at an affordable rate.\nBut for driver's stay they provide mattress from 11pm to 7 am only. So I recommend to find a room for driver at Baba Barphani  Ashram near the narmada temple at rs 400rs. And this sarvodaya hotel charged me 2800rs per night for 3 people,  2 double beds. I highly recommend this hotel. It's located at a prime location,  many food stalls nearby.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Excellent place to stay at. All modern facilities are available. Staffs are very cooperative, courteous.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Location is good. But the rooms are not. No WiFi and closet instead of charging 3k per night. Light doesn't switch off. Staff is rude and unfriendly. There are many better hotels nearby.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It’s really very nice experience with the resort. Treatment is very nice and the hotel management staff is very humble and always serve us happily. View is epic from this place too. Food is tasty too",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Their rooms are brand new, very neat and clean,with all superior amenities in washroom, openable windows with mosquito net,24 hours hot water in so much cold. Their owner ,kitchen staffs all are very co operative and calm, they serves pure veg/jain food varieties making fresh, hot and immediately on ordering.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Shreemata Sadan",
      "rating": [
        3.6
      ],
      "address": [
        "Sounmuda Road, MQ96+94M, near Narmada Udgam Sthan, Udgam, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "FRAUD.. Pathetic hotel..\nHas TV which does not work.\nAC are broken.\nWindows are broken\nThe almira is broken.. looks like bought from scrap shop.\nPillow cover + bed sheet + blankets (all) has stains ( very dirty)\nIf you book it online.. they will not accept the bookings and ask you to book it on the spot and charge you double the amount you paid online.\nIn simple words.. They are FRAUD.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Nice hotel and location is good. Near to both Narmada mandir and Sri Yantra mandir. TV was not working. The housekeeping staffs need to more active. Good parking place but no room available for drivers.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I visited with my family.  Service of the hotel is too good special facilities provide for the children. It is located near to Amarkantak Temple and the view os very good",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Staying at this hotel was the biggest mistake of our Amarkantak trip. The quality of the room is very bad, the bed-sheet and the blanket were very dirty, it can cause itching in humans. if you go to this hotel, then definitely take allergy medicine with you. Food quality was average but its prices were overpriced We had to wait 45 minutes for the food.\nThe owner and receptionist treated us very badly. they only want cash payment, not online payment. They will not give you a GST bill because they are eating government money by saving tax. The price of this hotel should not be more than 600- 700/- at all. The online price of this hotel is 1500 rupees but when you go there and book the room then the price will go ₹3200/+ hidden charge. You can stay at this hotel at your own risk",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Everything in hotels felt good, except\n1. You can't got in ur choice\n2. Due to the less taller of Bathroom  SAWAR ,it may make accident.\n3. Uneducated service boys difficult to communicate.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Teertham Amarkantak",
      "rating": [
        4.9
      ],
      "address": [
        "beside Narmada Mandir, Amarkantak, Madhya Pradesh 484886, India"
      ],
      "reviews": [
        {
          "text": "This hotel is located within 100 metres of Narmada Udgam Mandir which is the main religious attraction of The rooms are  well-furnished. Standard toilet-kit has been provided in room. All fittings and fixture are of superior quality. Hot water supply is also available all time.\nA good place to stay in in Amarkantak.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "This is undoubtedly the best hotel in Amarkantak. I stayed in this hotel for two nights. Rooms are very elegant and equipped with all amenities such as air conditioner, geyser etc. It is an extremely neat and clean property. The most advantageous factor is the location. It is not even 100 metres from the temple. The owner Mr. Monu Maharaj is a gem of a person who is always there to guide you and provide personal help on any issue. He also provides vehicles for local sightseeing and beyond (in case you wish to visit other places like Bandhavgarh etc). The tariff is also quite justified when compared with the amenities and location etc. If at all I visit Amarkantak again I shall stay at this property only.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "It was a great stay in Hotel Teertham. Very well maintained property, hygienic rooms. Very near to main temple. Food was delicious.\nMemorable stay.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very well situated, very clean, like new. Nice and helping people. There is only positive things to say about this place and the people runing it. Thank you.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Hotel Teertham is the finest choice of accommodation in Amarkantak. They behaved us like family members💖. Rooms, services... everything was outstanding. Really Happy to spend a couple of days in this hotel.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    }
  ]
}