{
  "places_with_reviews": [
    {
      "name": "Hotel Coral Heights, Ambalapuzha.",
      "rating": [
        3.8
      ],
      "address": [
        "Ambalappuzha, Sreekrishna Temple, Road, Ambalapuzha, Kerala 688561, India"
      ],
      "reviews": [
        {
          "text": "Rooms are neat and clean, rooms sevice is good. Nearby Ambalappuzha Temple, only concern is that it is in the compound of a BAR.  So outside ambience is not at all good. Now a days it is under restoration process.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The hotel located near busy Alleypy market.\nRooms were good,\nFood not so good, ordered something - got something.\nMy room was in the rear wing.\nMinus point of this hotel is having Bar below which is situated inside the premises.\nEvenings are worse as the entrance is occupied by parked bikes who have come for drinks in the bar.\nDifficult for ladies n kids to pass through the patch to go to the rear wing of the hotel.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": ". Charging 30 rs for water .which is more than mrp 20rp\n.no hotwater\nNo WiFi signal in rooms\nDust and fungus in room\nNo instructions in room\nDon’t take the room\n\nBetter opt for any local which may better Than this",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I stayed this hotel. There are lot of problems in this hotel.\n1. No hot water in room. They also tell it is available between 6 to 10 am . But it will never come room.\n2. Service is horrible\n3. We booked a deluxe room and it has bottle cap and chicken left over. Later they replaced room.\n4. I don't give any rating due to location. Unfortunately you can find alot of hotel in that area. So location is not a postive point.\n5. Food is very average.\n6. Cleanness rating can be zero.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Okay for short stays.\n\nIf all you expect is a nearby hotel from railway station or the temple; a place to get some rest and quick shower, then it's a good option.\n\nBed is super cosy and comfortable.\n\nHygiene is compromised because of cockroach infestations.\n\nFood is average and spicy.\n\nPs: Good if your service-level expectations are minimum. Otherwise, look for better alternatives for better service.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "The Lake Resort by Maat Hotels",
      "rating": [
        4.2
      ],
      "address": [
        "Vazhapparambil Jetty, Vysham Bhagam, Kanjipadam, Alappuzha, Vaisyambhagom, Kerala 686020, India"
      ],
      "reviews": [
        {
          "text": "The resort is very well maintained. It's right at the side of a backwater canal, kayaking is available on premises.\n\nThe rooms are good but be prepared for insects/lizards since it's in a remote location.\n\nThe staff is very nice and helpful. The food is good quality as well.\n\nThe only negative point is the approach road which is  a narrow dirt road in bad shape for around 1.5 kms",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The location was just next to a lake and coconut trees. A very beautiful and picturesque landscape.\nWe travelled alongside a human made canal to reach there.The road was very bumpy with no signboards making it kinda impossible to locate.\nThe breakfast served was good. They also had hammocks for peace and relaxation.\nPlus for book owls they literally have a whole shelf of fiction! Can ya believe it ?!! With authors like Dan Brown, Agatha Christie, Sidney Sheldon.\nThey also have a carrom board to have fun with your family. I recommend this hotel if you like long drives (it takes ages to reach) and just want to have fun!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The roads to Paradise is always not smooth..\nThat's all about the way leading from NH.\nStay was comfortable.. Food was homely..\nAmbience was great.. View was awesome..\nGood service\nA budget resort with calm atmosphere to merge in",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Pathetic stay, no road for 2 km it will take 30 min to travel 2 kmand your car will be dead. There is some temple nearby and they continuously play the loud speaker which destroys the entire peace of the place. Even it's completely far away from the city.\n\nEven if they offer free stay, avoid booking over here, in the same price you will get very good stay by backwaters or on beach.\n\nStaff is good and cooperative. 👍",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The place is great for its scenic beauty, the food is great, the rooms were ok. The only reason it dropped its one star is due to the road that leads to this resort. It's off the main road for about a km and that too narrow but at dawn, the view is awesome.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Green Palace Health Resort",
      "rating": [
        4.4
      ],
      "address": [
        "Kanjipadam, Kanjipadom car parking, Chempumpuram, PO, Alappuzha, Kuttanad Taluk, Kerala 688505, India"
      ],
      "reviews": [
        {
          "text": "A resort with ideal, quiet place to run away from the madding crowd for a peaceful vacation. Icing on the cake is the exemplary service provided by the management and staff. The resort owner and his family members were taking keen interest in the preparation of food and services. An area where improvement is required is a notice in the room that toiletries are available on demand/ request",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We stayed there for 3 nights and 2 days from 26th to 29th March 2024\nWonderful experience. Awesome place  with excellent/ helpful/ caring service by Owner ,Manager and the staff.\nThe food was homely, delicious and great.\nRooms are very neat and a safe place to stay. Nice swimming pool. Pavements are made for morning walks to enjoy scenery around.\nLooking or another opportunity to visit.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautifully maintained and offered very professional service. Food served was very tasty. All the staff particularly Manager Saboo and Mukesh were very hospitable. Rest of the staff too. Owners took personal interest in the Menu prepared and served. Boat service, House Boat stay and temple trips were very meticulously planned and executed.The environment around confirms that it is really God’s Own Country.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "An amazing place so close to nature. River front, swimming pool, health spa. Serene. They take u on a boat from the pick up point to reach the resort. Once u reach, u r in another world, with a calm and beautiful river front resort. Just sit and u will feel the miraculous  soothing done by the  nature. They have health packages with strict dietary plans.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "If you are going to this hotel contact the management or search for The green palace car parking .The location of the hotel needs to be updated or the Hotel management needs to share the hotel transit info to customers. We cannot directly go to the hotel on Road which google shows. We need to go to lake point from where there will be a boat provided by hotel management to take us to the hotel. We  have faced this issue and we were travelling at night 8 without this knowledge.\n\nThe hotel is very good and it is centrally located in the lake with scenic views. The food is good but the service can be improved as they provided food which was cold after 2 hrs of our order time.\n\nThe rooms provided to the car drivers is not good and there is no other option as this hotel is located very far from the town.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Treebo Tryst Vahada",
      "rating": [
        4
      ],
      "address": [
        "Neerkunnam,Vandanam, Neerkunnam, Alappuzha, Vandanam, Kerala 688005, India"
      ],
      "reviews": [
        {
          "text": "Absolute delightful experience. Deluxe Rooms are very extraordinarily large and sparkling clean. Staff were polite and helpful.\nOnly one downside was tasteless food . Their fixed menu breakfast and dinner both were passable and can be avoided.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Excellent stay. For me the most important part is always the cleanliness of the hotel. The staff are human just like us, so I don't really rely on staff reviews (unless that bad!). Don't we all have mood swings and cultural differences. Saying that... the staff were all very good. The rooms are spotless and super clean. The location is apt. You can easily travel to all three sides: Ernakulam, Kottayam, or further south. Or just enjoy around Alappuzha/Alleppey. Very peaceful location. Even though it's on the NH it's not right beside the road, so it's not noisy. Loved the furniture and the restaurant is good. We took an evening walk just Infront of the hotel and it was healing, felt nostalgic like those times when we didn't have gadgets but just nature... Ohhh and the sunrise view from our room. Check out the photos!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Worst service. Attitude filled female and male staff least interested in serving customers.\nBehaving like they were giving ordered items for free. Nice property , good luck .",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "one of my favorite hotel. Very quiet place with positive vibe. The staff is friendly. I can't help but say avarude hospitality is very pleasant. It is a very big room. The airconditioning is good. perfect cooling.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Worst experience in a hotel. We visited restaurant on 31.3.2024 for dinner. The staff were not responsive and have taken long duration to offer even water. The person who introduced as manager has said there is no other staff to provide much service.they should close the restaurant if they don't want customers to visit",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Ramanilayam Tourist Home",
      "rating": [
        3.8
      ],
      "address": [
        "West Gate Ambalapuzha Temple, Ambalapuzha, Kerala 688561, India"
      ],
      "reviews": [
        {
          "text": "Very convenient and simple hotel for a short stay near Ambalapuzha temple. Very close to the west nada. Staffs are polite and helpful. Good restaurants available downstairs and in north nada. They have some reserved parking area on roadside or you can park the car on main road. Note that lift is not operational.\n\nTemperature inside room will be high as no ventilation available inside the room and window glasses are not openable. But you can opt for AC. Rooms and bathroom maintenance needs to be improved.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "This is kind of a 3 star tourist home, good for easy access to Ambalapuzha temple from West Gate. We have booked the hotel for visiting Ambalapuzha Temple and its walkable distance to the temple, hardly 500 meters. The room service is good and he is friendly and provided us with Ambalapuzha Palpayasam. No good space for car parking, but managed to park near to the hotel itself.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Stayed there for 1 night, very close to Ambalapuzha temple. Room was clean and no bad odour was present. Bathroom could have been better, but at this price this was a good stay. Very close to bus stop where all Alapuzha buses will come. Will recommend to people.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Worst experience to me yesterday's room occupation.  You have informed NON AC ROOMS available and given charges and we booked four NON AC ROOMS and checked in at 7 pm on 14.4.23. Afterwards your staff came to room  and informed that all rooms provided with AC  and if you want we will provide same to us with extra charge of 500. Then only we found that no windows available in the room so that natural air possibility for non ac occupants was totally denied.  We couldn't sleep whole of yesterday night because of no air circulation.  You cannot demand every one to spend higher charges for air conditioning.  You have cheated us. No parking facility provided to us for our cars. Worst experience. Wanted to share this information to all",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "The stay was quiet good, friendly staff overall good experience and also the hotel os beside the temple so we can easily go to the temple and there are hotels nearby everything in a walkable distance.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "OYO Hotel Al Ameen Punnapra",
      "rating": [
        "Unknown"
      ],
      "address": [
        "145/F Beach Road, Junction, Punnapra, Alappuzha, Ambalapuzha, Kerala 688004, India"
      ],
      "reviews": []
    },
    {
      "name": "Vrindavan Tourist Home",
      "rating": [
        3.5
      ],
      "address": [
        "99M9+CC4, Ambalapuzha, Kerala 688561, India"
      ],
      "reviews": [
        {
          "text": "Its an old budget lodge, the biggest plus is that it is just next to the temple, which means that if you get out of the property thats the start of temple premises.\nThat was the most convenient part of it",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "A perfect place for family for the sake of just temple visit. Calm, clean, safe and economical area with spacious neet rooms. One of the first stay options here, almost sharing the wall with the temple.\nHave enough parking space.\nDo not expect any modern day services like, bath kits, towels, soap etc.\nI wouldn't search for any other space here, if I'm coming exclusively for the purpose of a serene temple visit",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "A complex very close to Ambalappuzha Sreekrishna Swami temple. It has auditorium with mess hall, kitchen and lodging. A restaurant was also available before but now it is closed. Parking is available. The auditorium is good for small functions. There is a beautiful courtyard in the middle but not maintained properly. Kitchen is at the second floor and no lift available.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Vrindavan Tourist Home is located in the West Gate North side of the temple.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very bad experience with service.They dont provide atleast a regular electricity.we have to shift the room at any time.They are not responsible at all .",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Nakshatra Residency",
      "rating": [
        4.6
      ],
      "address": [
        "Nakshatra, Vandanam, Kerala 688005, India"
      ],
      "reviews": [
        {
          "text": "Please dont trust these guys. They put lower price online and when we go to check in, they ask for more money. Which is practically like cheating on customers. Think 10 times before booking.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Worst experience ever , ive booked via oyo and booking and payment were done by online and when i reached the hotel they denied my booking and the were saying they cancelled agreement with oyo the catch is it is still available in oyo for booking and i had to pay extra money for the room  again",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Definitely worth the money. The customer service is something to comment on too. I would definitely recommend the place to my friends and family.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Neat and excellent customer service.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Excellent service and felt safe",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "OYO 49862 Gabis Wings",
      "rating": [
        1
      ],
      "address": [
        "West Gate, near Sreekrishna Swami Temple, Ambalapuzha, Kerala 688561, India"
      ],
      "reviews": []
    },
    {
      "name": "Top-Yard Heritage",
      "rating": [
        4.5
      ],
      "address": [
        "Vaisyambhagom, P.O, Vandanam, Vaisyambhagom, Kerala 688005, India"
      ],
      "reviews": [
        {
          "text": "Beautiful Quaint little property in the heart of Kuttanad. Makes you feel right at home. The owner has loaded the place with all sorts of water rides and equipments. The place also has a swimming pool but I'd wholeheartedly recommend you to take a swim in the lake rather. Plus, you are served a homely Kerala cuisine meal. The highlight here is you will be served the fish you catch from their pond along with the other dishes.\nYou can reach the property by Car or Boat but I definitely vouch for the latter.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent place to stay.. right in lap of nature with backwaters flowing on a step outside gate of property. Lush green garden and very clean rooms. Owner serves homemade authentic delicious food with lot of love and hygiene. Happy go lucky staff. Overall Amazing experience. Good people. Overall the best place to spend your vacation",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Top Yard Heritage is a gem for a weekend escape! The resort's got this awesome backwater view, and they throw in cool stuff like kayaking. It's like the perfect mix of chill vibes and a bit of adventure. Definitely recommend for a laid-back and fun getaway!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "\"Excellent experience at the Top-Yard Heritage Resort in Allappuzha! The location is beautiful and easy to reach.The property is meticulously  maintained, and the staff goes above and beyond to ensure a comfortable stay. The food is delicious, and the amenities are top-notch. I highly recommend it! ¹\"",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The place is next to the backwaters, very calm and relaxing environment. We got to see the sunset on the 1st day, it was mesmerising.  Good service and support by staff.  Overall, great place to stay.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    }
  ]
}