{
  "places_with_reviews": [
    {
      "name": "Anand Sagar Resort & Water Park",
      "rating": [
        3.6
      ],
      "address": [
        "MIDC Highway, off Anand Nagar, Ambernath East, Pale Gaon, Maharashtra 421506, India"
      ],
      "reviews": [
        {
          "text": "Sure, here's the review with emojis added to each point:\n\n\"Anand Sagar Resort Review:\n1. Location: Not Good. 🗺️\n2. Beware of Rickshaw Drivers: They hold a monopoly and can overcharge due to their dominance. Exercise caution to avoid unnecessary charges. 🛺💰\n3. Swimming Pools: Ideal for swimming pool enthusiasts, but not suitable for riders or those seeking other recreational activities. 🏊‍♂️🎢\n4. Outside Food Policy: Guests are not allowed to bring outside food, however, the quality of the resort's own food is also not satisfactory. 🍔❌\n5. Pricing Concerns: The resort charges exorbitant amounts, such as Rs. 350, for services and rides that do not meet expectations. 💸\n6. Ride Condition: All rides are not in good condition and lack proper maintenance. Skating is not advisable as it poses safety risks to guests. 🎡⚠️\n\nOverall, the resort may not be the best choice for everyone, particularly due to its location, limited recreational options beyond swimming, unsatisfactory food quality, pricing concerns, and poor ride conditions. I rate it 2 out of 5 stars. #AnandSagarResort #Review\"",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Budget Anand Sagar Water Resort . Very Good & Safe option for family & individual. Food is very tasty with reasonable price water quality in resort also very good and resort is very maintain and clean.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Water Park water filtration plant not working due to which oily water observed in all water pool with smell. Need to maintain water quality with low chlorine.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "जयहिंद. Huge place and various ' depths ' facilities according to the age of a child.\nFood Menu is comprehensive. Sufficient Parking. The Manager, Mr Jagdish Shetty is accomodating. Water Park surrounded by Palm Trees is a treat to eyes..Must visit before it shifts to another huge place...",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Awesome atmosphere, enjoy with family and friends, reasonable ticket amount, clean water need to slide repair, food also nice, transportation issues by local auto rickshaw drivers. Charges for auto rickshaws are high.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Krishna Palace",
      "rating": [
        4.1
      ],
      "address": [
        "P-35/36, Anand Nagar, Additional M.I.D.C, Ambernath, Maharashtra 421503, India"
      ],
      "reviews": [
        {
          "text": "It was a pleasure to stay here for a week on my recent business trip. The staff was always friendly and helpful, the room was beautiful, and the food was top notch. The housekeeping department was absolutely wonderful. I look forward to my next trip, I'll definitely stay here next time.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Cool hotel for a good price.\n\nWe went here for one week to see the area and visit friends. The the double rooms come usually with two separate beds a big window a tv and a nice small bathroom.\n\nOn the one side of the hallway you can see the sunrise and on the other side you can see the sunset from your bed.\n\nThe breakfast unfortunately hasn’t got the much variety as i wish but u can order omelette and other food whats good.\n\nThe dinner at the rooftop with the sunset at the background was so delicious.\n\nThe waiters Mr prakash ,virendra and manoj were very friendly and served us the whole evening. Even when we had extra requests they made it happen.\n\nIn total im very happy with the hotel and can definitely say its better then the usual tree star hotels i went to.\n\nWhen i’m the next time around the area i will definitely come back",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Great Ambience. Very bad food. Prices too high with respect to the quality & TASTE. Service left to good but untrained fresh boys.\nOur groups will Not be visiting again....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Krishna Palace in Ambernath offers an exceptional dining experience! The food is simply divine, bursting with flavors that leave a lasting impression. The atmosphere exudes warmth and charm, perfect for quality time spent with loved ones. Highly recommended for those seeking delicious cuisine and a delightful ambiance",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I have attended many social gatherings over here as it is near to my society. Mostly in my locality people book there hall for wedding reception or birthdays. It is a very good hotel. Food served is also very good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel S-3 Park",
      "rating": [
        4.2
      ],
      "address": [
        "Hotel S-3 Park Chikhloli, opp. Empire Industries, Dattanagar, Ambernath, Maharashtra 421505, India"
      ],
      "reviews": [
        {
          "text": "I have ordered orange blossom which says fresh orange, apple juice, mint, etc (cost 200). But they served me Real juice with mint leaves. At least be honest with what you are serving to your customer. Upon that lady manager has the audacity to tell we serve real juice only. They have not mentioned any where that this juice is a canned juice. You deserve a slap. You lost 1 of your customer.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Starters are ok and is good to be recommended... But the main course is such useless as they had kadhi patta in Dal makhani and Garlic based curry in Paneer Pasanda.. who does that.. Will never recommend this to anyone and will never go again to the Restaurant again.. Very unauthentic food even after complaining they have charged to us for the same...... 0 Star rating for food and taste of food....",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The rooms are good but ac was not working fine despite of being on lowest temperature, average cooling effect.The basic food item like 2 slice bread butter cost very high it was disappointing and their food service is also pathetic initially the staff confirmed twice the food item is available and later after sometime they denied saying its unavailable which was very annoying. They need to improve their service and train staff to be accurate.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the rare classy restaurants in a very unconventional place.\nThe food variety is just lovely with good taste and excellent portion sizes.\nThe overall ambience and feel is very upscale both for the downstairs restaurant and the rooftop dining.\n\nIt's can sometimes be a bit stuffy in monsoons and have experienced mosquito under the table but the staff sorted it out right away.\n\nThat being said my goto lunch dinner spot on my way to and from our second weekend home not to far away from here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Serving Staff are not doing any great job as they lack coordination and customer service skills and ethics. Also, the location is not excellent due to lack of public transport. However, the only best thing is Hall Rooms for Marriage Functions and the ambience inside.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Nakshatra Residency",
      "rating": [
        4.1
      ],
      "address": [
        "Navrang Hospitality Pvt. Ltd., Ambernath Industrial Park, MGN property, Lot No: K - 1, Additional MIDC, Near Anand Nagar, Ambernath (E), Thane Dist, Additional M.I.D.C, Ambernath, Maharashtra 421506, India"
      ],
      "reviews": [
        {
          "text": "I have visited here for dinner...it's a fav place with live music and awesome food... must visit",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Can do small functions there.\nCleaning staff needs to pay more attention to the washrooms cleanliness.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The best hotel to stay and dine in this area. Full satisfaction of stay. -- ACP GHORPADE",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I found it as a good place. It's a average good hotel for a middle class family. Room rent is less and size is also small. Food is tasty I ate Chinese and Indian from this restaurant it's tasty and there banquet hall is also quite good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Food quality is good, but the management can definitely work on improving their service.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Maharaja The Royal Resort",
      "rating": [
        4.6
      ],
      "address": [
        "Near Jambul M.I.D.C Gate, Ambernath-Badlapur Jambul Phata Road, West, Ambernath, Maharashtra 421505, India"
      ],
      "reviews": [
        {
          "text": "Maharaja the royal resort is a best choice for destination wedding,we had my son's wedding at Maharaja is was an grand wedding and Maharaja crew made it a memorable royal event.\nAmazing decoration\nDelicious food\nLuxurious ambience in very affordable rates.\nManagement and staff very cooperative and humble.\nWe had memorable moments\nIt's worth to plan your destination for any event .",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Visiting this place for the second time for the same Holi event. This resort is situated in a secluded place in Ambarnath and a bit far away from the main city centre. Getting local cabs or auto is a bit difficult here. Rest the place is amazing and they have hosted a very good Holi party in 2023 and 2024 with a minimal price of 799 bucks with lunch, ice gola and chaat counter included. Full access to the swimming pool and also the rain dance. The swimming pool has a separate area for the kids with a proper bund for the safety. The main swimming pool is large. They even host weddings and not just the ordinary ones but in a maharaja style. They have separate cottage areas and a villa. They have an attached bathrooms,  changing room with lockers bang next to the pool area. The premises is big and free to roam. Highly recommended!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice and quite place, beautiful rooms.. The food is very delicious... The breakfast was yummy.. Service is good enough.. A decent place to spend your weekends with family and friends!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I was there for Family wedding. The resort location is in Ambernath.the resort is good , amenities are good, but the staff is good.they serve the food but never bother  to check. At wedding night dinner food was pathetic,Rotis,rumali rotis, Dal, Jalebi rabri all was cold .waiters were glaring at us & when manager was called he was not in mood to accept the fault.i will say a Big No to this Resort for marriage purpose.we were so feeled Ashamed in front of our guests.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very great experience. Best food at this price point unlike other hotel where marriage food is heavy the food is best driving quality of maharaja royal resort.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel D-ADDA",
      "rating": [
        4.2
      ],
      "address": [
        "Kalyan-Badlapur Road, w, Dist, Belavali, Badlapur, Maharashtra 421503, India"
      ],
      "reviews": [
        {
          "text": "Had been to the restaurant with friends to have dinner.\n\nFood was good.\n\nThey have a well maintained bar section with a variety of alcoholic drinks.\n\nAtmosphere was also good.\n\nLive music facility available. Singer has a good voice.\n\nWell maintained interiors.\n\nOverall management was good.\n\nAmple Parking space available.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Stay at hotel was pleasant. Room was good and well maintained. Staff people were supportive. It has in-house restaurant and bar also. Looked like it is very famous in Badlapur based on fully occupied with guests every day. 😊.. The food quality was good. Looking forward to stay again in future.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice arrangements made by D-adda team. The service was awesome by Lakshman and Deep and Aditya, tilak sir. special tnks to Minal madam. So helping in nature n she in personaly involved in all event & managed so well..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Overall good arrangements & staff is very cooperative. Attended ring ceremony function.\nFood was 4/5, staff 5/5, Ambience 4/5.\nEnough Parking space available.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent location right on the main road. Good well maintained clean rooms. Fine dining restaurant with Karoke on certain nights, good food. The rooms are situated at a higher floor above the restaurant.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Vrundavan Resorts | Resorts In Badlapur | Farmhouse | One Day Picnic | One Night Stay | Best Hotels | Farm Stay | Nature Stay",
      "rating": [
        4.1
      ],
      "address": [
        "Near, Bypass Road, Katrap, Badlapur, Maharashtra 421503, India"
      ],
      "reviews": [
        {
          "text": "Worst experience.\n\nWould not recommend any one to visit here before clearing below points.\n\nIssues faced here are as below:\n\n1.  We a group of 8 friends visited here.\n2. It was informed to us will get 1 complimentary room for the day.\n3. When we visited the property 1 hall type room was given in which there was no washroom.\n4. It was asked to use a common washroom in which people had spit on the toilet seat.\n5. We being a group of 8 girls asked for a room with attached washroom.\n6. Again we had to speak at reception and all and after an hour a room was given.\n7. The room was not clean at all.\n8. Not water bottle or anything provided in room.\n9. We were later informed that AC charges in room are separate.\n10. Per person 100rs only for ac.\n11. We asked at reception to negotiate as it was not informed prior that in room there will be no AC.\n12. We had planned for a spinster party for 1 of our friend.\n13. The lady at the reception was totally rude. She didn't knew how to speak to customers.\n14. She is like it's a complimentary room and there will be no AC as we don't have lockers at our place for 1 day picnic we give room. If there is place to keep your bags and for you'll to change then that room is enough for 8 people. This is the response we got.\n15. While booking we had clearly mentioned that we are planning for a spinster so will need a room atleast 1.\n16. The charges taken by the property was a good amount and the service and experience was totally worst.\n17. Will never ever recommend anyone to visit here.\n\nTOTAL WASTE OF OUR HARD EARNED MONEY.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I had an incredible stay at the resort and was blown away by the exceptional hospitality provided.\nThe staff went above and beyond to ensure my comfort and satisfaction throughout my entire visit.\nFrom the warm welcome at check-in to the personalized service throughout my stay, I was consistently impressed.\nThe attention to detail and genuine care for guests needs truly set this resort apart, specifically Manager uncle and reception Didi having good caring nature for children.\nI highly recommend this resort to anyone looking for a top-notch experience with unmatched hospitality.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Pros -\n1. By road it's quite accessible, near foothill however close to city\n2. Enough parking space\n3. Spacious property, well maintained lawns\n4. Space available for Indoor-outdoor games\n5. 5ft. and 2ft. Pool, Rain dance\n6. Served tasty vegetarian / non vegetarian food\n7. Good for friends, okay for families\n8. Budget friendly\nNeed attention -\n1. Cleanliness of rooms can be improved\n2. Glasses were not available in the room\n3. Limited menu but okay\nOverall it's not so cozy but okay for one day stay.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I attended a wedding at this place. The place is nice and quiet. But they have not properly maintained it. There were plastic bottle and litter at one corner.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Beautiful serene cool ambient are the few words to describe this place for marriage functions. Ample parking spaces available here.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "HOTEL VANDANA RESIDENCY",
      "rating": [
        4.4
      ],
      "address": [
        "Katai Pipeline Rd, near HOTEL MAYUR RESTAURANT AND BAR, Navare Nagar, Ambernath, Maharashtra 421501, India"
      ],
      "reviews": [
        {
          "text": "Too good of an experience! Incredibly hospitable staff, great food and great service. Totally recommended to everyone.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a great experience this weekend, the staff was very supportive and the rooms were clean and tidy that too at a reasonable price.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We recently had the pleasure of staying at Vandana Residency, Varanasi,  UP, India and were incredibly impressed with the level of hospitality we received. From the moment we walked in, the staff was welcoming and attentive. They went above and beyond to make sure we had a comfortable and enjoyable stay.\nOur room was clean and spacious, with all the amenities we needed. The bed was comfortable, and clean. Being close to all important temples, ghats,  and  mouth-watering eateries in Varanasi, it was very convenient for us to visit those places as well\nOverall, we had an excellent stay at Vandana Residency. The staff was truly exceptional, and  I would like to give shout-out to Ashok and Aditya who were responsible for looking after guests.\nI would highly recommend this hotel to anyone looking for a warm and welcoming place to stay in Varanasi.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Worst experience staying at this hotel. Booked at 1500, I checked in late and the hotel asked me extra 1000 rs otherwise they won't let me check in. The service is very very very poor and the staff is very rude. I don't generally post reviews but I hope someone finds it so that they don't have to face what I have gone through staying in such a 3rd class hotel.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Place was clean. A bit noisy at night. Maybe coz my room was just next to the reception. Food was good. All in all very good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Mullukh Marathha | Mulukh Maratha | Seafood Restaurant in Badlapur | Thali Restaurant",
      "rating": [
        4.4
      ],
      "address": [
        "Mullukh Marathha, Shop No. 4, 5, 6, Ground Floor Om Mayuresh Apartment, Survey No.26, Hissa No.2, Plot No.5, Katrap Rd, near Monalisa Hotel, East, Badlapur, Maharashtra 421503, India"
      ],
      "reviews": [
        {
          "text": "The food was excellent, the ambience was perfect, and the service was top-notch. I absolutely loved the soft Marathi Sangeet playing in the background. The food was served promptly, and I have to say, the modak dish was a personal favorite. The non-vegetarian food was simply awesome. The place is photogenic, and they maintain it really well. I had a fantastic experience and would highly recommend it.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Really tasty food. Ordered Squid rings, crab lolipop. Amazingly crispy and delicious. For mains we have Prawns Masala with Bhakari and surmai and special mutton thali. Everything we ordered tasted really good. Service is very efficient and good value for the money. Cheers!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice ambience.best service indeed .\nwe had ordered Bombil fry...taste was very nice but very oily. Kala mutton sukha was well cooked and again very tasty. Even fronz was crispy and tasty.\nChicken lapeta and Bheja fry was not upto the mark. We ordered  Bheja fry..it should be dry and spicy...but it was literally Bheja curry..no..no..wasn't good.\nOverall good place for foody.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It's as very beautifully decorated restaurant which is decorated in village life theme.\nThere is indoor as well as outdoor dining arrangement. Indoor seating was little bit noisy.\nThe food was very very delicious. All the items that we've ordered   there were very testy. The Solkadhi we've tried here was one of the best Solkadhis I've ever tried.\nThere is a live counter for all types of Bhakris and chapatis on Village-style 'Chulha'.\nAmbiance was nice. They need to work on noise control issue.\nService was very nice and quick. All the staff was humble and good in hospitality.\nWashroom was clean but very smelly from inside.\nOverall experience here of having a lunch was very nice.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Food is Tasty and food quality is good. Very quick response from staff. Fish is fresh. Enjoyed food with silent Marathi songs. One suggestion - Card Payment Option",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "SPOT ON Sangam Relax Point",
      "rating": [
        4.1
      ],
      "address": [
        "1 4th Floor, Chandani Shopping Center, Math Mandir, Kailash Colony, Mumbai, Ulhasnagar, Maharashtra 421005, India"
      ],
      "reviews": [
        {
          "text": "The management is changed recently. The new management giving good services. Employees response is very quick . Rooms are maintained very clean and neat.  You can feel like home staying here. I enjoyed my stay. I recommend  SANGAM RELAX POINT for stay in ullasnagar.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good service and reasonable rates.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very good and yummy 😋😋😋 icecream 🍨🍦 and faluda.... test is very good 😊....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Great place in best price, people  behaviour is great",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The Behaviour of property Owner is Really Appreciate and Mercy he is A person who knows The value of money that is the Reason i am giving This Feedback so whoesever is Reading this feedback kindly book the property without any Hesitation Trust me he never charge extra or more the value of Booking.. One You Visit You again And again for your Requirements",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    }
  ]
}