{
  "places_with_reviews": [
    {
      "name": "PURPLE ORCHID HOTEL AND RESORT",
      "rating": [
        4.4
      ],
      "address": [
        "Near Outer Ring Rd, Bilaspur Chowk, beside Bhatupara Talab, Ambikapur, Manipur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Nice place to stay and relax with family. the hotel staff are well behaved and polite. Room service good and the food are tasty.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I had visited this property during my CG/MP vacations in July 2023 from Kolkata. I must say the hotel meets all necessary attributes be it room wise, service wise or from a culinary perspective. The huge parking area of this hotel is a big plus added with a very pleasant location situated in the ring road. The reception staff were polite and gentle and offered us attractive discounts which does call for a repeat visit. Highly recommended to people wanting an accomodation to visit mainpath.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Don't waste your money on food in this restaurant. Priced are exorbitant but the quality is not good and they don't serve hot food even the tawa roti is also hard and cool . If you ask they will make it hot and get back you. I ordered chicken spring roll but there's no chicken in it only vegetables u need to search for chicken. The street food vendor makes better roll than this restaurant.\nThe ambience is good that's it.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice and cozy stay in the city like Ambikapur. You can feel fresh after coming here. Slight unclean washrooms and rooms else everything is good.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I am giving two stars just because of hospitality we were given. Especially the girls who work here seem uneducated, with no sense of talking to the customers. The very girl who sits at reception always have angry expressions on her face which you will also observe in any kind of dealing she does",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Makhan Vihar",
      "rating": [
        4.3
      ],
      "address": [
        "Railway Station Road, opposite Paani Tanki, Ambikapur, Bhagwanpur Khurd, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "No doubt it's a very good hotel to stay. I have enjoyed my stay there. Rooms are clean and beautiful. Stuffs are well behaived. Services are also very good.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The hotel is conviniently located.Ample of parking space . The staff is well behaved.the rooms are neat and clean.\nThe buffet breakfast is well spread. The allacart items take lot of time.scope exists for improvement.\nAll in all a pleasant experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Yahan ka khana bohot hi tasty h. Quantity, taste, food packaging ekdum sahi h. You'll not be disappointed for sure. I've tried chicken thali, dosa, beg thali and I would highly recommend these",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very good and fast service on this hotel ,all rooms is very sweet & clean we have long time stay be happy thanks to all team hotel makhan vihar .",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Since this is a new hotel feels good to visit as this was my first time.\nFood is good. Wait time is a bit longer.\nMain course daal was initially warm(looked not freshly prepared), upon request they immediately made a hot daal!\nPricing is on a higher side as compared to other hotels in city.\nStaff is quite decent and polite.\nResturant's washroom could have been more clean and hygienic!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "The Kamoda Resort",
      "rating": [
        4.6
      ],
      "address": [
        "Rk Nagar, Banaras Rd, Gandhinagar, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Nice Resort for many purposes like marriage, birthday party, and many other functions. Have big lawn for functions and well managed space for car parking which is very necessary in big functions. Nice ambiance and like the way it has so many amenities like swimming pool, nice decorated stage as per your choice great things to capture with your photos.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Please improve the service staff of your restaurant. The cleaning staff and manager of the property have been co-operative! Also, please provide complete information regarding the prices and extra charges. If the swimming pool is chargeable then please let the guest know about it before they jump in the pool. A well informed guest is a happy guest. What we really loved about the property is the interiors and exteriors.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I'm so happy I found this hotel. It is out of town and so quiet away from the horns etc. The room was great and after a few days in hotels that apparently had hot water (not) it was so nice to have a hot shower. The bed was very comfy, the best sleep so far in India. The staff are fantastic. I highly recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "This new place in Ambikapur is great for hosting parties or weddings or any kind of get together. The rooms are spacious and well managed. The staff are very helping and friendly. There is a kids zone in the garden. Overall I've had a great experience.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Rooms are elegant and very nice. It's picturesque resort with all the basic amenities",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Grand Basant",
      "rating": [
        4
      ],
      "address": [
        "Beside Basant Multiplex, Kharsia Road, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "I Stayed there for 3 days but on first day itself I knew they deserve 5 Stars for everything. Everything is just top notch perfect, its a must stay place if you came to ambikapur or mainpat. Their rooms, service, staff, food, price is all Best. Compliments to all of them and keep it up.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I ordered veg biryani and it's test was really awesome.....\nRukmani sidar......tasty food as always",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good food taste and best food service delivered by sunita.\nGood and polite behaviour of Sunita.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "One of best hotel hotel in Ambikapur. Food taste, Good staff behaviour, room higiene everything is perfect here 😊",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very good experience with hotel, specially for restaurant.\nFood taste is very good and staff of the restaurant is very cooperative.\nOne of the staff, Sunita turkey is very active and good behaviour.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Sargawa The Palace Resort",
      "rating": [
        4.1
      ],
      "address": [
        "Sargawa Palace, Raja US Singh, Deo Marg, near Mont Fort School, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Service is very poor. Property is very good. Ambience is nice. But after all the food matters which was not upto the mark. Overall a bit pricy menu. And definitely they need some good menu design. Photocopy menu just gives a bad impression. Hope it improves in near future.\n\nUpdate: after 8 months hotel food quality and service has not improved. Please change your chef.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "In the outskirts of Ambikapur, there lies this restaurant which all in all was average when we talk about food. One thing I liked was services provided by the restaurant staff. It was calm and very positive. Food was not too shabby but it could have been better. Portions of food for the prices were commendable.\nIf you are looking for quite place where you can feel like you have been treated well this is the 0lqce to go. But the food I mean I can be better, hope they do it. Or maybe it was one time thing that happened with me.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms are very neat and clean their staff is very courteous and excellent. Food quality is up to the mark. However, it's based on resort concept hence located in the area which surrounded by forest and greenery. Location is slightly away from city centre.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent rooms, ambience, food and service. Extremely recommended",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Service was very bad and very deley\nFood was not upto the mark\nOverall my experience was very bad .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Avalon Inn",
      "rating": [
        4
      ],
      "address": [
        "45FX+2P6, Mahamaya Rd, Mamamaya Chowk, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Very good hotel.\nStaff and all amenities are excellent to visit with family.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It is one of the best places to stay in Ambikapur. Highly recommended.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Food was good but I didn't like dal.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice well maintained property with well behaved staff.\nKettle in the room is there. Food is good and reasonably priced. Not economical but balanced.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good place to dine in with your friends and family. The whole course of food was delicious and tasty. The sweet corn starter was really yummy. Service is also good. Overall 5/5 rating. I  really enjoyed having my dinner at Avalon Inn...",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Alankar Greens",
      "rating": [
        3.9
      ],
      "address": [
        "Bramha Rd, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Indulge in a cozy stay at this prime location hotel. Impeccable service, delicious breakfast, and ample parking make it a top choice. The staff's warmth adds a delightful touch. Highly recommended for a memorable experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very nice hotel.\nGood rooms , good service.\nThe best thing is they have their own protected car parking area",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's good hotel and nice view around this hotel",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It is a very good hotel and the best thing is that there is no disturbance in the rooms.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "HotelThe hotel is very good: The hotel staff is  good. food and drinks are good quality",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "GRS, Hotel The Grand Radhe Shyam, New Bus Stand, Ambikapur, Sarguja 497001",
      "rating": [
        4
      ],
      "address": [
        "Pratiksha, Bus Stand, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "An exceptional experience at The Grand Radhe Shyam! This hotel adeptly manages large events with efficiency. Spacious rooms at reasonable prices, impeccably clean and well-maintained. The environment is inviting and the staff is accommodating. Highly recommended for seamless event hosting and comfortable stays",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The first impression was excellent, very well maintained property.\nBut the staff did a lot of delay in our order even though there wasn't any kind of big crowd.\nAfter confirming the order we waited for more than 30 minutes for the food but  apart from the delay, the taste was amazing.\nI recommend Veg Sizzler to everyone.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It was a very bad experience at  hotel the grand radheshyam...the owner or we can say the waiters seems to be very absent- minded but one thing is that they behave nicely but they had taken incorrect order,  due to that we had gonna pay for that food which we had not ordered at last i want to say that i will not suggest my friends and relatives to visit there.. Thanks!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Staying at GRS was a good experience, room was clean, staff was well behaved, few things need to be added in the service to make it overall great.  Affordable rates. also good considering the location wise.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Reception boy had no manners . Didnt knew how to communicate with guests . Fan was not working but still he gave us the room and when we asked to change the room he refused.  Very poor service too . And food was of extreme poor taste",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "The New Shailgiri",
      "rating": [
        3.9
      ],
      "address": [
        "The new shail giri Beside honda showroom Manendra Garh, road, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "So, visited this place in the evening with my friends.\nThe place has some good vibes. As, we sat in the tent, which is well decorated & are good.\n\nThe staffs are good & also the service is well.\n\n(⭐out of 5)\nTaste- ⭐ ⭐ ⭐ ⭐\nPresentation- ⭐ ⭐ ⭐ ⭐\nAmbience-⭐ ⭐ ⭐ ⭐\nRecommended-⭐ ⭐ ⭐ ⭐\n\nThe taste of all the food items were well & good.\nI tried -\n1. Singapori Noodles\n2. Paneer Chilly\n3.  Baby Corn Chilly\n4. Cold Coffee with ice cream\n\nThe taste of all the food items were good & tasty.\n\nAlso, the place is photogenic, where you can get some good clicks.\n\nYou can visit this place with your friends or family & spend some quality time here.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Hotel is good & little long distance of main city......But hotel receptionist was Cheaters ..\nIf you book rooms online with some app you will see breakfast , wi fi , water bottle, laundry all things are free....But when you going to checkout receptionist forces you to pay for all your free things (water bottle, breakfast)..... Please don't visit & stay  any people without confirming in this hotel of cheaters..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Behaviour of hotel reception member/officer is not good . He don't have manners how to talk with customer. I have words with him and we have final the ac room for 1400 but afters some time his words were changed he is telling you have to pay 2000 for same room . He shared me prices of 1400 and some room pics on my WhatsApp no.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I have been here for a party where the facility was really good but the employees were very rude few of them were good most of them were worse",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good room and services. Best hotel near of Railway station. At economical price.\nDon't book online just come and book at place.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Manas",
      "rating": [
        3.9
      ],
      "address": [
        "458M+FF8, Ambikapur, Chhattisgarh 497001, India"
      ],
      "reviews": [
        {
          "text": "Great Hotel in Ambikapur\nNear Bus Stand...\n\nFood also available, tasty and rates are also tasty😄😄👌🏼👌🏼\n\nRooms are beautiful with Bathroom attached,well furnished ❤\n\nService also very good...\nStaff members are helpful & good in behavior 👍👍👍",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I deduct 1 star bcoz of very costly kitchen food items and poor drinking water quality.\nNice location and room service. Maintain your ro water facility.\nOverall, it was a good experience 👍",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Great Hotel at affordable Price.\nNear to Bus Stand.\n\nFood also available at reasonable price.\n\nRooms are great with nice & elegant Bathroom attached.\n\nService also good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I personally not like the owner and staff behavior and service  there are so many opposition in ambikapur near by them, who serve best",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The hotel was ok, as in ol korrect, as in all right. Service was good, for the room I stayed, it lacked cupboard and i didn't really switch on the TV but it was alright to stay, certainly has (solar) water geyser so plus one, totals to 3 (relatively for town like ambikapur) in Raipur it would be 2 or 1.5 stars",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    }
  ]
}