{
  "places_with_reviews": [
    {
      "name": "C.R. Regency",
      "rating": [
        4.2
      ],
      "address": [
        "No. 27/1 By Pass Road,n Vellore District, opposite Indira Nagar, Krishnapuram, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "Possibly one of the very few hotels in Ambur. The rooms are decent for a short business stay. They have single, double, and triple beds rooms.\n\nNo meals are served here however, you have few good restaurants around such as Sai Sangeet which is a good south Indian veg pick for your breakfast.\n\nThe hotel is located above a hospital so the parking sometimes might not very easy to get.\n\nThis is just a budget hotel, so don't expect a star service. It's decent and definitely a good choice.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It was all good experience\nStaff behaviour was fantastic.\nVery cordial and helping staff",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Definitely a good one for this budget. Rooms are spacious and nearby a vegetarian hotel. Eventhough the rooms are not brand new, One an consider without hesitation.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This hotel in Ambur is ok kind. I had to visit the city and stay for a night. The city has no five star hotels. Based on the reviews I stayed here. The Beds and blankets were not clean. They should maintain hygiene. Bathroom was leaking, ac was running but makes a blast sound every 30 minutes or so. The staff were helpful.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We checked in around 2.30PM on Sunday the 1st May 2022. We have allotted a Room on the fourth floor. No doubt the room was kept clean and tidy. But, unfortunately, drinking water is not provided, Intercom was not working, news paper not provided in the morning, TV not working, though there are 20 plus rooms, parking space provided only for 3 cars. We have to remove some two wheelers and park our car. We just managed because the Rooms were good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Pranisha Inn",
      "rating": [
        4.4
      ],
      "address": [
        "17/2, Somalapuram, Ambur, Somalapuram, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "Excellent customer service. Rooms are well maintained with all required amenities. Located in a most convenient place. Good place to stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Excellent stay... Clean and neat linens .. hygienic bathrooms and toilets.. spacious rooms. Comfortable bed and working space.. affordable price .. best in town hotel in ambur.. only food is a drawback... However swiggy Zomato deliver to this hotel .coffee tea available next door and can also be room delivered..  infact it's in a way good.. as we can choose to eat what we want and need not get stuck with one menu",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Were looking for an overnight stay as all places in vaniyambadi were booked out.\n\nChanced upon this hidden gem.\n\nClean, neat, tidy and spacious room.\nCourteous reception.\nHot water in bathroom available.\nClean and big bathroom.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Best in accommodation\nBest in Service\nBest in Price\nBest in all\nOne Suggestion\nPlease add the Breakfast and Tea snacks as complimentary",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "5 star hotel experience and extremely friendly staff",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Ambur NR Briyani & Kabab Center",
      "rating": [
        4.1
      ],
      "address": [
        "95, MC Road, Opposite to BSNL Exchange, Gandhi Nagar, Ambur Plantation R F, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "I love this place... Since years\nIts finger licking good .. can't wait to go back again",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Small restaurant on the Ambur main road. Good varieties  of kababs both Chicken and Beef. Biriyani and Chicken kabab was too good. Decently maintained.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Once a time this shop was good at all.\nBeef biriyani (basmati rice) is my all time favourite.\n\nBut nowadays they reduces their both quality and quantity of foods.., biriyani taste was below average.\nBeef chilli is good in taste.\nAt first they provide well cooked basmati rice biriyani with softened meat, but now they use jeera rice .\nWhen you love to  kebab then this shop will satisfy you.\n\nprice are average & worth for the quality and quantity of food.\nThis shop is located in highway service raod.\nThere was  no parking area, we park our bike in service road but no way to park car here.\n\nService was good and their ambiance is good enough., They have separate place to dine in with our family.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of Ambur best kabab centre... They have plenty of choices for you can choose here... And specially green chillies and pepper chillies is best in this restaurant... Am satisfied... #foodie",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I tried this shop many years back and got a chance to try again but still the taste remains same. I love this place very yummy must try place in ambur",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Royal Mughal Ambur",
      "rating": [
        3.7
      ],
      "address": [
        "No 182 MC Road, Kannigapuram, Ambur, Ambur Plantation R F, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "1.8 km from railway station if u came by one way ... otherwise it's to take long I turn ...ok room not 🚫 good",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Room is OK but washroom was not clean",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are good but the toilet is very bad no water and dirty more..I will not go again.night duty manager is very bad character more angry ..",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Incomplete interiors. No water supply. Clogged toilets Western closet. Accumulation of dust .",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Good location but washroom Maintenance was the worst.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "SRK Residency",
      "rating": [
        3.8
      ],
      "address": [
        "No. 79/12-D, Old EB lane, MC Rd, Flower bazar, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "We visited this place on 14th Jan, took 2 rooms.Rooms were neat and clean.Ample car parking.Room service was good. Overall nice experience.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Located nearby the Opposite of Ambur railway station walkable distance. Some outside construction is going on. Keeping clean and clear. Room service recommended to improve, intercom phone system not available. So unable to call the room servant for room service. The car parking area and reception lobby everything is perfect.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good and neat room stay in Ambur main road .. parking is available..",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Room, Bathrooms are not clean. No intercom, room service. Car entry height to be reduced, drive carefully else bottom of car will get damaged...",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Useless Hotel. Bedsheets are not clean . No room service.  Bathrooms are ugly.  Rooms are totally damaged. the whole hotel itself is in a bad condition. Charging full amount.  I stayed there on Saturday 5th Feb 2022 and vacated on 6th Feb. I suggest others to avoid staying there.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "ARAVIND STAYS",
      "rating": [
        4.7
      ],
      "address": [
        "ARAVIND STAYS, 3/3C, Bypass road, opposite to Murugan Theatre, Indira Nagar, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "One of the best stays in ambur surroundings.  Highly recommended for families and people travelling for business. The ambiance was so cool. The rooms are so clean and neat. Good service and hospitality. The manager was so kind and friendly. The staff are so supportive and friendly. Safe and secure for kids and family. Budget friendly and luxury comfort.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very neat & good place to stay, highly recommended. Rooms were clean and reception staffs and owner is more friendly type & very supportive.\nWell maintained the furnitures and good speed of wifi connection\nSaran from Bangalore",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very good place to stay, highly recommended. Rooms were neat and reception staffs very supportive. Would like to visit this place again if I plan my repeat trip to ambur.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Newly constructed Hotel, rooms are big,  neat and clean, Toilet is Moder and clean. Reception staff Satish and Saravanan are friendly. In this area it is very nice hotel. Car parking is available.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very good place to stay, highly recommended. Rooms were neat and reception staffs very supportive and very helpful and ensured that we are comfortable.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Anand Park",
      "rating": [
        3.5
      ],
      "address": [
        "No. 10/B, MC Rd, Naganadi, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "This place is good for chill with friends ..heater don't work for bath ...poor bathroom cleaning...but bed and room are spacious",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Owner and the staffs hospitality. Rooms were excellent. In the last 2 years, I visited this hotel for several time. Calm and peaceful atmosphere.  Price are reasonable. Keep staying.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "No Proffesionalism with hotel staff. Expensive for this locality. 1500rs for 1 room. A/C doesnt work and you cant set it below 21.Ac remote to be shared between 2 rooms. No room service. No dental kit,Soap, towel. Card payment not accepted. Pillow in the room are made so hard as if you are sleeping on a tree branch and huge. T.V is age old where you will get only tamil channels and it only some 15 channels",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Stay was excellent!\nOne of the best hotel in Ambur area!\nAmpel parking space\nRoom service best\nI would strongly suggest this place to stay",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Excellent ambience . The Hotel owner Madan is very cordial to the guests.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "OYO 30372 Royal Mughal",
      "rating": [
        3.3
      ],
      "address": [
        "182, M.C. Road, Ambur Plantation R F, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "The worst rooms that i ever saw, didn't  had the nerve to stay.\nThe receptionist is so arrogant that the below  pics and seeing them directly  also didn't  made any changes  to his thoughts  about rooms cleanliness..\nHe still claims the rooms are perfect.\n\nThe Worstttttttt!!!!!",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "First of all, I must say I was lucky that I got this place to stay at the night, because all other hotels were full in Ambur due to wedding season.\n\nBut at the same time, I wasn’t happy with the cleanliness. The sheets were dirty and so does the cupboards and racks. There were mosquitoes too. No soap, no toothbrush were provided. Just one shampoo sachet, a bottle of water and towel was provided (which i didn’t use).\n\nIf you aren’t particular about the hygiene, then you can opt for this.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Rooms were dirty, the bathroom window was broken, the AC outdoor unit of another room was directly facing to the bathroom window, so it was very hot, and was not able use the bathroom. Also they never care to ask if you are comfortable, they didn't even provide us the drinking water.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Worst place I have stayed. Wrong location marked on map. This is basically a lodge worth less than 500 RS but they charging more than 1300. Bedsheet was very dirty and no replacement when asked for one. OYO has lost all the quality standards. Never trust OYO for the name again. Worst experience",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "I had stayed in this hotel for one night. There was no good facilities available. They charged RS. 4000 per room but it was not worth even Rs. 2000. Even after lot of discussion, they didn't give any concession.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Flagship 36586 Sai Dr Venkatesh Residency",
      "rating": [
        3.5
      ],
      "address": [
        "10 MC Road, NH 46, Indira Nagar, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "I have booked 5 Rooms from 2nd sep 2023 to 3rd sep 2023 all AC rooms for my friends came from Bangalore. I was not there at the time of checking in. Not even in a single room AC not working no tap water or drinking water provided caretaker responded rudely. Even though we paid full in advance.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "not bad as people claim it to be. stayed there multiple times. some reviews here are super exaggerated but they do need to sort out the issues regarding oyo, smell in the water!, and receptionist not being in the reception. will rate them 3/5",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "I was booked for 13th to 14th October and I was paid my full amount to OYO when I was get there to hotel he refuse to give me room .. the hotel staff is saying oyo is not give the payment to hotel.  So how we trust to oyo when we paid the full amount .. I was full upset there with my small 3 year's baby ..  from there is also I was called up to oyo customer care also but he told he will get back shortly but know response from oyo still now.. pls don't booked with OYO when you leave with your family pls pls",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very bad, i suggest, no one to go there they charge too high and ac is not working, no proper water and no towel and soap supplies and very bad smell all the rooms, and very bad was too much of bed bugs. First of all they are not considering the oyo itself in oyo hotel how insane fk this ppl...",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "worse service. Hotel is not neat and clean, Staffs are rude. I suggest others ot to stay in this hotel.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Sampanghi",
      "rating": [
        4.7
      ],
      "address": [
        "44, MC Rd, Naganadi, Ambur, Tamil Nadu 635802, India"
      ],
      "reviews": [
        {
          "text": "Served our purpose. Decent hotel. Toilets could be cleaner and need improvement",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Good place to stay, very near to Ambur Railway station.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Rahman",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Super",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    }
  ]
}