{
  "places_with_reviews": [
    {
      "name": "Dark Forest Retreat Amboli",
      "rating": [
        4.5
      ],
      "address": [
        "H.No.24/4, A/P Chaukul, Amboli-Chaukul Road Amboli Chaukul Chaukul Road, Shirgaonkar Point, Amboli, Kegad, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "Rooms absolutely in good and well maintained condition. Good amenities provided for medium priced room. Well ventilated airy and spacious rooms.\n\nLocation is definitely a plus point as the resort is surrounded by mountains. not very far from the main town of Amboli.\n\nMy only concern is, as a foodie i like good food and Dark forest needs to better their offerings a little bit.\n\nService is very prompt, well spoken staff.\n\nWe stayed for 2 nights and thoroughly enjoyed ourselves. Will definitely come back for more.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I would like to thank all the staff at the resort for their hospitality. The room were clean, the lawns were kept well, restaurant delivered the food to our rooms on time and the reception were helpful.\nAlthough we had booked initially just for a day, the vibe felt so good that we extended our stay for two days.\nAlso thanks for setting up a bonfire 🔥 upon request.\nDefinitely visiting again during monsoons .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I stayed there for one night. Location is amazing as it is away from town and the main highway. Rooms are nice and clean. Beds are comfortable. Food was tasty and was delivered promptly to my room. Staff was polite and helpful.\n\nOverall very nice experience.\n\nOnly drawback was their open air karaoke system with loudspeaker (located in the garden). Some guests were singing till late night and it was bit disturbing for other guests like me.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very spacious, clean and comfortable rooms. Had a wonderful weekend stay. Would love to revisit in the monsoon. Only negative was that there was no mobile range at all (airtel) and had to rely on a somewhat slow wifi. Otherwise, we had fun :)",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Rooms are excellent..food and service is also excellent.\nThere should have been more trees or plants for shade in the property...or this resort is not for summer",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Whistling Woods Amboli",
      "rating": [
        4.7
      ],
      "address": [
        "Chaukul Road, Sawantwadi, Amboli, Maharashtra 416550, India"
      ],
      "reviews": [
        {
          "text": "A surreal experience for me and my family when we stayed there for two nights in Dec 2023. True to its name the woods constantly whistle and woo you into providing an amazing experience. The accomodation is impeccably maintained and amazing. The food is homely and really tasty. The people are very nice and friendly - all in all a place to be in the Amboli ghats\nP.S.: The book collection in the small library in the reception is truly enriching and the personal expertise that Hemant sir has in the local flora and fauna is enlightening",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Surrounded by the forest region of amboli It's a place where you will find a peace of mind, comfortable stay, nice hospitality. And another reason to stay is Mr.Hemant Ogale, well known butterfly researcher. Great person. It's a privilege.\n\nAbsolutely recommended.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "What a lovely and peaceful place! Different types of rooms available and built perfectly amidst nature. Quality of Food is also amazing. No need to look somewhere else if you are in Amboli for a trip.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Escape to nature's embrace at this serene resort, where each morning begins with a homely breakfast served amidst the captivating sights and sounds of the nearby forest and wildlife. An enchanting retreat for those seeking tranquility and adventure.\nSpecial Thanks to owner  Hemant sir..!!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Visited with family along with a 4 years old kid. We stayed for one night. Treat for a nature lover. Beautiful rooms. Amazing service, good connectivity via roads. Wi-fi available. Decent quality food. Very good service and hospitality by Mr. Hemant Ogale. His knowledge on butterflies, snakes, and overall nature & conservation is amazing. Will surely visit again.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Green Valley Resorts",
      "rating": [
        3.9
      ],
      "address": [
        "Amboli, Taluk, XX7X+7HP, Sawantwadi, Amboli, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "Average !\n\nLocated near Whistling Woods resort.\nPlace has great vibe but no good food.\nRates are too high as comes to the food quality. Service is average. Staff is not that careful.\n\nWell maintained ambience with good. Alcohol isn't allowed here. Peaceful place !\n\nParking space is not too large.\nKid friendly atmosphere with no nearby activities.Washrooms are not that clean.\n\nNot satisfied :(",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "This was a perfect location to stay on the way to goa. It's so perfect location that you won't regret.. stay was comfortable.. very nice location but ok rooms. We reached late night and left early morning. So could not explore more but breakfast was very good . pohe, amboli and tea is what we had .. it was tasty too..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Service is good. Rooms not maintained. Location is very good. Food is ordinary",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's best..clean envirement..testy food..best location..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Rooms are nice n clean. But not up to the mark. Best time to come here in Winter n Monsoon, so you can enjoy the nature. Food is good. Parking is available in vicinity.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Amboli Hill Resort",
      "rating": [
        4.4
      ],
      "address": [
        "House No. 1481, Plot No. 82B/66 Near Amboli Bus Stand., Sawantwadi, Amboli, Maharashtra 416532, India"
      ],
      "reviews": [
        {
          "text": "It is centrally located in Amboli near bus stand and main highway. All site seeing points are nearby within 10 to 15 mins reach by car. Car parking facility available on property. Great view from balcony of surrounding greenery with fog and clouds. Food is prepared as per order. Room rates are reasonable. Property owner and care taker are very cooperative and guide us about nearby areas. Overall very nice and enjoyable stay at Amboli Hill Resort.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "A lovely resort at heart of the city. Rooms were neat and clean. Room tariff was reasonable. Food was tasty and service was too good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice room customer friendly service, owner is good nice behavior with customer, you can stay with family very happily. Vishal is good person to help you, Thank you.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The place, food, rooms, and service is awesome! They treat you with so much love, adjustment, and courtesy as if we're relatives visiting their family. Loved the stay!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice place to stay here with kids, good atmosphere, nice customer friendly service. Owner is good communicater with customer.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Hotel Durvankur, Amboli",
      "rating": [
        4.4
      ],
      "address": [
        "Sawantwadi Rd, near bus stand, Sawantwadi, Amboli, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "Nice food, food is plus point given the surroundings. Clean toilets, it's plus point specifically if you are traveling with family.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Right on the main road,  easily accessible.  But,  it's a clam place. Rooms are good and clean. The entire place is well maintained. Dormitory beds are also available and good. On cold days they have camp fire.\nThe restaurant is also good. Veg thali and misal pav were well prepared",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "GOOD TO GO :)\n\nBudget friendly ! Book here rooms if you are coming here for picnic with your friends.\n\nOwner is too kind.\nPremium rooms are also available here.\nThey have kitchen and room service also available.\n\nVery Hygienic and well maintained.\nNice ambient climate.\n\n:)",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great food and very helpful staff. The owner was very kind, humble and diligent. Awesome place to eat homely food.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The hotel is located in a very nice location, the scenery is superb, the group and the rest are found here, the location is good, the food is good, and the stay is good. (Paid review )",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Mrugaya Nature Retreat Resort",
      "rating": [
        4.4
      ],
      "address": [
        "opp. H.P. Petrol Pump, Nangarwak, Amboli, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "A nice little cozy place surrounded by dense trees and sounds of chirping birds, very near to highway yet very quiet and peaceful.\nThe room was clean and well maintained, and the caretaker staff very responsive and friendly, attended to all our needs, and cooked delicious breakfast.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Nice friendly place very close to nature, with all basic ammenities coverd. Consider this a homestay rather than Hotel/Resort.\n\nWe were group of 4 and had a good time.\nLocation wise its perfect,  adjacent to highway and eveything is within close proximity.\n\nOnly breakfast is served which was really good.\nLunch/Dinner can be ordered or if you prefer visting restaurant there are few places within range of 1KM which are very good.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "If want to be in bliss of nature. This is the place. Economical also.\nNature at its best..in sort of forest resort, with various bird's. Best part --- No TV, No AC in room., because at this place you are not supposed to be in the room. You can casually sit under the tree shade in the surrounding.\nThe owner Parag is very generous host and service/ hospitality is very good.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best places to detox your soul . Amazing service, neat and clean rooms . There are plenty of water baths for birds where you can see birds .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the best resort I have visited recently. The room was well equipped and the service was excellent. It’s located within the small forested area, giving ample opportunities to watch wildlife. Entrance canopy is awesome, very good place to relax and chill. Excellent hospitality.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Shivmalhaar Hotel",
      "rating": [
        3.3
      ],
      "address": [
        "Vengurla-Belgaum Road, Amboli Hill, Taluka, opp. Police Check Post, behind Dattamandir, Sawantwadi, Amboli, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "Hotel location is good, ample of parking area. With prior information we reached by 11pm. The rooms very kept ready with extra bedding as asked. The good part ends here.\n\nHotel looks like one of the old hotels in Amboli and not maintained well. Rooms were clean but bed sheets, pillows very dirty. Bathroom had lots of earthworms.\n\nThe hot water starts only after 7:30AM.\n\nWill not recommend to family.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "It's okay. We had gone during monsoon and it's got fixed hot water timings but that's because they want to save fuel owing to the topography of the place. Yes, there's a feeling of pervasive dampness but was the effect of relentless rains. The location is good and convenient. So just to stay for a couple of days, it's a decent place. That too the price is ₹ 700. And nice hospitality. So I'd recommend this place.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "This hotel is budget hotel, it is clean, spacious and ample parking space. We stayed for one day but service and food is really good. The view from hotel is eye pleasing. It is good choice for people who want to enjoy nature and trek, go places, all picnic spots are very near from this hotel. One cannot consider if luxury is priority. Over all I rate 3 stars out of 5 for this hotel.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Not a place to stay with family. Place is OK if you're looking for a cheap place just for sleeping. Latest experience with the room was not so good. Room was not clean and windows rattle continuously with the wind. Agreed that it is difficult to manage in a place like Amboli which receives high rainfall but basic cleanliness could have been managed.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The hotel is good but a bit outdated and looks old from outside. The location is very good as it is just meters away from the Highway .\nThe rooms are ok , the beds and mattress were mediocre. The toilet and bathroom were also ok.\nThe view from the rooms is very good , try getting the top floor rooms facing opposite to the highway. Overall the ambiance is calm and quiet and you can hear all the burds from the forest.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Hotel JRD",
      "rating": [
        3.3
      ],
      "address": [
        "X283+7W9, Vengurla - Belgaum Rd, beside Bharath Petrol Pump, Jakatwadi, Amboli, Maharashtra 416532, India"
      ],
      "reviews": [
        {
          "text": "Was good but since facilities were less than expected and room charges are high one should definitely go to other hotels.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The food was very tasty and the quality was also very. The service was extremely good and the ambience was average but loved it as it was open and surrounded with lush green trees and mountains a little far away, the view is amazing 😍. The rates were very affordable just that quantity was little less, one Sabji is not enough for 2 people. Rest everything was good. A suggestion to the owner that please increase the quantity.....one bhaji should be sufficient for 2 people as per standard hotel quantity but your bhaji wasn't sufficient at all. Thank you🙂",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Very good place to stay. This place do have a bar and restaurant attached. Apart from that breakfast and beverages also available and located just beside highway.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Given the tourist footfall that Amboli has, one expects a good looking hotel from the outside; to serve even good food inside. But sadly the seating inside the restaurant gives you an idea of what you can expect. The food is strictly okay. Suggest to look for other options and give this one a miss if you are with family",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Probably the best place to stop over for lunch /dinner while heading somewhere.\nBathrooms are quite clean.\nThe property is quite nice with a play area for children.\nThe rooms are okay, with primitive bathroom fittings. Rooms could definitely be improved. Better options could be found to stay in Amboli.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "HOTEL MADHUBAN",
      "rating": [
        4.4
      ],
      "address": [
        "Nangartas wadi, aajra fata, vengurla - belgaon road, Amboli, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "Awesome restaurant for Breaskfast and other meals,\nClean and hygienic surroundings and toilet.\n\nWe tried Amboli plate and masala Maggi. The taste and quantity of food is very good and all at affordable cost.\n\nEven if mobile phone network is not available, the restaurant has its own WiFi connection which is fast and was very useful for us.\n\nPeople are nice, friendly and cooperative.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Food was nice.\nBangda Fish fry must try.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good veg-non veg food.....\nSpeciality in sea food......",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had breakfast at this restaurant one time and since then this place is my favorite one",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "What can I say!!!! After traveling for nearly 8 hours the lunch we had on this place was simply out of the WORLD. Thali they serve is the BEST. Taste is magical. To our surprise the person who made this food is a Budding Chef and currently pursuing his college.\nWe made another pit stop to this place while returning back from goa and again we were not disappointed with breakfast menu.\nThe taste of omelet and misal is outstanding.\nClosure, the Masala Tea was very refreshing .\nIf you pass by this restaurant, pls do take a pit stop to enjoy the food they have to offer you.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Aranya@mboli",
      "rating": [
        4.9
      ],
      "address": [
        "Kegad Shirgaonkar point Amboli, Chaukul, Kegad, Maharashtra 416510, India"
      ],
      "reviews": [
        {
          "text": "This homestay sits on a pretty hill near Amboli, surrounded by peaceful jungle. It's a perfect escape from busy life for anyone who loves nature. Both Gawade kaka who maintain this property are wonderful hosts.\n\nFor nature fans, this is one of the best places to stay in Amboli. The views are amazing, the atmosphere is calm, and the location is just perfect. The sunrise here is incredible. Plus, they serve delicious home-cooked meals with kokani taste. The rooms are kept nice and clean, so you can just relax and enjoy nature. We had a great time and highly recommend it to other nature lovers. You'll really enjoy your stay here.\n\nWhen we visited in April, everything was covered in mist, especially in the mornings. In afternoon , it was a nice breeze up on the hill, so we didn't need a fan in the room\n\nWe're already planning our next trip to this place. This place has stolen our hearts.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "A very peaceful calm beautiful location surrounded by nature. We stayed in this location for 4 days in Dec last week. We had a great time. Away from busy life this is the best place to spend time in nature. Gavade uncles are great host. We being Vegetarians enjoyed the home cooked tasty food by Gavade uncle. We will definitely visit again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "One of the best homestays in Amboli for nature lovers. Great view, peaceful, pleasant, location makes it perfect homestay. Sunrise from this place is just awesome. Homely food. Rooms are well maintained. You can relax and enjoy the nature. We had good memories. I highly recommend this place for every nature lover. YOU WILL LOVE THIS PLACE.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Really noteworthy and memorable place of stay.\nGreat views from the room itself. The location of the rooms is very cleverly done. No network here, which is a good thing. Really one place where you can nicely detox from devices and spend time with loved ones.\n\nHighly recommended of you're planning to spend quality time.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Located on a beautiful hill near Amboli.  The stay and rooms are basic but neat and clean. We visited in monsoon so it was all covered in mist. Mr. Gavde and his brothers run the place. The food is homely and delicious. If you love to stay in a nature dominated place with beautiful views around and are not fussy with amenities and all, this is the place for you. Loved our stay and will visit again.\nNote:  There is no network coverage other than BSNL. You'll have wifi at their dining area.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    }
  ]
}