{
  "places_with_reviews": [
    {
      "name": "Taj Swarna, Amritsar",
      "rating": [
        4.4
      ],
      "address": [
        "Plot No. C-3, Outer Circular Road, Opp. Basant Avenue, Nirankari Colony, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "Food is good. Rooms are cozy. Breakfast buffet spread is below par and lacks variety. I stayed for 3 nights and did not see any change in the breakfast menu. Surprisingly no shaving kit was there in the room and it was given only after asking. Complementary tea coffee sachets were not replenished on the second day. Got it after asking. There was some issue with the AC of the room. They fixed it promptly. Overall ambiance is good. Every morning you get to enjoy live play of Sindhi sarangi at the lobby.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I recently had the pleasure of dining at Taj Swarn, and I must say, the culinary experience exceeded all expectations. Chef Anish's special care for kids truly stood out, ensuring a delightful dining experience for our little ones. Chef Rashpal's sarson ka saag with makai roti was an absolute delight, bursting with flavors that transported me to Punjab.\n\nFurthermore, Chef Maoranjan's South Indian specialties, including dosa, sambhar, and chutney, were prepared with such authenticity and finesse, making us feel like we were dining in the heart of Chennai. The attention to detail and personalized touch from each chef made our dining experience truly exceptional. Kudos to the culinary team at Taj Swarn for creating such memorable moments!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I have stayed at several other Taj Hotels and have always been thrilled. I have always been particularly impressed by the attentive, helpful, and amiable staff. The next thing to mention is the incredibly delicious cuisine. The breakfast dishes alone are a feast.\n\nNow we come to the Taj in Amritsar. This hotel is also in sound, not new condition. The rooms are reasonably clean and well-maintained. The bathrooms are well maintained but could do with a few touch-ups.\n\nUnfortunately, the Taj in Amritsar has one major problem: the service at reception and dining room. We often had to wait 20 minutes for the ordered coffee or tea. We often had to wave the waitress over to us. No attention was paid to us, even though only a few other guests were in the dining room. The chefs were often standing around in the kitchen on their mobile phones. Orders were forgotten, and we had to keep asking. The servers mostly talked to each other and only attended to the guests when requested. The staff obviously have no interest in providing good service. The breakfast buffet also fell far below the expectations we are used to from Taj Hotels. It was loveless, always the same thing every day. The reception also needs to be more staffed. And you still have to wait. No friendly words, greeting, or interest in providing good service. Our almost week-long stay at the Taj Amritsar was a great disappointment.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good rooms as expected by Taj. But the service in the dining was lack lustre. The food offerings were also not the best i have experienced considering i have had breakfast buffets in other Taj properties. The experience was meh at best. But the staff and people in general there were very nice hence the three stars.\n\nNot recommended.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "My stay at Taj Swarna in Amritsar was nothing short of exceptional. From the moment I stepped into the lobby, I was enveloped in the warmth and elegance that Taj hotels are renowned for. The interior design is a beautiful blend of modern chic and traditional Indian elements, creating a luxurious yet comforting ambiance.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Ramada by Wyndham Amritsar",
      "rating": [
        4.3
      ],
      "address": [
        "117, 1, Hall Rd, Hall Bazar, Katra Ahluwalia, Amritsar, Punjab 143006, India"
      ],
      "reviews": [
        {
          "text": "My husband and I stayed here for 1 night on a 3-week trip through India to visit his family and see the amazing landmarks and cultural history. This was definitely one of the highlights of the north-India wing of the trip. The hotel was clean and a very pleasant walking-distance to the Golden Temple. The room had nice amenities (including a working shower which is not always the case throughout India), and the food in the restaurant was absolutely lovely. I'd stay here again if ever we make another trip to India. Amritsar was a lovely city to visit and explore, and this hotel definitely kept us comfortable and well-rested.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Excellent experience of staying in Ramada Amritsar hotel in April 2024. Location is very good for shopping and to visit Golden Temple. Breakfast spread was too good and we enjoyed",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I am glad that I chose this hotel during my visit to Amritsar. A team of no nonsense staff made the stay pleasant. Check in was easy. Food is as good as you get in the locality. House keeping is good. Proximity to the temple is a major attraction. Jalianwalabagh and partition museum which tourists should never miss is very close by. And being right inside a market makes things easy for shopping enthusiasts.\nThank you team Ramada for making my stay pleasant!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Behind the reception, the hotel quite proudly put up their review scores. You can see the scores steadily go down over the years and that was our experience too.\n\nPros:\nIt was a 15min walk to the Golden Temple (Harmandir Sahib).\n\nCons:\nNot up to international standards in any way.\nThere was a damp, disgusting smell in our rooms.\nThe beds and bedding looked as though they hadn’t been changed in a long while.\nThe showers leaked onto the bathroom floor.\nThe breakfast was very limited and disorganised. One day, there were no cups for coffee. Overall, the quality was very low compared to other hotels.\nThe staff at check in were not very good. The process was slow, and they said some silly things.\nThe rooms are not sound proof in any way.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "USP is location of place right in middle of market,near to Golden temple approx 1 km away. Rooms were neat and clean but little small as compared to other brand. Staff was too supportive and very attentive. Breakfast option was good enough for Vegetarian.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Makhan Fish and Chicken Corner Amritsar SINCE 1962",
      "rating": [
        4
      ],
      "address": [
        "Makhan Chowk, 21A, Majitha Rd, near Madaan Hospital, Sehaj Avenue, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "1. Service is good and fast .\n2. Food : tried both fried and tandoori fish . It was fresh but nothing great in taste … you will need to add your own flavour . Wish the fish was marinated . It would have been yum !!\n3. Tried the vegetable crispy in the Chinese section. It was 90% big chunks of cauliflower. They think that the customer can be fooled !\n3. The heavy rush makes people feel that the food is great",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Today’s visit to Makhan fish & chicken corner was awesome.\nTheir staff r super cooperative.\nShout to captain Karan.\nWe was on in his toes.\nThe food was awesome\nParking facility available\nWashrooms were neat and clean.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We had dinner here while we visited Amritsar, based on the reviews and recommendations. The place was too crowded and there was a waiting for the seats, however it didn't take much time.\nHad the fried fish recommended by the helping staff and a regular chicken item. Frankly I couldn't understand the hype about the fish fry. I didn't seem kind of special or too different from others.\nPrices are quite high.\nOne can have alcoholic drinks with the food in the family seating area also.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The Makhan fish corner is an iconic restaurant that is ofcourse famous for its fish. We decided to head over for some dinner and luckily got a table soon enough. The place tends to get crowded towards the evening. Its a family restaurant and has ample of seating. The staff is polite and prompt. We tried the amristsari fish which was well cooked but lacked taste. We also had some manchow soup which was good. The prices are a little expensive but if you want a good dining experience then you should head over.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Mouth watering fish fry!\n\nThis place was recommended by my friends. When you reach the place, it has a bar and a separate restaurant, so you can choose where you want to sit. I ordered their famous Fish Fry Sangara. It was good! The fish was fresh and its their most sold item, so you can be assured about its quality. Its very different from the fish fry you get in southern part of India, you can clearly see a coating of spices on this fish fry.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hyatt Regency Amritsar",
      "rating": [
        4.4
      ],
      "address": [
        "MBM Farms, Grand Trunk Rd, Rajinder Nagar, Maqbool Pura, Amritsar, Amritsar Cantt., Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "Stayed at this property twice now, and its a fantastic Hyatt, especially for the price and for a Category 1. The service here is amazing, the staff are super helpful and welcoming, they even remembered me when I came for the second visit. The rooms are  quite nice (not the biggest, but still spacious). There is a gym also but its quite small and there's no air conditioning inside, this would be one thing to improve.\n\nThe only downside is the location, its a bit outside the city center, but the plus is that it is right next to a big shopping mall and right on a main road, so the city center is only 10-15 mins by car. The hotel also offers a daily shuttle to the Golden temple (early morning and late evening)",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a great time staying at this hotel. Rooms were clean. Restaurant was good, it’s centrally located as well.\nStaff was good and welcomed us well. Special mention to Mr Dinesh, who took extra care of our comforted and requests.\nWe requested for an early check jn and we had a child along with us, all went well.\nWe had a great vacations and a wonderful stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "\"I recently stayed at the Hyatt Regency in Amritsar and it was an absolutely amazing experience..\nThe room was spacious, clean, and well-appointed, with all the amenities one could ask for. The hotel's facilities, including the fitness center and pool were top-notch!!\nThe food at the hotel's restaurant was delicious, with a wide variety of options to choose from.\nI was extremely impressed with my stay at the Hyatt Regency and would highly recommend it to anyone looking for a luxurious and comfortable stay in Amritsar. It truly exceeded my expectations and made my trip a memorable one.\"",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This is the worst 5 star hotel I have ever stayed in my life. The room is so noisy - you can clearly hear the above room people walking, pee, fresh toilet, shower + the worst sound storm - when they open/close the bathroom door. You can also hear people walking & talking outside of your room.\nYou are paying a 5 star hotel room but actually staying in a 2 star hotel building.\nRegardless air-conditioning temperature settings, two different Hyatt brand hotels will always make room cool - chilly & non-stop.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I recently stayed at this hotel while visiting from states, and unfortunately, it was the least enjoyable experience compared to other hotels in the chain like grand hyatt or hyatt chd. It took an hour to receive my room keys, and once settled, the noise from water pipes in the room above was constant and disruptive. The staff seemed indifferent and sometimes rude, which was disappointing. Additionally, during my stay, there was a private event with drunk guests wandering around, making the atmosphere feel unsafe for families.\nDespite the good quality of the food, the service was lacking. Moreover, the confusing entrance lacked proper guidance. Overall, my stay left much to be desired, and I wouldn't recommend this hotel for future visits. 😕",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Fairfield by Marriott Amritsar",
      "rating": [
        4.4
      ],
      "address": [
        "Fairfield Marriott Rd, INA Colony, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "The staff were excellent and treated us like royalty. Food quality was very high with decent choices at dinner and breakfast. Rooms were a little tired and if you are over looking the internal courtyard you are likely to be woken by the restaurant music at 3am. Hotel isn’t right next to central city, it’s a 15 minute rickshaw ride.\nThe hotel has a driver Sandeep who can be hired, he was very helpful when we booked him.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The rooms are really small. Buffet was good, but when I ordered a peach ice tea... It was really really bad. They just added water, and a lemon in it, when asked for sugar syrup the guy had no idea what it is.\nStaff throughout was kind and gracious, but need to work a little on their management during buffet timings, food services and understanding customer needs.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We thoroughly enjoyed our time at the Marriott! The amenities were lovely from the pool to exercise room and the daily brunch was excellent. We had car service through the hotel which was excellent, affordable and safe. Sukraj was our driver and he was so friendly, kind and knowledgeable. So grateful to have had him as our driver and tour guide!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The Fairfield by Marriott Amritsar is a solid 4-star hotel offering a comfortable and convenient base for exploring the city. Whether you're on a pilgrimage trip or a leisure visit, this hotel provides good value for money.\n\nPros:\n\nGreat Location: Situated [mention distance] from the Golden Temple and other key attractions, making sightseeing easy.\nClean and Modern Rooms: Rooms are well-maintained, offering a fresh and comfortable space to relax after a busy day.\nFriendly Staff: The staff is helpful and attentive, ensuring a smooth stay.\nDecent Breakfast: The breakfast buffet offers a good variety of Indian and Western options to fuel your mornings.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "From the moment I walked in, the warm and welcoming atmosphere made me feel right at home. The staff were incredibly attentive and went above and beyond to ensure my stay was comfortable and enjoyable. The room was immaculately clean and beautifully decorated, providing a cozy retreat after a long day of exploring the city. The hotel’s amenities, including the pool and fitness center, were top-notch and added to the overall luxury experience.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Holiday Inn Amritsar Ranjit Avenue, an IHG Hotel",
      "rating": [
        4.5
      ],
      "address": [
        "District Shopping Complex, Gumtala Sub Urban, B - Block, Ranjit Avenue, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "Well maintained property. Very clean. Comfortable beds. After whole day sightseeing, good night sleep is very important for me. To get rejuvenated for the next day. So, it was awesome. Although the buffet breakfast was not that lavish which normally we expect staying in 5 star hotels, quality of breakfast was also of 3 star rating. We stayed in deluxe category room , so I feel that 2 dental kits and comb should already has to be present there, for which we have to call on room service number, bcoz the housekeeping button was not working. So small things make big difference as I am also from hospitality industry, so know the importance.\nAllover stay was comfortable and good.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I will definitely recommend this hotel to a tourist visiting Amritsar. Now, for the rooms, they are comfortable and you can get a good view out if lucky. Service is the weakest part, not that time is a problem, but the attitude of the people. I feel they are a bit hostile and arrogant. The location is just amazing. It is extremely close to all tourist spots. However, in the food department strangely the breakfast menu was repetitive and didn't taste that good, but as for lunch and dinner, they will offer you some of the best preparations you might have ever tasted.\nDo try both veg and non veg options.\nYou can definitely give it a shot",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I had very good stay at hoilday. Best hotel in Amritsar and centre in the Amritsar. Front desk team helped me out to arrange the hoarding passes. Will be come soon at this property again. I recommend this hotel to every one best food at Amritsar. Service staff was very polite",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I enjoyed the buffet in the morning. I'm glad to get the services by your amazing staff Jatinder. She was quite jolly and helpful.\nGrateful to start a day having a wonderful conversations.\nThank you to all the staff there.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I would give minus points if it was possible. I am an NRI who booked 10-12 rooms for 4 days. The booking was not done appropriately as I had to tell them each and everything. Firstly they said I did not have any reservation, but when I showed them the text messages it took them 10 minutes to find my reservation. We had booked the rooms with extra cot , which they did not provide till after midnight. That too I had to call them 6 times. Then I asked them to put the cakes in the fridge , no one came till 2 hours to pick them up. I am not at all pleased with the service of this hotel. I have to ask multiple times for simple things. I have been to Holiday inn in USA, Canada and other countries. I do warn people to first check before coming and staying here. I stayed in best western last year and their service and cleanliness was much better than holiday inn",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Courtyard by Marriott Amritsar",
      "rating": [
        4.6
      ],
      "address": [
        "52, Mall Rd, Krishna Nagar, Green Avenue, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "I had the best experience in this hotel!! Hotel staff members were very humble and sweet.\n\nLocation is very appropriate and the parking service was good. Best thing was that it was a very clean and safe place. Ambience was the best thing.\n\nServices were very easy to coordinate.\nTotally amazing experience. Planning to stay again as soon as possible.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The Courtyard by Marriott Amritsar lives up to its 5-star rating. Whether you're visiting Amritsar for the Golden Temple or exploring the city's rich history, this hotel provides a comfortable and luxurious home base.\n\nHighlights:\n\nExcellent Location: The hotel is conveniently located, allowing easy access to major attractions.\nSpacious Rooms: Rooms are well-appointed and offer plenty of space to relax.\nTop-notch Service: The staff is friendly, attentive, and always willing to go the extra mile.\nDelicious Food: The hotel's restaurants offer a variety of cuisines to tantalize your taste buds.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The staff at this establishment is incredibly courteous and professional, ensuring a pleasant experience for guests. The culinary offerings are delightful, showcasing a variety of flavors that tantalize the taste buds. While the rooms could benefit from some enhancements in maintenance and cleanliness, the overall ambiance of the property remains inviting. The swimming pool and garden are impeccably kept, providing serene spaces for relaxation. With its prompt service and inviting atmosphere, this property presents itself as a commendable choice for accommodation in Amritsar.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Excellent location for visiting the Golden Temple and the hotel is also close to great local shopping and eating options. Staff are very helpful, courteous, and friendly.\n\nNice view from the rooms. Enjoying watching the sunset.\n\nThe reason for my low rating is the rooms and bathroom amenities. I first got a room with a giant column in the middle (see photo). I complained and was moved to a better room the next day. Was told hotel was full that night but I walked past several empty rooms at around 10 pm and for some reasons, the doors were left open. The mattresses are old and lumpy and need to be replaced. We woke up with a sore back everyday.\n\nThe bathrooms were always low on amenities. Gave 1 hand towel for two guests. No extra bath towels. Towels are old and frayed. Only 1 toilet paper roll in the bathroom. When it finishes, you have to call and request for more … and they bring you one more. Really?!!!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The staff were incredibly friendly and accommodating, ensuring that every aspect of my stay was comfortable. The room was spacious, clean, and well-appointed, with modern amenities and a comfortable bed. The hotel’s location was also perfect, close to many attractions and with easy access to transportation. I especially enjoyed the delicious breakfast offered each morning, with a variety of options to choose from.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Radisson Blu Hotel Amritsar",
      "rating": [
        4.5
      ],
      "address": [
        "Ajnala Road, Airport Rd, 8th Mile Stone, Bal Schander, Amritsar, Bal, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "During my business excursion to Amritsar in April 2024, I had the opportunity to lodge at this establishment, where I was immediately struck by the impeccable cleanliness and well-organized layout of the property. My accommodations were notably comfortable, and I thoroughly enjoyed the delectable cuisine offered at the on-site restaurant. However, upon departing, I inadvertently left behind my blazer in the room. Remarkably, the hotel staff promptly arranged for its postage, a gesture that greatly contributed to my satisfaction as a valued client.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Stayed for 2 nights as part of a longer trip.\nThe room was comfortable although the shower cubicle leaked all over the floor. Also, a stain on the sofa when we arrived.\nRestaurant was nice with good range of dishes",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "\"Absolutely delighted with my recent stay at Radisson Blu Hotel. From the moment I walked in, the front office staff's warmth and professionalism set the tone for a fantastic experience. Their attention to detail and willingness to go above and beyond made me feel valued as a guest. The room was impeccably clean, the amenities were top-notch, and the overall ambiance was inviting. I highly recommend this hotel to anyone looking for a memorable and enjoyable stay. Kudos to the exceptional front office team for making my stay truly remarkable!\"",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Just from the welcome, we (me and my partner) had a delightful experience at the property.\nWe got an upgrade to a suite upon arrival which made it extra special.\nThe dinner we ordered for room service was fresh and presentable. 10/10 on taste too.\nFor breakfast, we were running a bit late but we were still looked after very well, thanks to Pooja. From setting the table to making sure we had everything we needed including the lovely chai at the end.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very comfy rooms. Fitness centre well maintained. Mrs. Chandani was very warm in her hospitality. Delicious food. Spacious rooms.\n\nSuggestion to management: Please keep packaged drinking water instead of your filtered water. It brings trust for the customer.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "M K Hotel",
      "rating": [
        4.2
      ],
      "address": [
        "District Shopping Complex, Gumtala Sub Urban, B - Block, Ranjit Avenue, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "I recently stayed at MK hotel for 2 days and my experience was mixed bag.\n1) Accommodation (2/5) - The rooms were comfortable and provided decent level of comfort.However a notable downside was the constant presence of trolleys and cleaning supplies outside the rooms, making the overall ambience less appealing and rooms locks were not at all working properly. The room service seemed to be disorganized, affecting the overall quality of the stay.\n2)Service (2/5) - Unfortunately the service didn't live upto the expectations.Staff members appeared disinterested and their responsiveness was below par.We had to call for things a lot number of times. The presence of room service trolley outside rooms was inconvenient and gave a cluttered feel.\n3) Hotel quality (2/5)- The overall quality of the hotel left much to be desired.While the rooms were comfortable ,the lackluster service and disorganized presentation outside the rooms detracted from the overall experience.The hotel needs to focus on maintaining a more polished and inviting atmosphere for guests.\n4) Common areas (3/5)- The halls of the hotel were a highlight,offering a more pleasant and well maintained environment compared to the rooms.The common areas were well lit.\n5) Food (4/5)- one of the redeeming factors of my stay was the quality of the food.The hotel's culinary offerings were commendable,with diverse and delicious menu.This was a positive aspect that added some value to the overall experience.\nIn conclusion,MK hotel ,Amritsar has potential,especially with its comfortable rooms and good food.However,improvements are in the areas of service,hotel maintenance,and overall ambience to make it a more enjoyable and satisfying stay for guests.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Lovely place. Polite staff. Good food. Rooms are kept clean. The bedsheet and the things inside the room are also neatly kept. I am impressed and giving a 5 star rating. Good luck to the management and the entire team.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We had booked their Venus Hall for our son's birthday party. The overall experience was good but they could not commit to their word. We where promised a discounted rate which they readjusted the same amount in their service tax. Very arrogant General Manager cancelled our discount and charged us an additional amount. Very disappointed that a person being held responsible for the management of the hotel does not understand how to respect consumers",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Even though one of the oldest luxury hotels in Amritsar but in my last visit on 31st March, 2024 I noticed it's losing its sheen.\nEven though I am not the right guy to preach but can't refrain from advising them to pull up their socks and face the competition head on.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I have visited over there....... such a nice place and location is also great over there...... I would definitely love to plan my stay over there if I get any chance....... even the services all are great.......💓enjoyed a lot",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Comfort Inn Alstonia",
      "rating": [
        4.1
      ],
      "address": [
        "SCO - 111, DISTT Shopping Complex, near Passport Office, Gumtala Sub Urban, B - Block, Ranjit Avenue, Amritsar, Punjab 143001, India"
      ],
      "reviews": [
        {
          "text": "Room (305) was okay with clean linens. The bathroom is not well designed. The shower area is rectangular and there is no shelf to keep toiletries. The exhaust did not seem to work, and there were molds in multiple locations. There is very little space around the WC. However, the water temperature and pressure were good.\nThe breakfast spread was limited with very slow service. Didn't get tea/coffee even after a 10 min wait. Food quantity was just acceptable. The bar served better coffee, though.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I recently stayed at your hotel and I wanted to share my feedback regarding my experience. Unfortunately, my stay was not satisfactory. The rooms were not well-maintained, and my visit to the restaurant for breakfast was quite disappointing. Despite arriving at 7:30 a.m., the breakfast was not ready, and even after ordering tea and paratha, I did not receive them after half an hour.\n\nWhen I brought this to the attention of the front desk staff, I felt that my concerns were not properly understood, and the response was lacking in customer service. Consequently, I decided to check out and leave the hotel.\n\nI believe it's crucial to address these issues for the improvement of your services. I hope my feedback can contribute to a better experience for future guests.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good hospitality.\nHotel breakfast spread is elaborate .\nStaff is polite and helps with everything.\nRamandeep was very kind and helped us with breakfast items.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I just had my last visit in this hotel, overall experience was good . Rest the reviews are somewhat true like the bathrooms a bit small. Reat service and food was great , prices are quite high but compared to other big franchisees it is bit affordable",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent hotel and restaurant along with Excellent service and food quality. Ajay one of their staff members provides great service and very polite in nature . Overall great experience over there.  👌",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    }
  ]
}