{
  "places_with_reviews": [
    {
      "name": "Hotel Temple View Inn",
      "rating": [
        4.6
      ],
      "address": [
        "Sisganj Sahib, Road, Keshgarh Sahib, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "The whole team were helpful and happy people.\nHad a great experience and an unmatched view.\nThe room was huge, bed was so comfortable and bathroom was great. The place was immaculate and could not have been happier.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We've booked a room and made payment already. We informed the hotel that we would arrive late and check in around midnight. We called the hotel before the check in date and the hotel confirmed us that the room reservation is confirmed.\nOur flight was delayed, once we landed and were travelling to the hotel, we called the hotel. They said they already cancelled our booking and gave the room to someone else already and they don't have rooms available. So at the end we had to find another hotel to stay around midnight.\nOn the next day, we called the hotel to ask for refund of the payment we already made. The hotel said that we did not turn up and asked us to directly talk to Yatra the website we booked the room. Overall, we are not happy with this hotel.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Brand new 2BR, they gave us a room with a fabulous view of the gurudwara and the surroundings. Room service and food was really fresh and tasty. They accommodated all our requests. We appreciated that they called us ahead of time to give us directions that avoided a crowded market place, but it is a difficult place to reach in case you come during peak hours.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Overall experience was nice.\nElevator was not working so we had to take stairs every time.\n\nStaff was loud in the kitchen sometimes during night that was annoying.\n\nThere was some green stuff in the washroom water .\n\nEverything else was good. Food was good too.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "A great place and Management was top notch and friendly and the same goes for their team also,Very hospitable, fríendly and service oriented. Mr Mani (Management ,sorry if i spelled wrong) was great and Kamaljeet in service staff also.\nLocation is unbeatable. Overall worth every penny.\nThanks everyone making my stay memorable.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "HOTEL VIRASAT-E-PUNJAB",
      "rating": [
        4.8
      ],
      "address": [
        "V.I.P Rd, near TAKHAT SRI KESGARH SAHIB, Dashmesh Colony, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Virasat E Punjab is an ideal hotel to stay while on your visit to Anandpur Sahib.\nThe hotel is in close proximity to Takhat Sri Kesgarh Sahib and situated in a peaceful atmosphere. The rooms are spacious and washrooms are clean and well maintained. The host Mr Harteg Bir Singh is more of a 'Dost' (hindi for friend) who takes good care of guests supported by his affectionate family. Harteg jee is well versed with the heritage and glorious history of the city. The hotel has all facilities like hot water geyser , Air Conditioned rooms , Car parking & hygienic bedding.\nWe also enjoyed on demand  ' home styled cooked food ' services in the hotel.\nThe hotel staff is well mannered and helpful too.\nI stayed with my family for 3 days and had a wonderful overall experience.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Very nice hotal service near by gurdwara Sahib nice staff 5 star hotal",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Best Hotel. Very close to Gurudwara. Extremely happy with the ambience, amenities, food quality. Owner was so helpful as he dropped us to gurudwara in his own car during rain.😊",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Hotel owner is very kind hearted and had indepth knowledge of Sikh history. Hotel services was amazing and food was delicious. The room was very comfortable and everyone was very soft spoken and Friendly and experience was very good the one of the best property in anandpur to stay as a couple the experience was good. there are families staying but no disturbance was created so it's good",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Beautiful Hotel. Very close to Gurudwara. Extremely happy with the ambience, amenities, food quality, quantity and with the Hospitality, which was beyond my expectations and specially loved the lil sardarji host of the Hotel! This hotel is very much safe for GIRLS as we were girls so the experience was very pleasant for us. Owner was so humble that he dropped us to station in his own car.  🙂🙂",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Holy City Paradise Inn",
      "rating": [
        3.7
      ],
      "address": [
        "Sri Dasmesh Academy Road, Khalsa Heritage Memorial Complex, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "The rooms are clean and neat, altought few rooms needs a little touch up. The staff and the owner is very helpful and considerate. Would recommend this hotel to everyone.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Holy City hotel is located between the two roads (Dashmesh Acadamy road and VIP Road) Anandpur Sahib.\n\nOverall it's a good place to get in and dine, the food quality is good and tastes better than others . The weather of Anandpur Sahib is superb, slightly cooler than other places of Punjab and a bit warm in winter as compared to other cities And you will have pollution free Air and extra cool and fresh water of Himalaya in water taps.\nYou will not get rid here",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Before payment all AC IS GOOD\nAfter payment done then , your AC switch\nTurn off from.backend  , he asking  that is technically problem , no value of money ,",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This hotel is a fairly cheap hotel and quite close to the KESHGHAR SAHEB GURUDWARA... The staff are very friendly and helpful...Rooms are very good and have AC and the management will give you a  discounted non AC room if you want a cheaper option... But on busy days it's a good emergency backup place to stay at Anandpur Saheb  and I stay here regularly now because Anandpur Saheb is so PEACEFUL and the Virasat-e-khalsa museum of Punjab Sikh Heritage museum, the most visited museum in Asia is so beautiful that it's addictive !!!🙏",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "+ good location (though Anandpur sahib is so small, anywhere is good), big room, comfortable beds.  Has an attended front desk despite listing saying they don't.\n- terrible WIFI, no shower or toilet paper in bathroom, room wasn't clean (easily wipeable grime on basin).\nNo housekeeping in three days (we don't want it but others might).  Manager/owner is nice but not so helpful - we got better advice from people in the street.  Restaurant food pretty average for the price.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel White City",
      "rating": [
        3.8
      ],
      "address": [
        "opposite Panj Piara Park, near Virasat-E, Khalsa Heritage Memorial Complex, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Very very bad service by waiters and lack of knowledge. they could not tried to understand the customer needs even how to co -operate with customers . So i would like to tell you everyone don't waste your time and money at this hotel.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice spacious rooms\n\nFood quality is also good\n\nMust visit",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Date stayed at hotel: 22nd to 23rd December, 2022\n\nAccommodation was just slightly below acceptable, the service was disastrous. Food was acceptable. The dinner provided was decent, but breakfast was disappointing in terms of service. The tea was very cold. They had never told us what time breakfast would begin, so we arrived at 7.30 AM, and waited until 8.30 AM. 8.30 AM was just before any movement started, and then the staff walked into the hotel half asleep, because we had to request someone there to call them in. We were greeted by a used coffee cup in between the double beds, and the toilet was completely broken. The toilet seat and cover were detached from the toilet. There was hair on the beds, and the tables were filthy, and we had to request for them to clean it. Overall I would recommend avoiding this hotel.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "WORST HOTEL EVER NEVER EVER GO IN THIS HOTEL ITS VERY VERY WORST HOTEL WE ORDERED FOOD AND THE FOOD COMES AFTER THE WAIT OF 1 HOUR AND THEY ALSO ADDED 600 RS EXTRA AND SAID YOU ORDERED 10 GOBHI PRANTHA BUT WE HAVENT SERVICE IS NOT GOOD AND MANGER IS SO FRICKING BAD SO WORST I'LL GIVE 0/10 OUT OF TEN NEVER EVER GO IN THIS HOTEL",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "\"Amazing service, Very helpful and courteous staff. Restaurant service at this hotel is amazing.\nIt was wonderful stay with delicious food. The room was neat and welcoming. Staff is very polite and helpful. Overall it was a very good stay. Highly Recommended... at Shri Anandpur Sahib ,  Thank you for the hospitality\".",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Mata Sahib Kaur Niwas",
      "rating": [
        4.5
      ],
      "address": [
        "Lodipur Road, Lodipur, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Clean rooms available here and very low price",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We stayed there on our way to Himachal  Its such a peaceful place to stay. Budget friendly and welcoming.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good place to stay in Shri Anandpur Sahib",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Peachful place",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "New Taj Hotel & Restaurant",
      "rating": [
        3.8
      ],
      "address": [
        "Nangal, Chandigarh Rd, Sri, Anandpur Sahib, Rupnagar, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel, comfortable and the reasonable price I paid for the room was definitely a great value for money. Furthermore, I would like to commend on culinary offerings. The variety of food available was impressive, and I thoroughly enjoyed the taste of each dish I tried. The availability of a wine shop nearby, within a short 1-2 minute walk, was an added convenience for guests who enjoy drinks and socializing. However, I would like to highlight one small issue that I encountered. The kitchen closes at 10:30 pm, which may prove inconvenient for guests who wish to order food late at night. It would be beneficial if you could extend the kitchen's operational hours or provide an alternative solution, such as suggesting nearby late-night food options to guests. Overall, my stay at this hotel was enjoyable, and I appreciate the effort put into providing a pleasant experience for your guests.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Really nice resort for marriage functions or birthday functions in Sri Anandpur Sahib. Very good catering services. Food quality is really good.  Rooms available at genuine pricing. Friendly staff and owner. Ample space for parking. Overall a wonderful experience.👍",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "New Taj Hotel is a well-known comfortable, neat Hotel located in the City of Anandpur Sahib. It is within walking distance of the famous Gurdwara Kesgarh Sahib (200 meters) and the Khalsa Heritgae Complex (100 meters). The hotel has 5 furnished room Air Conditioned/Air Cooled room. It has a A/C restaurant , a banquet hall for marriages and a conference hall. It has ample car parking space.\n\nAnandpur Sahib (Punjab,India) is a famous city associated with Sikh History. Sikh religion was founded in the City. The most famous multi-purpose Bhakra Dam is also nearby (35 km) and so is the famous Hindu Shrine of Naina Devi (20 km).",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good place and good food service are also good very reasonable rates for food",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Their new banquet hall is amazing and it's quite good. Rest everything is all about decoration 😅😅😅",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Simran",
      "rating": [
        3.9
      ],
      "address": [
        "Near Railway Station, Majara, Nai Abadi, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Good Location, just opposite to Railway Station Anandpur Sahib...\nService is good, Staff was polite, found no issue while stay...\nI'll sure didn't hesitate to visit the hotel in future...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "This is best placed and budget hotel/guesthouse. Owner is very good . Bathroom in our room was very small. Rest it was clean and good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very helpfull staff , rooms were clean , bathroom was clean\nWe just spent 1 night to catch train\nWe took 5 rooms.\n\nRooms are basic type but very clean\nHot water available in washrooms\nNo lift\nRailway station walkable distance, justa cross the road.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Amazing hotel just opposite to railway station , neat and clean hotel , staff is very good , good service, owner nature is good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very good hotel stay with femily and friends good service and very coprativ staf.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel The Crown",
      "rating": [
        4
      ],
      "address": [
        "Nangal Road, Anandpur Sahib, Majara, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Nice hotel with good and tasty food 😋\n\n1) Location is very nice and view of hotel is very charming.\n2) Food is very tasty but little expensive as compared to other restaurants.\n3) Washrooms were neat and clean.\n4) Plenty of parking available.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good place to enjoy your stay close to higway. Nice and clean premises. Food is also delicious. Shout out to team for good management and wish you guys luck for future endeavors. 🫡",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We visited this place for lunch. Our order was delivered quite swiftly. The portion of the food was quite adequate and the price was reasonable.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I recently had the pleasure of staying at The Crown. From the moment I arrived, I was impressed by the impeccable service of the staff. The staff at the front desk were warm, welcoming, and efficient, making check-in a breeze.\nMy room was equally impressive, with its spacious layout, comfortable bed, and modern amenities. The decor was tasteful and elegant, and the attention to detail was evident in every aspect of the room. The Crown offered us a range of  dining options. The food was delicious, with a focus on locally sourced ingredients and innovative preparations.The hotel's amenities were truly impressive.\nI highly recommend this hotel to anyone seeking a  memorable stay.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Bedsheet  has  some underlying plastic. That will create sound whenever u turn or change position. I had breakfast that was pathetic movie waste.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Mata Jito Ji Niwas",
      "rating": [
        4.5
      ],
      "address": [
        "6FPX+CXH, V.I.P Rd, Keshgarh Sahib, Anandpur Sahib, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Mata Ajit kaur niwas is very good hotel near Takth Sri Kesgarh Sahib Sri Anandpur Sahib and very cheap and good hotel and very comfortable place to live 😊\nAll types of facilities are Available here.\nThank you",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very good service, for pilgrims. Air conditioned rooms available with geyser facility.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I stay mata ajit kaur niwas . Its rooms is overall good but not well . Its rent is rs 500 per day which is too much compared to rooms",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The people there was cooperative and nice",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Room was quite good and peaceful environment..\nMust visit once",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Palace Plaza",
      "rating": [
        4.2
      ],
      "address": [
        "Nangal Rd, Anandpur Sahib, Majara, Punjab 140118, India"
      ],
      "reviews": [
        {
          "text": "Excellent Hotel. From the warm welcome at check-in to the impeccable room and attentive staff, everything is simply perfect. Thank you for creating such a delightful environment for your guests.\nI will gladly recommend your hotel to others.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good food and super Deluxe room good  service",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good hotel with spacious rooms and service also very good . Staff is polite . Only drawback that AC is old and makes noice .",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Best place in punjab and in Shri Anandpur Sahib ,flexible staff and friendly behaviour\nReasonable and good food\nThank you Thakur sahab the manager.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Tasty chiken and service good very nyc hotel and staff very ncyly",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}