{
  "places_with_reviews": [
    {
      "name": "ELEPHANT PUB - River valley Huts by Antara",
      "rating": [
        4.5
      ],
      "address": [
        "Anakulam - Mankulam Rd, Mankulam, Anakulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "One of the best cottage I have visited till now. The caretaker were really helpful and friendly. Great staff who knew how to serve the customer. The room was well equipped and the service was excellent. From the balcony, we could view the water and forest. The location of our room was absolutely perfect.  It felt like a private river, very clean and clear water, a very good place to relax and chill. The scenery was beautiful and it was a relieve to walk in such a quiet and peaceful environment.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The property and Hut is nice and cozy. The hospitality of the staff is amazing. They are very humble and ready for help. The rooms have awesome uninterrupted views of Forest n River from the balcony. Room amenities are up to the mark",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Located 2 minutes away from Elephant view point, the resort has a unique jungle location, offers an experience that none of its competitors do. The room was fantastic, which was spacious.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "we had the most memorable time at Elephant Pub. We liked everything about the place, the outset Greenery, birds, the iconic Stream. Great hosting, and needless to say we will come back again. A special mention to our very own Jobin, who has taken care of us quite well, fed us with amazing food and helped us with trails for walks. It was quite an eventful wholesome experience.\nThe best place to connect with nature and enjoy peace, listening to nature.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I had a wonderful experience with my family  and would highly recommend this stay. The rooms were very spacious.Having a stream nearby for bathing was incredibly convenient. Staffs were very attentive. Overall no bad experiences with them.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Rambler Garden Resort , forest resort wish 360°Mountain view",
      "rating": [
        4.7
      ],
      "address": [
        "Anakulam, po, Mullanmada Rd, Mankulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "This is without a doubt one of the best hotels in Mankulam, Kerala.\n\nThis resort is situated in the middle of a mountain, room with a breathtaking view. The hotel's service from the front desk, restaurant, and housekeeping is impeccable.\n\nRooms are very clean and spacious!\n\nThe safari trip is a must-do for everyone. They arranged the trip on request and it was an enjoyable off-road experience.\n\nThe morning buffet breakfast offered quite a few decent options.\n\nThank you for making our stay comfortable and memorable.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "One of the worst resort that I have ever seen. It cannot be called as a resort it's simply looks like a lodge. The way to the place is very bad and our car's tyre got damaged on the way to the place and we have to look for a jeep's help to get out from place.\nWhen we enquired for the rooms there the owner give us many offers regarding the place but when we reached there it makes us sad and angry. The climate is not at all friendly it's very hot and there is no ac in any of the rooms. The photos shown in google is fake we witnessed the truth when we reached the place the swimming pool's work is not over and it's maintenance is still going on but the photos shows that whole resort is set for the guests. I think even the staffs were unaware about their guests because when we contact in the number given in Google the call was attended by the owner who is settled in ernakulam and he doesn't informed any about our arrival to the resort to the staffs.\nThe owner cheated with his fake offers about the place.\nI kindly request to everyone who is searching for this place please dont go to rambler garden.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We booked the attached pool room in the downstairs. It was absolutely worth it. Great location to chill with your friends. Their service was very nice and helpful. Only thing I didn't like was,In February month the weather is not cool in the morning there.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Accommodation (★★★★☆):\nThe rooms were spacious, comfortable, and well-maintained. The bed was incredibly cozy, and the daily housekeeping service ensured that everything was kept neat and tidy.\n\nHospitality and Service (★★★★☆):\nThe staff at the resort were friendly and accommodating. They went out of their way to make stay enjoyable and memorable.\n\nAmenities (★★★★☆):\noffers a range of amenities that cater to various interests. The pool area was well-maintained.\n\nScenic Beauty (★★★★★):\nThe natural beauty surrounding the resort is absolutely breathtaking.\n\nOverall, It's a great place to unwind and connect with nature. While there were a few minor hiccups, the overall experience was very positive. I'd definitely consider returning in the future, and I would recommend this resort to anyone looking for a peaceful escape.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Rambler Garden Resort is a beautiful forest resort in Munnar, Kerala, India. It offers stunning 360° panoramic mountain views, making it the perfect place to relax and rejuvenate. The resort has a variety of amenities, including a swimming pool, restaurant, indoor games, and jeep safari.\n\nThe food at Rambler Garden Resort is delicious, with a variety of Indian and international dishes.\n\nThe resort is located in a remote area, but it is easy to get to by car. The road to the resort is a bit bumpy, but the views are worth it.\n\nOverall, Rambler Garden Resort is a great place to stay for a relaxing and enjoyable vacation. It is perfect for couples, families, and groups of friends.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Homestay Sunmount",
      "rating": [
        4.7
      ],
      "address": [
        "Kuwait, Mankulam, Kerala 685561, India"
      ],
      "reviews": [
        {
          "text": "The property is located at a remote location with very less food options. The property is simple and the host is always there to help or guide you out. It's almost an hour drive from munnar and I visited this place at a wrong time as the weather was so hot and there property doesn't have any exhaust facilities as the heat gets trapped in. I'm still rating it 5 since it'd be amazing in monsoon and winters. Also travellers should plan for food since the hotels nearby don't serve a wide variety of food.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We went there as a group of 4 boys to stay but they never treated us like bachelors instead we were treated like a family only. The owner Joby is very friendly and helpful. He provided all the facilities as well as things we wanted including food, tour guide, vehicle, etc. This is a slightly remote location ( a small village ) but we cannot be bored here since we have a river, hills all the things are beside the homestay only. It's a worthy place to visit if you are planning to go here.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Excellent location. The house is kept very clean and the most equipment is available. The host is extremely helpful and will also help you with his best you can make use of your time. A slight language barrier but that can be let go of since the host is helpful.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I stayed this homestay with my family last week. Neat and clean easily accessible. Most attractive point is near by river. It's very amazing view and service from Mr. Joby is memorable\nI highly recommend this home stay for families",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It was really grt staying at Homestay Sunmount .we really enjoyed our holidays. The only issue is it's 30km from munnar. But the place is nice",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Sky Valley Resort mankulam idukki",
      "rating": [
        4.2
      ],
      "address": [
        "Pooyamkutty - Mankulam Rd, Mankulam, Kerala 685561, India"
      ],
      "reviews": [
        {
          "text": "Tree house is superb and staffs are very good and friendly good service even we can cook in kitchen nice atmosphere",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Great location, really pleasant and clean rooms, but the thing that makes this such a good place to stay are the staff, All of the people are incredibly helpful and generous with their time and advice. Upon arrival we were warmly welcomed by the staff and Manager.\nWe had one night and a day here, which obviously also added up to the experience with a great offroad jeep safari.\nAbout the property its a very beautiful and comfortable, view from the all rooms is incredible you will fall in love with the beauty which surrounded bu hotel.\nWhoever travelling to Munnar I strongly recommend this awesome property.\nThanks..!!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Superb Stay!!\nA very Good property perfectly located,with stunning views right from the rooms.\nThe atmosphere was absolutely fantastic was fully up to my expectation. All crew on board was really fantastic, Room decor and ambience was excellent.\nI would like to thank Mr. Kiran for his ever smiling response to all our queries.in fact, all the Resort staff were very warm towards their guest. Delicious traditional food at the dining and service was quick.\nLoved the off-road Jeep forest ride and private waterfalls.\nI would highly recommend this place.\nPeaceful location!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Me and my family had a wonderful experience being at this blissful place. Primary highlight of the resort is situated at very quite, peaceful and nature friendly ecosystem. We were very happy with the privacy we received during our stay, moreover the staff were very friendly and helpful. They had this special tree house cottages, the view from these cottages were breath taking and the staying experience was truly an amazing. They also provide adventure trips like trekking in the forest and Geep safari into the jungle (one of the best off-road drive you could get in Munnar). Another point to highlight was regarding the delicious food they served during our stay, we really enjoyed the food especially the live BBQ's along during the camp fire. For a pet lover like me, it was really nice see that the resort happen to be a paradise for pets.\nTo sum up, Sky Valley Resort Munnar is nothing short of heaven on the mountain.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Pleasant stay..Good staffs....If you are nature lover and like hill stations and want to stay in jungle view then its a best place to stay. Good hotel. Large property. Clean room with all basic facilities. Reasonable with rates. Mr Kiran z very helpful..He guided us  for forest trekking.ans the experience was awesome..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "PepperLand, Anakulam",
      "rating": [
        4.5
      ],
      "address": [
        "Near, Anakulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "After we went and saw some cottages in Anakulam, we chose Pepper Land. The cottage is cool. It is very clean and the rooms are cool. On top of that, the caretaker Rahul is cool. He is always with us from check-in to check-out. Rahul is a cool chef. All the food he made for us was delicious.  The beef roast and beef fry are a must try as well as the off road jeep safari we will definitely come back again.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "It was really a wonderful experience - the trekking, waterfalls and close view of elephants at the river - everything is a memorable experience. Really enjoyed the grilling at the kitchen. A wonderful place for a family to stay and enjoy the sights .",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "No bedsheets no towel no soap in the room I ask the manager he answered we don't provide those things. The first night there was no service around. I had to go hungry to bed. The next day the service prepared  lunch for me. I think the water they served with the food was not clean. In the afternoon disentry started. Welcome Campylobacter. I spend the hole night on the toilet seat. Be aware of pepperland",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Rooms are okay but Caretaker never takes care . You are basically on your own . He was no where to be found.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Nice place to hangout for a weekend with family. Nice service. Food - you can order or can cook. Don't miss the offroad trip and most importantly watch elephants coming to drink water from forest.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Kairali Home Stay",
      "rating": [
        4.8
      ],
      "address": [
        "Anakulam - Mankulam Rd, Mankulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "Spiffing experience on staying here! Worth spending penny! I visited there on Dec 2nd  with my friends. They do have 4 rooms, which is very cozy and neat.Will refer anybody in future for this stay! It's very nearer to Anakulam  centre(350) and once you've been inside the home, you will feel like your own home and also it's beside the mountain from the city center. Really Really worth!! Thank you more for providing us the comfort and memorable stay, Don’t miss the early morning and evening views!!!!",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "A nice place to stay 🥰\nNever thought about the mist on this summer vacation! Thanks our Anu chettan 🥰",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Most lovable place. Great ambience with caring people. No cheating like other tourist places. Lot of neat water falls for healthy water bath. Trekking was really amazing. View of elephant bathing at night was beautiful. Stay at Kairali Homestay was really nice and safe at core. A good guy with very good behaviour assited us there will be a solid asset for Kairaly Homestay. Planning for next visit.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "It was a pleasant experience. Nice hospitality, and the rooms were very clean and neat. A Homely atmosphere. Like to visit this place again.. And i strongly recommend to all.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Wonderful homestay.Very clean rooms and magnificent view. A very helpful and pleasant person assisted us.Trekking was very interesting and the waterfalls were the best.\nPlanning the next visit.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Nature Homestay",
      "rating": [
        3.3
      ],
      "address": [
        "Anakulam - Mankulam Rd, Munnar, Kerala 685561, India"
      ],
      "reviews": [
        {
          "text": "Mobil number indo",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Nice place",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "A good homestay",
          "languageCode": "en-US",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Puliyamkunnel Resorts",
      "rating": [
        4.9
      ],
      "address": [
        "p. O, Anakulam - Mankulam Rd, Anakulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "Wonderful place and awesome view, walkable distance to Anakulam.\nAffordable prices for families and groups.\nFriendly and supportive staff. Highly recommend...",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "The experience was excellent. The manager of the resorts helped us a lot. Overall a good stay.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "From this resort one can enjoy the scenic view of a hill station in the morning.  This is very close to the stream where wild elephants come to drink water. Service is very good and economical.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Good stay for meetups..! We friends  stayed there for 2 days after 7 years of our college. It was a beautiful experience. Food, stay all were excellent.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Good stay with necessary amenities in a beautiful location. Staffs are humble and well mannered.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Co-operative guest house MANKULAM",
      "rating": [
        4.9
      ],
      "address": [
        "Anakulam - Mankulam Rd, Mankulam, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "Very pleasant nature vibe.. The most intresting thing about the stay was the offroad  trucking, in addition to that, during our period of stay we were really lucky to see a group of elephants, they came to drink water from the near by river-anakkulam river. =",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Highly suggested, the services offered by the stafts are so heartfelt... They continue to enquire about our comfort and felt like they are treating the guest like their own family. Thanku guys💚💚💚💚",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Rooms and  facilities are very good",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very nice and beautiful",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very nice",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Elephant Valley Cottage",
      "rating": [
        5
      ],
      "address": [
        "Valiyaparakutty Rd, Anakulam, Kerala 685561, India"
      ],
      "reviews": [
        {
          "text": "Best place for vibing , chill atmosphere. Suitable for partying without any distribances",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    }
  ]
}