{
  "places_with_reviews": [
    {
      "name": "Teela - The Glamping Resort",
      "rating": [
        4.7
      ],
      "address": [
        "NH11C Jaipur- Delhi Exp, Jaipur, Rajasthan 302002, India"
      ],
      "reviews": [
        {
          "text": "A truly wonderful experience. A location away from the busy life of city. A very good thing was that there was no TV in the room which bought us close with family. The bonfire with dinner was amazing. Excellent food and good room service. Overall a wonderful night out.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "I recently had the pleasure of experiencing the ultimate glamping getaway at The Teela. From the moment I arrived, the exceptional service stood out, especially their unique Jeep service that whisked us away to our luxurious tent.\n\nThe highlight of my stay was undoubtedly the private bonfire experience. Surrounded by nature's serenity, we enjoyed the warmth of the fire under a star-studded sky—truly magical!\n\nMoreover, I was pleasantly surprised by the immaculate cleanliness of the bathrooms. It's rare to find such pristine facilities in the midst of nature.\n\nOverall, Glamping Paradise exceeded my expectations in every way. It's the perfect blend of luxury and nature, and I can't wait to return for another unforgettable stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "A surreal experience making our annual workcation at Jaipur all the more memorable for me and my team. The rooms are nicely done, very well managed and moonlit spots that their general manager Kshitiz aka KZ took us for was worth a lifetime experience. I certainly plan to go again and be at Teela to experience solitude and serendipity of golden dunes and green.\n\nOur day tour included ATVs, Paintball and off-roading giving the team an adrenaline rush and heart full delight. Though the excitement took over the high tea hour but the snacks were mouthful and dinner spread was a delight too. We are happy that we chose Teela for our workcation this year. I would like to thank their entire team KZ, Priya, Naren for their hospitality and the amazing marshals who gave us such beautiful memories of a lifetime.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great place to get away from hustle bustle of city life. Suited for those who want adventure rather than lavish resorts. Everything was good except the kitchen service, it was bad although the food was good not amazing. Still the resort is at niche stage and lot room for activities that can be done there at resort. In all enjoyed the overall experience.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Our stay was truly exceptional! The property, staff, and overall experience were all memorable. Purely indulgent glamping with a unique blend of luxury and camping. The Sundowner setup, the cozy bonfire, and the diverse food options added to the charm. A heartfelt thanks for creating such a wonderful experience!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Achrol Niwas, A TreeHouse Hotel, Jaipur",
      "rating": [
        4
      ],
      "address": [
        "Near NH 11C, Chappar Ki Dhani Village Achrol, Tehsil, Amer, Jaipur, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "\"Staying at Achrol Niwas was an absolute delight! The serene ambiance amidst nature provided a perfect escape from the hustle and bustle of city life. The staff was incredibly hospitable, ensuring every need was met with a smile. The rooms were spacious, clean, and beautifully decorated, offering a cozy retreat after a day of exploring Jaipur's wonders. The delicious cuisine served at the restaurant tantalized the taste buds, and the picturesque views from the property added to the overall charm. I highly recommend Achrol Niwas for anyone seeking a memorable and rejuvenating stay in Jaipur.\"",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Was in this place for 2 days attending a wedding. The property on its own is good. But is it worth traveling that far to? Probably not.\nSince huge property, the wedding preparations were done spread across the property and had some lovely decor.\nComing to rooms, they are huge rooms. Room lighting is pretty low. Hot water to bathe was luke warm. Housekeeping folks claim that's the hot water. In this cold season, how can one shower there? i don't understand.\n\nFood was average. Nothing to go gaga over..",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It is not accessible as per disability point of view. No ramps were available. I did suggest the GM Mr Dara Singh for the same. Before checking in the room, do check for leaking flush, hot water availability at night and early morning. It is located in the outskirts so food can be ordered in their restaurant only. Food is ok types not very tasty.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "A very good property is maintained poorly. Staff is rude, don’t hesitate to say no for small things.. unlike other resorts/hotels in this price range.\n\nWe entered the pool, realised it was too dirty and even after telling them many time they didn’t give a damn!\n\nThe only good thing is the location and i would give 5 star to the gardner, very beautifully maintained.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Such a bad staff and property… Achrol Niwas “A Tree House Hotel” the most ridiculous people working at this property specially Mr Prem he never show respect to the customers and never fulfil what he commit at first meet… Customers ke bhi paise kha jate h… Booking krne k baad advance leke bhi last moment pr wedding event ko khrab krte h pr refund bhi nhi dete or customers k paise kha jate h! They never maintain decorum… behave badly…. Do not come and visit this property ever specially for families, couples and for wedding celebration.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Stories- The Organic Farm Cafe ( a unit of Little Things Hospitality Pvt. Ltd.)",
      "rating": [
        4.7
      ],
      "address": [
        "Delhi jaipur highway, Jaipur, Labana, Rajasthan 303104, India"
      ],
      "reviews": [
        {
          "text": "A nice getaway place at city outskirts with baori, pool, cafe seating, villas, dj dance rope course, basketball and other outdoor games for entertainment purpose. Peaceful & Nature friendly aura although a bit old fashioned. Food was average. Cold coffee was great. Overall, sun..fun..relaxation! Which is Much needed in winters. 😄 Had a STAY-CATION day!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Best place in a bit outer to Jaipur. The ambiance is amazing, I loved it.  They have limited food options but the chef is doing good work 👍\nThe only thing which I noticed during my visit is that they try to avoid accepting payment through UPI or Card as they charge 5 % extra on payment through UPI and 8 % extra on payment through card.\nEvery hospitality place nowadays accepts online payment without any extra burden on customers.\nOverall experience was great 😃",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It’s was amazing food , great atmosphere..! Polite behaviour of staff ..! Pet friendly",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "If you’re looking for a venue to do pre wedding shoots, theme parties , kitty parties with private sitting area along with food prepared with fresh vegetables this is your spot. They have game areas too. This place looks divine with aesthetic vibes. The aura of this place is filled with fun and love. There are different backdrops which are perfect for any shoot. The ambience is very eye catching also they have live kitchen and delicious North Indian food. All over I had a lot of fun and will definitely recommend you to visit it once.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Place is really beautiful. Day and night both the time ambience is really pretty. They have some amazing cottages to stay . Affordable prices, I tried honey, chilli, potato, iced tea, virgin mojito, pasta, and some more dishes.\nTaste was okayish . They have a pool area too .",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Achrol",
      "rating": [
        4.3
      ],
      "address": [
        "4XW6+MMF, Achrol, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "So amazing place",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Nice 🙂",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Awesome place with lots of greens",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Achrol Bagh",
      "rating": [
        4.2
      ],
      "address": [
        "Village Achrol, Thasil:, Amer, Achrol, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "Good setting, far from Jaipur, the location is quite quiet, but we hear a lot of music nearby two nights out of two we slept there. Quite beautiful places, Bedding quite good, many lamps and sockets do not work, the fabric roofs are interesting, but there is no sound insulation : you enter next door as if you were in the same room. mediocre food, very bad service. I even had to be the one to ask to open the swimming pool, which is normally open from 7 a.m. to 7 p.m.\nCame in a group, the evening entertainment was ridiculous, we didn't come all the way to India to have cheesy parties with French music. And the worst point : the baggage handlers do not hesitate to enter your room, being aware of your presence, whether you are ready and available or not, to take your luggage 25 minutes before the scheduled time because they are in a hurry. The same goes for the keys : I was jumped on as soon as I went out to take them back when I was going to come back a few minutes later.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Winter events are enjoyable here, but in summer, the jungle setting can be exhausting, with abundant greenery but minimal shade. Accessing the rooms involved navigating lengthy pathways, yet e-cabs were readily available for convenient drop-off and pick-up.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We stayed at this resort for 2 days to attend a family event. This is a beautiful resort. The staff is top notch. The cottages are well maintained. They have few vehicles to take you around the resort. We would highly recommend this place for destination events.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice place to spend weekend with family and friend. We went for new year  celebration and everyone loved it. Great arrangements by Reasort management & staff.. Great food too.... Keep it up.\nJust a suggestion Rugs in room need to be cleaned.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Had a destination wedding of my close family. Thoroughly enjoyed the couple of days we stayed in Achrol Bagh resort. Room cleanliness and service have a good scope for improvement.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Azizaa Resorts and Hotels Jaipur",
      "rating": [
        4.6
      ],
      "address": [
        "Delhi Highway, Mod, near Tala, Achrol, Chak Charanwas, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "Azizaa Hotel The hotel is a perfect place for destination wedding.It is a beautiful built property in Rooms are cozy and spacious with all amenities.Warm welcome with smile .Front desk staff was courteous.Food taste is amazing. Definitely will recommend to our family and friends.Special thanks to General Manger Virendra Shekhawat",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Honestly the service is really good, the rooms are good too for the cost but the distance from the city is something i didnt expect.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Azizaa Resort was Beautiful and Decor was modern and Stylish\nStaff was friendly and helpful\nRooms were spacious and well maintained\nLocation was perfect\nFood and services were excellent\nOne should visit",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Good service tasty food 😋. helping & gentle staff with quick service…i have lot of enjoyed there.. beautiful property",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I stay with azizaa resort in wedding function\nRoom is comfortable\nFood was very good\nService was very good\nAll staff help full\nNice resort\nThanks",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "SHUBHAM RESORT",
      "rating": [
        4.1
      ],
      "address": [
        "N.H.11-C (Jaipur - Delhi Highway), Near Tala Mod, Achrol, JAIPUR, Chak Charanwas, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "Nice property. Amazing food.\nSupportive host\nMust visit on your trip to Jaipur to Delhi route.\nOwner supported in each way possible",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very nice experience over there ♥️i was totally gloomed in the nature of that resort not resort but a beutiful palace 😘",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "This property is excellent.\nAnyone Enjoy there . Service is very fast",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I love this place and wonderful view most beautiful services ❤️ I'm happy",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "It's a great resort to visit with a family and friends good to have there",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Fine Acers Jaipur Resort",
      "rating": [
        5
      ],
      "address": [
        "Near, Gunawata, Seengwana, Rajasthan 302028, India"
      ],
      "reviews": [
        {
          "text": "Outstanding Location",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "SPOT ON 62478 New Jammu And Punjab Hotel",
      "rating": [
        4
      ],
      "address": [
        "National Highway 11C, Kalwad Kalan and Khurd, Rajasthan 303002, India"
      ],
      "reviews": [
        {
          "text": "For a budget friendly this place serves good tasted food and love their Chai. But what's best part about this place is their Adorable Labrador😍",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "✨ The food is of average quality.\n✨ Service provided by staffs was good.\n✨ Apart from food alcoholic beverages and soft drinks are also available.\n✨ The atmosphere is just like a highway dhaba.\n✨ We went for the food so cannot comment on the stay.\n✨ Situated near Amity University Rajasthan.\n✨ Ordered roti ( plain and butter), jeera rice,dal, paneer bhurji, Sev bhajji, masala papad.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Highway top class hotel hai all staff is friendly",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It's wonderful in a way that they can arrange for booze at anytime of day..if you are ready to spend extra bucks. Sanitation and hygiene is certainly average but food tastes ok. Availability of booze, veg and non veg food at late hours of night makes it a popular spot among students. Number of students is high due to so many universities in vicinity.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Great food.. Free parking & plenty of space.\nYou can choose to eat outside in open or use khaat ( bed ) to eat in ac or non ac halls",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Aranya By Stories Luxury Villas",
      "rating": [
        4.2
      ],
      "address": [
        "Delhi - Jaipur Highway, near Achrol, Labana, Rajasthan 303104, India"
      ],
      "reviews": [
        {
          "text": "It was mistake booking this property”\nThe reason you don't see too many reviews about this property is perhaps because not many people comes here. I did that mistake. If your coming here understand that u will not get the basic services like drinking water bottle availability in the room, tea coffee sachet, sugar, salt sachet, not even glass, we were served water in paper glass and we had asked for glasses everytime we want to drink water, there is no mini fridge, tv is there but doesn't work in any room, they don't serve non-veg, food quality is bad, there is no chef in the property. They have a cook and boys for cooking from around the village. Owner has spent money on property but not on service. Staff was no doubt very helpful. They don't have phone in the room, they don't have a proper reception. Overall not worth the price. In this price, you have lot of better and excellent options",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I recently stayed at this resort for 2 nights and had a great time.\nThe villas were huge and beautiful. The service was excellent. The food was fresh and well prepared.\nThey too have adventurous activities which I truly enjoyed.\nDr Raghav and Mrs Swarakshi were of great help. They guided me well and helped me in planning my day.\nWill surely visited this place again.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Celebrate my 25 anniversary here\nNo tension, feel and get  what I want\nNo any artificial all is with nurture",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Fabulous service and nice property",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}