{
  "places_with_reviews": [
    {
      "name": "Elephant Passage Resort",
      "rating": [
        4.6
      ],
      "address": [
        "252/IV ,Chithirapuram, Anachal, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "Everything was great, we had great experience. Very nice staff at dinner time , dinner was lavish I really enjoyed. I would say one of the best dinner. At breakfast time they were lacking in service but the food was nice. Nice ambiance and jungle theme was area. Pool area was good, maintained jungle area for morning walk. They have play area for children.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Rooms are gr8. Pool is small and was always crowded. The staffs were friendly.\nOnly thing we didn’t like was the attitude of F&B Manager. We order Caesar’s salad and it was too salty for a human to consume. We didn’t ask for replacement or refund, we just wanted them to know that it cannot be consumed. But he told salads taste like this and may be where we have had before , it might not be actual Caesar’s salad and he was boasting that he worked in Dubai for many years and this is how it is made without even knowing how horrible it tasted. He was comparing the salad with pickle and was explaining how it was made . For the price we payed, finally we got to know how Caesars salad was made 😂\n\nWe ordered some North Indian food for dinner and it turned out to be good.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had a great experience at the Elephant Passage resort . Services were very good and the staffs were readily available anytime we need them. Ambience, very nice and the surrounding was clean and tidy. Food was awesome. You could kill time by attending their various events.\nOnly surprise when we arrived at the Location was, resort is in a high lying area. But no worries, they have experienced drivers who will assist to drive our vehicle up the steep if we go in our self vehicle and also they have their own transport to help their guests to move in and out the resort.\n\nOn a whole it was an amazing stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Overall experience was good.  We booked\nCottage room including breakfast and dinner.\nQuality of room was good just in and around the forest area.\n\nFood quality was good.\n\nThe major scary part was when we encountered a snake just in front of our room path way. We saw the snake while returning from dinner . Our kid was walking ahead of us and suddenly stopped asking what is that. Thank God all of us are safe.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We had a very delightful experience of staying here. Wanted to stay more than one day. It was wonderful overall.\n\nThe warm welcome with drinks, to a beautiful sitting area. In one day of stay we had high tea, bonfire, music session , pottery and other things too.\n\nThe rooms are spacious and clean. All basic amenities and toiletries were provided in room. Balcony was beautiful. Washrooms were is good shape and hot water was coming whenever needed.\n\nThe location of hotel is quite peaceful, picturesque and serene. The best place is pool area. Though the pool is really small, it has got great sunsets view. Spectacular it is. We loved spending time there.\n\nIt was our anniversary Nd on our request they provided pastries with candles which was really sweet. The overall experience of staying here was great.\n\nThe best part is it’s food. Not only the spread is huge but it’s tasty. Only improvement is needed in coffee which is quite simple and more like milk.\n\nFront staff should be increased as they had only one person parking car as well as carrying luggage. Rest the place is top notch. A full five star feels.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Elixir Hills - Suites Resort and Spa",
      "rating": [
        4.7
      ],
      "address": [
        "Near Letchmi Tea Estate, Munnar, Kerala 685612, India"
      ],
      "reviews": [
        {
          "text": "Rooms are good. Reaching resort from Munaar town is scenic but also 30 minutes long. So we think twice about visiting town.\n\nService is good when called. Call reception for everything. Food is good and breakfast spread was decent.\n\nResort is full of steps, be aware if you have elderly. Pool can use some cleaning.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "We had a great stay at Elixir. The location was amazing nestled in between tea estate, so it feels amazing to be right in the middle of nature. But if you want to go see places it’s a drawback because we need to drive to remote place back and forth.\nThe food, room amenities and nature walk, waterfall, cave everything is so beautiful with birds calling. Ms. Vijayalaksmi has been of great help to us guiding us thought the stay.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Elixir is a nice property inside the estate.The weather is good now but not too cold.The view from my room was the backside of another building which I feel pretty upset.\nSwimming pool is good,the cave and the water fall is a different experience.\nFood is too good.The breakfast spread and taste was very good.The ride to the resort from munnar town is very pleasant and calm.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Excellent placement of the resort. Best service from the whole team, restaurant and reception crew, etc. Always available to serve our requests. Food may seem bit pricey. Activities available are adequate and the best in all is the nature walk. We all enjoyed it very much🥰",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Our stay here at elixir was so wonderful. The place is massive with plenty of amenities available for the adults and kids with swimming pools, bon fire and play area. Food was also really delicious with varieties. There is also a small walking trail down the area where we can take walks as a minor trek and taking it in the morning was so refreshing for us.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Tulsi Village Retreat",
      "rating": [
        4.4
      ],
      "address": [
        "Kommpanpara.P.O, naikunnu, mankadavu road, Munnar, Kerala 685561, India"
      ],
      "reviews": [
        {
          "text": "Am giving 1 star because there is no zero star option available to rate. Location wise it's good but a bit far from munnar city. Service can't be worse than this since this hotel is in a remote place and they don't have any good food options. If you ask something like for breakfast tea coffee lunch or dinner either you have to get it ordered from outside for which also they will charge.\n\nThe common things like towel bedsheets are not given everything needs to be asked..\n\nBetter not stay here",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This place is awesome. It is far from the main road therefore it makes it even wonderful. You get to witness real Kerala staying at this place.\nThe hotel staff is also amazing. They are always ready to help you and greet you with a smile always.\nHats off to Tulsi Village Retreat Manager and his staff.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The place is excellent in all parameters. I stayed in a travellers room. Didn’t expect it to be good but it was awesome and very spacious. They have other higher priced rooms which give a great view but i was more than satisfied.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Rooms were amazing. Staff was very cooperative and polite. North food was also been prepared as per our need. View is very pretty from the rooms. It is in between the Trees it feels like we are in the forest. It is really worth to visit this place. I am surely gonna visit again.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We had a very pleasant and memorable stay at tulsi village . The room was very neat and clean. The balcony was spacious providing an excellent view of the lake and distant mountains. It’s the place to be during early mornings and in the evening. Food served at the restaurant was very delicious. Staffs’ hospitality definitely needs a mention.The staffs  always available to attend all our special requests and resolving our concerns very quickly.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Star Emirates Luxury Resort & Spa",
      "rating": [
        4.5
      ],
      "address": [
        "Munnar Bypass, Ambazhachal, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "Everything perfect! The hotel got an upgrade for us and the room was so good! We requested an indian kitchen class and the hotel organized it in a such a good way. We loved the staff members, chefs and everyone that made this kerala experience something unforgettable!\nThanks!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "A Resort in a scenic location, Staffs are very friendly.Rooms are very clean.There is swimming pools for adults and kids. Buggy is there for pickup and drop from Reception to rooms.Food is very delicious❤️But the waiting time is the only problem in the restaurant.We ordered our lunch and we got it after 1 hour. Remaining all are good❤️Will recommend to friends! ✨❤️\n\n-Sarath Rhythms",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "This resort is the best one for sure. The ambience is superb, food is great and they have all the amenities. The staff here will go to any length to make your stay comfortable. Best place for kids too..will surely recommend this place to everyone..",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "When I got there I was shown to the worst room in the hotel,down on the basement floor,no balcony just a standing area,where you looked at a wall. I got on to my agent here in India,I told him I felt discriminated against. He must have got on to them quickly,cos the next thing I know,I've got a better room,with a tiny but enough for two to sit out on. From the balcony you looked out into forest,getting in the morning and evening all the bird calls,and the insects chirping etc. The countryside around the hotel is beautiful,from the mountains to the tea plantations. Meanwhile back at the hotel,the breakfast is nothing specially,in fact mondain. However the evening meal was delicious,and went down well. The hotel has two pools one a family pool,it has a play areas for kids as well. It's on a very steep hill as are most things around this area,so plenty of puff needed. There are plenty of jeep excursions and thrill rides. Talking of thrill rides the traffic goes as quick as it can around the mountain bends,my advice ,don't look.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Our experience dated on 04/01/24 to 06/01/2024 was excellent.\n\nThe hospitality of hotels staff was very decent. The staff are co operative and polite.\n\nRoom service was 100% prompt and perfect.\n\nFood quantity was also best.\n\nI really enjoyed staying at star Emirates luxury resort and spa.\nThanks to all.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Dew Drops Farm Resorts by Maat Hotels",
      "rating": [
        4.5
      ],
      "address": [
        "Mankulam Road Kallar - Vattiyar, 2XW5+8XP Kallar Valley, PO, Munnar, Kerala 685611, India"
      ],
      "reviews": [
        {
          "text": "Visited Dew drops Munnar for two days. It has great location, very neat and spacious room, food was excellent. Service from staff was very good. This is located in a huge plantation property, you will feel very close to nature and whoever prefers to stay away from city and crowd can happily enjoy here. They even provide Jeep service to go around near by places, visited a couple of places and it was very good. I booked plantation stay and farm stay both categories and both rooms were very very good. There is a cattle farm, there are few other animals that are sheltered here.Overall a very good experience of visiting here. Keep up the good work the whole team of Dew drops.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We stayed here for 2 nights.\n\nPositives:\nThe best part about this property is its location. It is deeply nested in the nature, totally cut off from the modern noise. Ideal for peace lovers.\n\nAlthough not much options in the food department, still the same was tasty.\n\nThe service was quick. The staff was very helpful and friendly.\n\nThe rooms were clean, decent and value for money. The bathroom, toilets were clean too.\n\nNegatives:\nThere was no ventilation in the room. There were windows available but without grills. If u keep the windows open anyone could enter easily. I think window grills will solve the problem here.\n\nSince the property is deeply nested, the only way to reach there is through a off roading of approx 5 minutes by a jeep service provided by the hotel management. Not suitable for senior citizens. I think if road quality is improved it will solve the problem here.\n\nAll in all 4/5 stars",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We stayed there for 3 nights. We were given normal plantation view rooms for first 2 nights and honeymoon cottage, the third day. Honeymoon cottages are costlier, spacious but we didn't like it.\nLighting is not proper. Bathroom very small with not much space for cloth hanging. Not very clean. Plantation view rooms were clean. TV didn't work due to some cable connection problem for first 2 days.\nFood has to be ordered 40 mins before but food was good. Not much options for vegetarian though.\nVery distant from Munnar town & other sight seeing places. It'll cost money for transportation and this is not worth all the effort & money. Can go for other better options at this cost.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We went on a family trip recently to munnar. On 4th April 2024 we reached dew drops by afternoon, the welcome was very pleasing, staffs were kind and helpful.\nThe ambience is very nice, you will be living along with nature. The rooms are clean and neat, the washroom too is very clean. Food was really delicious.\nWe stayed two nights in plantation view rooms, these rooms were quite hot during the day ( we went in the wrong season..) and one night in farm view, that is the best experience, you get the feeling of being in middle of a jungle away from the roads, crowds and the city.\nThere's also games and other activities like cycling, fishing and camping too.\nOverall a wonderful place for families and friends for a vacay in the woods.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "It's inside a large private farm and has two resorts in different places. So photos seen while booking might be confusing.\nFarm Stay location is amazing, quite deep inside the farm. But with average room, food and service.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Willmount Cabin Homes, Munnar",
      "rating": [
        4.7
      ],
      "address": [
        "8 Acre, Kallar Vattiyar, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "It was an amazing experience we had at Willmount, Munnar. This place is a great option if you want to spend quality time with nature.This place is situated at a hill areas where the accommodation is in a tree cabin which we can face a beautiful view of the area and has a fine surroundings enriched with wonderful plantations along with chairs to sit.We loved the atmosphere and hospitality offered at Willmount, the staffs were also very friendly & caring. And the trekking was the best part of the all.Thank you Willmount for wonderful experience..",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "It was an overall great experience with lovely view, compact and comfortable rooms. Staffs were very friendly, services were topnotch. More than these the food here was a cherry on the cake, fresh and home made. The ambience was awesome one.Small suggestion from our side that a dressing mirror and room freshner could have been placed otherwise all arrangements were good.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "The stay was excellent. The resort's staff was amiable. We asked the resort staff to set up a Jeep safari, and the Jeep safari was excellent as well. The driver took us off-road and visited a few mesmerizing viewpoints and tea plantations.\n\nWe spent two nights there. A-Frame on one night and Square Cabin-1 on the other. Both rooms had an incredible view. 🏕️\n\nWe had a great time by the CAMPFIRE. The campfire was expertly planned by the team. We listened to the guest stories/songs and also played Dumb Charades. Danced after a while at the end. We had a great time, it was so much fun. ✨\n\nWithout a doubt, we will visit the resort again!!\n\nRecommendations:\n- Place way boards to direct people to the property.\n- Can build up a shared eating space. currently, meals are brought straight to the room.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Just wow experience. After a 4 day Kerala trip booked Willmount cabin home for taking some good rest under green before leaving back. But Just last day turned out to be one of best with adventurous trek for sunset view, one of best camp fire talks with Willmount and guest crew ever. And my God view from room keeps you wondering the wonder of nature. Best crew for happy and safe stay. Thanks everyone guys.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Had a lovely time unwinding from the daily mundane routine. The service is amazing , entire staff is very friendly and helpful. The view from the cabins are captivating. The location is very peaceful and away from the hustle and bustle. And how can I forget the amazing trekking to Pettimudi hill too for the sunset. Thank you Akshay , Subin and rest of the staff for making our stay so enjoyable. And yea there was bonfire too !",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "The Lake View Munnar Resort",
      "rating": [
        4.3
      ],
      "address": [
        "Munnar Sengulam P O, Anachal, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "The rooms and services are vertical good. We had a good stay here.\nThe pool is neat and hygienic.\nThe entire services were good.\nBreakfast was delicious and buffet.\nThe resort has an average view.\nSufficient parking facilities.\nNegatives:\nThey are not that big negatives but still have to mention it for other people who might find it valuable.\n\nThe road to the resort is little bit messy.\nThe Beds are not that good which effects a comfortable sleeping. ( Took Deluxe rooms. Don't whether it is the same for other category rooms).",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Ambition Food's pool view is stunning, creating a relaxed atmosphere. The diverse menu offers delicious dishes with impressive presentation. The staff is friendly and knowledgeable, ensuring a pleasant dining experience. The poolside seating adds a touch of luxury to the meal. While the overall experience is excellent. Overall, Ambition Food is a delightful choice for a serene dining experience with great food and a beautiful pool view.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The hotel is located at a convenient place and had great views of the mountains. The front desk, restaurant, and room service staff were excellent, courteous and very helpful. They were genuinely happy to serve.\nAlthough a late reservation during peak season, they accommodated all our requests, including extra mattresses, top floor and nice views.\nThe food at the restaurant was\nwas also great. Breakfast buffet had a wide variety of tasty selection. To top it, the room rates was quite reasonable.\nThe only suggestion for improvement would be to heat the pool and to extend the pool hours in the evening.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Hotel is located at a picturesque view of mountains. Loved the sunset view from the infinity pool. Rooms were clean with a great view of mountains. The food served was delicious. The staff is very helpful and friendly. I definitely recommend this place if you are looking for a stay in Munnar!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Very Nice Experience…Room were spacious and service was very good … Atmosphere is very pleasant & view from balcony is very good. Morning Breakfast & Dinner is good & tasty. Hygiene is priority of Owner/ management staff. Swimming pool is wide and one can enjoy with family & friends.\nOutside garden sitting are is good and perfect for photography.\nPerfect destination for spending leisure time.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "K-Mansion (Kallumkal Mansion)",
      "rating": [
        4.9
      ],
      "address": [
        "Karadippara, Munnar, Kerala 685565, India"
      ],
      "reviews": [
        {
          "text": "If you are comfortable with bedsheets that are not clean, room that has a of dirt inside and a random clothe hanging for your balcony view - go for it! They had to go through 4 bedsheets and still couldn’t find a clean one without stains. For clothe, they said it’s been there for months and not their problem. For the bedsheets, they said take it or leave it. In the end, we check out 2 hours after checking in and went to other property with a cheaper price and better room and service.\n\nCleaning staff is very nice & accommodating. Reception guy was nice, and was trying his best. The owner is the rudest person I have ever met. He got aggressive with us, even though we were having a polite conversation with the reception guy. Personally, I was shocked to to see this behavior. Not recommended for couples, perhaps, single backpack travelers wouldn’t mind these things. Oh, I haven’t even shared the stains from balcony. Looks like they are collecting reviews cause of very polite travelers.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "K Mansion is a beautiful boutique stay which is easily accessible. The room we stayed had amazing forest view and each morning we woke up to the singing of Malabar Whistling Thrust Bird. The property also has a game room and viewing deck.\nJerin was a very helpful from the day we reached. He can speak good English, Malayalam, Tamil and also Hindi. He greeted us with a big smile and was always available to give us suggestions with planning our itinerary. His timely information about the presence of elephants at Anakulam gave us the opportunity to witness an entire family of wild elephants! Also , the food they prepared was very tasty and homely. You can request them to prepare the food of your choice 2 hrs prior. Overall we had an amazing stay at K Mansion and would love to visit again!",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Located 10 km away from the centre, this place seems to be in the middle of forest offering a quiet and peaceful stay. Easily accessible with gated parking facility, they carry a mix of dormitory and rooms. The rooms had a spacious balcony (could put a single bed 😛), clean (as new) bathrooms and a forest view (wake up to sound of birds/monkeys). Simple yet delicious breakfast spread, helpful staff, but slightly premium pricing from a hostel vibe perspective (paid Rs 7900 for 2 rooms/5 people)! I wish they could offer a bed to accompanying drivers (they do provide washroom and breakfast).\n\nPro tip - Closeness to the town ensures access to tea plantations and other attraction points (e.g. echo point, market area, tata tea museum, etc).",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "It’s a very nice cozy place. The rooms are very clean, a balcony with a beautiful view, comfortable beds and peaceful atmosphere. The staff is very friendly and helpful in every way. A big shout out to Mukesh, who tirelessly attends to all the guests and their queries. Upstairs is a recreation area, fitted with a jacuzzi and in the attic is the pool table.\nThe meals were good and they made it according to our taste. Will surely be back here again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "The stay was amazing. Room was very neat and clean and the place was very quiet. Staffs also very responsible.The view was good from top floor. Food price was nominal and taste also good. Only thing is far away from munnar town and main attraction places. If you want a place with privacy and calm definitely it was a recommended one.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Ela Ecoland Munnar - A Nature Retreat",
      "rating": [
        4.4
      ],
      "address": [
        "Mankulam Road, Kallar - Vattiyar, 2XRG+965, PO, Kallar Valley, Kerala 685611, India"
      ],
      "reviews": [
        {
          "text": "My friend and I thoroughly enjoyed our stay at Ela Ecoland! The staff is friendly, welcoming, and helpful. They helped coordinate places to explore and activities to do in Munnar. The rooms are lovely with beautiful views. We enjoyed our meals and felt like we got authentic tasty Indian food from their restaurant. Overall we highly recommend staying here and will definitely be back in the future!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Pleasant experience for lovers of greenery! We stayed in a luxury tent for 3 days and felt very comfortable. The room lacked a bit since some of the lights didn't work, kettle was broken and bathroom not ideal. But if you are just coming to sleep and enjoy the surroundings it will do! Great food service we loved the restaurant. The waters in front of the reception are lovely for a dip as well. The sounds of the birds will surprise you :)",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Treehouse was booked so we had the cottage overlooking the river, which was better than the treehouse. The view was lovely as the cottage is up high and the balcony  felt to be amongst the trees. A monkey visited us on our first night and I’m sure I saw fireflies! Birdlife in the morning was incredible. This place is right in a jungle. Food was good but the room was a bit small and needs a new coat of paint. Bed was comfortable . Wifi strong.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Location was superb, i had initially booked the tree house. It was pretty old and didn't look safe. Also, it wasn't properly cleaned. However hotel staff gave me another room. Dont book tree and luxury tent if you have problem in climbing huge stairs. Food could be better. Staff is very kind. Also they dont serve food in tree house so we changed.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "India is a beautiful country. There's no doubt about that, but after a while you also enjoy peace and quiet and nature. You get all that here.\nWe had half board and the breakfast and dinner were excellent and plentiful.\nOur tent was very spacious and clean. Hot water was available.\nYou should be fit to walk to the apartments.\n\nWe went on our excursions with the local tourist guide, Jaison. Just ask for him at reception, you won't regret it.\n\nAll in all, just a great place with nice people.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Forest County Munnar",
      "rating": [
        4.4
      ],
      "address": [
        "Lechmi Estate, Kallar Vattiyar, Kerala 685612, India"
      ],
      "reviews": [
        {
          "text": "Unique location, with great views and positive Vibes, friendly desk staff, jungle treaking, camp fire, all an adventure lovers need. Not for those who seek comfort. But those who want to be near nature don't miss this place. They provided special vegitarian meal for us and fulfill all our request like giving our driver a place to stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This was recommended by my wife. So I trusted her and we booked. Photos did show amazing views.\nSo we decided to book a room.\nThis is located at Munar, and it's on top of a hill.\nHow to reach there,  once reach near to their location you need to call them.\nPLEASE NOTE: you can not take your car or bike to their location, reason being it's completely off road and I mean a proper off road, your car won't have the capacity or even if you have a 4x4 may be you won't have the experience to take your car up there.\nIt's 2km of OFF Roading all the way up/down. There's no other route.\nSo we recommend you take all your belongings and double check that you don't miss to take anything, cause it's 15 to 20 mins up and down.\n\nOff-road experience is amazing. The drivers at this place are experienced, and they don't make any mistakes while driving.\n\nAnd once you reach up, they will drop you near the reception. You need to register your name and provide an ID proof like Adhaar or a passport.\nNote: This place is not your 5-star hotel. It's a place to chill. No AC or fan.\n\nOnce all done, throw your baggage in your room and take a walk, and enjoy the beautiful landscape.\n\nMain highlight- Glass Bridge and live music.\n\nYou can take your photos near or on the glass bridge.\nShoes are not allowed while entering the glass bridge.\nFor romantic photos it's amazing.\n\nThey have camp 🏕 fire and it's amazing,  sometimes you get to speak to know other people and enjoy the night with live music 🎶.  If you know how sing you cam sing along.\n\nThen they have options like early morning 🌄  trekking, they have a trekking guide, and he will take you to some beautiful places.\n\nShoe, some sanitizer or salt is a must as you will encounter leaches. Keep a stick handy for walking.\n\nFood is okay. They do have a BBQ section, and you can enjoy\n\nThey provide dinner and breakfast.\nBreakfast, they have decent options, and guys who serve are good heart. They help you when you need anything.\nCheck-in is 2 pm.\nCheck out is 11 am.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great location, but rooms and service is not worth the money we pay\n\nLocation: Its a great location with scenic views. Had to take an adventurous jeep ride with off roading trails to reach the location. The property have a decent area for camp fire, a small glass bridge where we had taken some good photos\n\nRooms: The rooms  provided are spaciouse, but not so clean. Bathrooms does not contain any tissue papers, there is no door mat , dental kit or shower gels provided, no way to reach the room service. But the balcony view was so good. But only 3 rooms out of 10 rooms rooms we booked had these views.\n\nService: The boys at the buffet and the kitchen were so well good. Their service was exceptional\n\nFood: The dinner was fine, but the breakfast was terrible",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Amazing, Wonderful,  pleasant & Polite.\n\nEverything was Amazing each and everything.\n\nStaffs are really really good. The way they treated us was really heartwarming.\n\nThe room... Neat and clean and very good and nicely maintained.\n\nThe food... 100% Hygienic and quality highlighted stuffs. Tasty and yummy.\n\nI want to write more but iam shivering in the middle of Fogs.\n\nThank you guys for this facility,\nFor sure Now onwards all my suggestions to my friends will be here. To enjoy the Nature and for enjoying the lovely moments with the lovely peoples.\n\nHighly recommended 👌",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a wonderful stay at Forest County.\nThe location is so peaceful, calm and close to nature. We have to park our cars below at their parking area and reach the property by an off road jeep ride.\nThe service was so good. Food also was also delicious. Dinner and breakfast was provided.\nI booked a honeymoon package, they provided candle light dinner, cake and bedroom decorations. It was a pleasant stay. Would like to visit again.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    }
  ]
}