{
  "places_with_reviews": [
    {
      "name": "Tranquility Trichy",
      "rating": [
        4.6
      ],
      "address": [
        "Anakkarai, Melur, Kollidam Flood Bank Rd, Srirangam, Tiruchirappalli, Palur, Tamil Nadu 620006, India"
      ],
      "reviews": [
        {
          "text": "A beautiful bungalow in a rural setting with colourful birds and peacocks in the surroundings. A quiet environment from the hustle and bustle of the city. A lovely place for relaxation. The caretakers of this bungalow are Mr. Maaran and his family members. His spouse cooks delicious home made South Indian meals for the guests. Lovely family and they take care of the guests as their own family members with lots of hospitality and attention. A great place to stay for relaxation.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Waking up here is a serene experience, with the morning serenaded by a natural symphony of birds, their chirps harmonizing with the distant calls of peacocks, creating a delightful awakening. This enchanting chorus ushers in the dawn, as sunlight filters through the leafy embrace of the surrounding greenery. The property, with its nostalgic charm, becomes a sanctuary where the bustle of the modern world fades away, replaced by the tranquil sounds and sights of nature's own awakening. It's a place where each morning is a gentle reminder of the world's simple beauties, setting the tone for a day of peace and relaxation, much like the tender, carefree days spent at a grandmother's home.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I recently had the pleasure of staying at this charming homestay nestled on a river island, and I can't help but share the enchanting experience.\n\nLocation: The homestay is a hidden gem, surrounded by lush greenery that paints a picturesque scene. Being on a river island, it offers a tranquil escape from the hustle and bustle of city life.\n\nAccommodation: The accommodations are cozy and thoughtfully designed, blending seamlessly with the natural beauty around. Waking up to the sounds of nature and the gentle flow of the river made each morning feel like a serene retreat.\n\nGreenery and Scenic Views: The homestay is a paradise for nature lovers. The abundance of greenery, well-maintained gardens, and the breathtaking views of the river create a calming atmosphere. It's a perfect place to unwind and reconnect with nature.\n\nAuthentic Culinary Delights: One of the highlights of my stay was undoubtedly the authentic local cuisine. The homestay takes pride in offering a diverse menu featuring regional specialties. Each meal felt like a culinary journey, with flavors that were both comforting and memorable.\n\nHospitality: The hosts' warm hospitality added a personal touch to the entire experience. They were not only attentive to every need but also shared insights about the local culture, making the stay feel like a cultural immersion.\n\nOverall Atmosphere: The homestay provides a perfect blend of tranquility, natural beauty, and a taste of local authenticity. Whether you're seeking a peaceful retreat or an adventure in the lap of nature, this place offers an idyllic setting.\n\nIn conclusion, my stay at this river island homestay was nothing short of magical. I left with a rejuvenated spirit, a camera full of scenic captures, and a heart full of gratitude for the wonderful memories created.\n\nHighly recommended for anyone looking to escape into nature's embrace!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Our stay at Tranquility was a big disappointment . The room is quite small , the location is quite remote , the view from the room is a big let down ( ground floor ) as compared to what is shown on the net . The electrical wiring seems a big question since the moment the kettle is switched on , the power trips . The stock of tea , milk sachets etc is not kept for early morning use . The small inner room does not have a bulb , hence cannot be used . The bath area too is quite small . The AC does not work properly . Despite drawing the attention of the owner and caretaker , nothing was done to resolve this . As a result , as against a stay of 3 days , we had to check out in 2 days . The same is the experience of my colleague who stayed in the adjoining room . The pricing too is ridiculous given the above drawbacks . This property is not recommended at all .",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "We visited Tranquility resort 2 weeks ago, and this entire time, we are still relishing fond memories of our stay there and can't bring ourselves to the present world! I felt resorts like these are truly an eye opener for busy city dwellers looking for an off the beaten track vacation. Blessings to the owners and the care takers for having set this place up and for giving so much love and attention in order for guests to thoroughly enjoy their stay.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "B. Krishnan Mansion and lodge",
      "rating": [
        3.9
      ],
      "address": [
        "Gunaseelam, Tiruchirappalli, SH-25, Trichy Musiri Namakkal Road, Trichy, Tiruchirapalli, Gunaseelam, Tamil Nadu 621204, India"
      ],
      "reviews": [
        {
          "text": "Very Mid level room for a family stay. It is located 50mtr from the temple. The only thing is there is no attached bathroom and all are western. And VENTILATION was one of the problems in all rooms.\n\nAnd the beautiful thing is you can see the beauty of the KAVERI river from the back side of the house.\n\nCharge for 24hrs - 700 Rs ( Without AC) and 1100Rs for AC .\n\nOverall for one day stay was ok.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Decent stay. Lodge provided all facilities",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good.famous venkatachalapathy temple situated@gunaseelam near musiri. Temple visitors using this lodge. Nearby also some lodges are there.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "There is no attached bathroom in your room.. Room services are worst... They don't respond you properly... Only pro is its location... Just 100 meters from gunaseelam temple... Think twice before you book this mansion...",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Superb responce& best quality",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "OYO 68879 Sri Maruti Pilgrims- Gunaseelam",
      "rating": [
        3.1
      ],
      "address": [
        "house No.4, mass gardan, Sri maruti pilgrims, Gunaseelam, Tamil Nadu 621204, India"
      ],
      "reviews": [
        {
          "text": "Can't stay in this lodge... Max number of people gave suggession to me...i not much in to this place",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Room is good as shown in pic...but I will not recommend for families because very close to highway and there is no bike parking and no compound for bike or car...I was scared upto morning for bike parked near road because very close to highway...camera is there but little bit fear.\nOnly one person is taking care of all room he is good person who is manager of all place.. and there is no shops near ... special think is another side of road is river so for photo shoot good... Very outter to tirchy....room is good but not oyo standard !",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Pros : Location is very good if you want a overnight stay in Gunaseelam.\n\nCons : No restaurant, Bedsheets were not changed which was agreed by owner also. Got it changed on request.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "Such a nasty place , simply rubbish .\nVery unhygienic place , smelly rooms bed sheets . Not cleaned . Bathrooms are horrible .\nThe owner / manager of this property is uneducated rude and don't know how to speak to a guest .\n\nI trusted oyo but they dint help me .\nI booked ac room but they gave me non AC room , complementary breakfast was not served .\n\nPlease don't stay even if the rooms are free.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        },
        {
          "text": "The worst rooms and experience.when they dont accept online booking, why do they keep online bookings?\n\nTotally hopeless owner.no sense to talk to people.\n\nHorrible.dont even think about this rooms.",
          "languageCode": "en",
          "rating": [
            3.1
          ]
        }
      ]
    },
    {
      "name": "Richfield Private Stay",
      "rating": [
        3.6
      ],
      "address": [
        "Gunaseelam, Tamil Nadu 621204, India"
      ],
      "reviews": [
        {
          "text": "The place is good during winter or rainy seasons in front of the river Kaveri. The only advantage is nearby to the temple. The outside scenic will be good of paddy lands. Ample car parking facility. There is no air conditioned rooms for that price of rs.2000/ room I paid Rs.4000/- for 2 rooms and it is very  expensive for the place, we slept outside the room in terrace as it was very very hot inside the room. Even one room not having toilet facility. There is no good drinking water facility. Very hot during sunny days, better to stay in Trichy or Musiri will get better air conditioned rooms for same tariff. Not recommending...\n\nUpdate for owner's reply: I usually give Rs.20 to Rs.100 to the room service person while checkout if the service is good. But for your staff even he requested we have not given single money because of the higher tarrif they charged and no service he provided. We  informed earlier as we are coming 9 pax in 2 cars to stay over night from Kanyakumari also they informed to stay in the terrace room without air-condition I agreed but I have mentioned for that room the tarrif is too high may be your ground floor rooms might be good and cheaper. My review is fully concerned on the terrace room only which we stayed.\n\nHow come we know the 2 person rooms will accommodate for 9 person by bribing as we came from 450km far away, we have discussed the number of people going to stay and all over phone a couple of days back itself. As we informed everything over phone we reached the place by around midnight 11.30 pm.\n\nWhy should we stay there without any facility  by paying Rs.4000 for 9 person, we might take 3 triple cot rooms for Rs.950 and it will not exceed Rs.3000. There are so many alternatives as we came via Trichy as the reason we booked with you over phone we stayed there and shared my experience.\n\nAs we are responsible Google local guides with Level-8 we will share only the facts.\n\nPlease check my reviews there will be very few negative reviews or mostly I will avoid  writing negative reviews but sorry to say if things are really worst will forced to write these kind of negative reviews.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Wow",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Nice place to stay",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "sheela sasi",
      "rating": [
        "Unknown"
      ],
      "address": [
        "WJ44+CW2, Sirukambur, Kariyamanickam East, Tamil Nadu 621213, India"
      ],
      "reviews": []
    },
    {
      "name": "K.P.S Complex",
      "rating": [
        "Unknown"
      ],
      "address": [
        "WJ55+F9F, Sirukambur, Kariyamanickam East, Tamil Nadu 621213, India"
      ],
      "reviews": []
    }
  ]
}