{
  "places_with_reviews": [
    {
      "name": "Hotel Durga",
      "rating": [
        3.9
      ],
      "address": [
        "NH55, Turanga, Angul, Odisha 759122, India"
      ],
      "reviews": [
        {
          "text": "Room is good but TV is not working and in some room old model TV is there. Whose screen quality is very poor. broken tap in bathroom,water drops all the time. AC remote or TV remote can stop working any time. Bathroom is not up to standard. I think hotel management forgets how to maintain room😜",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Avoid this hotel like a plague. It's a ramshackle place run by a bunch of novices. I am certain they have not carried out any maintenence since it was inaugurated. Terminates in room. Not a single fixture in bathroom works. You would be lucky is rhe had shower does not dintegrate and head shower falls on your head. A/ C is in far paaage of the room and does not help all besides makes so.much sound you cannot sleep. Absolutely hopeless. Forget egt free ecen if they pay you do not stay here. Sleeping on the road outside is cleaner and healthier. Owners or mangers missing. Understandable with a slum like tbis how will they fa e customers  all the time?",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "A very good experience at the Hotel. Food was really pretty awesome. On the highway and easy communications. The staff is polite and helpful.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The food quality is very good, but the hotel has charged Rs. 40/- for a single water bottle which costs only Rs. 20/-, which has been mentioned in the said water Bottle, this is a very ridiculous manner.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Room service was too prompt\nBut cleanliness not upto mark\nFront office too prompt fr all.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Hotel Prasanti Pvt. Ltd.",
      "rating": [
        4
      ],
      "address": [
        "Near, NH55, Turanga, Angul, Odisha 759123, India"
      ],
      "reviews": [
        {
          "text": "Old hotel and rooms could have been better. Wifi not working.exhaust fan not strong enough. Had issues opening kettle for hot water. cafeteria was good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nice place to stay.In general official staffs is staying in this Hotel,Room is super clean,toilet bathroom is also Super clean,\nThey offer complementary Breakfast,you can ask breakfast as per your choice.Room Service is good,If staffs smile littlebit that will be an extra for the guest.Also they have Electric Car Charging Facility as well which is littile diffrent approch to the service.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel Rooms are not well maintained, it looks very old. Not renovated. Restaurant food is good. Lift Available, Sufficient Parking Space",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Room no 112,\n1) Toilet Flush not working\n2) No Door Mats.\n3) Tiles giving sound and moving\n4) Wi-Fi not getting connected.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Not Good !\nACs don't work during a power cut. The shower is in the bath tub.... climb in or opt for a bucket bath.\nLight switches are inverted....Had to make 5 calls to room service to get serviced.\nNo buffet breakfast.... simple orders are ignored (like no butter on toast).\nIt lacks professional management.\nNot worth the charges.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Jasmin Palace",
      "rating": [
        4.2
      ],
      "address": [
        "NH-55, Kandsar, Nalco Nagar, Angul, Kandasar Part, Odisha 759145, India"
      ],
      "reviews": [
        {
          "text": "Rooms were spacious but needs maintenance, like door knob in balcony room number 105 was not functioning.\nWe stayed there for one day only so didn't required room service that much. But the restaurant need serious upgrade in terms of service. Quite time consuming to deliver food, on the other hand taste of food was really nice. Location wise it's very good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Located just beside the National Highway, this is a decent hotel to stay for the night. Area is quite big and best suitable for marriage and other functions. Huge parking space is available.\nI stayed here for one night and was somewhat satisfied with the service received from this hotel. Since Angul is an Industrial city, so you could expect a lot of dust. The rooms looked clean but the floors were a bit dusty. So cleaning in regular interval is required. Bathrooms were neat & clean, geysers were working properly and amenities like shampoo, soap were provided by the hotel.\nFood was delicious. You don't have to wait much after ordering your food. They are fast in providing the service. I had bread omlette with coffee as an evening snack while in the dinner I ordered tandoori roti with dal fry and veg kofta. Overall the taste was delicious. Complementary breakfast was provided. it included various traditional dishes like Idli, Vada, Puri, Ghughni, fruit salad, boiled egg and tea/coffee.\nOverall it was a nice stay for me.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Had a good stay. Food was good. Breakfast is same everyday and reheated and given in the next day which has to be improved.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "1.Staff are well behaved and cooperative. Rooms are also good.\n2.Breakfast should be changed # to manager/ management.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good Hotel if you are looking in 2k budget. Hotel has a good Entrance with a beautiful reception area. Staff are well behaved and cooperative. Rooms are also good. Morning Breakfast is included where you get good options. Overall a good budget hotel to stay in Angul.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel RAAZ",
      "rating": [
        3.5
      ],
      "address": [
        "Similipada, Angul, Odisha 759122, India"
      ],
      "reviews": [
        {
          "text": "The Hotel is no more...it has been closed for a long time...the place has just been used  for landmark only.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very good hotel. Nice location. Good service. Nice restaurant with tasty foods. Rooms are well maintained. Very much neat and clean. Hotel surroundings is a very nice. Meeting room and accommodation for party and reception etc is available here. Very good hospitality. Just nearer to bus stop. Parking space available here.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "I am pretty confused whether to give 3 or 4 🌟.\n\nFor food quality taste it deserves 5 🌟, food price point it deserves 4 🌟(a bit costly).\n\nFrom the prospect of accommodation it deserves 2 or 3 🌟 because when we check then the room was full of mosquitoes there was no liquidator and when the AC was turned on lot of dust fell onto the bed. The bathroom was quite pathetic and not clean.\n\nThe sraff were pretty decent and good.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Hotel Razz is situated on NH-55 Similapada Angul. It is one of the oldest hotel in Angul. The hotel has a good location with communication facility. The hotel rooms are well maintained and neat and clean. The food here is delicious and of excellent quality. Staffs are very good and cooperative. This is the best hotel with all facilities at a reasonable price.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "It is nice valuable hotel at perfect location. Management and staff was co-operative too much. I would like to suggest to everyone.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Ashray",
      "rating": [
        3.5
      ],
      "address": [
        "Turanga, Angul, Odisha 759123, India"
      ],
      "reviews": [
        {
          "text": "A big NOOOOO! In one word it is just pathetic! AC room doesn't have AC switch neither remote. The restaurant doesn't have any cook. You will not get any breakfast. They bring it from outside. The service men always seems to be lost. The bathroom window panes are broken. People from nearby houses can see you taking bath quite easily. It's better to have food in a nearby restaurant opposite to Hotel Prashant.\n\nThe hotel is too pathetic and painstaking. A big no for family stay or either you are traveling solo!",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very Worse  Quality Hotel. All part of the Hotel is very dirty. Rooms, Toilet, Bed Sheet etc are too dirty. No service at all. Price is also not low. Avoid to visit.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Nice hotel in the bank of Nathional highway\nCouple friendly hotel\nCouples are allowed\nThey took 1600 for one night per Couple\nCheck out time is around 10 - 11 AM\nStaffs are also good",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Enough Space for parking.\nVery late food service.\nFL shop is just 50meters away.\nVery much safe and good privacy 🔏 maintain.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "The property was average, it's not value for money. Food service and quality was excellent, staff are so cooperative.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "hotelimagein",
      "rating": [
        3.6
      ],
      "address": [
        "Bypass Rd, Similipada, Angul, Odisha 759122, India"
      ],
      "reviews": [
        {
          "text": "Affordable and overall experience is good.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I will never recommend this restaurant. Staffs don’t know how to behave. Food serving time is more than an hour. Decorum is the worst. Even the quality of rice is low cost but the price of a rice bowl is like other restaurants 60/70.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Nice 24 hours for 900 rupees",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Never gonna recommend this hotel... Worst experience ever.. There are many more better hotels in angul then this... I would prefer to shut this restaurant since support staff are not in mood to work here....",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Absolutetly nonsense behaviour. The waiters quarrel among themselves. Food is deliver after 50 minutes. Please do come at 2pm for your dinner. (IYKYK)",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "OYO Hotel Kalpataru",
      "rating": [
        3.5
      ],
      "address": [
        "NH55, Hanuman Bazar, Angul, Kandasar Part, Odisha 759122, India"
      ],
      "reviews": [
        {
          "text": "Amazing place... It's totally safe.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "One of the worst hotel, price is high, cleanness is zero, rooms and toilet are unhygienic, service is also not good.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Very pathetic. Standards to be improved a lot. Room air conditioning is not effective. Some of the rooms doesn't have ceilling fan. I have to change my room. TV and AC does not have power backup.bachelor bathrooms are much cleaner that the bathroom and toilet of this hotel. they don't have the Oyo kit to serve. But the care taker is well behaved guy.owner need to improve the standard.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Staff was nice and breakfast was goodish.\nThey had minimal of everything and i guess that's the best you can offer at that price.\nWould rate below average for cleanliness but other things were okay .",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Most disgraced hotel I ever stayed. There is a pile of wastes in the entry gate, no ac remote (guests can't change the temp), no everyday cleaning (maybe due to Corona, but I really feel that is just an escuse of cost cutting nothing else), most disgrace is I found a cockroach on my pillow on first day of arrival.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "The Prestige Continental",
      "rating": [
        4.2
      ],
      "address": [
        "NH55, opposite Decobee Tiles and Sanitary, Turanga, Angul, Odisha 759123, India"
      ],
      "reviews": [
        {
          "text": "The hotel is good ..we celebrate our wedding anniversary here ..good food... specially the starter item...there are many places for the photo session... which everybody wants when they go any restaurant... price is little bit high... Service is very good...staff behaviour is very good also...you can go an enjoy..🥰",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "my stay at Prestige Continental was nothing short of perfection. I left feeling rejuvenated, refreshed, and already looking forward to my next visit. If you’re looking for an unforgettable hotel experience, look no further than Prestige Continental.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I stayed ther for 3 night, service is wonderful. One of the best property in Angul, staff behaviour, food quality is very good. The mist part is the property's GM is very down to earth n a nice gentle man, I belive he would be the best GM among all the hotel from Angul.\nKudos..\nKeep it up team prestige Continental.\nKeep up growing..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the best experiences of my four day stay at this place. The staff there were very kind. The food served was lit.. I wish to visit the place once again. Much recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel is one of the best new property in Angul. Manager is very well behaved and cooperative. Service is very good and prompt, breakfast and quality of food is superb.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Star Light Hotel & Lodging",
      "rating": [
        3.2
      ],
      "address": [
        "Nalco Nagar, Angul, NALCO, Odisha 759145, India"
      ],
      "reviews": [
        {
          "text": "Useless.. what ever item you ask they have not. The menu is a show piece",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "I stayed 12 days in this hotel, Owner as well as staff very supportive.\nService of hotel is very good.",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Good School",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        },
        {
          "text": "Nice",
          "languageCode": "en",
          "rating": [
            3.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Swagat",
      "rating": [
        2.8
      ],
      "address": [
        "Chandsi Clinic, F.C, I Road, Girang chaak, NALCO, Odisha 759145, India"
      ],
      "reviews": [
        {
          "text": "This hotel is very bad hotel entire Odisha and it's service is very bad,not clean room and staff behaviour is very bad ,plz any one cannot come in hotel",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "The rooms and the environment is great, yes, slightly a bit expensive for 1 day stays but it has good food and atmosphere.",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "Very very Wrost hotel I have never ever seen in my life, Electricity problem, blankets and towels are so dirty, Toilet situation is too bad,hot water not available, basin drainage system is chocked, TV not working, Room service not available...",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "It is not that much good or bad",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "The people in here will ignore you if you don't say what you you order standing here for more than 30 min time wasted",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        }
      ]
    }
  ]
}