{
  "places_with_reviews": [
    {
      "name": "Spree One Resorts and Conventions",
      "rating": [
        4.1
      ],
      "address": [
        "7CW9+F8X, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "It was an overnight stay and we chose this place because it was on the highway. We just drove in. Big property with very spacious rooms. Beds are more than double. They dont have lift though. Nice view of mountains. The property has a big swimming pool ( needs maintenance for swimming) and have seats around. Have a bonfire. Overall i liked the place.\n\nThey have a restaurant and delivers food to room, otherwise walk 300 meters to highway side restaurant.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Decent Accommodation. Food options and breakfast needs improvement. Short of front office service personnel is a hindrance to carry luggage to rooms. Needs improvement",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Decent property but maintenance and services is below average",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice resort located in NH-16. Checkin was smooth, rooms were quite big. In-room service available. Parking space available. Good staff",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Very Nice location and good amenities\n\nFood is also very nice\n\nMainly the Staff is very helpful",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Mythri Residency",
      "rating": [
        4.6
      ],
      "address": [
        "Road, opposite Temple Entry Ghat, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "To all reviewers, Suggest to share the reviews once u stay for multiple times.\nThey will be polite & patient for your first stay, if they see u come for multiple times, gone they will grab your innocence & make u go out of Hotel.\nStaff are arrogant.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very good hotel. Stayed for 2 days. Staff are friendly and give good guidance about the places around. Wifi and Smart TV available. Nice rooms and Clean bathrooms (They can put a small cupboard in their rooms. Just a suggestion)\nHotel is just opposite temple ghat road entrance. Hotel doesn't have restaurant but nearby there are many tiffin center's.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Not suggesting to stay here.\nThey will throw u out immediately if they get room bookings. I had cleared them while checking in that my stay will be for 2 days, after a day of stay they made me check out in the morning saying rooms got booked just now for today.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Rooms are good\n\nIf you have any problem in the room, they'll respond immediately.\n\nLocated below the hill,need to take vehicle to reach the temple.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Adjacent to Annavaram temple mahadwaram.Advance booking is must, otherwise room reservation a little bit difficult.Rooms are neat and maintained",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Arya Vysya Choultry, Annavaram",
      "rating": [
        4.1
      ],
      "address": [
        "choultry, beside Arya vysya samajam, near Devi lodge, Velampeta, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "Getting a room is easy there in normal times. I suggest the ₹900 A/C room with a western toilet. We opted for the ₹500 Non A/C room in winter, but it gets a bit hot. There's a tea shop nearby, but not even god knows when it's open. Plan to eat breakfast and dinner elsewhere since they don't serve meals here.\nLunch is free and very good in taste (they say). The rooms aren't clean when you first enter; they're a bit dusty on the floor and bedsheets. Grab the receptionist's number before entering for room services.\n\nSpeaking of room services, they gave only 2 pillows, so I asked for another one, but by the next morning, no pillow or return call. They really need to improve in room service.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good place to stay here for the pilgrims of annavaram don't go upside of mountains for accommodation because many of rooms are already booked and filled stay below the annavaram  temple hill and go to darsan\nAt this arya Vysya choultry we can get food at 12 pm to 2pm at free of cost at afternoon provide delicious food for pilgrims at around 300-500 rs we can stay here for a day there are ac ,non ac ,deluxe rooms available there .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Aryavysysa is a nice place to stay. The choultry is spiritually blessed, very clean, tidy and healthy environment. The blessed  lunch is served with love and affection.  The choultry is affordable and free for all Spiritual travellers.  All community members must avail the benefits of this choultry rather than wasting money. The money saved can be donated for noble cause. The choultry is near to Temple,  bus stand and amenities. Jai Satyadeva,  Govinda.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The name itself says Arya Vysya choultry, here rooms n lockers n food wll be provided to Arya Vysya community only n they'll will be identified via their Gothrams",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I seriously don't know about this place. But in the evening times (i.e.,6pm to maybe around 10-10:30pm) exactly attached to this hotel we can find a low cost tasty street food. This food centre doesn't mentioned any name. Every tiffin is available here idli, puri, wada, types of dosa, bonda all this items include rs.20/- and uttapam is rs.30/-(i tried every item, i loved the taste with chutneys😋).\nSeller's are also soo kind♥️.\nThis place is worth over any other restaurants in Annavaram.\nBut I personally recommend this place, when you visit to Temple Annavaram🙏",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Prakash Sadan",
      "rating": [
        3.8
      ],
      "address": [
        "79JX+MVH, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "AC Room maintenance was worst.somemany bed bugs are here. Don't waste ur money paying 1000rs here.our toddlers suffered alot with the bed bugs bites and we are also suffering with them. .( pls don't take accommodation to stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Better to avoid staying over night till the maintainence improves (only god knows when it will happen). Go have darshan and come back. Full of bed bugs in AC rooms with bonus of mosquitoes that you will only see in Africa. Worst place to stay  in Annavaram is Prakash Sadan.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Not at all recommended.\nWorst experience ever,lot of bed bugs,very bad bedsheets, pillows are too worst and too much pricy for this,when we are entering into room we experienced kind of weird smell which is horrible and out of all these we can't complaint to nobody.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Book a ground floor room here if you want to have a sleepless Terrible night.. Beds are full of bedbugs. Biting and crawling all night... We could not sleep even for 2 minutes. Bathroom kudaa not clean….room all dusty….ac and heater no problem…….",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are Spacious.Hot Water Geaser available.Staff are good.But hygeine is not maintained as bad smell in Rooms and insecticides/Bed Bugs in Rooms. Request Temple Authorities to take steps for bad smell due to drainage system/Spraying in Rooms and White Washing etc for Piligrims Convenience.\nStaff are cooperative and responsive and help Piligrims with concern🙏👏",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Siva sadan",
      "rating": [
        4.4
      ],
      "address": [
        "79JV+WRJ, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "‼️‼️‼️ALERT:  Carry 2000 Rs cash for each and every room that you have booked as deposit. Only cash deposits are allowed…\n\nHonesty you don’t have anything better around that gives you ample space to walk around and relatively comfortable stay close to temple (like super close: 3 minutes drive). Cottage is big with\n1. large and clean corridors\n2. Lift facility\n3. 3 minutes drive to temple\n4. AC in the room\n5. Large size rooms with extra bed with cot (single) besides a king size bed with hard mattress\n6. Showers in the bathroom\n7. Western toilets\n8. Balcony\n9. Large waiting area\n10. Relatively clean\n11. Decent open parking spaces\nBook online and grab your room\nCheckout time is 24 hours, which means you will have your room for 24 hours irrespective of the time of check in.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good for temporary stay. Longer stays Can be tricky.\n\nAccommodation is  good . Reception is friendly. Looks like there are some quotas so research before arriving.\n\nBut the combination of Temple administration rules and Facility rules means you cannot carry a stove , you cannot arrange meals on large scale  for those who stay.\n\nDrinking water  is allowed but bottles are t allowed.  So if you have a seniors and kids who have requirements like  warm drinking water , teams and coffees, you can’t have them.\n\nTeas and coffees need to be carried  in flask to accommodation sites which make this facility straight from 1980s but with AC and Geyser.\n\nViews are good . This facility is overlooking pampa reservoir and the temple if you get rooms from 2floor and above.\n\nOverall it’s a nice accommodation but with some shortcomings due to administrative rules .\n\nPics are reference for location , view . Room is suite",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "My experience is five star, the rooms are clean, view is good and a quite place, staff also reasonably nice.\nAC, bed and pillows are good. Lift is there.\nBathroom and toilets are also separate rooms.\n\nHowever this 2 star rating is to report/feedback issues which can occur in the future, but not related to my recent stay.\nThe quality of doors, bathroom materials used is poor. Considering lakhs of people use this facility over the decades, quality should not be cheap.\nJust because today its 4 months new, we feel its good, after another 6 months people start reporting many issues I guess.\n\nBy their rule, they take advance of Rs.2000 (For a 1500+GST room rent) with a finger print.\nWhile checkout the rule is the same finger print to match otherwise they dont return the advance and deposit it to the temple.\nWhat happens if its because of their software issue? what if the system is dead or unknown issues? I dont know, but  for me luckily everything went smooth.\n\nAlso they strictly take hard cash, no UPI/card.\nThey take only aadhar (soft copy works) as ID, no other cards accepted.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Rooms are good and spacious. Its newly built. But you need to book in advance. Otherwise you wont get rooms. Ask for AC remote from reception. Views are nice. Food is not available nearby. Get food before hand. Otherwise you need to go long. Long way from temple. Having own vehicle is advised.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very luxurious, neat and clean  but very far from the temple. Free buses available but not frequently.own vehicle transport is good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Sree Ganesh Residency",
      "rating": [
        3.7
      ],
      "address": [
        "OPPOSITE TO UPHILL GHAT ROAD, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "Waste of money\n\nIts really waste of money staying here.\n\nwe stayed for one day in 2 floor room no 22, its a smelly room washroom is too bad, No hot water, Tap will not work, bedsheets not changed. when we informed in reception he came up and said there is no smell and he cant give another room.\nWe have reached in the evening 6 Pm asked receptionist to switch on the greyser he denied to do it saying they will only switch it on the morning if you want to do bath wait till morning.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Clean and neat rooms. Parking not available, but devasthanam parking is there. Don't expect a professional service as this is not 5star hotel. But best budget hotel.\nOwner and team were nice.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Very Good..... Nice location...very good staff...best rooms for low budget... And near by Temple...",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "We just stay for few hours and stay was good\nRoom was ok as we just need for refresh and luggage.\nIf you didn't get rooms in upside temple will recommend to try this hotel once.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "It's quite opposite to Temple route.But rooms are not that much good.But it is ok to stay for few hours.Later we will suffucation and bad smell..due to no air flow",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Satyadeva Residency",
      "rating": [
        3.9
      ],
      "address": [
        "Annavaram, D No:1-20/9, Subbaraya Puram Mainroad, near Sai Baba Temple, Annavaram Colony, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "I attended a marriage function. It's good that the food and rooms and service and function hall.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "For a family (two adults and one kid below 10 years age) they are asking to take 2 rooms. Worst response I have ever seen in India. They are asking to take seperate room for less than 10 years kid",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "No  A C. and  Complaint didn't solve.. windows  not closes. No wash basin pipe. Totally not good",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Decent place for stay in Annavaram. Washrooms could be better and cleaner.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Unfriendly staff.\nRoom are bad unclean.\nLizard are there in room.\nWashroom are not clean.\nNo hot water.\nAc remotes are not working.\nFan not working.\nYou are find better hotel's near by.\nPlease I recommend all not to come hear.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Satya Deva Guest House",
      "rating": [
        3.8
      ],
      "address": [
        "7CM3+824, Velampeta, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "Book Guest house in online before coming to temple since temple staff people will not give you rooms booking even though rooms are available. They will block them for their staff and friends only.\nBetter to book AC rooms with a cost of 1000-00 per day.\nNon- AC rooms cost 500-00 per day but they are not good.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "If you Book Online ,  Then Go,  Otherwise those people will cheat you.  Even the rooms are available,  They will simply say that ,Rooms are booked.\n\nBut one Broker come to your place and provide  the room.\n\nIt's totally Cheating the Pilgrims.  Particularly at Morning Timings",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Walkable distance from main temple\nRooms are very spacious.\nMaintenance is average.\nPreferably for family visit and functions.\nPer room - 500/- 4 to 6 people can accommodate",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Average place to stay at Annavaram.. the toilets are pathetic as the water wasn't flowing out well and was floating into the room instead. But,, the rooms are large and spacious. This could turn out to be an excellent lodging if maintained well.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are good. Need a bit of maintenance but good overall.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Sneha Residency Hotel",
      "rating": [
        3.8
      ],
      "address": [
        "1-27-25, Tuni, road, Chalamayya Nagar, Annavaram, Andhra Pradesh 533408, India"
      ],
      "reviews": [
        {
          "text": "Location wise good, atmosphere accommodation also nice in Annavaram this residency is nice. In all aspects it is too good nice.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Best place, good surroundings",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Nice service. Clean and neat maintenance. Good staff. Peaceful surroundings. Best for the stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Its location is the holy town Annavaram. It's a very good place for shelter. Peaceful life can be had there. It's just 40 to 50 kms far from the district headquarters Kakinada and it may be 60 to 80 kms from Rajahmundry. One of the most famous holy centres is ANNAVARAM.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Good. Spacious. Affordable.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Swagath Grand",
      "rating": [
        3.4
      ],
      "address": [
        "7CM4+G5X, Velampeta, Annavaram, Andhra Pradesh 533406, India"
      ],
      "reviews": [
        {
          "text": "Not a good place. Even the glass doors never close. So I experienced dust the day I visit. Lunch is ok but 339/- for two lunch meal is quite expensive for the dishes and rice they have served.\nOn a overall its the good hotel in Annavaram when compared with other hotels",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "I went here for Vegetarian meals that was so nice and tasty with Reasonable price.but the atmosphere and cleaning was average and Service was good and maindraw back was we cannot able to park the car here because of rush and no particular parking area.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "It's a good hotel to dine in with a good ambiance in front of Annavaram Hill exit gate. very hygiene and maintaining neatness, tiffins, and tea tastes awesome whenever we visit annavaram. we don't miss to have tiffins at this hotel",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Poor quality and utter poor service with exuberant costs. Only for name it is grand, but service and quality it is NOT",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Overall experience 3/5\n\nLocation of hotel good 5*\nAll available at walkable distance.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    }
  ]
}