{
  "places_with_reviews": [
    {
      "name": "HOTEL ANKOLA INTERNATIONAL",
      "rating": [
        3.8
      ],
      "address": [
        "NEAR ANKOLA APMC GROUND, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "Very Nice hotel to stay. Good services, there is play area for children.\nWe checked in 1hr early and checkout 1Hr late still no extra charges.\nSeparate restaurant for veg and non veg food.\nOverall we are satisfied with their services.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "- Ideal for those seeking a tranquil escape in Gokarna away from crowds.\n- A three-night stay at this hotel provided an excellent overall experience.\n- Friendly staff and well-maintained, comfortable rooms enhance the stay.\n- Opt for rooms on the front side for the added bonus of a balcony.\n- Ground floor amenities include a pure vegetarian restaurant, a bar for drinks, and a combined Veg+Non Veg restaurant.\n- Conveniently ample parking space available.\n- Note: Kudle beach is approximately 30km away from the hotel.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are very dirty,  staffs are very rude. Bedsheets and pillow covers are dirty.  Pathetic food. The cab they provide for local site seeing charged exobiratetly high price. Rooms are very small for the price they charge.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Stayed for 3 nights. Conveniently located on the National Highway with ample space for parking. Seperate resturant for Veg and Non Veg. Tried fried rice, thali, curd rice and breakfast in Veg Restaurant and taste is awesome. Little garden for kids also available. Room cleaning not up to the mark but room service is excellent. Overall good experience at affordable price @ Rs. 2000/- per day for AC Room.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Location and layout of the hotel is good. Management is poor. No qualified staff. Rooms & linen dirty. They have to be reminded to switch on the heater for hot water. Needs professional management",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Varadaraj",
      "rating": [
        3
      ],
      "address": [
        "Baleguli, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "Worst place to stay. Disgusting rooms has full of ants and bed bugs... And mosquitoes\nDown there is bar shop. These are local alcohol drinking rooms. They mentioned 3 star hotel.. and loot money these are very cheap rooms.",
          "languageCode": "en",
          "rating": [
            3
          ]
        },
        {
          "text": "First I was looking at the reviews and suggested not to go there. But we were getting late so we decided to stay there.\nAs we stepped in the room we saw that Room was good. Down there was hotel to have your meals. Location is just aside of the highway. TV was working, geyser was there in the room and there was a balcony. Finally satisfied with the room and were economical also.",
          "languageCode": "en",
          "rating": [
            3
          ]
        },
        {
          "text": "Stopped here for a break and breakfast as it's on the highway  and it was the worst decision. Neither their dining place is clean nor the toilets . The food was  pathetic and the pricing was the same as  A2B/HSV/Udupi  restaurants . If travelling with family never plan to stop here .",
          "languageCode": "en",
          "rating": [
            3
          ]
        },
        {
          "text": "If you see this restaurant best to avoid, Waste of time and money. I will give it a zero rating if it was there. The supporting staff is very rude. No proper taste and maintenance.",
          "languageCode": "en",
          "rating": [
            3
          ]
        },
        {
          "text": "Despite the numerous reviews, we decided to give this restaurant a try out of necessity. Regrettably, our experience aligned with the negative feedback. I strongly advise against choosing this restaurant.",
          "languageCode": "en",
          "rating": [
            3
          ]
        }
      ]
    },
    {
      "name": "Sahana Palace",
      "rating": [
        3.6
      ],
      "address": [
        "Venkatraman, Venkatramana Temple Rd, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "It’s not a family hotel first thing\nTheir is no car parking or bike parking\nRoom is so dirty no proper maintenance full of dust\n\nStaff ask more money if booked through online apps but we don’t give any penny to this dirty stay\n\nAll pls avoid this place u will get better stay somewhere else",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "The hotel is located at the heart of the ankola town closer to the bus stand and hotels. The hotel manager Mr.Ramakanth was very helpful in the date change request even though MakeMyTrip made it a tough one to do. The rooms are average and it is very untidy when it comes to single non deluxe rooms but 4 bed non AC deluxe rooms are comparatively clean and better maintained. There is no covered parking but there is ample parking space on the neighbourhood road next to the hotel",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Normal room with nominal facilities. For one day stay it is ok.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very neatly maintenance,room cost is good",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Rooms are not clean and not worth the asking price",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Niharika",
      "rating": [
        3.6
      ],
      "address": [
        "M8R5+3X5, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "Nice one. You can have Kerala menu also from there.\nMore attention to be given by the hotel management towards the cleanliness of the area inside.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Good food but little more organization required  bar and restaurant near ankola",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "It looks good, we had lunch from here, many of my students had taken biryani, was told not fully okay with that. Me and friend had taken kerala meals , tasted Karnataka.I got two stones between the meals. I won't prefer the same hotel when moving to the same place.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "I don't complain about food. But rooms here are in very bad shape. Also no proper hot water facility plus you will get free mosquito services. And the staff here are very rude. They try to loot you wherever possible. So I suggest avoid staying in this lodge or stay at your own risk.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "This is a decent restaurant around the place.i went here on my way to gokarnam. It is a little difficult to find good restaurants around here. Food tastes reasonably well and very affordable. Restrooms are located outside the restaurant. There is sufficient car parking space available infront of the hotel and beside it as well that can accommodate heavier vehicles. They also provide on sight food services.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Sapna Comforts",
      "rating": [
        4.2
      ],
      "address": [
        "Dr Dinakar Desai Rd, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "Room size was good and clean, but their was some pungent smell into the room and washroom. Hot water available only in the morning 6 to 10am even in AC rooms.\nFood was ok .. I took orange juice the glass was not clean..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms are full of large cockroaches. And this is for their so-called larger premium rooms. Avoid this place",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Clean rooms with very good air conditioning.\nGood service and location.\nLift is available, initially you will be offered with water, soaps etc.\nEasy access to a good in-house South Indian hotel at the ground floor.\nOverall it was up to mark for the price paid.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This is my second visit to this wonderful lodge, and I can't wait to go back. From the owners to the staff at this hotel they all treat you like you are part of their family. they greets you with humor, love, a smile and just the best greeting you could ever ask for.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Spacious rooms, insulated from sound and noise from outside/ roadside. Neat and cleanly maintained. Solar Hot water, which is not available after evening. Near to the Highway. Parking available for 5 to 6 cars on the curbside. Private busses from Bangalore stop here, for pickup and drop. Double AC for INR 1680.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Biligiri lodge",
      "rating": [
        4.5
      ],
      "address": [
        "near NH, Ankola, Karnataka 581353, India"
      ],
      "reviews": [
        {
          "text": "Good food\nVery good sea food",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Very good",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good service.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Good",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Shree Kamakshi",
      "rating": [
        5
      ],
      "address": [
        "Kumta Road, beside Manu Indane Gas Agency, Ankola, Karnataka 581314, India"
      ],
      "reviews": [
        {
          "text": "Good place to stay. Owner is very humble.",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Excellent and Delicious Food 👌 perfectly cooked and juicy taste 😋 very much satisfied along with ice cream",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Super delicious food...",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Super delicious food!!!",
          "languageCode": "en",
          "rating": [
            5
          ]
        },
        {
          "text": "Mouthwatering food,..",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "BEENA LODGE",
      "rating": [
        "Unknown"
      ],
      "address": [
        "Ankola, Karnataka 581314, India"
      ],
      "reviews": []
    },
    {
      "name": "HOTEL SURYA LODGING TOURIST",
      "rating": [
        "Unknown"
      ],
      "address": [
        "M846+XGJ, Dr Dinakar Desai Rd, Ankola, Karnataka 581314, India"
      ],
      "reviews": []
    }
  ]
}