{
  "places_with_reviews": [
    {
      "name": "Apple Park Resort & Hotel Rooms",
      "rating": [
        3.4
      ],
      "address": [
        "Beach Rd, Antervedi Pallipalem, Andhra Pradesh 533252, India"
      ],
      "reviews": [
        {
          "text": "Apple Park Resort & Hotel, is the only option in case you are looking to stay near the beach.  The backside gate of the hotel is beach facing, and this is an advantage. No need to worry about how to go to the beach, You can walk into the beach.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "The food is disgusting, they served us frozen biryani and when we asked about the food being cold, they simply said they cooked just now  and it's cold because of weather, never knew the food gets cold faster in the hot weather. We had wait for 1hr for the frozen biryani and they didn't even warmed the food. There's no water coming from the sink, how are the customers supposed to wash their hands? I had to wait at the sink for the waiter to bring the water(i already applied soap to my hands and later i got to know that there's no water). The people here in this restaurant don't care about the food or services and the customers, they just want the money we pay. It's better to eat at the rainbow restaurant, the food there is good, it's on the way to the light house and it has all facilities and there's another beach nearby the rainbow restaurant and this beach is generally quite not much crowded.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "I have visited the place and it is fabulous, firstly the warm welcome by Ramu garu gives a homely touch, secondly the view of beach is magnificent with the aroma of costal sands, their ambience is excellent, couple friendly rooms with great food, they even have kids play zone area with eco friendly atmosphere.\nIt's a great place to travel again & again I strongly recommend this place at Antharvedi beach to be your family vacation😀😁🤗",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Worst experience we had",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Very lavish, peace full,  don't expect food facilities",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Kanakadurga Hotel",
      "rating": [
        4
      ],
      "address": [
        "Lakshiminarasimha temple,Sivalayam street, Antervedi Pallipalem, Andhra Pradesh 533252, India"
      ],
      "reviews": [
        {
          "text": "Rooms are decent enough.They will not provide drinking water, We have to purchase it. Over all its good .",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Located just near the Beach .it is clean and provides u great hospitality.Lovely hotel with very accommodating staff. Breakfast was very good and overall I would highly recommend this hotel.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Recently we stayed here. Nice and friendly hospitality.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Worst Rooms ever. No lift for upper floors. Worst hygiene and washrooms are too dirty.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Superb hotel in this area with luxurious things and also very cost effective.Enjoy",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Temple guest house",
      "rating": [
        4.5
      ],
      "address": [
        "8PMM+M4Q, Antervedi Pallipalem, Andhra Pradesh 533252, India"
      ],
      "reviews": []
    },
    {
      "name": "Sri Lakshmi Hayagreeva Rest Rooms",
      "rating": [
        "Unknown"
      ],
      "address": [
        "near PADHARU STAMBALA MANDAPAM, MAIN ROAD, Antervedi Pallipalem, Andhra Pradesh 533252, India"
      ],
      "reviews": []
    }
  ]
}