{
  "places_with_reviews": [
    {
      "name": "Sri Saravana Bhavan",
      "rating": [
        4.2
      ],
      "address": [
        "185, Sholingur Rd, Near Old Bus Stand, Arakkonam, Tamil Nadu 631001, India"
      ],
      "reviews": [
        {
          "text": "Nice place for dining with family and friends. Best place around this area in arrakonam. Hygenic atmosphere and tasty food. Although food is costly but it doesn't compromise on taste. Overall a nice place.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the finest places for a veg hotel at akm\n\nFood quality is best\n\nNeet maintenance with hygienic....\n\nService people must improve their speed of service with patience smiley welcome",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good ambience neat and clean Dining and Kitchen  Night kuda 11.00 varaiku eruku",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Had been to this hotel for breakfast and lunch during our visit to Sholingur temple.\n\nTried idli, Dosa and poori items by us.  It was good and chutney was little spicy.    While returning tried lunch as well.  It's a typical Tamilian meals and overall it was good.  Service was also good and the waiter serviced us based on our needs.\n\nMeals cost was Rs. 70/- only.  Overall value for money.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very tasty breakfast items available, very good service.\nGhee roast and Vada are very good.\nSituated near Karpagam theatre junction and ESI.\nThe road is very crowded and has frequent traffic jams.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Ambari Square - Party Hall and Rooms",
      "rating": [
        4.6
      ],
      "address": [
        "S3B, near Indira Gandhi Statue, Tamil Nadu Housing Board, Arakkonam, Tamil Nadu 631003, India"
      ],
      "reviews": [
        {
          "text": "Had a good & peaceful stay in Ambari Square.\nRecommended for all set of people.\nWill revisit again.\nPrice is little bit higher for single person.\nRooms are neat and clean\nAC & Heater & Wardrobe is available.\nSmart TV available but no set top box. Only OTT.\nYellow light in the room and no white light.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "VERY SUPERB\nPARTY HALL VERY VERY SUPERB\nDECORATIONS ALL GOOD\nTHEY MAINTAINING ROOMS AND PARTY HALL VERY GOOD\nALL WORTHY THINGS VERY WORTHY EXPENSE UPTO MY EXPERIENCE.\nAMBARI SQUARE COMPETETING CHENNAI BASSED HOTELS, ROOMS AND PARTY HALL..\nEVEN THEY DONT HAVE RESTAURANT THEIR ASSISTANCE IS VERY HUMBLE AND MAKING GUEST TO BE HAPPY WITH THEIR ROOM SERVICE..\nALL ROOMS IN DIFFERENT COLORS AND EACH AND EVERY THING DECORATED AND THEIR COMPLIMENTS WHICH THEY GIVING IS SIMPLY SUPERB AND ESSENTIAL |\nLIGHTS AND DECORATIONS WERE VERY GOOD",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Ambari square one of the best party hall in our arakkonam. I suggest all the best for the best hospitality services and good services. I will refer to My friends and relations for any other functions to ambari square.\nManagers Varun and satyan congrats to them.\nThanks and regards",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Nice party hall and staff coordination is Superb keep it up mr varun and sathya",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "One of the best party hall in surrounding and best staff service I have ever seen thank you -varun bro for good assistance",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "SRN RESIDENCY",
      "rating": [
        3.7
      ],
      "address": [
        "INDRA GANDHI STATUE POINT, 7/15A, Kalyana Mandapam St, JOTHI NAGAR, Arakkonam, Tamil Nadu 631003, India"
      ],
      "reviews": [
        {
          "text": "They insist on the full money to be paid in advance They switch off the lift once theirrvworking hours are done. The bedsheets are torn",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are very average. They don't change Bed sheets everyday . They don't clean the room everyday until we ask them.\n\nAtleast , they don't provide water bottle also. Only water can is available near the lift for all the persons.\n\nAC in the room doesn't work properly. Bathroom is not neatly maintained. Hot water not available.\n\nThey don't provide Breakfast also.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Had a good stay with family. Only issue is the rooms are located at 2 Nd floor and no lift is available",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Don’t ever go this room for stay… Had worst ever experience while staying in this hotel",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A new building. Good place to stay. Very clean. Nice behaviour. Cost effective",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel New Sairam",
      "rating": [
        3.7
      ],
      "address": [
        "5/100, Mosque St, Arakkonam, Vellore, Arakkonam, Tamil Nadu 631001, India"
      ],
      "reviews": [
        {
          "text": "Taste is Good.\nWaiting time is less\nDecent vegetarian hotel near Railway station.\nPrices are average.\nRoad side parking only.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Tasty food, staffs are very kind.. hygiene place.....",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Not good hotel members behavior.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "This morning, I was having a connecting train at 7:05 at Arakkonam, thought to complete breakfast in the waiting time, this hotel served us hot breakfast with nice Vada, courteous staff, Good place to visit. I'LL recommend it to my friends and family.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "A Decent Pure Veg Hotel near Railway station. Good Taste and Quality. Breakfast & Dinner are fresh and special.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "OYO 40129 Ssm Lodge",
      "rating": [
        4.2
      ],
      "address": [
        "1, Naidu Complex, Arakkonam, Tamil Nadu 631001, India"
      ],
      "reviews": [
        {
          "text": "Well maintained rooms... neat and clean bathroom. Room is so good with all needed amenities for the price. Easy to locate the place. People who travel from outside need to be aware that there 2 SSM lodges available in the same city. So make sure you are choosing the right location in the google map. Congrats to the SSM Lodge management for maintaining the premises very neat.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice Place to Stay. it  is in main Place.oppsite veg hotel operate up to.10 30 PM .easy to reach thiruthani ,Nemli Bala and Soliingur  attached opposite Hotel in photo...",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice and well maintained rooms... Polite and friendly staffs... Had a great night... ✌😃",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms and bathroom is Good, a/c is not effective. Staff support is excellent.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Oww very nice service place",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "OYO Vijay Palace",
      "rating": [
        3
      ],
      "address": [
        "28, 2ND, AV, AKSHAYA COLONY, Arakkonam, Tamil Nadu 631003, India"
      ],
      "reviews": []
    },
    {
      "name": "Arabian Grillz",
      "rating": [
        3.6
      ],
      "address": [
        "No 6/1 gandhi road stuartpet, Arakkonam, Tamil Nadu 631001, India"
      ],
      "reviews": [
        {
          "text": "Ambience is good, doesn't have a great parking. Food was great, had the takeout packaging was good. Had their shawarma and tandoori chicken both were delicious. Must try as they have a variety of foods",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Serving not good\nI order chicken fried rice... They are small bowl and they not give gravie & rietha..",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Worst ever I had in akm. I bought mini combo pack includes biriyani chicken rice grill and a drink. Biriyani tastes like tomato rice and there is no chicken in chicken fried rice except rice there is nothing else left in it. Taste is horrible the quantity is lil too.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Great to have such type of restaurant in arakonam\n\nThey are really maintained good and surving receiving\n\nFood quality is good have a nice place to take",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Excellent food and Ambience. We tried first time shawarma in Arakkonam it was perfectly marinated and we enjoyed the flavour. I would recommend everyone must try.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "Sangam Residency",
      "rating": [
        5
      ],
      "address": [
        "Tiruthani Road, Jaya Nagar, Arakkonam, Tamil Nadu 631003, India"
      ],
      "reviews": [
        {
          "text": "Good service",
          "languageCode": "en",
          "rating": [
            5
          ]
        }
      ]
    },
    {
      "name": "Monika Hotel",
      "rating": [
        "Unknown"
      ],
      "address": [
        "Sholingur Rd, Arakkonam, Thiruthani, Arakkonam, Tamil Nadu 631209, India"
      ],
      "reviews": []
    },
    {
      "name": "Natpudan Anbu Unavagam",
      "rating": [
        "Unknown"
      ],
      "address": [
        "Sholingur Rd, Arakkonam, Tamil Nadu 631209, India"
      ],
      "reviews": []
    }
  ]
}