{
  "places_with_reviews": [
    {
      "name": "Rishi Ecotourism monkey lodge",
      "rating": [
        4.3
      ],
      "address": [
        "Reshi, road, Kashone Khasmahal, West Bengal 734311, India"
      ],
      "reviews": [
        {
          "text": "Absolutely pathetic behaviour from the owner's family - a lady who spoke very impolitely and in a bad manner. Unexpected from someone who is associated with the hospitality business. No warm water available, no electricity backup. We had to sleep in extremely stuffy rooms without electricity at a time when temperatures were about 27/28 degrees. One had to wait for at 30 minutes before you could get a cup of tea.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The location is awesome with the river and mountains all around. The rooms however are okay. The geyser facility is not there and the bathroom lock was broken. Besides that everything else was good. Must visit.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Great place to stay for 2 days. Beautiful scenery, surrounded by nature..on the banks of River Reshi.\nBike ride absolutely possible. Food is nice.. The staff is very nice..\nThey will arrange barbeque and Bonfire any place you like.. great experience..\nThere's heritage linked to this one too as Sebastian Pradhan who is the owner is actually the founder of the old silk route. So the more reason to stay here.\nGreat experience",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Lovely place, lovely food and care us very good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Awesome experience. Superb location and we'll behaviour.. and also food quality is too good",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Eco Log Hut Resort",
      "rating": [
        4.5
      ],
      "address": [
        "Aritar Rd, Reshi, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "The resort is located in the old Aritar Dak Bunglow complex. The rooms are big and spacious and could accommodate a family of 2 adults and 2 kids comfortably. Overall the property has the potential to be the best resort in Aritar but at present seems to be not very well maintained.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Lovely location, good rooms with good food. The owner is also very helpful.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Had visited during last week of December. Nice location, beautiful property. But it needs maintenance. Overall, good experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "No king size beds had to pay 700 extra for bed...The bedspread was not clean and we had to demand a replacement.. Rooms are good. Nice service 👍",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Best resort and best service. Thanks to Mr Ravi Tamang for the lovely experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Ashraya Boutique Homestay",
      "rating": [
        4.8
      ],
      "address": [
        "Rongli - Chujachen Road, Sundung, near Power Office, Rongli, Sikkim 737131, India"
      ],
      "reviews": [
        {
          "text": "Ambience and location of the property is really good. Rooms are clean. View from the rooms is heavenly. Food is homely and delicious. Hospitality of Chettri Couple who maintains the property is cherry on top. If somebody is visiting east Sikkim, this is the best place to stay.\n\nWe had our first month anniversary and the couple just decorated our room with lights and balloons as well.. 😍\n\nThey have a dog - Rocky who is very sweet and cute..",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I visited east Sikkim with my partner in the autumn of 2023 and stayed in Rongli for a couple of nights at Ashraya Boutique Homestay. It is a very nice and cosy place to stay in. The room was clean and tidy and exactly as advertised by the landlord. The bathroom was also very clean and proper with a geyser installed. The toiletries however need to be carried along as the property doesn't provide any, except towels. The view of the fields from the window was also quite calming. The landlord is a friendly gentleman who made us feel comfortable. He is always available on WhatsApp and also for phone calls. The food was all cooked in-house and was tasty and made with fresh ingredients. Most notably the service boys Kismat and Raj were extremely hard working, polite, cordial and always ready to run the chores as per the guests' requests. Raj especially was extremely helpful. The rates for the room and food is extremely reasonable.\n\nOverall, it was an extremely pleasant experience staying at Ashraya Boutique Homestay and I would recommend the place to fellow travelers.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "As Lachung and Lachen were not open for tourists, we decided to change our plans and stay at Rongli for a night before proceeding to Gangtok. We found this homestay in a casual browsing. We thoroughly enjoyed the stay, food and hospitality.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "I am glad to select this homestay..\nVivek vai is very very nice and gentle person...the house keeping stuff also very good..amy hole group is very with their behaviour\nWhatever we need they are always there...\nThank you Ashraya Boutique Homestay",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Ambience and location of the property is very good. Rooms are clean and we'll maintained.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Jamyang Retreat",
      "rating": [
        4.9
      ],
      "address": [
        "Aritar, Mankhim Rd, Rhenock, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "Best Property in Aritar.  Hospitality is too good . Room are New and Clean . Food is homemade and delicious.  MUST STAY IN ARITAR",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Amazing homestay in an offbeat place named Mamkhim in North Bengal.\n\nAmazing rooms, service, food quality....you will feel not less than a 4 star hotel.\n\nJust beautiful.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very beautiful place to spend one or 2 days.\nI must say this property is not less than any 3 star hotel.\nThe food and all the services provided by the staff and owner is nice and their behaviour is very polite.\nAll our request kept by the owner sonam jii.\nWe enjoyed a lot in this place with my group of 13 friends.\nIf u are in aritar choose this palce.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "I recently had the pleasure of staying at Jamyang Retreat in Aritar, Sikkim, and I must say, it was an unforgettable experience. From the moment I arrived, I was greeted by the friendly staff who made me feel right at home. The hotel is located in a beautiful setting with stunning views of the surrounding mountains and forests.\n\nThe rooms are spacious, comfortable, and elegantly decorated, with all the amenities one could need. The beds are comfortable, the linens are of high quality, and the bathrooms are modern and clean. I especially appreciated the attention to detail that the hotel staff paid to every aspect of my stay.\n\nThe hotel's restaurant serves delicious food .\n\nOverall, my stay at Jamyang Retreat was exceptional, and I highly recommend this hotel to anyone looking for a luxurious and relaxing getaway in Aritar, Sikkim. The staff's hospitality, the beautiful surroundings, the comfortable accommodations, and the excellent facilities make this hotel a must-visit destination.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "We have experienced an excellent service from the owner as well as their staff. The resort is really an ideal place of spending a peaceful stay with an atmosphere of serene tranquility amidst greenery and hills with a magnificent sight of Mt. Kanchenjangha. Highly recommended.\n\nNani Gopal Das",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "The Aritar Retreat",
      "rating": [
        4.8
      ],
      "address": [
        "Gumpa simana gaon, near Rhenock Gumpa, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "The experience of staying at Aritar Retreat has been delightful. It is located at a beautiful serene place amidst nature with a great view and has all the amenities needed for a comfortable stay. The service and hospitality touched our heart. I would definitely recommend this place and would like to visit again.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "This property is probably the best thing of Aritar. The resort overviews a cliff where one can enjoy a golden sunset.\n\nExcellent personalised service, best of class food, well maintained n clean rooms.\n\nUndoubtedly the most value for money proposition of Aritar.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Service was good . The hotel was clean and the room service was very good . The hotel owner was very kind to give us big extra bed in nominal charge. Happy with the services except I have a small recommendation to kindly keep slippers for the customers and mineral water and microwave to warm up food.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "Gyatso is a gem of a person , He and his staff represents Sikkim . Kind , helpful , down to earth , respectful and most importantly hardworking . The resort is set amongst the hills . If you are looking for tranquility, peace and  nature , this has to be on your list in East Sikkim. Zuluk , Nathang Valley and Old Baba Mandir are all accessible from here and so is Gangtok.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        },
        {
          "text": "One of the most beautiful places and resorts, I have ever stayed in. Its location is just 250mtrs away from Aritar Monastery. Even the new point is only 2km. The rooms are beautifully decorated, equipped with modern facilities like tv, gyser, electric kettle . Their tasty food is also well cooked and well priced. We tried fried rice and chili chicken.",
          "languageCode": "en",
          "rating": [
            4.8
          ]
        }
      ]
    },
    {
      "name": "Hotel Aditya",
      "rating": [
        4.2
      ],
      "address": [
        "Aritar Maneydara Pakyong, near Govt. secondary school, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "I highly recommend this hotel.We entered the hotel with very warm welcome from the owner Mrs.Gita Pradhan. She is very dynamic and looks every nook and corner for the comfort of visitors.The rooms are very spacious with a nice balcony view.Foods are all awesome.We got a homely atmosphere due to well behaved staffs and the owner herself. It’s really a worth staying place in aritar",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice place to stay. Wonderful hospitality by the owners. Food quality is awesome and very homely. Excellent view from the room. The rooms are also very spacious. 10 minutes walking distance from Lampokhri Lake.I would highly recommend to come and stay here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This homestay was absolutely amazing if I unsee some little parts. 1st of all, the owner was amazing and very welcoming as well as helpful. The view from the room was marvellous. I could witness an awesome sunrise. The wooden attic was very aesthetic and good for people who love to take pictures. The scenery around this homestay was very peaceful for eyes and mind. But there was a particular Bengali person, maybe the cook or helper (not sure). His attitude was kind of rude. Only that part was not favorable to us.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "If there was an option to give less than 1 star I would have given that. The hotel which they insist on it being a homestay whenever it suits their agenda is run by goons.The lady is rude to the point of being insane and Indian Karen. I had earlier posted a negative review which they threatened me to remove by surrounding me and my wife with local goons at 11.30 in midnight. The service is terrible and the host lady is teethering on the brink of insanity. There are loads of other homestays here which are much better in both service and views. This one has just pretty flowers in the outside and nothing else.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Each and everything of this hotel is awsome.\nTheir hospitality and their behaviour is just spellbound.\nA must come destination\nWithoiy any doubts",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The yaksha Himalayan retreat",
      "rating": [
        4.9
      ],
      "address": [
        "Lingsay Khasmahal, West Bengal 737133, India"
      ],
      "reviews": [
        {
          "text": "Me and my friends visited this place. Hospitality of Vinay, his wife and his cousin brother were awesome. The food was perfect. Rooms were also spacious, hot water was also available. In a nutshell, a perfect weekend gateway. Would love to visit again.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Excellent service by Vinay bhai. The place is very beautiful, calm and quiet with the view of kanchenjunga from the homestay. Most important is the hospitality of Vinay bhai his cousin brother and his wife. They have arranged everything perfectly. Also, the site scenes guide by his brother was nice. It's a nice property. We will surely come back again. I recommend everyone to visit this place once.",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "really its a very beautiful place must visit...",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Very nice place will come soon again",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        },
        {
          "text": "Such amazing experience! It was absolutely superb, the view point is really breathtaking, the peacefulness you feel in the place is such like in heaven! Excellent Hospitality ! Will be looking forward to visit again soon!",
          "languageCode": "en",
          "rating": [
            4.9
          ]
        }
      ]
    },
    {
      "name": "Orange Court Resort",
      "rating": [
        4.7
      ],
      "address": [
        "Aritar Road, near Shiv Mandir, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "I had a very good stay in Orange Court Resort! The family managing it has been very nice and helpful, and the environment is great! I spent some time at the lake and had some good rest in beautiful nature. Definitely recommend it!",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "1st of all well maintained property. All staffs are polite and hard working  and the food was so delicious. Pls try their chilli chicken. I loved the property and the owner is also soft spoken and very much welcoming. We got the bestest rooms",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Extremely happy to have found this place on Google Maps and stayed there for 3 days straight. Comes with a group of very welcoming and accommodating hosts, caretakers and dogs.\n\nExceptionally spacious rooms with lush greenery all around. Food is simple but scrumptious. You will love it.\n\nExtremely well placed starting point for the Silk Route circuit. Rongli is nearby.\n\nI visited at the end of April - weather was quite cool. Hope to visit again during winter.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "In my entire Sikkim trip, I had the best experience here. The location is just great. Aritar is not too cold, there is a lot of sun in the summer, its a great climate. There are 3 dogs which are very friendly and fun to play with. So if you like dogs, you'll be very happy. The rooms are  very nice, clean and spacious. The staff is very nice, they even let us cook a curry when we asked. They have a huge lawn area which great for walking, getting some sun and playing with the dogs. They also make great food, it was very tasty. The entire property is just very open and feels very free. It is tastefully decorated, and there is even a book collection to read from left by the people who had previously been there. I just love the essence of this place. The weather is so amazing in summer, I cannot recommend it enough.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Great place surrounded by amazing greenery & amazing views!\nThe location of the resort is at an ideal & convenient spot. There's no traffic noise or any kind of disturbance.\nThe rooms are quite spacious & have good ventilation. The evenings are cool so the windows are sufficient for ventilation, however, it would be better to add fans there for summers.\nThe service was beyond satisfaction, the care takers are very friendly & helpful.\nAll in all, we had a great stay!\n\nNote: you might encounter many insects during the evenings & nights, which is common in jungle areas.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "Mangaldeep Resort",
      "rating": [
        4.2
      ],
      "address": [
        "Kholatar, P.O.&P.S. Bazar,, Rongli, Sikkim 737131, India"
      ],
      "reviews": [
        {
          "text": "Its an excellent stay at Mangaldeep Resort, Rongli. Rooms are cleen and staffs are polite and friendly. Foods are as like as home. Mr. Nikhil is very helpful person and master of tour conductor. He provide us a driver named 'Micky\" is a charming person, drive safely and most of the people of Sikim is known to him. In brief rooms, home stay, tour, whatever Mr. Nikhil arrange for you, will be the best.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "At Pelling, in Golden Ice hotel, the experience was amazing.The members of staff, manager all were very very cordial.The view from the hotel was beautiful.\nAt Gangtok, the hotel was okey.\nThe driver, Satish Tamang, is a darling.He is a lovely boy.All my best wishes for him.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Wonderful experience we did have with the place. Excellent location, fairly quick room service and most of all top class hospitality from the owner Mr. Pradhan. They infact conducted  our sikkim tour very well. Loved it. Looking forward to visit there again.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Luxury hotel in Very affordable price.\nThe location is just beautiful.\nHospitality is awesome. Clean and clear bathrooms, rooms, dining hall.\nFood quality is very good.\nThey have a tourism service and that’s very budget friendly, so u can plan your trip from here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Visited in May 2022. The place is rundown with even the basic things missing. The rooms have bugs and cockroaches. Very hard to recommend Mangaldeep Resort and travels.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Aritar Lake Home Stay",
      "rating": [
        4.4
      ],
      "address": [
        "near lake, Aritar, Sikkim 737133, India"
      ],
      "reviews": [
        {
          "text": "The homestay is very good\nOwner and staffs behaviour very good\nSee the views of Kanchenjunga from the roof of the homestay\nInternet would not work but vodafone network would work only on the roof and others network availabe but jio is not availabe only vodafone internet is available here on the roof\nRecommended to stay here Aritar lake Homestay",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Wanna get a clear view of Mt Kangchenjunga from your room?? Then visit to ''ARITAR LAKE HOMESTAY'' is a must...\n'' We deliver what we Promise''",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Just was awesome stay...\nOwner's behaviour was too good....\nI am fully recommend",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This homestay is too good ... owners behaviour is awesome ... fully recommend to stay here.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Very good memories ❣️ so beautiful ❤️ charming just 💞",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    }
  ]
}