{
  "places_with_reviews": [
    {
      "name": "Le Pondy Beach Resort Pondicherry",
      "rating": [
        4.3
      ],
      "address": [
        "No.3, Lake View Road, Nallvadu, Post, Pudukuppam, Puducherry 605007, India"
      ],
      "reviews": [
        {
          "text": "We visited the Le Pondy Resort with family during winter and the food spread was great. The food was also very delicious. The ambience of the hotel is also great. The buffet might be a bit pricey. The manager was very kind. The rooms were very neat and the beds were also very comfortable. I would highly recommend visiting this resort when staying at Pondicherry. If you even just want to spend the whole time in the resort you can because they have a big pool and a baby pool with floaters and they also have a nice beach. We also saw a Kingfisher.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We stayed at the Le Pondy Resort with family during last week.\nOutside the room amenities is clean and well organized.\nMorning breakfast taste and spread was great.\nSwimming pool is quite large.\nKids Play area is good.\nIf you even just want to spend the whole day inside the resort you can because they have a big pool and a baby pool with floaters and they also have a nice beach\nStaffs are friendly and responsive.\n\nNegative Part of the resort is\nInside the room located in the ground floor, encountered the Frog during day time. Informed the reception and successfully they catched, since they were very co-operative.\nSecond instance where I encountered the Frog inside the room at mid night. I didn’t wish to wake up my family, so decided to spent the night with the Frog where we slept on the bed and frog was sleeping underneath the bed.\n\nI had very bad experience only concern to the room for the given money of 13k.\n\nI would recommend to take a room located in first floor and unless if you are adventures enough to stay in ground floor.\n\nThanks to the staff!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The property is in an amazing location with private beach access. The rooms and villas are excellent. We had a great stay. The staff were super accommodating at the rooms,  restaurant and at reception. They enabled specific dinner requests.  Very good breakfast, great food both at the restaurant and room service. They have very good amount of parking available along with valet access. Overall excellent place  and we had a memorable stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The location of this place is amazing as you can enjoy back waters and sea at the same place.\n\nThere is direct access from this resort to the beach plus the resort side beach is very clean and has limited access to the outsiders. You can enjoy the sunrise along with white sand.\n\nThe staff is very humble and quick. Some how I felt they have very limited choices for Non veg but then for veg you have multiple options.\n\nI will recommend this place if you are visiting Pondicherry :-)",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Plus points:-\n1) Property is huge and lot of open area.\n2) Breakfast options are good.\n3) Private access to beach is a plus point\n4) you can roam around and enjoy calmness of\nproperty even in late night, feels safe.\n5) I see many negatives on service, but we had good\nexperience, room service was good, they have\ncomplimentary food for kid. It takes sometime to\nreceive but manageable.\n\nNegative points:-\n1) in night time its really pathetic to have good sleep\ndue to mosquitoes, in spite of putting liquid,\nexperience was horrible.\n2) Staff behavior was not so great as was expected\nfrom a 4 star so called property. We requested a\nmosquito bat(since we were staying for 4 days)\nand staff was not cooperative, it was like you\nmanage yourself.\n3) Room needs really a big time maintenance, since\nproperty is big but room feels very old, not\nmaintained properly. from inside it feels like a 2 or\n3 star hotel. it should be maintained properly.\n4) When we checked in and inspected room...it was\nnot properly cleaned and moreover basic facility\nlike geyser was not working and no one came to\neven see our complained.\n\nOverall its good property but room need a big time maintenance, rooms are not worth for the price they charge.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Radisson Resort Pondicherry Bay",
      "rating": [
        4.2
      ],
      "address": [
        "No 198/1, 198/2, Maraimalai Adigal St, Manavely Revenue Village, Puducherry, 605007, India"
      ],
      "reviews": [
        {
          "text": "Excellent stay. We stayed for two nights with a 1 year old. The beach is walking distance and is very clean. Inside the resort they have a kids play room, a separate swimming pool for kids and daily activities. The room and was spacious enough for three of us with a nice balcony.\n\nRoom service was quick and special food requests for baby food was taken care of. Have no complaints and would definitely return.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Stayed from 11 February for seven nights.\nLovely hotel very quiet if you want a peaceful stay.\nRooms are beautiful and the standard of cleanliness is excellent. Nice pool but not enough sun loungers ( only six) and although there were only a few people at the pool most days it is a problem.\nFood was excellent and spicy.( although the fish and chips are just superb)\nLocation is great in that it is about 5 minutes away from a beautiful beach but it is a little far from Pondicherry town(15 minutes in a taxi) It’s a shame they don’t run a shuttle bus.\nThe spa is wonderful and very reasonably priced.\nLastly the staff,particularly in the restaurant are just wonderful- they make the hotel shine.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Amazing property with good amenities - pool, spa, garden area, indoor play area for infants, indoor/outdoor games, gym, walkable clean beach area. Good rooms with good amenities. While this experience is sorted and keeps you happy, here's a Bigger Glitch:\n\nFood & Beverages and services that follow - the staff that serves are young/freshers and that doesn't give them the ability to work around with different customers. Looks like they're understaffed too - While we can be understanding regarding it - I came across an instance which was uncalled for, it was rude, demeaning and very uncomfortable! This time, not just the young one, but even the skip levels failed to understand the real problem I was trying to communicate. I eventually had to escalate but guess what - it really spoiled my experience for the rest of my stay. Apart from breakfast - I ended up dining in my room for the rest of the meals.\n\nThe food however was brilliant and this is where you'd end up spending and you wouldn't mind it, however, heads-up, they are quite commercial, they'd charge you for curd too!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Resort was good. Staff was great. Food was good too. The Bodhi Spa experience was excellent. More can be done in regard to service. Ordering food in the restaurants took a great lot of time. Also, too many mosquitoe bites in restaurants, it needs to be regularly fumingated to keep them away. In all it was a good stay",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Fantastic Resort: Highly Recommended!\nThe resort is beautiful, clean, and very well-maintained. My family had a wonderful time at the resort. The swimming pool is large and loved the greenery all around\nThe rooms are fabulous with state of the art technology to control everything in the room from an ipad.\nWe were here to celebrate our anniversary and it was an amazing stay.\nIn terms of food and services, everything was good.\nLoved my stay ❤️",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Villa Shanti Hotel & Restaurant",
      "rating": [
        4.3
      ],
      "address": [
        "14, Suffren St, White Town, Puducherry, 605001, India"
      ],
      "reviews": [
        {
          "text": "Had a wonderful experience staying at the New Years! Was one of the places with great ambience and not to noisy quite for my taste. The breakfast compote was amazing and also their vegetarian Indian meal menu is worth trying.\nTheir hospitality is too good. Slightly expensive than other similarly placed properties. Room space and cleanliness was worth the price paid.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The restaurant in Villa Shanti has a strong French flavour in terms of ambiance and food. Natural lighting and simple furniture pcs add more charm. We went there for lunch on a hot summer day (11th Apr). Most part of the restaurant is non AC, hence choose your seat suitably. Loved their steamed curry leaf fish (I would have preferred some other veggies as side instead of country beans) virgin mojito. Good service, only con is  few tables have low seating  and are suitable for beverages not for food. Service quality is good. No valet parking for lunch, don't know about dinner sessions. Can park the vehicles on the roads but need to look for \"no parking\" signages on the side roads.  Try their desserts, they are yummy!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Food was really very good. Great for date night. Not VERY expensive either. It’s doable on a good vacation evening with your family. There is no AC in the dining area, but ambience is good. You’ll appreciate the heritage feel. Over all RECOMMENDED 👍👍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Villa Shanti Hotel & Restaurant offers a serene escape with its charming ambiance and impeccable service. The tranquil atmosphere, coupled with delicious cuisine, makes it a delightful destination for a relaxing getaway or a memorable dining experience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I was here for dinner two times on my Pondicherry trip. It was an amazing experience. Restaurant staff is really good, prices are also reasonable. Must visit, if you’re looking for a good time in White town.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "The Sunway Manor",
      "rating": [
        4.2
      ],
      "address": [
        "155/D, 100 Feet Rd, Bharathidasan Nagar, Mudaliarpet, Puducherry, 605004, India"
      ],
      "reviews": [
        {
          "text": "The location of the hotel was perfect easily travel to different tourist spots. The hotel was very well maintained and the rooms were also good. The AC could be improved since it takes awhile to make all parts of the room cool. The staff were very friendly and helpful. The food was excellent. The pool was also maintained well and the activity room had few indoor games for kids. Highly Recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Our stay at the hotel was absolutely delightful. The hotel's ambience was fantastic - truly inviting and stylish. The staff were exceptional - friendly, attentive, and always going the extra mile to ensure our comfort. The food at the hotel's restaurant was outstanding - delicious and beautifully presented. It was a truly memorable experience! We highly recommend this hotel to anyone seeking a luxurious and comfortable stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Returning for a second stay after a five-year interval, this hotel continues to impress with its remarkable offerings. The staff's unwavering friendliness and efficiency contribute to a seamless experience. The extensive buffet service during morning, afternoon, and night stands out for its diverse array of options, characterized by exceptional taste. Maintaining the highest standards of cleanliness, the hotel exudes a class synonymous with outstanding service. Facilities such as a pristine pool, well-equipped gym, and spa further enhance the overall guest experience. The convenience of valet services alleviates any concerns about parking, adding to the overall sophistication of the stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good stay at this place. Rooms were neat and services were quick. Didn't opted for breakfast but did tried their veg red sauce pasta and it was not at all good in taste.\nThis hotel is around at a distance of 4 km  from the white town and going to and fro in regular intervals feels frustrated sometimes. Bus stand is quite near. Overall a good time and you can surely opt to stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We stayed here for 1 night on our visit to puducherry.\n\nIt's a proper 4 star hotel with a terrace pool and fancy breakfast on offer.\n\nRooms were nice and offered a view.\n\nThe service and food were also nice. The only thing is it's not on the beach or close to it, it's in a uptown area in the city. So better have a vehicle if you plan to stay here on your trip.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "RKN Beach Resort",
      "rating": [
        4.3
      ],
      "address": [
        "No.50/3, Sudalai Street, Pooranankuppam Rd, Pudukuppam, Puducherry 605007, India"
      ],
      "reviews": [
        {
          "text": "Place is bit shady during night time. It is little far away from the main city. Resort is located close to paradise beach and exclusive access to beach.  Sunrise was pleasant experience due to proximity of the beach. Rooms can be maintained better for the price they are charging. Swimming pool and restaurant is very good. Lot of space for kids to enjoy like kids play area, swimming pool, IPL screen watching etc. Overall good place but rooms can be maintained better",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Pros: Beautiful property. Good pool. Food was good. Polite staff.\nCons: Fan switch is behind the bed post....how is one supposed to switch the fan on without taking shoes off. AC was switching off automatically and we had to manually switch it on by getting up from the bed. There is no remote. Only a wall control panel. Staff is not multilingual. Beach is dirty. Only the area opposite the resort was a little maintained....but we saw local people pooping in the beach waves on our early morning walk. Dirty stinky beach. No point booking a beach access resort for a dirty beach.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Staff are extremely kind, resort is conveniently located from the beach. There is buggy service to and from beach.\nThere are a lot of facilities such as swimming pools (I mean pools and not pool), badminton and tennis courts, cricket pitch, indoor games, and kids play area. The room we received was a big room. Well maintained, but with a very uncomfortable bed. Bathroom is huge and also well maintained. Overall, a good experience and a good choice to stay in if staying in Pondicherry for over 2 days. Only then will you be able to enjoy the resort to its fullest.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This resort is the perfect place to spend time with family. We enjoyed the atmosphere. There are indoor and outdoor games accessible anytime. Late evening outdoor theater can sit and enjoy with everyone. Rooms are super clean. Food is too good.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I attend my friend wedding here. I stayed for two days. It was awesome experience. Great room service. Good ambience. Lot of play areas such as chess board, tennis court, kids play area, spa, aquarium, birds, swimming pools. End of resort you can access to enjoy beach. Good place to stay with family and friends. Personally I enjoyed a lot.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "The Residency Towers Puducherry",
      "rating": [
        4.4
      ],
      "address": [
        "388, Anna Salai, Subbarayapillai Chathiram, Puducherry, 605001, India"
      ],
      "reviews": [
        {
          "text": "We stayed for 4 nights in November '23 for a family vacation. Our room had no view although, but room was clean spacious and had all facilities. Restaurant had many great options. The buffet had a vast spread. Location of this property is central and all tourist places are easily accessible. It right in the market, so many other restaurants are also close by. One can step out to explore the market any time. And public transport is also available easily from here. Overall a good stay option.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great Location, Uncompromising Standards!!\nI experienced a mix of positives and negatives during my stay.\nThe hotel's location is undoubtedly one of its greatest assets.\nHowever, there is a  lack of variety in the breakfast menu, making it monotonous after just a couple of days. Another issue were the chairs in the room. They're very uncomfortable and not suitable if your looking to work out of the room.\nFurthermore, I was surprised and somewhat disappointed when the room was cleaned without my permission.\nDespite informing the staff of the possibility of checking out, they proceeded to clean the room without seeking confirmation, leading to the accidental removal of some of my products.\n\nAlso, I did notice that they provide extra care and attention to guests coming from outside of India. This preferential treatment is a significant turn-off.\nHospitality should be inclusive and welcoming to all guests, irrespective of their background.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I had an exquisite stay at the hotel and indulged in the spa's rejuvenating treatments. The hotel's luxurious amenities and attentive staff exceeded expectations. The spa's tranquil ambiance and skilled therapists provided a blissful escape. A truly delightful experience that I highly recommend for both leisure and wellness enthusiasts.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Our 2 nights at Residency Towers was wonderful.  The room and bathroom were large, comfortable, and nicely furnished.  An iPad controlled everything from the AC to the curtains, but not the toilet. Service was excellent, possibly excessive.  Breakfast and lunch was nicely prepared and delicious.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "A Gem in Puducherry: A Review of The Residency Towers\n\nFrom the moment I stepped into The Residency Towers, Puducherry, I knew I was in for a treat. This luxurious hotel isn't just a place to stay, it's an experience.\n\nLocation, Location, Location!\n\nSituated perfectly, the hotel is just a short stroll from the famed Promenade Beach.  This meant I could easily enjoy the scenic walks and vibrant atmosphere of the waterfront. Yet, the hotel itself offered a peaceful retreat, a haven from the hustle and bustle.\n\nAccommodations Fit for a King (or Queen!)\n\nMy room at The Residency Towers was nothing short of exceptional. The refined quarters were spacious and impeccably decorated, with stunning city views. The room's amenities, including an LED TV with Netflix, were the perfect touch for unwinding after a day of exploring.\n\nA feast for the Senses\n\nThe hotel boasts a variety of restaurants, each offering a culinary adventure.  Whether you're in the mood for a fine-dining experience or a casual pub atmosphere, The Residency Towers has you covered.  Every meal was a delicious exploration of fresh, local ingredients.\n\nRelaxation at its Finest\n\nWhen it came time to unwind, the hotel's spa was a dream come true.  The expert therapists pampered me with a rejuvenating treatment, leaving me feeling refreshed and ready to explore more of Puducherry.  The indoor pool was another fantastic amenity, perfect for a refreshing dip or simply lounging poolside.\n\nTop-Tier Service\n\nThe staff at The Residency Towers truly elevated my experience.  From the friendly greetings upon arrival to the attentive service throughout my stay, they ensured every need was met with a smile.  Their genuine hospitality made me feel welcome and valued.\n\nThe Verdict: An Unforgettable Stay\n\nThe Residency Towers is more than just a hotel; it's a luxurious oasis in the heart of Puducherry.  If you're looking for an exceptional place to stay that offers impeccable service, world-class amenities, and a truly unforgettable experience, look no further than The Residency Towers. I cannot recommend it highly enough!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Lagoon Sarovar Premiere Resort , Pondicherry",
      "rating": [
        4.6
      ],
      "address": [
        "River view Avenue, Pooranankuppam, Puducherry 605007, India"
      ],
      "reviews": [
        {
          "text": "I had a wonderful time at this Resort, a peaceful oasis away from the hustle of the city. Every corner of this property is just amazing and perfect if you want to relax and recharge your energies. Also, everything is very stylish and treated in detail. I had the warmest welcome, the owners are simply fantastic and the staff was very friendly and nice. They all made my stay even more enjoyable, by always making sure I was comfortable. The rooms are excellent and the restaurant’s food was delicious, with a huge variety of options! The chef was very careful to satisfy my requests and I really appreciated that.\nEverything about the Resort was exceptional! Thank you all for your kindness and for making my stay unforgettable!!",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Overall, a great resort to unwind and relax with family and friends. The staff was cordial and the property is well maintained. Breakfast was good with a variety of options. One can enjoy indoor activities like air hockey, pool, foosball, etc. and outdoor activities like water sports at the lagoon waters, cycling, swimming in the infinity pool, archery, etc. The resort is relatively new and much better than most other resorts in Pondicherry.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Perfect getaway if you want a quiet, serene place with a great view. The staff was extremely courteous and helpful, especially at the restaurant. Some staff at the reception had trouble with English but it wasn’t too much of a bother. Few things you must know before booking: there’s no elevator, so if you’re staying on the first floor, please be prepared; White Town is around 20-30 minutes away, so book an auto or cab in advance, costs around 500 rupees; laundry service is outsourced and it’s returned on the evening of the next day if you give it to them by afternoon.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Lagoon view Rooms were clean and well maintained. Good views of back water . Indoor & outdoor activities are good enough. They have water activity like speedboat (850 per head), banana (950 per head) & peddle boat. Buffet was good , taste & quality. Ala carte waiting time after an order was solid 25-30 mins. Welcome drink we have to remind them  to provide . They had DJ nights. Other than that there is no water smell or mosquitoes here . Good amount of space for Parking , security & Reception available 24/7. Wallet parking available . Last 500m to resort is little rough patch but you will reach there eventually.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Amazing Property. The keen initiative to showcase the ancient sculptures are amazing. One of the best cuisines I have ever tasted. Very nice place for recreation. Really enjoyed in all aspects. The collection of antiques are really awesome.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "Hotel Karai Chettinad Restaurant",
      "rating": [
        4.4
      ],
      "address": [
        "100 Feet Rd, near Indra Gandhi Square, Anna Nagar, Puducherry, 605005, India"
      ],
      "reviews": [
        {
          "text": "Booked a smoking room for 10 days and they asked me to pay ₹10k for smoking inside the room and after so much of dispute they demanded me to pay ₹3000 to check out. Otherwise rooms are good, also they will clean the room if we request, for those 10 days they cleaned twice which was on my demand. For non-smokers and one day trip it's a good place, for others nope. Even if you stay for two days you need to request them for cleaning and water refill.. mostly they will close the main entrance by 10.30 which is on main road and they request you to use back entrance until morning.. they will not have tea or coffees, naan items won't be available after 7.30pm",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Food was quite delicious and exquisite. However their service could definitely improve, waiters were not attentive and few even hovered too close to us which made it uncomfortable. We were given plastic plates which was very disappointing given that the briyani costed Rs. 450 and had very less meat pieces.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We dined in with family. The food's taste and service were excellent. Prakash, the F&B manager, was courteous and made sure that guests had the best experience. Keep up the good work!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The food has a good taste, and the ambience is pleasant. While I haven't tried their vegetarian dishes, their non-vegetarian options are quite delicious.\nThey need to focus on attentiveness and promptness could further elevate the overall guest satisfaction.\nDuring peak times when the hotel is fully booked, parking can be a bit challenging due to limited space.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I went to this restaurant solely by looking at the reviews on Google and I'm happy that I did. Excellent food quality, delicious taste. Quantity is a little less compared to the cost, but you will feel satisfied with every bite and will just crave for more. Polite and friendly staff, totally hygienic, fast service. Ticks all my boxes !!!\n\nPrawns pepper fry and mutton biryani are a \"must try\" here.... Please keep it up",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Sandunes Paradise Beach",
      "rating": [
        4.3
      ],
      "address": [
        "VRCC+W55 Paradise beach, Pudukuppam, Puducherry 607402, India"
      ],
      "reviews": [
        {
          "text": "Great private beach with an affordable bar and restaurant but most of the water rides were either not available or had biased prices. Entry is Rs. 70 per person. Beach is really clean and well maintained aesthetically.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place to visit for activities. Entry fee is only ₹70.you can enjoy  activities however some of it are bit expensive. Sea side is really clean even you will find a place to take bath after sea shower.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good for adults. Entrance cost is for all who are 10+. Do not waste entrance money if you wish to entertain kids. For kids it will be only max 4 raids are there. Most of it will not be working.\nNo lights in Rest room, Toilets not cleaned\nWater in the rest room tank is green coloured fully algae contaminated.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Best place to stay and spend good time with family\n\nIt's pet friendly\n\nGM Mr.jayakanthan taken spl care to  every guests like kings\n\nThanks sir for kind service\n\nFood was good sea food must try\n\nStaffs are polite and humble\n\nBeach access is highlight\n\nWater activity also there to enjoy for kids and adults",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This is actually one of the cleanest beaches in pondicherry. Entry fees are 70rs per head. There are water games for kids but the paramotoring is available on this beach. This is also called paradise beach. This beach has Goa vibes. Small pubs available nearby. We enjoyed paramotoring at 4k per head which is expensive. Car parking is available for free. Would recommend visiting this beach rather than rock beach or serenity beach as those are not maintained.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "La Grrande Malar - The Boutique Hotel Pondicherry",
      "rating": [
        4.4
      ],
      "address": [
        "20, Kandappa Mudaliar St, MG Road Area, Puducherry, 605001, India"
      ],
      "reviews": [
        {
          "text": "I stayed here after reading lot of good reviews in Google, but was disappointed with the price I paid for the kind of rooms and services that were offered.\nFirstly, there were no room boys to assist for luggage.\nNext, although the rooms were neat, we felt we could have got similar rooms for same price. There were no holders for soaps or paste.\nWe took room with a view but the view was fully covered by next building wall. Thought, why paid more for this view?\nLocation of the hotel is a big positive thing. It was very near all important places to visit.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Stayed with my family here for a 3d2n stay. Room was very comfortable and didn’t lack anything. Restaurant has a great variety of food choices and very tasty appetizers! Personnel are very kind and welcoming. They’re informative and help you with all queries. Google shows 3stars but i see no reason to not make it 5stars.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I am writing to express my sincere appreciation for the outstanding experience I recently had at your hotel. From the moment I stepped into the lobby, I was captivated by the exquisite ambiance that permeated the entire establishment. The tasteful decor, soothing lighting, and attention to detail created an atmosphere of unparalleled luxury. The level of service I received during my stay was nothing short of exceptional. Your staff's professionalism, attentiveness, and genuine hospitality left a lasting impression on me. Every request was met with a prompt and courteous response, making me feel truly valued as a guest. Moreover, the overall experience surpassed my expectations. The well-appointed rooms provided a perfect blend of comfort and style, ensuring a restful and enjoyable stay. The attention to cleanliness and maintenance did not go unnoticed, contributing to an overall sense of well-being. I want to extend my gratitude to the entire team for their commitment to excellence. It is evident that your dedication to providing a superior guest experience sets your establishment apart. I will undoubtedly recommend your hotel to friends and colleagues and look forward to the opportunity to return. Thank you once again for an unforgettable stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The location is top notch, just meters away from White Town, Promenade Beach, Sand Beach and the Rock Beach. Everything prominent is at a walking distance. Including rental scooters, atm, hospitals, bakers street and etc.\nRegarding the hotel, the rooms are really good. The bathroom is proper. The housekeeping maintains the room everyday. The breakfast provided is also good. The staff including the receptionist are very courteous. We had a great support from Subhash. He's a thoughtful and a very helpful person. The rooms have all the amenities you may need. All in all, it's been a pleasure doing business with them. And I can opt for it again whenever I plan on visiting Pondicherry next.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Good property but needs a little more care. Staff is polite and helpful. Location is great. Walking distance from the Rock Beach, museum, Aurobindo Ashram etc. Cleaning is an issue. Bathroom exhaust of all rooms are centrally connected and thus it smells all day. Limited parking. Max 7 cars can be parked. All others need to park the car on road. Breakfast is average, it's not bed but can't rate it excellent. When I dine in and ordered tea, it was great, but same is not good when ordered in through room service. Fruits kept in room are not fresh. If they improve on cleaning and maintenance, then it could be good place to stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    }
  ]
}