{
  "places_with_reviews": [
    {
      "name": "THE GRAND",
      "rating": [
        4.3
      ],
      "address": [
        "30, GT Rd, Ushagram, Asansol, West Bengal 713301, India"
      ],
      "reviews": [
        {
          "text": "Pros:\nFood quality was good.\nThe quantity served was sufficient.\nService was satisfactory.\n\nCons:\nVery limited menu options.\nAmbiance was average.\nTaste was not authentic for some items like Tom Yum soup\nOverpriced.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Overhyped place. Nothing great. Front desk fellow was having too much attitude. Visited for dinner. The servers informed that only a single restaurant is open. Agreed and placed order. Taste was below average. Met one 3rd class server who didn't know how to use card swiping machine and was talking back a lot. Awarding 3 stars because of other two servers who were well behaved.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The Grand is a Really Good Hotel worth money. Good, tasty and variety of Food and sweets available. Very Nice hospitality and services. Liquor and bar also available. Over all very nice experience we get over there.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I recently dined at Aroma, The Grand in Asansol, India, and it was an exceptional experience. The ambiance was inviting, with a perfect blend of elegance and comfort. The menu offered a diverse range of dishes, each prepared with exquisite flavors and presented beautifully.\n\nThe staff at Aroma, The Grand, were incredibly attentive and friendly, providing top-notch service throughout our visit. The attention to detail and dedication to customer satisfaction were truly commendable.\n\nI particularly enjoyed the freshness of the ingredients in every dish, showcasing the restaurant's commitment to quality. From appetizers to desserts, each course was a delightful culinary journey.\n\nThe restaurant's commitment to maintaining a clean and welcoming environment further added to the overall positive experience. I highly recommend Aroma, The Grand, to anyone seeking a memorable dining experience in Asansol. It's a culinary gem that stands out for its exceptional food, service, and ambiance.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I was stay on 6th Mar with a very bad experience. Hotel lobby is excellent but when rooms are very poor & less maintain pic enclosed.\nFront dest people was very much attitude look like give us free rooms",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Asansol International",
      "rating": [
        4.2
      ],
      "address": [
        "66, G.T. Road East, Murgasol, Ushagram, Asansol, West Bengal 713303, India"
      ],
      "reviews": [
        {
          "text": "Excellent place. Comfortable and the rooms were nice though on the smaller side. Clean and the room had all the necessary details needed for a nice quote stay. The staff are friendly but in their eagerness to please they sometime go overboard. What I felt was they needed a lot more training. The other thing I noticed is very few people in the staff actually smiled.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Location is good and there are plenty of shops nearby including good food junctions. You will definitely require a good restaurant or take away services once you have tasted food from this hotel.\n\nTheir rooms are spacious but without temperature control in winter time. For my entire stay I have to wear all the woolens inside the room itself.\n\nThey served sauted vegetables and herb rice with chicken Kali mirch tikka! Quantity of food is good but the quality is not up to the mark. Overall it's an old hotel, who claims to be a new one! Staff behavior is so, so and not at all pleasant.\n\nMy driver was there and they charged Rs 300 extra for driver accommodation. But the hotel has no parking and my driver could not take bath for 4 days of the stay. The washroom was so dirty!\n\nTheir lift is very old and you have to close the door manually. It's a small congested lift and feels very bad.\n\nI have to book this hotel at very last time as other good hotels were sold out! So I actually have no option but to stay with them.\n\nAnd to top the list, they charged me a false bill of Rs. 137/- which I have noticed later.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the best hotels in Asansol.\n\nTheir room are neat, clean. They are providing prompt room service, food test and quality also good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very nice place to stay and for any kind of occasion like marriage, rice ceremony etc. Food in the restaurant is very costly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The staffs are decent, cooperative and very prompt in providing their services. Little bit expensive but worthy….. Food is also good. Well decorated and oldest hotel in Asansol. Best part is that you and your entire family are always safe here. You just come and enjoy. There is also no dry day. I just love this place.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Super Collection O Meera International",
      "rating": [
        3.5
      ],
      "address": [
        "Sen-RAleigh Road, West, opp. Axis Bank, Apcar Garden, Asansol, West Bengal 713304, India"
      ],
      "reviews": [
        {
          "text": "Everything Depends upon your Booking. If u book offline you got good rooms but if you book online on discounted price you got average rooms. Overall Service is great. Receptionist and Staff behavior also great. Good choice to stay.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Had blood stain on the bedsheets, dirty room, dirty toilet, ac not working properly, battery missing from remote, television not working, broken jet spray, flush not working, shower not working, and above all very rude behaviour from the staff. Worst experience ever. Won't recommend at all.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "Dirty bed sheet and toilet. Next day no one came to clean the room , toilet and for squaring up the bed. Intercom not working. Tea service only after 8am. That too you need to make call from your mobile phone to desk. Hot water line in bathroom is choked . No water , no electric kettle, no towel, no soap or any other toiletries provided. it's totally waste of money.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "No toiletries provided. Rooms are not cleaned, they just change sheets everyday. Don't even sweep the room. You will find condoms packet, Burnt sigrets beneath bed , woman hairs and a lot of dust lying on the cupboards",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        },
        {
          "text": "I would leave zero stars if I could. The food is mediocre for the price and to make it even worse it is not even close to authentic. You should not call yourself even a decent restaurant. The vibe, music, and food feels ridiculously whitewashed. Other side Room service was good enough, receptionist behaviour was good at that time specially that mask guy and that person who wear turban at there.",
          "languageCode": "en",
          "rating": [
            3.5
          ]
        }
      ]
    },
    {
      "name": "The Fern Residency, Asansol",
      "rating": [
        4.2
      ],
      "address": [
        "Burnpur Rd, IISCO Steel Plant, Burnpur, Asansol, West Bengal 713304, India"
      ],
      "reviews": [
        {
          "text": "We attended a family marriage function. The halls are really big and specious. Catering is standard and the staff are well behaved. They went out of their way to cater special requests for the bride. Lights and decoration was up to the mark. Rooms are very huge which is always consistent with other properties of fern too. Washrooms are clean and spacious with all toiletries in place. Breakfast the next morning was wholesome and overall it was a wonderful experience.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The hotel seems to be good. But the beverage part in the restaurant is too much over priced. The price they are selling match the price in Taj and Marriott. A glass of wine 3500rs seriously",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "My comfy place...I loved this hotel..I generally not stay in hotels as I don't go outside much..but this hotel gave a great image of hotels and now I will go and roam around more...whose so ever is in Asansol and want to have yummy food and relaxing stay, visit this place..",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The Fern Residency in Asansol epitomizes refined hospitality and eco-conscious luxury. From its elegant rooms to delectable dining options, every aspect of the hotel exudes excellence. The rooms offer a serene retreat with modern amenities, perfect for business or leisure travelers. Culinary delights await at the in-house restaurant, where expertly crafted dishes tantalize the taste buds amidst a charming ambiance. What sets The Fern Residency apart is its unwavering commitment to sustainability, evident in its eco-friendly practices and initiatives. Moreover, the staff's impeccable service and genuine hospitality ensure a memorable stay for every guest. Whether you're seeking comfort, culinary delights, or a sustainable retreat, The Fern Residency delivers an exceptional experience that exceeds expectations.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Hotel is good . My room was having view of asansol stadium view. Hotel is is on the same building of galaxy Mall. You can do time pass in the mall in the evening. Mall is not that much big, but of good size with numbers of Shop for shopping. Hotel banquet hall is having entery from fourth floor of mall. Hotel is having gym also. Housekeeping is nicely maintained. Staff is friendly.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel The Signature Asansol",
      "rating": [
        4.1
      ],
      "address": [
        "169, G.T Road Near - United Bank of India, B. B. College More, Branch, Ushagram, Asansol, West Bengal 713303, India"
      ],
      "reviews": [
        {
          "text": "One of the best hotels in Asansol.\n\nVery efficient service, rooms are maintained well, nice behaviour received from the staffs here.\n\nFood taste is not good here and expensive!\n\nHowever overall it is very good hotel to stay with family, alone or friends.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "All staff behaviour is very good. The food items are very tasty.\n\nAmazing experience.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Absolutely loved the food there. Although on the costlier side but the food is worth the money. Great staff and fast service",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Rooms were very small for the price charged. Funny thing was Standard Room with 2 seperate beds was cheaper than a Premium room with a Double Bed. Yes, the only difference b/w both Rooms was the Bed, but the price difference was 1k.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Highly priced with average quality food. Waiting time is too much with slow service and untrained waiters. Not recommended.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Paras",
      "rating": [
        3.3
      ],
      "address": [
        "29(64)/1, G.T.Road, Gurunanak Complex, Rambandhu Talaw, Ushagram, Asansol, West Bengal 713301, India"
      ],
      "reviews": [
        {
          "text": "Basic rooms are not suitable for staying, very much dirty and unhygienic..windows are not opening, blankets and bedsheets are not clean. AC rooms are good as per the price points, rooms and beds are clean, had a huge window which you can open.\nNext to keep in mind that it is only lodging, no foods are available at the hotel.\nManager is little bit rude, staff service is good but not much services are there to avail.\nLocation of the hotel is good.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Okay place to stay for 1 night!\n\nBut the room is not worth the money!!",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Amazing Hotel but Rooms Are Shaddy But Staffs Are Amazing 😍❤️",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "I booked this hotel for my exam purpose. I reached there at 4 am on the same day of my exam. My exam time was from 8:30. The hotel was clean, bathroom was clean and room was average. They charge around 650 through MMT. staff behaviour is good enough. Overall it's perfect for work purpose. Not for luxurious stay.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Booked on phone. Reached at schedule time of 3am. Picked up and switched the phone off. Lot of difficulty find a hotel with no Sign Board.\nAfter 1hour to reach there, told no room is empty. Arrogant.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Jyoti International",
      "rating": [
        4.1
      ],
      "address": [
        "Sen - Raleigh Road, opposite of Ramkrishna Mission Ashram, Gobindapur, Asansol, West Bengal 713305, India"
      ],
      "reviews": [
        {
          "text": "I went for dinner with my family. We didn't avail the room service, so can't comment on that. As far as the food is considered, it was very delicious and not very rich. The quantity of the food was also sufficient. The restaurant is very spacious and the ambience is vibrant. It will be very economical if you avail their membership to get heavy discounts and offers.\nThe only con I found was that the choices of soup and Chinese chicken gravy items offered by the restaurant are very very limited.\nOverall my family and I loved the food and their service.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Absolutely loved the hotel......i would 100% recommend it..\nhotel jyoti is a really Good Hotel worth money... Good,very nice hospitality and services... Over all very nice...\nFood is so deliciously awesome,very well maintained restaurant....",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice place and food is awesome\nIt's really good for Jyoti international restaurants and relaxation. Contrary to Ramakrishna Mission. The view outside is amazing. This is our second time staying at that property. The behavior of the employees is very good",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Location is good but their lift is too small for such a big hotel. I really wonder how much can the owner save by installing a small lift which can accommodate just 5 people in such a big multi storied hotel. Location and parking is good.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "First of all, if you are going to the restaurant, a big NO, the food Is extremely bad. Quality and taste are not maintained. There are very good places to dine in at half the cost.\nIf you are planning to stay here the rooms are good but the prices are way more than the services and quality of the room.\nThere are very good hotels at this price point in the city.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Diwan International",
      "rating": [
        3.6
      ],
      "address": [
        "AGARWAL COMPLEX, OPP. KABLI GODOWN, BAKAR ALI LANE, NEAR, BASTIN BAZAR, Pathak Bari, Asansol, West Bengal 713301, India"
      ],
      "reviews": [
        {
          "text": "We were visiting Asansol for some reason in the month of early December 2023 and stayed here.  The room given to us was very spacious, big size.  Toilet was clean.  Owner is very, very helpful.  Overall service is very good.\n\nLocation is a bit tricky if you are coming here for the first time because it's behind a very big market, but owner is always there to guide you.  Auto, toto rickshaw available from Station, less than 1.5 km.  No issue.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Neat & clean Spacious rooms little Restaurant are not available you can order thru delivery app Location is in a busy street Ok for individual persons..",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Great place to stay at an affordable price. There are many good restaurants nearby. It's a little hard to find the location. Overall  good experience",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Hotel manager and staff are very bad behaviour they took 1200 RS for room and when I checked out the staff and manager take 100 RS for bedsheet dirty\n\nKoi hotel Mai bedsheet Ganda hone pe extra charge nhi leta hai very bad experiences\n\nHotel manager reply if he took 1200 then show bill you don't give me bill otherwise I also show the bill unfortunately pls don't lie you took 1200 for room and dirty bedsheet for 100 RS",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Best hotel in asansol.\n\nHotel place is good at this rate, staff behavior is good and rooms are big, air conditioner is working perfectly. If you come here by bus or train then it good , the hotel is situated at asansol business market.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    },
    {
      "name": "OYO Flagship Alisha Lodge",
      "rating": [
        2.8
      ],
      "address": [
        "229, lower, Chelidanga, Asansol, West Bengal 713304, India"
      ],
      "reviews": [
        {
          "text": "Worst place to stay, no proper service available. Do not book online via Oyo, they will create a chaos if you do the booking via Oyo. Worst hotel experience so far. Nothing is clean starting from bed sheets to washrooms.",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "Extremely disappointed by the hotel management system, rooms are not clean properly, if you book online, no cancellation option...No attended found 24/7. May be cheap but extremely poor service. No complementary breakfast serve here as stated in booking site.",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "Very nice room ...sarvice are good.. staff behaviour good... but price high...but good experience nice hotel flagship Alisha",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "I recently booked this hotel. First you find trouble to find this hotel then after when you check in they told you that pay extra charges for room other than what OYO ask to pay then after if you decline his purposal and ask for room he Directly say all rooms are book and if you told OYO or complain OYO authority i directly told him that there is short circuit in the room and defend myself.\nI booked for AC room but i get simple non AC with bathroom seat broken and about mosquito you don't sleep well.\nReviews are better for intelligent people\n\nBe careful and visit one more OYO property 100 steps away from Alisha thank you guys 🤗",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        },
        {
          "text": "Worst experience ever.\nIf you are going to stay in this hotel,\nTake your own responsibility of your vehicle.\nAll though they have parking facilities but parts of your vehicle could be stolen from the parking.\n\nAnd the behaviour of the manager is worst. He will start arguing with you. And won't take responsibility of the stolen parts.\nAnd you have to bear the cost of the things from your pocket.",
          "languageCode": "en",
          "rating": [
            2.8
          ]
        }
      ]
    },
    {
      "name": "BOMBAY HOTEL",
      "rating": [
        4
      ],
      "address": [
        "G.T. Road, Munshi Bazar, opp. Eastern Railway School, Joynager, Munshi Bazar, Asansol, West Bengal 713301, India"
      ],
      "reviews": [
        {
          "text": "Very good fast survey, good taste of food,good behaviour with good price. In front of my school . From my childhood many times I dinner here . First time after today dinner I give own rating to them . 🙂🙂",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Delicious South Indian and Chinese dishes are served here. Cleanliness and hospitality are worth visiting",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good environment and pure vegetarian hotel but Hotel staff are very lethargic and waiting time after ordering food is long.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Veri nice,clean,polite & friendly behavior of manager and others staff. Near to asansol station. Reasonable prices of rooms.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good ambiance and taste of food was quite good. If your choice is veg dishes try here paneer items it was delicious 👌",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}