{
  "places_with_reviews": [
    {
      "name": "NSK Anamthara Resort Private Limited",
      "rating": [
        4.2
      ],
      "address": [
        "Kottiyod, Kizhakkupuram, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "Great venue to host events. We chose this location for my engagement ceremony on the 11th of this month. Our party was upstairs in one of the party hall. Beautiful space! Staffs are all so friendly and helpful. Since we have quite more people than we expected at the first place, the manager accepted our request to close the restaurant for the regular customers and open it just for our party. Thank you to the staffs for helping us to have a party that we all never forget. They have a huge children’s park. The ambience is so heavenly. They offered us a buffet menu which satisfied all our guests (chicken/beef/mutton/vegetarian/vegan)\nAltogether 5 outta 5 experience",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Good place to stay with family. The ambience is very good and has a lot of space to walk and sit. Also there is a children's park to play and spend time. And some adult activities programs like rope walk,zip line, etc are also there but were in maintenance while we were there. The problem is the smoking in the room, full of cigarette buds outside the windows and sometimes smell will be in the room",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice place and calm environment, friendly staff, good food @affordable price",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "My wife's college reunion at Ananthara Resort was a delightful experience filled with great outdoor activities and delicious food. The sprawling outdoor setting provided the perfect backdrop for our gathering, and the opportunity to play basketball added a fun and energetic dimension to the festivities.  It was heartwarming to see the children thoroughly engaged in play, creating a vibrant and family-friendly atmosphere.  The variety and quality of food surpassed our expectations. The culinary team at the resort demonstrated their skill in creating a memorable dining experience.\n\nOverall, Ananthara Resort provided the perfect setting for a college reunion, blending a picturesque outdoor environment with enjoyable activities. If you're seeking a venue that caters to both outdoor enthusiasts and food lovers, Ananthara Resort is a commendable choice.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Quiet and scenic place. A bit hard to find the location though. The surroundings are very calm and beautiful especially during September to January. The swimming pool is well maintained and they also offer a handful of activities (for adventure lovers). Good place for a short weekend getaway. A personal request to the resort: Please open the swimming pool for those who would like to pay for it alone.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Savithri",
      "rating": [
        3.9
      ],
      "address": [
        "Chirayinkeezhu Rd, Veeralam (Veera Kerala Puram), Kizhakkupuram, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "I visited here for a conference, all is good, except sound system. There is a open rooftop. I took some photos from there. The hotel is situated in heart of the city.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Worst experience. High cost with poor management and service and worst quality of food. Rooms were not cleaned and the bathroom had bad stench. AC was not working. Seating arrangement was poor. Hotel is not good for wedding reception or any such functions. They charge huge ammount with poor quality in service.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Attended an engagement function there, the hall was nice and food was great also plenty of parking available.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Good service, good quality of food and service.. nice atmosphere and good parking area. But the price is a little bit high.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Nice stay and rooms are good. Service needs real improvement",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Harisuns Plaza",
      "rating": [
        3.7
      ],
      "address": [
        "NH 66, Alamcode, Kerala 695102, India"
      ],
      "reviews": [
        {
          "text": "Hotel is located at the alamcode junction. Rooms were big enough to accommodate 3-4 person. Rates were quite reasonable. Staffs were really nice and friendly. There are many hotels/restaurants in the vicinity so one can get all the options for veg/non veg food easily there. Thanks to the owner and staffs of the hotel for helping us in all way. Highly recommended 👍",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "It was nice and comfortable stay at Rs 700. Basically it's inside a shopping complex (the name itself belongs to the shoping complex). They have non ac rooms with double bed facility. No water heater. Ample parking space provided . Location is excellent.\nGood for people coming for exams at nearby engg college in Attingal.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "The main advantage of this hotel is the location. Easily accessible and convenient at Alamcode junction. Customers can get a room at a reasonable price. The room was standard and the bathroom was clean. The bus stop is very near and u will easily get an Auto too. 3 Restaurants are there nearby. No pure veg restaurants around the hotel(u have to go attingal to get a veg restaurant). Staffs are polite and helpful. Overall good",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "One of the best experience I had. The lodge is situated in a cardinal position where one could easily reach the premise apart from that  access to the public transportation is close and very convenient. The rooms and services they provide are top notch and the staffs are very attentive to our needs. Only glitch I felt is that regarding mosquitoes otherwise it was a pleasant experience",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Disappointing. Not fit for night stay. Didn't  expect much amenities at the price. Just could not even sleep well. Very stiff and uncomfortable bed , continuous noise as it's by the high way side, POOR ventilation, foul chemical smell on pillows and in the room and a cell tower just besides the building!\nToilets okay.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Royal Castle Resort",
      "rating": [
        4.1
      ],
      "address": [
        "Mananakku, Attingal, Kerala 695102, India"
      ],
      "reviews": [
        {
          "text": "Have not stayed there but went to attend a meeting there. Good to have a resort by the lake here. A couple of cottages are available form the entrance all the way down to the lake. The lake is further down with boat rides available. A hall is available to hold small gatherings by the lake. May visit sometime to spend a day over there.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good ambience, Open area. Not good in peak summer times.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Good ambience and nice location for evening party.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "My recent visit to Royal Castle Resort in Mananakku, located near the picturesque Mananakku Lake, was an unforgettable experience. I had the pleasure of attending a marriage function in the evening, and I must say that the setting and service left a lasting impression. The resort's location is its crown jewel. Nestled near the serene Mananakku Lake, the scenery is breathtaking, especially during the evening when the golden hues of the setting sun cast a magical glow over the water. The view provided a serene backdrop for the celebration. The resort's architecture and interior design exude a sense of regality. The grand hall where the marriage function took place was tastefully decorated and well-lit. The attention to detail in the decor added to the overall ambiance, making it a truly royal affair. The resort staff was courteous and efficient, ensuring that guests felt welcomed and well taken care of. They provided excellent service throughout the event, attending to the needs of the guests promptly. The catering was exceptional. The wide array of dishes served was not only delicious but also beautifully presented. From traditional South Indian delicacies to international cuisines, the food was a highlight of the evening. The desserts, in particular, were a sweet delight. The Royal Castle Resort in Mananakku excellent spot can be considered for a marriage, bday or a getto function. The combination of the stunning lakeside location, elegant decor, attentive staff, and mouthwatering cuisine made it a memorable evening for all attendees. If you're looking for a royal experience in the heart of nature, this resort is a must-visit.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Bad Experience, Not recommended for Family. We had taken 2 rooms with family and in toilets water finished at 10pm and the staffs didn't do anything till next day 9am. After frequent complaints also they were not serious of the matter as they have taken all the rent in advance. So we had no option, vacated the rooms and had to go to other hotel for using toilets and take bath.\n\nEven they were not sorry for that and atleast didn't had paid us a compensation or a discount.\n\nThe management should take care of the staffs, neatness & hospitality to the customers.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Mekosha Ayurveda Spasuites Retreat",
      "rating": [
        4.5
      ],
      "address": [
        "Melattingal, Near Perenem Temple, Alamcode P.O, Kerala 695102, India, Thiruvanthapuram, Keezhattingal, Kerala 695102, India"
      ],
      "reviews": [
        {
          "text": "The staff was exceptionally friendly, the environment was refreshingly quiet, and the food delicious! The Ayurvedic doctor on site gives an introduction to Ayurveda and how one's visit is tailored to provide the best experience for healing and balance. They take healing seriously so the doctor prescribes what your treatments will be rather than picking and choosing based on what you want. In that way it's more of a healing center rather than a spa vacation. It is relaxing, but it's not a spa where you choose your treatments. That said, it's a delightful retreat for resting and, especially, healing.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Mekosha Ayurvedic Resort in Trivandrum provides a serene escape with clean rooms and delicious food. The well-maintained and secluded property enhances the tranquil atmosphere. Special commendation to the skilled and friendly massage therapist, Shahila, whose exceptional treatments added to the overall experience. Highly recommended for a rejuvenating stay.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Beyond expectation! My first trip to India and stay at Mekosha. Mekosha is welcoming, calming, peaceful, healing and rejuvenating- even if you show up with stress, it soon melts away. I greatly appreciated the kindness of all the therapists and all the staff- everyone works to make the experience the best for all the guests. The genuine care and work that goes into every aspect, Thank you so much! And the really unexpected part was the friendliness of all the guests, the connections and conversations made it such a memorable experience! And I think that's the part of healing we all need (love, connection, friendships) I really wish I had stayed longer however as I left I knew that this is a place to come back to. Thank you for touching my heart with such a lovely retreat!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Intimate  ayurvedic spa with personalized treatments, simple food and a great chance to interact with the small group of guests. Suitable for indians as well as visitors. For newbies as well as for those who have experienced ayurveda before. With just 11 rooms  it feels very personal and friendly. Rooms are fabulous. Pool is great. Cost is not exorbitant. Treatment is very effective with authentic products and trained therapists. Doctor consultation is personalized and I found it useful. 1hour from trivandrum airport. Will definitely visit again.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Where do I start with this place, from start to finish me and my mum had a great time.  The staff went above and beyond, food was great, the rooms were spacious and so nice to have treatments in the room.  We met some lovely guests and became one family, love the small scale of this place would definitely like to go back.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Hotel Aaramam",
      "rating": [
        4
      ],
      "address": [
        "MRW9+9C7, Main Rd, Near Bus Stand, Attingal, Thiruvananthapuram, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "Hotel Aaramam was surprisingly good with their meals and meen pollichathu. Good service and not bad sitting. They provide really good parking and the view was quite good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "One of the best Restaurant in Attingal town , Neat and clean , Food and service also good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I had Porotta, Veg Fried Rice, Paneer Butter Masala and Gobi 65 from here. The food tasted fine. Gobi 65 wasn't that good. This place has an open dining room, the ambiance of this place is very enjoyable. The staff were friendly and courteous. Enough parking space available to accommodate four wheelers and two wheelers.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Moderately priced, clean restaurant.\n\n• Tried chicken biriyani (₹130).  I don't like this type of biriyani, maybe because I'm from Malabar .\n• Very pleasant behaviour from one of their staff (One chechi) made me smile even though I was in a bad mood.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Neat and clean restaurant near Attingal region. Reasonable price, tasty food.\nParking space is limited. Very near to KSRTC and private bus stand.Only problem is to find this restauran, they should add some sign boards in the main road.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Pearl Palace",
      "rating": [
        4.2
      ],
      "address": [
        "MRHF+9RG, NH Road, Mamam, Attingal, Kerala 695104, India"
      ],
      "reviews": [
        {
          "text": "Arranged a business meeting here, ended up as a disaster. Projector was not working and even the mics. There was not even a proper AV technician to assist.\n\nBehaviour from the side of the manager was rude and irresponsible. I think that is the main reason for this un professional set up.\n\nHere you may go to the bar for a drink, but never for a professional business meet or family function.\n\nNever recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Didn't stay here but had a good dinning experience here. Food was fresh and prepared to our taste. Service was very prompt and the establishment is well maintained.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Very disappointed service in executive bar.\nVery poor service. I suggest you to bring a glass along if you going to have a drink or else wait atleast 30 min for a glass. I don't know why they are taking back the glass while order the other the peg & needs to be waited for so long to get another one 😬",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Quality of food, drinks and accompaniments are relinquishly well. At peak times they are delayed to serve to the table on time",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent service and great facility. Super clean and friendly staff. Must place to stay at Varkala.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "DEV Residency",
      "rating": [
        4
      ],
      "address": [
        "Moonu Mukku, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "I had a bad experience, there is no Waiter in the executive lounge, I waited 30 minutes to take my order. Finally I got out of the lounge. I strongly suggesting to avoid the executive lounge.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Hotel with restaurant in the heart of Attingal town. Good rooms, nice board room, courteous staff and all well organised. Food is good , tasty. There is a Bar too",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very tasty and homely food. Staff behavior vas very polite and very helpful. Excellent dining in attingal.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very poor service\nPoor managing\nAc not working condition",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good staffs especially the lady staffs at reception and food served staff was very pleasant and well mannered, I visited with my wife they gave warm sent off. Excellent staff recommended",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "SPOT ON Green Inn",
      "rating": [
        3.4
      ],
      "address": [
        "6/9, Ravivarma lane Moonumukku, attingal p.o, trivandrum, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "I stayed at this hotel for one night. Rooms are low-quality, not cleaned and AC water flowing in the room floor. The bathroom is not cleaned and will help cause nausea",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "I will not give a single star. I stayed here one day.  The rooms were drity, lot of smell was there. Bath room was so dirty. One of the worst experience in my life. Dont recomend to anybody this hotel. I asked them to clean the bath room. Nobody came.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "Good service is good and beer. Best hotel in Attingal.",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        },
        {
          "text": "👍",
          "languageCode": "en",
          "rating": [
            3.4
          ]
        }
      ]
    },
    {
      "name": "Prarthana Residency",
      "rating": [
        3.6
      ],
      "address": [
        "Near Attingal Police Station Police Station, MRX7+GXR, Road, Attingal, Kerala 695101, India"
      ],
      "reviews": [
        {
          "text": "Very nice room good service exlent",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "One of the perfect choices for short stay in the Attingal town. Neat, safe and affordable place. Rooms are well furnished with clipboard, dressing table and another small table. Some rooms have teapoys and chairs as well . Hot water is available in the bathrooms. All the same, signs of lack of good maintenance are evident in places..with damaged paint on the walls, loose leaves of the Air conditioners etc. The hotel was in a much better condition 2 years back. The lack of restaurant facility attached to the hotel is one drawback. Room services maybe available but.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Very good hotel!\nPros: Neat rooms, bed spread, restroom; reasonable tariff and excellent behavior from staff.\nCons: No specific parking available, Few things were faulty which they can rectify in no time.",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "there is no food served there...but good hotels are nearby WALKABLE eg.Hotel aariyas(veg), Hotel aaram (veg /non veg and last but not least Hotel sasindra which is a small tea shop which serves  hot steamed NAADAN puttu with a fine kadala curry ,papppadam etc. they also serve non veg.\noverall its a good place for family stay especially when you are there for writing NID or other exams for your children",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        },
        {
          "text": "Plus points : Clean , neat Budget hotel at Attingal . Neat rooms & toilets . Round the clock hot water facility . Fresh smelling bed sheets & pillows  .Good staff support .\n\nMinus points .: No restaurent , not even tea . Very small parking area .",
          "languageCode": "en",
          "rating": [
            3.6
          ]
        }
      ]
    }
  ]
}