{
  "places_with_reviews": [
    {
      "name": "Radisson Hotel Kandla",
      "rating": [
        4.4
      ],
      "address": [
        "Survey No. 68, 1, Airport Rd, Galpadar, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Great place but it is located right next to railway tracks so it can be noisy at times.\nGreat food and service. The swimming pool and gym is also great!\nBest hotel in Gandhidham at the moment.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "What can u expect? It's the best among other hotels but not up to international. Only a seasoned traveller can spot the difference. But hotel ambience is nice among the sandy & dusty road. No hot feelings.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hello 👋.\n\nThis property is beyond expectations. The design of Resorts feels like you are staying in a very modern City.\n\nThe amenities and service you can't find in types-2 City.\n\nThe property Oowner must have very long vision, as they allocated modern shopping space inside the premises which I rarely found these days except the Oberoi or Taj's high end property.\n\nWishing all the very best to the team Radisson Kandla.\n\nThanks.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I recently had the pleasure of staying at Radisson Hotel, and I must say, it was an exceptional experience from start to finish. We stayed at Villas here.\n\nThe food quality surpassed my expectations. Each dish was prepared with precision and care, resulting in flavors that delighted my taste buds. From appetizers to desserts, every bite was a culinary delight.\n\nHowever, what truly elevated my dining experience was the impeccable service provided by Ananya, Shivani, Shukhendu & Bijoy. Their attentive demeanor made me feel welcomed and valued as a guest. They all went above and beyond to ensure that my dining experience was nothing short of perfect, and for that, I am truly grateful.\n\nThe ambiance of Waves Restaurant was also noteworthy, providing a comfortable and inviting atmosphere for a memorable meal.\n\nIn conclusion, I highly recommend Radisson Hotel to anyone looking for a comfort stay and a culinary experience that exceeds expectations. The combination of excellent food quality and exceptional service, makes it a standout stay & dining destination. I look forward to returning soon for another enjoyable trip.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I assume not so many people know where Kandla/Indian is located. However, once you go there, you will enjoy the Radisson Hotel. Not only friendly people and good food but also easy check-in and good room service!\nI had a lovely dinner, and I enjoyed a lot of good Indian dishes! Unfortunately, my storage was too small to try everything.\nAnd when you have time, the waiters are lovely listeners and entertainers! Worth to go again!",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Holiday Resort & Spa (A Unit of S. Poddar Group)",
      "rating": [
        4.4
      ],
      "address": [
        "Survey no.110, N.H.41 Road, Galpadar, Anjar, Meghpar Borichi, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Nestled amid cool landscapes, their exquisite stay and eat hotel offers an unparalleled experience of luxury and tranquility. The architecture seamlessly blends modern elegance with timeless charm, creating a captivating ambiance that envelops guests upon arrival. Each room is equipped with state-of-the-art amenities. The dining experience is a culinary journey, with a diverse menu highlighting local flavors and Indian delicacies. Guests can savor their meals in the opulent dining area or choose to dine. Impeccable service, paired with the stunning surroundings, ensures that every moment spent at our hotel is a celebration of beauty and indulgence. 👍🏼",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Hotel is at a great location, very near to the airport and has nice exteriors however the rooms and their washrooms need a serious overhaul.\n\nEven the cottages need to be redone.\n\nBreakfast buffet is fine and staff and service were decent too.\n\nOverall was a fine stay.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Lovely place for stay. Nice cottages and rooms. Lovely food. Property situated at good location. Resort is very good and everywhere greenery. Lots of tree. Nice place for marriage function. Corporate meet. Food is too delicious, tasty. Other activities and facilities available like spa,saloon, gym indoor/ outdoor games. Nice lawn tennis court. Cricket coach is there. You can spend good moments with family and store Lovely memories for future here. Even you can find here permit shop for out state tourist. So they can enjoy liquor here.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Property is good but..... in restaurant staff senior person mr. poll very rude behavior with my family.... i latterly fist time face this type of rude behavior in my 35 year life.. .. i request all visitors pls don't 🙏🏻 select this place\n\nMr poll my mistake stayed your resort",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Great View and Great place for vacation. Property is nicely maintained and felt good in the nice environmentand services. One suggestion to keep some activities like badminton free instead of charging 150rs/person. Also, they should change room cleaner or freshner from that lemon to something else as some people may allegric to it.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Ramada by Wyndham Gandhidham Shinay",
      "rating": [
        4.4
      ],
      "address": [
        "Survey No. 496/P-40, Near HP Petrol Pump Adipur Mundra Highway, Shinay, Gandhidham, Gujarat 370205, India"
      ],
      "reviews": [
        {
          "text": "Great service, great people. A bit far from everything but there’s a nice dam nearby.\nWould be good if there was a way to access it more easily.\nThe AC puts air out right onto the heads of people sleeping in an inconsistent way. It’s uncomfortable because of that, my wife needed it on to sleep well though.\nI feel the AC is too noisy, the room is at 33-36db without it and 50db with. That’s with the fan on the low setting it’s even louder with the fan on high.\n\nNeeds a bit more sound insulation as the pool side rooms still get car horns.\n\nAll the fire detectors blink with a very bright green light which isn’t ideal for sleeping but staff was very helpful and took effort to minimise the light for me and I’m very happy about that.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The hotel service provided by Mr. Bijender was commendable.\n\nHowever, the reception staff, especially Mr. Ashish, were not up to the mark; they were uncouth, unprofessional, and unhelpful with management of rooms for large group.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Overall the Rooms are unclean with a old carpet , torn menu book , lousy food and scaly washrooms . Lousy food as I had especially asked for less spicy less oily biryani and got a full oily spicy biryani .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "wonderful place to stay with family, The hospitality of the staff is nice. Food quality is also good with a wide variety of dishes to choose from. Neat & clean rooms.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Thank you for making the stay special\nWith the kind of look around you do with your guest with extra love &  affection it’s highly recommndable.\n\nSpecial thanks to Sanju & his inspirational stories he travels on his bike to long destinations & others too Mayank, Ritik at the Resturant also want to thanks the resturant manager don’t remember the name who arranged the meal (fast meal too)(Taufeeq) I believe his name was\n\nSpecial thanks to Ashish front desk  as well who took good care of us during the stay\n\nAll of them deserves a patt on their back with their respective supervisors or Managers\n\nYou guys have a wonderful team keep inspiring! Keep it up !\n\nThanks prabal\n#129\n6-8th March",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Renest Gandhidham",
      "rating": [
        4
      ],
      "address": [
        "Plot No, 78, Rabindranath Tagore Rd, behind Tagore Garden, Adipur, Sector 8, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Basic amenities good. Room size good. Floor though clean had fine dust. Bathroom shower is a waste. No pressure at all. Toilets cleaned, but not upto mark. Food quality is good, but over priced. Complementary breakfast good variety.\n\nCheck with the platform you book. We booked through renest website which offered 20% food discount on our voucher. But the same was not informed to hotel. Though we had discount printed in our voucher, hotel did not pass on discount.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Nestled in the heart of Gandhidham, Renest Hotel (formerly known as Kandla Inn Hotel) stands as a testament to timeless hospitality. As one of the city's oldest hotels, it has gracefully evolved over the years, blending its authentic charm with contemporary services to cater to the ever-changing needs of its guests.\n\nWhether you're a business traveler seeking a comfortable retreat or a social butterfly planning a grand celebration, Renest Hotel has something for everyone. Its sprawling party lawn provides the perfect setting for unforgettable events, while the banquet hall caters to intimate gatherings and formal occasions.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Totally pathetic service, which was not there previously I have been there many times and i would recommend it previously with five star but now the staff is totally.        in cooperative , they r strictt on check in check out policy but they won't be able to delivered room on time, further early check in charges are too much high if u neend your room half n hour before they are charging 1500+tax as early check in\n\nUnnecessary calling in room\nHousekeeping poor ,we have to beg for pee day room bottles\n\nSo this would be my last visit after facing all this",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The check in happened very smoothly. Thanks to the whole staff of Front office. Stay and the service provided by the hotel are great all requests were well taken care of. Would definitely recommend this hotel. Food was amazing specially the veg items. Location is beautiful & rooms are spacious.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good location near to railway station.good service decent staff.excellent stay at Renest gandhidham",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Empir'e Gandhidham",
      "rating": [
        4
      ],
      "address": [
        "Rambagh Rd, nr. Rajhans Cinema, Ward DC2, Ward 7, Gandhidham, Gujarat 370240, India"
      ],
      "reviews": [
        {
          "text": "I stayed for one night and reached around 12 am The rooms were clean The hot water in the washrooms were available from 8 am to 10 pm . My rooms were on the 1st floor the only surprise was there is no lift in the hotel",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The service was really nice and the staffs behaviour was good. It's just the wifi was not working and the pillows was really really hard to difficult to sleep and geysers issues were there. I hope you are going to work on it.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "We booked 5 Rooms  during Nov 2023 the rooms quality is very poor and  have no kettle, No freedge, and beyond all this there is no hot water facility which is basic requirement in cold weather of winter in Kutchh. Not recommend for family.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Best room and room service,restaurnt food was amazing .. All serivice like wifi ,room clean,all basic facilities in the hotel",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms are average and the staff are co-operative and helpful, The food was very good.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Ambar Sarovar Portico",
      "rating": [
        4
      ],
      "address": [
        "Plot No.100, near Oslo Circle, Sector 8, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Rooms are big and specious but, needs serious attention towards maintenance.\nFood quality at breakfast can be better,  seams due to current conditions less bookings and, they are not taking things seriously too.Service level is very poor.we need Faster service but stap availability is very less so they cannot give better service.Food  Quickly also very bad .We take Green Salad  but as the price quantity is too Less.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The room was very neat and clean and the service was very good the food is tasty",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "All good. Very nice. Keep it up. Thanks",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Good & supportive staff.\n\nIf Someone ask me than definately will refer this one.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Stayed for two nights. Good choice among other hotels at this area.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Quality Inn Palms",
      "rating": [
        4.3
      ],
      "address": [
        "255, Survey No. 98, Galpadar, Near Airport Crossing, Dist. Kachchh, Gandhidham, Meghpar Borichi, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "I recently stayed at the Quality Inn Hotel during my travelling trip, and I must say that the level of service I received was exceptional. From check-in to check-out, the staff at the hotel went above and beyond to ensure that my stay was comfortable and enjoyable.\n\nFirst and foremost, the front desk staff ( MARTHA) was welcoming and friendly. They greeted me with a smile and provided all the information I needed for my stay, including details about the hotel amenities and nearby attractions. They were also prompt in addressing any questions or requests I had, making me feel valued as a guest.\n\nThe room I stayed in was clean and well-maintained. The housekeeping staff did an excellent job of keeping the room tidy and replenishing the supplies such as towels and toiletries. The bed was comfortable, and the room had all the essential amenities, including a mini refrigerator  which made my stay convenient and hassle-free.\n\nOne aspect of the hotel service that stood out was the complimentary breakfast. The breakfast spread was impressive, with a variety of options such as eggs, bacon, sausage, fresh fruits, cereals, pastries, and more. The food was fresh and delicious, and the breakfast area was kept clean and well-stocked. It was a great way to start my day on a positive note.\n\nThe overall service was attentive and responsive, making my stay stress-free and comfortable.\n\nThe location of the hotel was also convenient, with easy access to nearby restaurants, shopping centers, and major highways. The parking facilities were ample and well-lit, providing a sense of security.\n\nIn conclusion, I had a fantastic experience with the Quality Inn Hotel service. The staff was friendly, the rooms were clean and well-equipped, the breakfast was delicious, and the additional amenities were convenient. The prompt and efficient response to any issues or concerns was commendable, and the hotel's location was convenient. I would highly recommend the Quality Inn Hotel to anyone looking for a comfortable and enjoyable stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "They should really work on service for parking area.. even if they hv kept men for it they aren't jus aware what to do n how to do",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The overall ambience and service is superb!! The way they treat the guest is what makes this property completely different from others.. i even got married at this place and trust me guys the hospitality was amazing!!! I always have a wonderful time whenever I visit this place!!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The most serene, beautifully green and spacious place to stay n enjoy your vacation. Their courteous staff makes your stay more pleasant. The vast green lawns can accommodate ten thousand people ! Their own bakery & dairy is excellent ! Worth staying there always 👍",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We always opt for this hotel as it's pet friendly. My dog enjoys the stay here as he can freely move around without his belt in the big gardens. The staff is professional and we enjoyed our stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Lords Eco Inn, Gandhidham",
      "rating": [
        4
      ],
      "address": [
        "Near Madan Singh Chowk, beside Vinay Cinema, Ward 2A, Adipur, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Nice service Executive....\n\nWorst experience ever from Lords. Booked by brand name, but experience was worst, smelling bad in bathroom, not maintained rooms and bathroom, after all this morning breakfast and service added experience even bad, Taste is not good, for tea and bread butter need to give reminder multiple time by seating in restorant then after almost 15 it come... *Do not book by this brand name in Gandhidham.* Good is only location, near to Adipur bus stand.\nName:- Shiwani jii\nName :- All staff of hotel 🏨 very good and Nice behaviour all staff...",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Old property. Not as per other Lords property. TV - WiFi not working properly. No hot water.  All bathroom flooded with leak water. No parking facility. No Buffett breakfast even after pay for it. Not recommended for office travel stay.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms are  best 👌 place is good 👍\nService is not upto satisfied 😒\nToilet area smells badly..",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Room cleaning good but washroom issue and breakfast service is not good no testy breakfast and very delay service provide",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "poor service.... No proper hot water suply...... Bathroom not veey clean....high priced for the quality",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Happy Stay",
      "rating": [
        3.7
      ],
      "address": [
        "Plot No : 285 , Ward 12/B, near Gandhi Market, Main Bazaar, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "Worst experience ever, No hot water availability. When the room opens it has a bad smell. They don't  have an easy access charging point for the phone. Even i want something i go to a reception point but no one is there i literally wait for half an hour but no one has come. It was a very disappointing experience.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Rooms are not clean at all.\nStaffs are not polite they don’t even provide toilet and soaps in the washroom.\nPeople only come here because of the cheapest rate just it.\nDon’t expect hospitality here.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Pleasant stay, hotel staff very friendly, room was ok clean. We had a good sleep. No privat parking space. Great budget option! We will come again.",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "I would say it's totally value for money hotel. Rooms are nice and Rates are very reasonable compare to other hotel. It's located in main market so everything is easy available at walkable distance. Totally recommended and Amazing service and mesmerising food. Best rooms at reasonable prices. They give such personal attention and the owner itself calls to ask for reviews and staff is well trained and polite. Loved the ambiance. Will surely visit again",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        },
        {
          "text": "Worth for money. Amazing service and mesmerising food. Best rooms at reasonable prices. They give such personal attention and the owner itself calls to ask for reviews and staff is well trained and polite. Loved the ambiance. Will surely visit again",
          "languageCode": "en",
          "rating": [
            3.7
          ]
        }
      ]
    },
    {
      "name": "Hotel Shivam",
      "rating": [
        3.8
      ],
      "address": [
        "Plot No.173,--A, near Navneet GAS HP, Sector 1, Gandhidham, Gujarat 370201, India"
      ],
      "reviews": [
        {
          "text": "If you're looking for a clean and comfortable place to stay, you might want to avoid the establishment in question. Based on the keywords provided, it seems that their housekeeping service leaves much to be desired.\n\nThe poor service is evident in the unwashed bedsheets, old mattress, and dirty bedsheet and pillow. These are not only unhygienic but also indicate a lack of attention to detail and a disregard for customer satisfaction.\n\nIt's disheartening to come across such an establishment that fails to meet basic cleanliness standards. It's safe to say that this is not the ideal place for anyone seeking a pleasant and comfortable stay.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Rooms are good but location is not good. They provide Non veg food.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Amazing hotel. Friendly staff. Great rooms. One of the best hotels in town.\nThe only problem are the mosquitoes. They should introduce a program of mosquito control:\ndrying out the water;\nfilling up the ponds with earth so there will be no standing water where mosquitos can breed. Installing mosquito nets at the windows would help. Too many mosquitos in the rooms.\nBring your own mosquitonet to avoid getting malaria or dengue.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "Staff is not good manager's behaviour is not good",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        },
        {
          "text": "I stay here for 2 days 3 nights. It’s was good experience in affordable price.\n\nLocation wise it’s at good location near highway and station.\n\nStaff is very cooperative and decent. I love the tea here :)\n\nPersonal words: If you are near this hotel and want some good sleep, so you can stay here.",
          "languageCode": "en",
          "rating": [
            3.8
          ]
        }
      ]
    }
  ]
}