{
  "places_with_reviews": [
    {
      "name": "The Fern Residency, Aurangabad",
      "rating": [
        4.1
      ],
      "address": [
        "Jalgaon Rd, Sector C/3, Town Centre, Town Center, Cidco, Aurangabad, Maharashtra 431003, India"
      ],
      "reviews": [
        {
          "text": "Excellent stay at Fern\nThey gave us an upgrade and we were really happy about that. Location is great. Food taste and quality is nice.\nStaff is warm and welcoming.\n\nFew suggestions :\nNeed to do something about carpet smell and get slightly lean pillows (the ones we used were too huge) 😊",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Close to the airport.\n\nRooms are comfortable but not luxury.\n\nI got ill after eating the buffet, I ate from the non-veg section. The hotel was able to get a doctor to see me in the room, however, even with a Hindi/English speaker present, the doctor ignored some key symptoms, which resulted In me suffering from gastro for longer than necessary.\n\nAll in all, just an OK stay",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The hotel wasn't very clean. To start the toilets on the lobby area smelt terrible! Where is the ventilation? There was a horrible smell in my brothers room where they had to leave their doors open to get the bad smell out before closing their doors again.  Bathroom tiles had mould growing on them, beds and pillows were good. The carpets on the corridor were not vacuumed and swimming pool area was not properly kept. We dinned in the restaurant twice for dinner and I must say, the food was good. Overall the stay was just ok, I saw some newer hotels around the area and wished I had done a bit more research before booking,  definitely not 4 star standards.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of the best hotels in Aurangabad. So neat and clean it is. Staff is very helpful and friendly. Hotel ambience is very good and authentic. Everything you need in a international level hotel you will get. So basically it is an international level hotel. I tried first time in one of the Fern Hotels. Definitely trying other stays as well",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Seems to be a common pick from most tourists visiting aurangabad for Ajanta/Ellora. Rooms are good, clean and AC is great! Room has a TV, small fridge, Kettle and complimentary coffee, tea satchets.\nHas ample parking and even offers cabs for tours, if you call ahead\nThe breakfast & dinner buffets are good, Al-a-cart menu is attractive as well.\nValue for money.\nWould recommend.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Vivanta Aurangabad, Maharashtra",
      "rating": [
        4.5
      ],
      "address": [
        "8-N-12, Dr Rafiq Zakaria Marg, Rauza Bagh, N 2, Cidco, Aurangabad, Maharashtra 431003, India"
      ],
      "reviews": [
        {
          "text": "stayed in this hotel with my family on holiday. It is a wonderful hotel with beautiful ambience, excellent facilities and wonderful services. The hotel building is in a beautiful Moghul palace style with well-pointed lush gardens and in-the-garden dinning setting for guests. All rooms have beautiful views to the garden or the swimming pool.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The hotel lives up to the name of the Taj brand! The service is top notch, they make the guest feel very comfortable. They even accommodated our request for room upgrade and attended to our request for extra bedding very late night as well. We had dinner in the garden area, which was good but can be improved. I’m sure this is a hot property in tourist season as it was decently expensive on the weekend as well. I’m sure this is the best hotel to stay in Aurangabad.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Great place like any other Taj. Food is the best. Lots of green.. lots of birds...overall great place to stay and chill... You can enjoy a game of. Croquet here ..that's the surprise element here.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Stayed here with parents. Had an amazing experience. The staff went beyond to ensure we had a nice stay and felt special. Would definitely recommend. Food was good too, ate at the open air restaurant on the premises.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We stayed for 2 nights and the experience was amazing. The rooms, the decor and the property is very nice.\nThe service was top notch. Right from check-in to check-out was a good experience. The staff is very friendly and are always ready to go out of their way to help you.\nSpecial shoutout to Shishupal and Sheetal from Latitude. Sunday morning was very busy, however, they were courteous and were guiding the guests for seating arrangements.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Welcomhotel By ITC Hotels, Rama International, Aurangabad-Premium business & leisure hotel| Near Ajanta Ellora Caves",
      "rating": [
        4.5
      ],
      "address": [
        "Chilkalthana, R-3, Jalna Road, Town Center, Nyay Nagar, Aurangabad, Maharashtra 431003, India"
      ],
      "reviews": [
        {
          "text": "The service was second to none, after moving from one hotel to this Rama.\n\nThis hotel features great attention to detail and is everything you could need while recovering or preparing to see the surrounding sites of Aurangabad.\n\nThe food is some of the best I've eaten on this trip, all served with smiles and idle chit chat if you do so enjoy it.\n\nI look forward to staying here again when I'm inevitably back to see more of the region.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "We loved our stay here! The staff were all fantastic and so helpful with anything we needed. The rooms were modern, clean, and very comfortable.\n\nWe had a very hard time getting a hold of someone on the phone to verify details about our reservation, but once we arrived everything was wonderful. I wish we were in town and able to stay for more nights.\n\nFor those traveling with babies — they were able to provide a crib for me in the room.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "I recently stayed at this ITC hotel near the famous caves and had a wonderful experience. The restaurant staff were fantastic, providing excellent service and delicious meals throughout my stay, especially the chefs, who would pander to my off menu choices.\n\nThe hotel's proximity to the caves made it a convenient choice for exploring the area. My only recommendation is to book early online, as walk-in rates can be significantly higher. Overall, I highly recommend this hotel for anyone visiting the area.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Excellent hotel by ITC hotels. Located on Jalna road with easy approach to airport. Service is very professional and upto the international standards. Rooms and bathrooms are on smaller side but well maintained.\nAlso has swimming pool and spa and gym. However when I visited spa was not operational.\nHas three banquet halls and lawn ideal for conference and marriage ceremony.\nFood quality is good.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Was here with my American friend. While dropping him to the hotel, I had my dog (a beagle) with me in the car. They stopped us on the gate and said dogs not allowed. I told them my dog won't get out of the car, and that we are there for just 30 seconds, just to drop my friend, we wont even get out of the car.\nThey refused, and my American friend had to walk from the main gate to the hotel.\nSo surely not an international standard hotel. Still stuck with 18th century rules.\nLeft a bad taste. Not recommending any of my future friends.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Lemon Tree Hotel, Aurangabad",
      "rating": [
        4.2
      ],
      "address": [
        "R 7/2, Airport Rd, CIDCO Cannought, Chilkalthana, Aurangabad, Maharashtra 431210, India"
      ],
      "reviews": [
        {
          "text": "Fabulous property with excellent rooms, service and delicious food. The employees are very helpful and co-operative. The ambience is very soothing and perfect room especially the ones facing the swimming pool. I stayed in the room on the ground floor which opens up in front of the swimming pool and has a perfect sit out area attached to ur room which was just too good.\nLoved it here. Can't wait to visit again.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I visited the hotel on 30Dec2023 with my family and stayed for 1 day. My experience was really nice. The staff followed up before my visit and was friendly throughout my stay.\nThey even packed small amount of food for my 2 year old daughter to eat later in the day as she was not eating anything during breakfast time.\n\nI am thankful for their nice and courteous gesture. I would recommend this hotel to everyone especially family with small kids.\n\nThank you lemon tree",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "A very good experience. Well placed rooms with all essential amenities. A big swimming pool. Working gym. Well laid lawns.  I highly recommend this place.\nThe restaurant surely needs improvement. The F&B staff is a bit casual. Food is at least 20 per cent overpriced. Limited menu options. Overall restaurant experience is fine.\nThe location of the hotel is perfect. Just behind the hotel the whole area is full of restaurants, fast food joints and cafes.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent Stay - Friendly Staff and Great Service!\nI had a wonderful stay at the Lemon Tree Hotel Aurangabad. The staff was incredibly cooperative and helpful throughout my visit. They even went the extra mile by packing breakfast for me and my family when we requested it before heading out to a temple early in the morning.\n\nThe hotel itself was very clean and had a great overall vibe. I especially appreciated the efforts of Tejas and Chandrakant, who  accommodated our request for a late checkout even though we informed them at the last minute.\n\nHighly recommend this hotel for anyone visiting Aurangabad!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Excellent property. Gives a feeling of a resort. We were on a vacation when we stayed here. Kids had a great time - They cycled, played badminton, table tennis and had a good time by the poolside which has hammocks.\n\nThe staff is courteous and accommodative. When we came to the hotel, the hotel was fully booked so the general manager, Chandra, arranged a nearby hotel for us on the first day of our stay. We came back in for the second day and enjoyed the day here. The staff went extra mile to make our stay pleasant.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "VITS Aurangabad",
      "rating": [
        3.9
      ],
      "address": [
        "Railway Station Rd, Vedant Nagar, Aurangabad, Maharashtra 431005, India"
      ],
      "reviews": [
        {
          "text": "BIG NO!!!!\n\nThey have virtually no service. Everything takes forever to be done. Staff is rude and uncultured. The rooms have leaking was basins and broken drawers that refuse to close. Requests to change the room are met with you have to pay extra for it. Shady women can be seen in the hotel. Don't book here.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Not a brand new property. So it has ita ups and downs but nothing to complain really. Great location.. you can walk out and enjoy food at some really good restaurants. There is a chai shop just in the opposite corner.. best chai .. Creamy and tasty. The swimming pool is a bit of a disappointment as it is open for coaching and hence way too crowded. The cab operators they have tied up are ok. Cabs are not bad bit again not very new fleet of cars other than that friendly and accomodative. Budget and luxury balanced ..",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Outstanding hospitality! The staff went above and beyond to make our stay memorable. The room was spacious and luxurious, with stunning views. The location was perfect for exploring the city. Highly recommended!",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "BIG NO!\n\nOur stay was nightmare. The AC was not working properly. Even they don't have ceiling fan in rooms. We were awake whole night. Couldn't sleep. Also central light control device was beeping every 5-10 mins. Was horrible experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's very nice hotel and friendly environment from all staff. food is good and service is also very good we visit again.... Thanks Will visit again in future. Rooms are good and clean overall support staff was nice.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Ambassador Ajanta Hotel, Aurangabad",
      "rating": [
        4.2
      ],
      "address": [
        "R, 4, Jalna Road, opp. High Court, Town Center, Cidco, Aurangabad, Maharashtra 431003, India"
      ],
      "reviews": [
        {
          "text": "We regularly organize events at this hotel, and I am delighted to share my positive experience.\nThe staff's approach is very professional, ensuring seamless coordination from planning to execution. The available event spaces are versatile, well-equipped, and impeccably maintained.  The hotel's attention to detail, responsiveness, and commitment to customer satisfaction make it an excellent choice for any event manager. I highly recommend this venue for its outstanding service and facilities.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "It is a very nice hotel in the middle of Sambhajinagar city with lots of greenery and large space. From check in to check out the whole experience was great. Your service staff is very polite, courteous and attentive.The room was clean and spacious. Morning breakfast was also very delicious. Overall I felt very safe and comfortable here. Highly recommended.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "One of the best place to stay. Location is convenient. Hotel has lots of trees and a nice jogging trail. Food is average. Book online thru third party websites to get best deals. Take care of personal belongings in room. Hotel hosts large events so expect huge outside crowd in common areas.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The staff is very co-operative (especially on reception desk Shreyas and house keeping Sanjay). Entire stay is comfortable and to add a cherry on it, a room upgrade was given by the hotel. This two persons name I remembered as they not only cooperated during the stay only but also after the stay, as I forgot one of my parcel in the hotel room which was couriered at my residence by them and also they gave extra yard to search for it.\n\nApart from this also loved the rooms, views, and facilities provided, being in city centre gives an added advantage to enjoy the city also.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Over 50 year property and they dont make any properties like this any more. One which has large lawns, play area, a porch, swimming pool and very large rooms.\n\nThe service was with a smile, the rooms were big but the furniture is dated and so are the fittings. You can see the door locks being loose, fitting falling apart in the washroom and more.\n\nHowever, we enjoyed our stay here. Clean room, well priced, service with a smile and prompt attention to needs. Strangely they did not have a valet available when we came.\n\nThe overall hotel is very old style.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Ginger Aurangabad",
      "rating": [
        4
      ],
      "address": [
        "Railway Station Rd, Venkateshwar Colony, Bansilal Nagar, New Usmanpura, Aurangabad, Maharashtra 431005, India"
      ],
      "reviews": [
        {
          "text": "\"Great value for money! The hotel offered comfortable accommodations and friendly service. While the room was slightly small, it was clean and well-maintained. The breakfast buffet was delicious, and the location was convenient for both business and leisure travelers.\"",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The hotel was an okay experience, but not exceptional. While the location was convenient and the staff were friendly, the overall cleanliness and room amenities were lacking. Additionally, the dining options were limited and the ambiance could use improvement. Overall, it served its purpose as a place to stay, but there is room for improvement to make it a more enjoyable stay.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Overall good experience. The rooms are clean with clean bedspreads.\nThe toilets are clean and hygienic.\nThe staff is courteous and always ready to help.\nThe reception staff helped us to get cabs for Ajanta and Ellora.\nThe breakfast options are there but taste should be made better.\nIt has a restaurant for dinner or lunch but not that great.\nAmenities like swimming pool isn't available",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Really good and nice experience. We visit there for two night awsome feel and the service also customer friendly. Food also very creative and they have options for breakfast, lunch, and dinner. The ambience also very impressive. Must try this all. I felt 5 star for this.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "First day.. no wifi..\nSecond day.. no hot water and non smoking room filled with terrible smell of smoke..\nThird day.. bathroom clogged..\nFourth day.. again no hot water..\n\nAfter a full day of work, u come to a place which is more of a nuisance..\n\nCall them n they will send someone after 2 hrs..\n\nI'm stuck here because I paid for 6 nights in advance.. a decision I regret every moment of my stay here..\n\nNo view to talk of.. restaurant is literally like they somehow cramped few tables and chairs there..\nNot much variety in breakfast..\n\nService is okay.. food is mediocre.. not worth the price you pay at all..\n\nExpected better from a supposed 3 star hotel.. will never return or recommend to anyone.\n\nIra by Orchid is way better in much lesser price..",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Amarpreet, Aurangabad - AM Hotel Kollection",
      "rating": [
        3.9
      ],
      "address": [
        "Amarpreet Chowk, Jalna Road, Rokda Hanuman Colony, Mondha, Aurangabad, Maharashtra 431001, India"
      ],
      "reviews": [
        {
          "text": "My experience here for two nights was actually quite good. The rooms are spacious and well maintained.\nThe staff are quite helpful. The location is in a busy area but easily accessible. The breakfast spread is quite good too. For its price it is recommended.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "A nice hotel to stay in with your family. Rooms are clean and comfortable. Staff serving the food at the breakfast and dinner were very courteous. Special thanks to Kavita she took our order and served us the food. She was very polite and accommodating. But room service is slow. We ordered water bottle but it took some time for them to deliver it to the room. During checkout as well they took too long to get the luggage from the room to the lobby. Overall I am satisfied.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Over the period this hotel is losing its glory ,I have stayed here 5 years back ,it was totally diff than what it is now.\nI was charged 5900/- per night for room.\n1. Bathroom was with bathtub ,which had fittings which never worked because of low water pressure. Same way hand shower and main shower too was not having enough pressure. Bathroom water  was not getting flush out from drain pipe.Inspite of reminders to front desk no one turned out for clearing it.\n2. Room is having old furniture without floor mattress which is not expected when your are charged 5900/- per night .\n3.Food taste is good and room service was quite fast .\nOverall it was okay stay ,but lot of improvements are required .",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The food is really awsome and delicious. The rooms are clean and beautiful as shown in the pics. House keeping Staff needs to respond timely. We had to continuously follow up many times for small things. Apart from this issue, it's really good hotel to stay with family.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I recently had the pleasure of staying and Working at this luxurious hotel in Aurangabad and I must say, it exceeded all my expectations. The Hotel is simply breathtaking, creating an impressive entrance that sets the tone for any guest. The convenience of being just an 15 minute from Railway station and also from the airport was a huge plus.\nStaff was very polite and helpful for every cause.\nSo as the delicious food served.\nOverall have enjoyed it.\nI highly recommend this establishment for a memorable and enjoyable stay as well as Events.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "7 Apple Hotel - Aurangabad",
      "rating": [
        4
      ],
      "address": [
        "Next to D-Mart, Hudco Corner,, Beside Taj Vivanta, CIDCO, Rauza Baug, N 2, N 12, Aurangabad, Maharashtra 431003, India"
      ],
      "reviews": [
        {
          "text": "We stayed here for 3 nights. 2 adults & 1 kid (1 yr old). Room size is small-medium with queen size bed, bed side tables are small (1x1 ft approx). I thought the room is very small as given in the other reviews but the room size & cleanliness is decent considering the price. Attached bathroom was also neat & clean with 24x7 hot water supply. Room was cleaned everyday. Linen provided was of good quality and towels & garbage bags were changed daily.\nDaily breakfast is provided at the restaurant no complaints for food quality. Buffet dinner is also good , my suggestion is to prebook it with the room else you’ll find it costly.\nIf you’re getting the room for around 2500 for 2 persons with breakfast then it is value for money.\nElectric kettle is not available in the room, there is a common tea/coffee station available on 2nd floor.\nMy suggestion for hotel management is to fix a wall clock inside the room.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I recently stayed at the Hotel 7 Apple in Aurangabad city, and it was a wonderful experience. The hotel staff were incredibly friendly and helpful, and they made sure that my stay was comfortable and enjoyable.\nThe rooms were well maintained  and well-appointed, with beautiful views of the city skyline. The beds were comfortable, and the linens were high-quality. Attached bathroom was provided, with plush towels.\nThe hotel also offers a restaurant where a variety of dishes are served\nOne of the best features of the hotel was its location. It was nearby many attractions, including historical monuments and shopping areas.\nOverall, I highly recommend this hotel to anyone looking for a comfortable, convenient, and enjoyable stay in Aurangabad. I really loved their motto",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "I recently stayed at Hotel 7 Apple. The staff was polite, rooms were a bit smaller but well-maintained. The charges were reasonable, and I appreciated the cleanliness. However, I noticed toothpaste was not provided in the bathroom. On the bright side, the food at Apptite was excellent, and the staff there were also very polite. Overall, a decent experience with some minor points to consider.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It was a wonderful stay in 7Apple Hotel. I loved the courtesy of the staff. Front Line Manager brought breakfast even after we had left the hotel. We are thankful for this gesture. Also, The Manager from Delhi was very  polite and helpful. The Laundary services could be improved. And I suggest that the plastic water bottle should be replaced with RO water in portable\n\nSay No to Plastic, Yes to Environment.\n\nThank you so much!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "It wasn't  a good experience..Rooms are very very small in size.. also windows are very small and horizontal and it doesn't seem like window it feels like you are locked up in some room. Lights in room were not adequate and also few big lights were not in working condition, we had to call reception and after some time they sent electrician and it was finally not fixed even after multiple visits. Same issue with Tv subscription though it was fixed after few visits from staff. In all this what we got was continuous calls to reception and continued disturbance due to these things. Bathroom are also way too small and not so clean. Check out was also very poorly managed and staff head at reception is very rude.",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Hotel Atithi",
      "rating": [
        4
      ],
      "address": [
        "P, 3, Jalna Road, Seven Hills, Town Center, Cidco, Aurangabad, Maharashtra 431001, India"
      ],
      "reviews": [
        {
          "text": "Location is good and the rooms are decent enough. Breakfast is same almost all days except 1 item being changed. Rooms are clean but can be maintained better. The services are a bit slow but not something to be complained about. Rooftop restaurant is generally full in the evening and the food is quite good. Overall a hotel that can be recommended for all.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Had an amazing time. The atmosphere and service were great. Definitely a must do if you are looking for a good time.Beautiful downtown hotel with nice roof top bar. Rooms have historic feel .Staff is wonderful and accommodating providing upgrades when available.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "One of the finest dining hotels and restaurants in budget I have visited, it's a 3 star hotel although rooms are clean and elegant. Service is good, food is tasteful and staff is helpful. It has a swimming pool with other amenities like an elegant rooftop dining option.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The staff were incredibly prompt and attentive, always ready to assist with any requests. Their efficiency truly enhanced my overall enjoyment of the hotel. Thank you for providing such excellent service!\"",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Attended marriage, very easy to locate, banquets are spacious and nicely air-conditioned, food is good and staff is cooperative. Parking facility is slightly congested. Turnoff is foul smell at the entrance of the banquet due to washrooms",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    }
  ]
}