{
  "places_with_reviews": [
    {
      "name": "Grand Serenaa Hotel & Resorts",
      "rating": [
        4
      ],
      "address": [
        "Near Auroville, 164/1, Puducherry - Tindivanam Road, Thiruchitrambalam, Puducherry, Tamil Nadu 605111, India"
      ],
      "reviews": [
        {
          "text": "Certainly! Here's a sample review:\n\n---\n\n**Great Hotel with Exceptional Staff**\n\nI recently stayed at Grand Serenaa and had a fantastic experience. From the moment I arrived, the staff went above and beyond to ensure my comfort and satisfaction.\n\nThe hotel itself was clean, modern, and well-maintained. My room was spacious and beautifully decorated, with all the amenities I needed for a comfortable stay.\n\nWhat truly set this hotel apart, however, was the outstanding service provided by the staff. From the front desk to the housekeeping team, everyone I encountered was friendly, professional, and attentive to my needs. They were always ready to assist with any questions or requests I had, and their genuine hospitality made me feel welcome throughout my stay.\n\nAdditionally, the hotel's location was convenient for exploring the area, with easy access to attractions, restaurants, and transportation options.\n\nOverall, I highly recommend Grand Serenaa  to anyone looking for a top-notch hotel experience with exceptional service. I will definitely be returning on my next visit to the area.\n\n---\n\nFeel free to customize this review with specific details about the hotel and staff you're reviewing!",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Stayed there for 2 days. Rooms were clean and well maintained. Breakfast items were changing and had many options. English breakfast available. Swimming pool were nicely maintained. Have play area for kids as well. Since it is is in Auroville, naturally beach is faraway.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms are very good, spacious rooms, very neat and very clean, all amenities were put properly. Morning breakfast was out standing in restaurant the taste was very good. And the front desk staff Miss.Varsha was very friendly and very polite. Thanks to Grand Serenaa team for memorable stay we will come back again.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "\"An unforgettable stay at this grand serenaahotel! From the moment I stepped through the doors, I was greeted with warmth and hospitality that set the tone for the entire visit. The rooms were impeccably clean and luxurious, providing the perfect sanctuary after a long day of exploring. The amenities surpassed my expectations, from the stunning garden space & pool to the world-class dining options onsite. The staff went above and beyond to ensure every need was met, offering personalized service that truly made me feel like a valued guest. The location was unbeatable, offering easy access to all the attractions and landmarks. I cannot recommend this hotel enough for anyone looking for a truly exceptional experience. Five stars all around!\"",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Very good experience.  Activity room can be improved a little. Swimming pool was awesome. Food was amazing.\n\nOverall satisfying experience",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Mango Hill Pondicherry",
      "rating": [
        4.1
      ],
      "address": [
        "Old, Auroville Rd, Bommayapalayam, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "Rooms were little old and needs renovation. But rest all other things were perfect including staff and service. Food was awesome. Swimming pool was major attraction. Really enjoyed the stay",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "We were stayed there for couple of days. We are really got a best service over there. The staffs are really courteous. When we ordered something from restaurant and room service they are served professional and all well trained. The food was really tasty. Very quick service from restaurant and room service. Room was clean and neat.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Resort was so good with lot of mango trees surrounded and an good Ambience. Swimming pool was so clean and tidy and it was easy access to all the rooms. Recommend for family to stay and enjoy this peaceful resort",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The room (French Classic) was  rustic and nice. Parking could have been better, the car was buried in a heap of leaves. The pool is the highlight of the property and compels you to take a dip. Room service food was good, but they ought to improve on the breakfast. Overall a good experience.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I recently had the pleasure of staying at Mango Hill Resort for three nights, and my experience was nothing short of amazing. The resort boasts a unique approach to room design, setting it apart from the usual accommodations. The attention to detail and creativity in the room model added an extra layer of enjoyment to my stay.\n\nOne highlight of my experience was the culinary offerings at Mango Hill Resort. The food was not only delicious but also featured a diverse range of great options. Each meal felt like a culinary journey, and I was impressed by the quality and presentation of the dishes. The culinary team at the resort truly knows how to elevate the dining experience.\n\nEqually commendable was the warmth and welcoming nature of the staff. From the moment I arrived until my departure, the staff members went above and beyond to ensure a comfortable and enjoyable stay. Their friendliness and attentiveness added a personal touch to the overall experience, making me feel truly valued as a guest.\n\nIn summary, my stay at Mango Hill Resort was a delightful and memorable experience. The unique room design, delectable food options, and the exceptional hospitality of the staff contributed to an overall positive impression. I would highly recommend Mango Hill Resort to anyone seeking a refreshing and enjoyable getaway.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Greek Bay",
      "rating": [
        4.3
      ],
      "address": [
        "117/1A, Auro Beach Rd, Periyamudaliyar Chavadi, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "Nice little place with an awesome breakfast buffet. Rooms are good, with a futon sofa in the ground floor and a bed in the 1st floor (family with children should be little careful since the bed is closer to the railings). Swimming pool is small and can accommodate 10 people at max and edges are a little sharp. Lighting in dining area especially near the three huts needs to be improved.\n\nThe access to this place is very narrow and due to this didn’t feel like going out for dinner or sightseeing.\n\nOverall a good place to stay and take pics and view the sunrise 😊",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "This is more than 5 star. The decor of the room is very nice, very good beach access. Only minor thing is the lane to this place is a bit narrow. I must admit that the staffs here are one of the best in my travel experience across the years. All the people were very courteous. The shefs in the restaurants were very much accommodating. My father was instructing how to make the food for them, and they were even listening to that, and making the food accordingly. The price is also very reasonable, given its room conditions, and access to beach. This place is highly recommended!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Absolutely loved our stay!\nWe arrived very early, and they graciously accommodated us with an early check-in. As two solo female travelers, we felt incredibly safe throughout our stay. The staff went above and beyond to make us feel welcome and comfortable. Rooms were spacious, impeccably clean, and provided a cozy retreat. Overall, an exceptional experience - already planning our next visit!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We had a 3N/4D stay at this resort.\n- A great experience overall.\n- Great Ambience with greenery.\n- The other end of property opens up directly on the beach.\n- Rooms are of decent sizes and clean.\n- Staff is well groomed and well behaved.\n- Food Quality is good.\n- Pool is clean and open throughout the day.\n- Liquor is neither available nor allowed to consume in the premises.\n- More variety of food can be added in the menu.\n- Similarly option can be added in breakfast buffet.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Had an amazing experience at Greek Bay. The vibe of this place truly transports you to Greece. As soon as we entered we were greeted with welcome drinks which was really refreshing. We stayed in their Bay- front suite, which was spacious and well maintained and the view from the balcony was something else. The best part was the access to the Beach with the sound of the waves which is so calming and comforting.The staff there are really courteous and tends to your every need. The food was also really good.\nOverall this property is hands down the best in Pondicherry.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Lamel Cove Beach Resort",
      "rating": [
        4.3
      ],
      "address": [
        "Mariamman Koil St, Periyamudaliyar Chavadi, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "Lamel Cove Beach Resort offers a delightful beachfront experience with access to the shore from 6 AM to 6 PM. The sea view rooms on the first floor provide stunning views. Although the sea can be a bit rough and the sand coarse, the overall experience is enjoyable.\n\nWhile Lamel Cove Beach Resort offers a picturesque beach experience, I wouldn't recommend it for families due to the crowds from nearby shacks and accommodations. We observed some disturbances caused by the neighboring properties, particularly concerning for foreigners and Indian girls.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The view is wonderful although there are many setbacks. There is a sudden stink every 15 minutes and the bathrooms stink. The room is very spacious but there are granules of sand lying here and there. There is a lot of space inside the room but there is not a lot of space in the resort itself. The food is great and I may recommend it for a one night stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Lamel Cove Beach Resort offers a tranquil escape with stunning ocean views. The spacious rooms are clean and comfortable, providing a relaxing stay. The resort's staff is friendly and attentive, ensuring a pleasant experience for guests. The beachfront location allows for easy access to the beautiful sandy beach and crystal-clear waters. Overall, Lamel Cove Beach Resort is a great choice for a peaceful beach getaway.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The right place to have a perfect vacation. Room literally on the beach. Waves were 20 feet away. Pretty much like a private beach in the early morning. Watch sunrise from the comfort of the room balcony overlooking the horizon. Courteous and flexible staff. Wide menu options and great food. Clean and big rooms with big and neat beds. Thanks to the resort staff for making our vacation memorable.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "A fabulous place to holiday, very close to the beach. Resort is well maintained, managed by a very professional set of work force. Food is great at reasonable rates with quick service.\nGreat ambience.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Prince Park Farm House",
      "rating": [
        3.9
      ],
      "address": [
        "New no.. 283, Old, Auroville Rd, Chinna Kottakuppam, Karuvadikuppam, Puducherry, Tamil Nadu 605102, India"
      ],
      "reviews": [
        {
          "text": "Rooms are good. The only concern is no frequent cleaning until vacated. Though the swimming pool is open the management is not willing to operate the motor attached to the pool. Breakfast is good.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Large facility. Well isolated rooms. Beautiful scenery. Calm atmosphere. The water tap was not working and they replaced it soon. Bunk bed was large and a good idea to accommodate more people. But this blocked air flow to the lower bunk in spite of additional fans.   Since it was december we managed.\n\nThe bed was dusty and the bedsheets were not clean. That is the only complaint i have. Otherwise worthy of the cost. Good place for group outing. I think individual rooms/cottages are also available but not sure.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "It's a good deal at a reasonable price.\nWith ample parking space, we could park our car right next to our hut.\nNot very far from hotels and restaurants if you have your own vehicle.\nWe got a feeling of staying in the olden days, staying in the hut.\nSwimming pools are decently maintained.\nFood is typical south Indian.\nThe only issue is lack of wifi, which is available only in select areas near the reception and swimming pool. They said they are working on the same.\nOverall, we enjoyed the stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I had a relaxed vacation at this farm house with my family. I did not care about wifi signal or dth connection. Completely soaked in nature and detoxed myself of these regular tech.\nSwimming pool was well kept and centrally located. We got ample parking near our suit.\nFood was good with breakfast having good no of items.\nIn summary it was worth every penny spent.\nI did not pay 20k per night so i did not expect ultra luxury like 5 star hotels or super expensive resorts",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "I have visited this place more than 3 times and stayed in different room types. Location would be calm and good for enjoying. Rooms were clean all the time and we can park our car outside of our room. This place is beautiful and has well maintained swimming pool for all age groups. This place is safe completely, me and my frds were walking around the place in late night. They have upgraded with food delivery option to room, where the tastes were all good. We ordered for dinner by scanning the QR code pasted in the room. The only issue we faced was with food order due so some issues in the website, hope which will be resolved soon. Morning breakfast had more options and everything tasted good. Overall good and enjoyable experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Poppys Olive de' villa Pondicherry",
      "rating": [
        4.3
      ],
      "address": [
        "142/1C2, Auroville Rd, Auroville, Kuilapalayam, Bommayapalayam, Tamil Nadu 605101, India"
      ],
      "reviews": [
        {
          "text": "We stopped by at Poppys for a nice dinner and we were awed by the amazing customer service and extremely delicious food they offered. Food was so delicious that we ordered more dishes even though we were almost full. Kalai was our server…had a big smile on his face with every interaction we had. Everyone from the entrance gate to table were so so courteous. Highly recommend!!!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good place to stay while in Pondicherry. It's away from the city noise and peaceful. The garden is very well maintained and staff is always ready to help. Breakfast was wholesome and offered something for everyone. The bathroom can be improved as it neither has exhaust nor a wipe to clean the wet floor.\nTip; you will find multiple good restaurants within 10 mins walk to have lunch and dinner.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "My friends and I stayed at Poppys for 3 nights. The room was spacious, clean and well maintained. Meals at the hotel were great too. The resort is located in Auroville so it's a bit of a drive to get to the main Pondicherry tourist attractions, the Auroville Visitor Center is a bit closer though. But it's not too much of an issue if you have your own vehicle or rented scootys. The staff were very hospitable and friendly, would definitely recommend for anyone visiting.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We have been for 1 Night 2 Days at Poppy's Olive de villa. It was a wonderful experience for us. The resort is very well maintained and all the staff are kind and prompt. The pool is very good and very well maintained. We had a great time staying here. It was fantastic while it lasted. I hope to come and stay again in the near future. Thank you.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "The Hotel has a very nice and well maintained property. The pool is big and the staff is very caring (even in low season). They offer good breakfast and board games. The guard at the entrance gate was especially friendly. They also arranged a cab for us to get to the Auroville visitors center.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "The Saravi Resort",
      "rating": [
        4.7
      ],
      "address": [
        "Re Survey No. 193, 8, Anna Nagar Extension, Kottaimedu, Kottakuppam, Puducherry, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "I recently stayed at the HA Hotel for two nights and had a wonderful experience. From the moment I checked in, the staff was welcoming and accommodating. The room was spacious, clean, and well-appointed with modern amenities. The bed was comfortable, ensuring a restful sleep both nights.One thing that stood out to me was the cleanliness of the room and the attention to detail in housekeeping. The bathroom was spotless, and the toiletries provided were of high quality.The hotel's location was also convenient, with easy access to nearby attractions and dining options. Additionally, the complimentary breakfast offered a variety of options to suit different tastes, making it a great start to the day.Overall, my stay at the HA Hotel was enjoyable, and I would highly recommend it to anyone looking for a comfortable and pleasant stay in the area. I look forward to returning in the future.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Wonderful experience in this Resort. It was top class and luxuries. We got it in our budget. We went for Christmas. The staff the food everything was just perfect. The resort is just awesome with the best ambience. There was a swimming pool too. Only suggestion from my end is kindly keep a clothe stand to keep wet clothes for drying. Because for wet clothes water keeps dripping and we cannot hang the clothes in the hanger.  I will definitely visit this place once again.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very good resort in Pondicherry. Villa with personal pool would be an ideal choice.\n\nRooms are big, clean. Service is good. Food offered was decent and tasty.\n\nSerenity beach would be the nearest attraction to this place.\n\nThe property is 900mt from the main road, if you are coming on your own transport, this point wouldn’t be a concern.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "Very clean rooms.  Bright place. Great outdoors.  Cycling, a walk around,  pool, vegetable garden.  Unique shower area.\n10 min drive from places of interest,  own vehicle is (almost) a must.  Good B/F buffet. Very pleasant staff.",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        },
        {
          "text": "\"Staying at Saravi Resort was an absolute delight! The serene ambiance, impeccable service, and breathtaking views made for an unforgettable getaway. From the comfortable accommodations to the delicious dining options, every aspect of our stay exceeded expectations. The resort's attention to detail and commitment to guest satisfaction truly sets it apart. I can't wait to return for another relaxing escape!\"",
          "languageCode": "en",
          "rating": [
            4.7
          ]
        }
      ]
    },
    {
      "name": "White Pearl Residency",
      "rating": [
        4.6
      ],
      "address": [
        "119/15, E.C.R Road, Periya Mudaliyar Chavady, Periyamudhaliyar Chavad, Puducherry, Periyamudaliyar Chavadi, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "Awesome check-in experience.\nNear and clean rooms.\nParking space good enough to accommodate more than 5-6 cars\nGood breakfast.\nOverall a great experience. Will definitely recommend.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Very Clean and neatly maintained rooms. Cooperative and Courteous staf.The food served in the restaurant is very tasty as well.  We loved the pizza prepared at this place. Complimentary Breakfast served by the hotel was nice, too.\nIt's on the main road and easier to spot.  Overall, it was a excellent place to stay with family.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The rooms were very clean.. Had a pleasant stay.. Their wood fired pizza was top notch!  It's bit far from the main city.\n\nCons\nif you don't have a vehicle it would be difficult to travel and beach near the hotel is very dirty...",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "The hotel was maintained top notch with ultra clean and spacious rooms. The staffs were very friendly and helped a lot . The hotel is not very far from the busy city and was just 5-6 kms away and can be easily reached via car or bike . The breakfast was very tasty . Their specialties are the wood fire pizza which was so tasty and for the money you give its very very big and filling . Overall my wife , kid and myself enjoyed the stay and we will definitely recommend this hotel  and i myself will visit again here .",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "I have stayed here with my friend for a couple of night in a Deluxe Suite\n\nThe reason i gave 4 rating\n\n1. Good spacious room\n2. They ask voluntarily when to clean rooms and come and clean which is good\n3. Morning breakfast was decent\n4. A few people in reception were polite\n\nWhy i did not give 5 rating\n\n1. Wifi connection is poor. I've asked a couple of times, restarting router won't fix the issues\n\n2. I have ordered one coffee and i told clearly light coffee but the coffee served was strong and very very bad quality\n\nI hope if these things are taken care of, i will visit again",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    },
    {
      "name": "WoodPacker Hostel",
      "rating": [
        4.5
      ],
      "address": [
        "No: 175/10, Edayanchavadi to T.C.Kootroad Auroville PO vanur, Auroville, Puducherry, Tamil Nadu 605101, India"
      ],
      "reviews": [
        {
          "text": "It was a wonderful stay! The Vibe was awesome. The people who come there are very much like-minded and can be easily jelled along. Anush is doing a great job in conducting events and music sessions and takes care of guests like friends do. Overall a fantastic experience!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Visited there recently, and had an amazing experience. Definitely a best choice to stay in and around auroville. Everyone you meet there is so down to earth. Roof top was the highlight. You can interact with lots of like minded people. The ambiance, the vibe, the hospitality... One should definitely experience.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Great food and coffee at the rooftop cafe! The morning yoga was a great addition. Best way to start your day! They also have some workshops happening here.\nGreat for solo travelers. Friendly and welcoming, with a chilled vibe 👌🏼",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "The place has a friendly host, pretty rooftop and easily accessible to Auroville and other important places. And not to forget 2 cute cats with 2 kittens (Dosa and Chai )always come to get petted by everyone!\nThe food at the rooftop cafe is homely and good! Anuj hosts events at the hostel occasionally too!",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        },
        {
          "text": "Lovely experience at this beautiful hostel!\nThe place is so peaceful and calm, the rooms and dorms are very neat and clean, the people who work here are so amazing, and literally here you can meet people from all around the world, from all aspects of life and hear about their experiences.\nAnd if you're a solo traveler or a small group of friends, this is the place to be in Auroville/ Pondicherry.",
          "languageCode": "en",
          "rating": [
            4.5
          ]
        }
      ]
    },
    {
      "name": "Soorya Beach Resort",
      "rating": [
        3.3
      ],
      "address": [
        "East Coast Road, Auro Beach Rd, Bommayapalayam, Periyamudaliyar Chavadi, Tamil Nadu 605104, India"
      ],
      "reviews": [
        {
          "text": "One of the worst experience staying here. Bad behaviour of tye staff who stays night time.  Needs remodeling of rooms . Bathroom doors don't have handles and locks. Garden area is very good . Pool is also good. Overall cleanliness needed.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "Very very bad experience. Do not get cheated by checking the availability on booking apps like make my trip, and make payment.  The hotel authorities are very cunning.  They don’t entertain booking online through apps, when we reached, there was no accommodation and till now i m fighting for my refund…\n\nTo all the booking apps— ban this hotel from your listing. They are not ethical.  They never consider your case , and do not take responsibility of addressing your concerns",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "The resort boasts comfortable and spacious rooms with breathtaking views of the ocean. Each room is tastefully decorated and equipped with modern amenities to ensure a relaxing stay.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "It is near to the beach but it is not a beach resort since it is not attached the beach. The rooms and whole resort is not maintained well. The rooms are fully noisy with AC machine sound. There is no beach view from the rooms even though they call it as a beach view rooms. And not worth for the price they are charging.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        },
        {
          "text": "⭐\n\nThis hotel boasts a great location with easy beach access, making it a suitable spot for friends. Unfortunately, the experience is marred by consistently poor hygiene in both rooms and toilets. Moreover, the swimming pool is inadequately maintained, detracting from the overall stay quality. Consider alternatives if cleanliness is a priority.",
          "languageCode": "en",
          "rating": [
            3.3
          ]
        }
      ]
    }
  ]
}