{
  "places_with_reviews": [
    {
      "name": "Le Méridien Mahabaleshwar Resort & Spa",
      "rating": [
        4.4
      ],
      "address": [
        "211 / 212, Medha Road, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "ideally would give an overall 4.5 rating .\nGreat location, good vibes with all the trees cover all around (though many may feel claustrophobic as there is no view from rooms except the tree foliage except near the pool side or some other places.) the temperature compared to other parts of Mahabaleshwar is lower dur to tree cover. the place does have a nostalgic feel. food platter was reasonably good though the fruits weren't so great. Food taste wise was so-so and  not so great. serving water in glass bottles was a great thing. they have water saving devices though water conservation isn't fully optimised as water flow on taps and health faucets was on higher side and  there are good technologies available as I am aware of that could help save more water and electricity. yet overall they have taken good measures for being a green hotel as I see. service was very good . staff was courteous and helpful. rooms were large and decor was nice though it felt a slightly little claustrophobic. for elderly who cant walk or climb stairs it may be difficult though buggies are available easily at a call with some waiting time. The sports room was quite classy and large. we enjoyed the Table tennis and pool a lot. the infinity pool on roof top was good and it is covered so makes it convenient to swim in afternoons too without worrying about the sun overhead. in fact the best view is from this area.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The place is beautiful. Located in the middle of a forest with extensive trees all around. Really happy with the service. Staff is quite friendly and helpful. We had a baby with us yet doing stuff was not difficult at all. Internal transportation requires buggy service but walking around the campus is fun as well.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "We arrived here for a overnight stay, the location was easy to find. We were greeted well upon arrival and taken to our rooms too. I didnt like the idea of my family living in 2 rooms and we were constantly getting locked out. We also had to keep calling the desk staff to send new keys for the rooms.\nThe resort is lovely and spread out nicely. There is a lot to do at the resort with kids. The service at dinner was very slow. I am not sure why but we were kept on wait to sign the cheques. (At this point our server was unorganized)I believe at this scale this should not happen and the restaurant was not even crowded. I hope our experience next time is not the same.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "It is a recently developed property of over 27 acres, major of it is still maintained as a forest. The resort organizes its own forest trail and plantation programmes for its guest. There is a lot to do within the resort itself. The food is excellent. I wished to mention about some team members but it would then be demeaning others who remained behind the curtain but ensured a pleasant stay for us.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Superb Hotel within 27 acres of forest land. Full of trees and greeneries.\n\nThe breakfast and dinner are superb. We tried dinner at 3 different restaurants and all were very good. The one called Woods gives you a jungle experience. Superb pan-asian food.\n\nIt has a nice swimming pool. A guided walk across in the jungle is worth experiencing.\n\nThe entire property is very relaxing with first rated services.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Courtyard by Marriott Mahabaleshwar",
      "rating": [
        4.4
      ],
      "address": [
        "19/B, Metgutad, Panchgani - Mahabaleshwar Rd, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "The best thing about the property is the Services offered by the staff. We had gone with our 8 month daughter and the chef team took good care of her needs. That made the entire stay enjoyable and we didn't have to worry about the food for her. The garden view from the room is beautiful too.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The hotel has beautiful views all around. The different areas like Quarter Deck, pool area, Berry Library restaurant, etc. are great for chilling and relaxing away from the big city hustle. The food is very good, service is outstanding everywhere on the property and they certianly go above and beyond to make your stay comfortable and the experience enjoyable. They also have kids activities and a play/game room which our four year old son loved. The rooms could have been better. The bathroom fixtures and all plugs in the rooms are not well secured and falling off. Otherwise, the staff, service and food is excellent.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "overall a great experience. the rooms in the villas we got were too beautiful, spacious. thought found a few dumb things like the seat cover (see photo) smaller than toilet rim (bad hygiene) no place to hang the hand towels though they have kept tissues (not at all a eco friendly place in contrast to their sister concern le Meridien in Mahabaleshwar); no towel/ clothes rack or stand in shower area etc.\nThis hotel probably has the best location in Mahabaleshwar overlooking a valley as well as a mountain range beyond it. The winding roads going up and down in resort give a wow effect.\nthe food taste was ok on first day but then they improved it a lot. The staff of course is careless about jain food and they ended up giving non jain food on an occasion. staff is courteous and good. though in service found it a bit slow and reluctant when it came to asking for filtered water in a glass bottle instead of plastic bottles which has become a bad habit with most hotels including this. swimming pool is par excellence in view, cleanliness, size and location. changing room near the swimming pool was a bit smelly and again no rack or even a hook in the shower area. no place to hang even the towel inside forget about the clothes. funnily only hot water came in this shower area.\nsports room was congested and not upto the mark in decor.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a very relaxing and enjoyable stay at Courtyard Marriott. The friendly and helpful staff was a key highlight of the trip. Varied activities such as cooking classes for kids, juggling performance, etc kept the kids engaged and happy. Would love to visit again and will highly recommend this place.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Location and rooms are good. Service is not at the par with other Marriott hotels I visited. Request for removing extra bed from the room, was ignored by the staff. Had to call 3 times just to clear plates from the room. Bill copy was not given during checkout even after waiting for more than 20 minutes, had to call them everyday for 5 days to receive bill copy. On 5th day finally received the bill copy. Thanks for sending it🙏",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Saj On The Mountain by Club Mahindra",
      "rating": [
        4.1
      ],
      "address": [
        "Metgutad Village, Panchgani Mahabaleshwar Road, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "Despite being a small resort the manager and the team make sure that we enjoy every day spent there. They arrange different activities and the staff is so good. We enjoyed all the days spent in the resort. Location wise it's centrally placed. All sightseeing is close by within a 10 km radius.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Fantastic resort. Good location.   Ideal for a relaxing holiday. Good 10 stars.  However, however…. Rooms need maintenance- desperately!!  Mahindra pls look into maintenance of all your resort rooms   We’ll enjoy a lot more!!",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Excellent property! Courteous staff! Kid friendly!\nUnwind cafe is very good special mention to Jyotsna! Kids really enjoyed cup cake activity. Thanks a lot",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Food was great, hospitality and activities arrangement was very nice, Joshna conducted the workshops very well\nStaff is courteous. The maintenance of the room could have been better and housekeeping service was not upto the mark\nOverall a very pleasant experience and we had a good time.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Activities have been very interesting. Food is delicious and the staff very caring  specially ms Joshna she is soo, cooperative , friendly, extending desired help all through the stay.Excellent service, provided. Location of the resort picturesque and breathtaking.\nGaharwars",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Brightland Resort & Spa",
      "rating": [
        4.4
      ],
      "address": [
        "Kates Point Road, Old Mahabaleshwar Rd, Mahabaleshwar, Avakali, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "If you are visiting Mahabaleshwar then this is the resort you should opt for. Very nice place with very nice view. Rooms, staff, service is all up to date and perfect.\n\nWe booked ivy deluxe room and it has a nice mountain view with a gallery and also has a bath tub. Room and room service was very good.\n\nTalking about food, it's delicious. I was surprise to see so many options in breakfast. I had to carry 2 plates full of all the options. They have options in sandwich, juices, cornflakes, and so may other things. Everything was very tasty. We also dinner and they have all the options you can opt for.\n\nThey also has a bar next to swimming pool, spa, library, gaming zone, kids zone, and they host events on weekends for family n kids.\n\nThe road to reach is a bit under construction but once you reach their it's all fine.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Absolutely loved staying in this property. We booked a cottage grand room. Spacious for a family of 4. The resort is huge with all the facilities and greenary. Different types of trees and flowers. Swimming pool and jacuzzi are fabulous. The games room is good for kids. They have a dedicated play area for toddlers. Multi cuisine restaurant Olive garden serves best food. Cleanliness is top notch. This place is must visit in Mahabaleshwar.\nFive stars for their breakfast buffet. Don't miss it.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "This is a great value for money destination. The location overlooking hills is very serene. The food specially the Olive Garden restaurant is superb and delicious. The room service and housekeeping staff are prompt and quick . The activities at resort keep the guest engaged. The guards help a lot in car parking and assistance you may need.  Overall a property which exceeded my expectations with service delivery, customer centricity, engagement and food",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "One of the high end resorts in Mahabaleshwar in terms of amenities. Staff was hospitable and helpful and amenities were well maintained. There are several room types available so choose based on the configuration needed. Several of the rooms and amenities are wheelchair accessible despite the resort being on the hillside (there's conscious installations of lifts and ramps at several places)\nThe location is however slightly away from the main market (but close to Kate's point) . The resort also has activities through the day including good treks as well as indoor activities that are well organized .",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "I recently stayed at this resort and spa for a 2-day trip and was thoroughly impressed. The staff was incredibly helpful, going above and beyond to ensure my stay was enjoyable. The view from my room was breathtaking, offering stunning vistas that instantly put me at ease.\n\nSpeaking of the room, it was impeccably clean and well-maintained, providing a comfortable and relaxing environment throughout my stay. The resort offered a wide range of activities to suit every preference, from outdoor adventures to leisurely spa treatments.\n\nThe swimming pool, jacuzzi, sauna, and steam room were all top-notch, providing the perfect way to unwind after a day of exploring.\n\nOne of the highlights of my stay was the delicious breakfast included each morning. With a variety of options to choose from it was the perfect way to start the day.\n\nOverall, my experience at this resort and spa was nothing short of exceptional. From the helpful staff to the luxurious amenities, it exceeded all of my expectations and left me feeling relaxed and rejuvenated. I can't wait to return for another visit.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Club Mahindra Resort - Sherwood, Mahabaleshwar, Maharashtra",
      "rating": [
        4.2
      ],
      "address": [
        "Blue Valley Ride, off Satara-Medha-Mahabaleshwar Road, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "With all the negative reviews about the resort, I was skeptical about visiting. But it turned out to be a great stay.\nThe property is big, rooms are old but fair. What makes stay great is the welcoming and helpful staff.\nRecommended ✅",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Google maps disconnects at multiple places on the way...no sign boards by club Mahindra on the way. Such a lavish property but no attempts to easily navigate to the property.\nThe rooms were good and spacious but old fixtures, but was told they are under renovation, irrespective of this we found out villa to be good and we had a great time at the property.\nThe room amenities had to be asked for and were not already available in the room, slippers shampoo etc etc.\nThe food was good, breakfast and dinner spread was really good. Sweet section needs improvement, as we found them undercooked.\nAll in All a good stay!!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This property is located at an amazing place. Quite and full with nature.\nRooms are good and service are quick. Food costs extra and is costly (even their packages). Anything extra you touch in the property has an extra cost.\nThe stay already on an expensive side with the bulk amount initially collected and later customers are charged with annual year maintainace. Too expensive for a good property and service.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Club Mahindra offers a serene escape with its picturesque surroundings. The lush greenery which  create a soothing ambiance. The resort is well-maintained facilities provide a comfortable stay, and the rooms are clean and spacious. The staff is courteous and attentive, ensuring a pleasant experience for guests. The on-site restaurant serves delicious and diverse cuisine, catering to different palates. However, some guests may find the mobile connectivity inconsistent. Overall, club Mahindra Resort is a delightful retreat for those seeking a peaceful getaway in Mahabaleshwar.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Located just outside the city limits of Mahabaleshwar in a very scenic location surrounded by greenery. Very beautiful resort with lots of recreation place and facilities nice little pool.\nThe food was just very good and tasty. I enjoyed every moment of my stay here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Evershine Resort and Spa",
      "rating": [
        4.4
      ],
      "address": [
        "C.T.S, 182, Gautam Rd, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "I loved this resort. The rooms were spacious, and well maintained. This resort is 10 mins walkable distance from the market. The breakfast spread was really good. They serve snacks and tea in the evening. Along with that, there are some activities and games for everyone.\nOur bathroom got clogged, but when called at reception, they immediately solved the problem. So, we also received good service.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Beautifully crafted and very well maintained. Great staff hosting the place. Special call out to the room service staff. Very courteous and always available to help. Overall a great experience with the amenities like games and activities one can enjoy during the stay. Icing on the cake, it's walkable distance from the main Mahabaleshwar market.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Had a wonderful holiday at Evershine on on the Holi weekend. They had a celebration going on for Holi.  It was fun for all guests without being noisy or overbearing. Food was good quality, tasty and well presented. Rooms were sparkling clean and extremely well maintained. They have two restaurants, one of which is open air. Both serve veg as well as non veg choices. Buffet breakfast has a decent spread.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Awesome place to visit with kids and family. Lots of activities planned for kids. The rooms are hygienic, the food is tasty and the buffet spread is too good",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "If you are planning a trip to mahabaleshwar you must go to evershine resort. The entire property is too good. Lots of fun activities for both kids and adults. Food and service is awesome. Rooms are clean.\nMust visit places😊",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Regenta MPG Club Mahabaleshwar",
      "rating": [
        4.2
      ],
      "address": [
        "CTS No 233, Old, Tapola Rd, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "Delighted to have spent time at the hotel, where we experienced fantastic service, delectable cuisine, and well-maintained rooms. I would recommend the addition of tree hammocks to enhance the environmental feel. Additionally, it would be beneficial to inquire with customers in advance regarding buffet and breakfast services, especially if they have not booked these amenities during the initial reservation. The overall ambiance was excellent, and we thoroughly enjoyed our stay.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I stayed at Regents Belgaum and the while general discussion I told him I am driving to Goa and then Goa to Pune he suggested to take a break at this property\n\nIt’s a superb property old but very well maintained lush lawn and beautifully maintained  all side lanes welcoming you with colourful flowers across.\n\nFood and service is also good recommending you to try once during your visit to this beautiful place … the drive is also awesome",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I was very happy with my stay overall. The hotel is clean and well-maintained.\nThe rooms are a bit small, but they are clean and comfortable. The beds are soft and the linens are fresh.\n\nI would like to thank Mr. Tariq for his excellent service at the hotel reception. He was very friendly and helpful, and he made our stay very enjoyable.\n\nI would also like to thank the hotel staff for their hard work. They were all very friendly and helpful, and they made our stay very comfortable.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "My recent stay at this heritage hotel was fantastic, thanks to the wonderful team starting from the Security person to the Reception to the Manager Mr. Praveen at Restaurant and all the Staff Members including Mr. Karan, Mr. Jagannath, Ms. Tejal  were very much helpful. Their hospitality made me feel right at home from the moment I arrived.\n\nThe food at the hotel's restaurants was simply delicious. As on the first day there were less tourists who have opted for Dinner so the restaurant has not designed the buffet but they have provided us the à la carte as per our choice and provided such and amazing dinner.\n\nThe hotel itself was cozy and inviting, with comfortable rooms that provided a peaceful retreat after a busy day. The staff were always on hand to help with anything I needed, making sure my stay was as enjoyable as possible.\n\nOverall, I had a wonderful experience at this hotel. If you're looking for a place with great hospitality and tasty food, I highly recommend giving it a try. You won't be disappointed!",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Rooms were not good specially washroom the hotel and ambience everything was good lawn was spacious exterior too good and spacious but they need to work a lot on the rooms nice place though",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "The Grand Legacy Resort and Spa",
      "rating": [
        4.3
      ],
      "address": [
        "Panchgani-Mahabaleshwar Road, Post. Met-Gutad, behind Saj On The Mountain by Club Mahindra, Mahabaleshwar, Avakali, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "Review of TGL Resorts and Spa:\n\nOur stay at TGL Resorts and Spa was exceptionally relaxing and indulgent. From the moment we arrived, we were greeted with warmth and hospitality. We were fortunate to be upgraded to the Aqua Room, which boasted a private pool and two spacious bedrooms, one of which featured a luxurious in-house Jacuzzi.\n\nThe in-house restaurant, offering pure vegetarian cuisine, exceeded our expectations with its delicious offerings and prompt service. Our days were spent leisurely, alternating between the private pool and the rejuvenating Jacuzzi. The hotel also provided evening entertainment with games and activities, expertly organized by Deepak.\n\nOne highlight of our stay was the guided trek through the nearby jungle with Deepak. The nature trails were invigorating, offering a refreshing escape into the depths of the forest. Back at the hotel, we enjoyed a sumptuous breakfast spread each morning, setting the perfect tone for the day ahead.\n\nVenturing out, we visited the famous Mapro Gardens, indulging in their signature strawberry and cream, along with freshly made pizzas and sandwiches. Exploring the local Mahabaleshwar market added a cultural touch to our trip, allowing us to immerse ourselves in the charm of the region.\n\nReturning to the hotel, we concluded our evenings with a mesmerizing session of stargazing, albeit at an additional cost. While our experience was overwhelmingly positive, there were a few minor drawbacks to note. The temperature of the private pool was notably chilly, suggesting the need for better temperature control. Additionally, the AC in our room was slightly noisy, although the responsive staff promptly addressed the issue.\n\nOverall, our stay at TGL Resorts and Spa was nothing short of delightful, offering a perfect blend of relaxation, adventure, and culinary delights amidst the serene backdrop of Mahabaleshwar.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Good calm place. Fun activities.  Rooms very cozy and some rooms had jacuzi. Food is ok. Good option for vegetarians and jain food. Pool is not very big. Good for family stay. Location is very close to eateries and mapro is closeby. Room were clean and well maintained. Recommended for a calm short vacation.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Excellent experience while on vacation during year end. The food is awesome, never had any complains. The service by staff and kind behavior is specialty. I was at Star room and the sunset view is the best. My family had good experience.\nSpecial thanks to chief team for so good food.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "I stayed at this property with my mom in their grand classic room and the view from lawn is really breathtaking. Rooms are clean and the staff is helpful. And if you’re vegetarians then you must stay at this hotel because the food is great here.\n\nThey have art gallery, gym, spa and game zone. You will have so much to do here.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "We stayed at this hotel for the first time.\nThis is a pure vegetarian hotel so it attracted us to stay. Hotel is on Mahabaleshwar – Panchgini road towards veena lake. Hotel road from main road is steep up so difficult to walk up hill with luggage.\nAs soon as you enter the gate, huge structure welcomes you. Reception is on few steps up. Whole thing looks very beautiful and, in the night, they do good lighting.\nHotel lady was following up with us 2 days before for any requirement and also in touch with us on the day of arrival if we need any help on the way or location. This is a good gesture form hotel.\nOur check-in was very smooth and room was also ready. We stayed in Grand room. Room was quite spacious and up to 2 extra beds can be accommodated easily. There is no view as rooms are in the building (they have lift). They have some other rooms also where you get valley, garden etc view. We have not tried it. Room was having all the required facility with tea-coffee kettle. Bed is quite large. Bathroom was spacious but there was no curtain so whole bathroom get wet while bathing.\nThey have a pool may be around 18 inches to 24 inch deep. Games room, where they keep competition also. In the evening, they keep some activities to keep you busy like, games, magic show, karaoke etc. They have a beautiful spa. Try that.\nThey have huge dining hall.  Food is very good. They have lot of varieties in the breakfast and due to health issue, if you have any particular requirement, they are ready to help. In the evening at dinner time, they have buffet and there is live singing also. Singer on karaoke sing beautiful songs. We were used to sit till end after dinner also. We appreciate chef for preparing these tasty dishes. They serve Jain food also.\nThere service is also quite prompt. All were ready to help on request.\nOutside the dining room there is lot of spaces to seat and chit-chat till late in the evening. Big groups can enjoy there.\nDuring checkout, they have given water bottle and cake for you back journey.\nOverall, we had an enjoyable stay.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Valley View Beacon Resort, Mahabaleshwar",
      "rating": [
        3.9
      ],
      "address": [
        "Valley View Rd, Near Market, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "We visited this place in the last week of March '24. This place is very close to the market but it's difficult to spot due slum like area surrounding it. But once you are in it is one of the finer place to stay. The food here too good. Me and my husband loved the breakfast spread and lunch. I am a foodie and there wasn't a single dish which disappointed me. Every food item in the spread was yummy. We had good time at temperature controlled swimming pool. The rooms with valley view costed 8-9k per day. We were not aware of that and we had booked delux room which had no view. Please make sure you confirm from hotel which room you are being provided. We were under the impression that our room will have a view but it didn't and that was the only thing that disappointed us. You can enjoy the view of you go to their lawn area.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "We had a very pleasant stay at the property. The property is well maintained and the staff is very friendly.\nThe rooms are neat and clean with all the facilities upto date.\nThe food is good but is little bit pricey.\nOverall a very good stay.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Location and access to the resort is terrible. Narrow road, slums all around. But once you are in the resort they take care of you pretty nicely. Rooms are good. Outdoor lawn space is great. Entire staff is excellent. Food is great. But for the price, the location is definitely not where you want to stay… so I would not recommend this place.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Great view!! Comfortable rooms!! Very courteous staff they make you feel comfortable. Available for service all the time. The only drawback of this hotel is the locality it's not upto mark with hotel standards.\nNarrow road to enter, slums all around. But once you are in the resort they take care of you pretty nicely. Rooms are good. Outdoor lawn space is great. Entire staff is excellent. Food is great. But for the price, the location is definitely not where you want to stay… so I would not recommend this place.Extremely beautiful hotel, polite staff, very helpful receptionist good quality food,helpers were serving us with smile on their face aesthetic look of the hotel makes it even more pleasant good job valley view beacon resort looking forward to come often whenever m planning to visit Mahabaleshwar",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Booked two rooms for weekend, total came to 12.5k. Really from the photos on Google and the booking site it's not what I expected .The price we paid is too high for the rooms and no view outside. The service and food is pretty nice that's only good thing about the place. But access is bad, most of the room has no valley views as mentioned in the name.The air condition inside both rooms were cutting off and  switching on  its own even after I changed the timer setting on the remote,there wasn't fresh air properly coming in due to that. And air-conditioning switches on with such loud noise it woke me up everytime it started. Parking place also very congested.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Bella Vista Resort",
      "rating": [
        4.6
      ],
      "address": [
        "Village Metgutad, Mahabaleshwar, Maharashtra 412806, India"
      ],
      "reviews": [
        {
          "text": "We celebrated our baby’s first birthday at the property and it was the best decision. The resort is absolutely beautiful and serene. They have so amazing activities and a huge games room and our baby loved spending his evening there. The staff is very friendly and they went an extra mile to make sure of our baby’s comfort and preferences.\nWe had a absolutely amazing 2 days and we couldn’t have asked for a better celebration.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Our stay at the hotel was all good except one thing.\nOur room was bang on the kitchen area so there were cooking smell coming in our room at few instances.\nApart from that loved the location,overall amenities,and design of the hotel.There were few activities like drums,kids karaoke,telescope arranged for guided stars and planet viewing  everyday which was really good.\nOverall breakfast buffet was decent.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Stayed in the second floor valley view room in their Red stone building. The room and the bathroom were spacious and absolutely clean with all amenities required for a comfortable stay....but the best part was the view from our balcony which was absolutely breathtaking.\nWith  beautiful landscaped gardens and very cooperative and polite staff (one of the best I have ever come across) this place is possibly one of the best resorts in that area.\nThey also have a  nice recreation room and a very good restaurant. The buffet breakfast spread is decent and the food is tasty.\nHats off to the staff at Bella Vista from the personel at reception to the staff managing the restaurant,to the housekeeping to the gardeners who work tirelessly  to ensure that each guest has a memorable experience.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "It's highly over rated resort. Charging exorbitantly. I booked 2 rooms but got duplex room having only extra double bed with no privacy,  no separate bathroom,  no seperate TV. In fact nothing but extra bed. But i was charged for 2 rooms. Even single room charges are also very high compare to location,  room size and amenities provided. Kitchen is okay. Food choices were good but not the best. Food rates are okay but Food quality,  taste should be better.\n\nOverall experience was not very good. Visitors should check thoroughly before booking.",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        },
        {
          "text": "Excellent Place.Very peaceful and beautiful location. We had a wonderful stay at Bella Vista resort. We thoroughly enjoyed our stay. The hotel ambiance was lovely the food was excellent. We look forward to coming back. Excellent reception. Thank you all 💕",
          "languageCode": "en",
          "rating": [
            4.6
          ]
        }
      ]
    }
  ]
}