{
  "places_with_reviews": [
    {
      "name": "The Ramayana Hotel, Ayodhya",
      "rating": [
        4.3
      ],
      "address": [
        "Shahnewazpur Manjha, Booth No 4, Ayodhya, Uttar Pradesh 224135, India"
      ],
      "reviews": [
        {
          "text": "I would avoid to stay in this hotel in future. we have booked two luxary suites from 10 April to 11 April.\n\n- in both room fridge wasn’t operational.\n- Shower wasn’t working in 1st floor luxary suites.\n- Cleaness\n- In breakfast we had very limited option.\n- At breakfast table staff is highly unprofessional or not in mood to serve the customer.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Location is good. Hotel is pretty, garden area is quite nice specially for winters.\n\nAll staff including restaurant staff seem to be new, not so experienced and so customer service was not upto the mark. Front staff asked us to wait for an hour so they can arrange a better room for us, but ended up giving us the same room and thus, wasting our time.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Unbranded local 2star hotel\n\nIt’s a 2star hotel, food poising restaurant. 1 star staff. All reception staff amit akash sourav & others are arrongant, unhelpful. They will behave as if owners of property. After all it’s a local unbranded property. Go with raddison and not local.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "My mother (a senior citizen) and I stayed at this hotel for 2 nights in April 2024. I had a lot of questions for the staff before making the reservation, as I needed to ensure my mother had a comfortable stay. The staff (Saurabh Pandey and Amit Singh) were very prompt, responsive and helpful with all my questions.\nAmit also helped arrange a cab and driver  driver for us during our 3 days there. Our driver Ambuj Pandey was Excellent!! He is the reason our visit was super comfortable and well planned. He arranged for a wheelchair for my mom at the temple as well as a private wheelchair to tour the nearby areas like Hanuman Garhi, Dashrath Mahal, etc. He assisted my mom with steps etc and was extremely helpful. He took care of all the negotiations with the vendors. He is a very intuitive fellow and is able to anticipate and suggest options for guests accordingly. I would highly recommend Ambuj to be your driver / tour guide for your Ayodhya visit.",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        },
        {
          "text": "Thanks to Mr Himanshu Tiwari it was a good experience! When we arrived our room had no windows and the refrigerator and air conditioning were not working. He moved us into another bedroom with a balcony and had his team fix the air conditioning which was our biggest concern. The internet connected only in the telephone not in the laptop but they offered me a laptop to use in case I needed. He was very helpful so keep up the good work. Thanks to him we can recommend this hotel. Our friend’s bedroom was fine so I guess we were not really lucky. Location is good, bedroom is very clean and restaurant is vegetarian only and very good!",
          "languageCode": "en",
          "rating": [
            4.3
          ]
        }
      ]
    },
    {
      "name": "Hotel Panchsheel, Ayodhya",
      "rating": [
        4.1
      ],
      "address": [
        "Near Deokali Bypass Crossing, NH-28, Adarsh Puram, Ayodhya, Faizabad, Uttar Pradesh 224001, India"
      ],
      "reviews": [
        {
          "text": "This place is very close to Ayodhya and it has a good  restaurant with sitting space outside as well. The food was good and came is no time at all. The coffee and tea were too sweet but perfect to beat the cold weather.\nThe washrooms were very clean and well maintained.\nBeing on the highway this place makes a perfect stop over for a road journey.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "One of the best hotels in Faizabad the food quality is average. The interior and exterior are just great so overall it can be rated as 4.5 stars but the option isn't available for the same. No doubt it is one of the best hotels in Ayodhya.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I was stayed in this hotel for 15 days as a part of my professional purpose. My total rating is 3 star only...because of the bad service provided. We have a corporate booking , the booking plan was AP plan. But they not given laundry facility in first few days. Also airport pick up & drop facility not provided . Room was good, food was good . One of the Reception staff name is 'Susheel', his behaviour was rude and never smiled. Teach him about guest service, atleast teach how to smile. All other staffs are very nice .",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "All is good in Ayodhya, Hotel room was clean and big in size.\nWe are 5 people stay in a room with no difficulty. Washroom was also very neat and clean.\nGood location with Good ambience.\n\n#Jai Shree Ram",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Visited the restaurant !\nThe food was tasty\nOnly problem was the were charging extra on the water bottle\nThe MRP was 20\nThey charged 22 and added GST on top of it !\nSomething which is unethical\n\nMy engagement ceremony was organised yesterday at hotel Panchsheel and it was the best of all. The interior of the hotel is eye catching. The banquet hall is one of the best I have ever visited.The staff were so much helpul especially Vinay Shukla and Neeraj.  Overall it was a good experience.\n\nThis place is very close to Ayodhya and it has a good  restaurant with sitting space outside as well. The food was good and came is no time at all. The coffee and tea were too sweet but perfect to beat the cold weather.\n\nThe washrooms were very clean and well maintained.\nBeing on the highway this place makes a perfect stop over for a road journey.\nAll is good in Ayodhya, Hotel room was clean and big in size.\nWe are 5 people stay in a room with no difficulty. Washroom was also very neat and clean.\nGood location with Good ambience.\n\n#Jai Shree Ram",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Hotel Surya Palace",
      "rating": [
        3.9
      ],
      "address": [
        "Nh-28 bypass Ayodhya Flyover, Q6XC+69V, Bhanumati Rd, Karsewakpuram, Ayodhya, Uttar Pradesh 224123, India"
      ],
      "reviews": [
        {
          "text": "First time visited to Ayodhya thro tourist agent...lot of hopes for comfortable stay sothat we can see Shri Ram peaceful as it was a maindain visit to temple town. Unfortunately it was a worst experience in staying in hotel...Room was unheagenic, lot of mosquitoes and flees in the room and lawn area.. also RAT in room !!. We booked two rooms, and both were having the same issue. Property was looking very good from outside but felt a third class service and staying experience. Want to forget staying experience!!. Better to avoid booking in hotel.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "The quality of the food here is very poor, the taste is not good at all.  I ordered motor paneer, roti.  The food is full of salt, when I say this, argues with me, though much later the food is changed and I am served the same food again with lemon.  Be careful before eating here.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "We did not stay here. Sat in the beautiful lawn and waited here for the Volvo bus. Here lot of prilgrims are staying in dormitory. Hotel property from outside looks very good. No idea about service etc.Location is at bypass.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Stayed at Hotel Surya Palace Ayodhya Bypass recently. The rooms were comfortable, but the service was a bit slow. The location is on the highway, which might not suit everyone as it’s a bit outer from the city. If your plan is to explore Ayodhya, I’d recommend looking for hotels within the city for a more convenient experience.",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        },
        {
          "text": "Very bad experience won't recommend\n°Staff go into ur room's washroom\n°If you're room's door is open monkeys can easily come in\n°Not very clean\n°No tv and ac too\nWifi password is ayodhya@12345\n(Even tho speed is 25mbps)\nAlso there are small open windows in ur washrooms so pigeons can easily come in\nEmployees are arrogant",
          "languageCode": "en",
          "rating": [
            3.9
          ]
        }
      ]
    },
    {
      "name": "Royal Heritage Hotel & Resort, Ayodhya",
      "rating": [
        4.2
      ],
      "address": [
        "NH-27 Bypass Ayodhya Maheshpur, Infront Of Bedi's Dream Land Hotel, Ayodhya, Katra Bhogchand, Uttar Pradesh 271319, India"
      ],
      "reviews": [
        {
          "text": "Nice resort with good ambience but the staff needs to learn to serve. Courtesy is completely missing, they are okay even if you leave the venue without eating or vacate the room.\nBreakfast does not have variety, very very basic items (have never seen any other hotel / resort with so limited options).\n\nWhen one of the other guests had asked for the option of omlet / non-vegetarian option, the witty staff answered it Ayodhya, hence the non vegetarian items are not served in the breakfast. The best part was the awareness of the guest who reminded the staff about the menu and the variety of non veg served (when the guests pay for it) in the same resort. 😉😉😉",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "We stayed in E block. Room was very neat, clean & spacious but little  electrical work & civil work was to be completed. When we switched off, all lights were off. Single light we could not keep ON. Bathroom water flow also to be repaired. But their staff immediately came & cleared the water. Food was very good. Overall experience in the hotel was very good and stay was comfortable & pleasant.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The place is full of mosquitoes and flies. The hotel is more suitable for banquet or large parties and not for family stays. We went in March and they were having water problems already. The overhead tank water had got over. Food is average. And since there was a large party going on, we were not even given place in restaurant to eat breakfast.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "I stayed at the resort for a few days. The property was nice, the food was good, and the ambiance was pleasant. However, it was a bit far from the main location. The staff, except for a few individuals, wasn't great. Only manager named Mansi seemed professional. She was the only one who spoke English fluently, which made communication easy for me. Overall, the service and the hotel were good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This is really a great place. There are many blocks which are still under construction. It appears the project is in a take off stage. The rooms are spacious, The service requires improvement. It is close to Ram janma bhoomi, which is an added attraction to stay here.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Hotel Krinoscco",
      "rating": [
        4.4
      ],
      "address": [
        "249, Ayodhya - Faizabad Rd, Awadhpuri Colony, Amanigunj, Faizabad, Uttar Pradesh 224001, India"
      ],
      "reviews": [
        {
          "text": "I had booked this hotel for my Parents, Grand Parents and they loved their stay at this hotel. Property is nice, new, clean and hygienic.\nService at this hotel was amazing with amazing team of staff. Special mention to Palak Singh, she made sure that whatever I had requested, it was taken care of. She made me feel like I had younger sibling taking care of my elders in my absence..\nThank you team and thank you Palak!\n\nI have special",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The rooms are elegantly designed, restaurant is impressive with good food & service.\nChecking in was smooth, rather early check in was accommodated, a special mention to Ms.Palak at the front desk for her help. Overall, good experience, would recommend",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The main thing is staff is,worst. They don't co-operate to you and arrogant. At the time of checkin I told them to arrange extra bed and I already booked triple,share room. I requested 2 times but they ignored to do that. 2nd thing we booked rooms with dinner and what is the hight they arrange our buffet dinner in someone's private party seriously that is,worst. This type of hotel do this type of games so cut the cost. And all staff is useless totally. Worst service ever. Be careful with this. I am a travel agent and I visited many places and hotels so trust me this is worst case.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "The hotel was really good. Clean, good size rooms with good service. The front desk staff was extremely helpful with the check in process and guiding on temple visits etc. Special mention to Samna who was very kind, attentive and gave the best tips. Also have to mention the breakfast. Didn't have a lot of expectations with that but it was outstanding. The variety of items kept and the quality of each of them was excellent.\n\nDefinitely recommend this place if you are visiting Ayodhya",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        },
        {
          "text": "Our stay was very pleasant. We were traveling with our parents and in-laws. The hotel staff was very helpful and accommodating in fulfilling our requests. The food was good. Special thanks to Ms.Samna and Mr.Durgesh at the hotel’s reception who gave us guidance about the city and places to visit when we were short of time.",
          "languageCode": "en",
          "rating": [
            4.4
          ]
        }
      ]
    },
    {
      "name": "Taraji Resort Hotel & Restaurant | Best Hotel in Faizabad, Ayodhya | Wedding Venue",
      "rating": [
        4.1
      ],
      "address": [
        "National Highway-27, bypass, near Deokali, chauraha, Ayodhya, Faizabad, Uttar Pradesh 224001, India"
      ],
      "reviews": [
        {
          "text": "Third quality hotel.\nUneducated, Illmannered, irresponsible managers Durgesh and Ajit, they don't know hor to talk to the customers. They spoiled my sisters engagement with their pathetic arrangements and services.\nTheir staffs dont know how to serve food to the guests,  they were serving snacks in disposable plates, staffs dont know how to cut cake and serve it.\nThey served dal rice in disposable chai wala cups to bride and groom --THIRD CLASS ARRANGEMENTS.\n\nthink twice before going for this so called hotel for any big event as they will leave no chance to spoil it.\nWe booked this hotel for engagement and wedding but due to their so called  A1 class services, we cancelled it for the wedding and bear the loss, booked another one.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I had to catch the bus where this resort is located. I reached late there around 11. The staff is really helpful and cooperating. They took my order and waited for me to finish. Food was average. But service and staff behaviour was on point.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Nice neat place. But\n1. chinnese food ordered in restaurant was too TOO spicy.\n2. No general Toilet on ground floor, none on other floors, they are part of Banquet halls.. if halls occupied, difficult to use.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I went there for dinner with my family. The service was very poor. The restaurant staff was unprofessional. They were prefering their know customer either if you are waiting since long for your order.\nThey were not ready to listen atleast.\n\nAt the last they served the food in disposal utensils, and said main utensils is not clean.\n\nFood quality and taste also was not good.\n\nThink twice before visit.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Such a worse experience that i had on my trip to India. I would never recommend this place to any one. A really run down place. One person can get sick if stayed there for more than an hour. We had booked two nights. But had to run away to book another hotel as we cannot stand the smell of the toilet inside the room. Bed sheets were too dirty. Used tea bags. Very Unprofesional staff. No manners at all at the front desk. Our money wasnt refunded for the second day that we had book. Photos on the website doesnt justify the actual place.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "KOHINOOR PALACE - A HERITAGE HOTEL",
      "rating": [
        4.2
      ],
      "address": [
        "Vaidehi Nagar, Reidganj, Faizabad, Uttar Pradesh 224001, India"
      ],
      "reviews": [
        {
          "text": "Experience royalty at its finest in Hotel Kohinoor Palace! From the moment you step into the grand lobby, you're greeted with opulence and warmth. The luxurious rooms are adorned with exquisite decor, offering a perfect blend of comfort and elegance. The staff's impeccable hospitality ensures a truly regal stay. Indulge your taste buds in the delightful culinary offerings at their restaurants, each dish crafted to perfection. With its central location and world-class amenities, Hotel Kohinoor Palace is a jewel among hotels,",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "If you are looking for a good stay with a touch of heritage in your stay, this is the place you should go to. It was just for one night, but I haven't had any complaints so far. There is a sense of peace in the place. It is a good choice for big families because the rooms are very spacious. As far as the service provided by the team was concerned, I had no issues with it. It is also a good experience when it comes to the food. I found the overall experience to be good.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "If you are expecting luxury stay, then its a big NO. ONLY FROM OUTSIDE THE HOTEL LOOKS GOOD.\n\nThe prices for rooms are similar to 3 or 4 star hotels but the facilities provided even for super deluxe rooms no where matches the star hotels.\n\nI had taken 2 rooms here for 1 night stay and i found the below problems with their stay:\n* There is no basic lift in the hotel\n* No natural lighting in the rooms , and are fully dark without lights turned on\n* The shower in one of the room was spoiled\n* No one to pick the call made to reception, and have to go all through the stairs and tell them\n* No stinking smell in the bathroom but there were stain marks as if uncleaned properly in the commode and basin\n\nOverall i feel this is a very old hotel being renovated recently and missing above details in it",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "The Kohinoor is a decent establishment in Faizabad, about 25 min from the Ram Mandir. An old mansion transformed into a small-size hotel. The rooms are clean, spacious and well lit. We stayed in a room facing the backside so it had a window. The rooms are set around two corridors on the ground and first floor running around a courtyard where meals are served.\nThe restaurant does not seem to be open to walk-in customers. House guests can place orders from their room and head down to the courtyard when the food is ready. The North Indian fare that we had - dal, rotis, aloo curry - were standard and decent.\n\nWhere kohinoor needs to do better is in the area of room and customer service. Things are changing in Ayodhya - fancy hotels going up closer to town and millions more tourists will descend. Kohinoor needs to step up its game. Room service was sluggish at best and non-existent at worst. We had to remind room service several times to replenish basic amenities like coffee and tea.\nKohinoor cannot afford sluggish service - other proprieties will soon crop up in the area and give them stiff competition.\n\nNo lifts in the property - making it hard for senior citizens and others needing assistance.\n\nI’d give them 3 stars but their  room service drops it down to 2.5.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "This place was a palace in the past and now converted into a hotel. So they have good size  rooms. But the bathroom is not maintained. Another problem we faced was, on the day of our stay they had a marriage in their lawn, and the music was there till 1 pm. It was very disturbing and annoying. The rooms are not sound proof, so it was difficult to go for a sleep in that sound.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    },
    {
      "name": "Shri Ram Hotel",
      "rating": [
        4.1
      ],
      "address": [
        "Dant Dhawan Kund - Ahirana Marg, Near Shri Hanuman Garhi Mandir, New Colony, Ayodhya, Uttar Pradesh 224123, India"
      ],
      "reviews": [
        {
          "text": "Ac deluxe room was  spacious,neat and clean food was good and staff were polite and courteous\nRam mandir is 2min walkable distance from this hotel\nOverall a good place to stay",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "I really appreciate the management for maintaining Shri Ram Hotel in a hygiene state, the staff members are responsive. Added advantage to the hotel is it's restaurant, food is tasty. Very nearer andin a walkable distance to all major temples in Ayodhya. One negative thing is that TV did not work for two days, however it is not a major issue. in all I opine that I should give five star rating to Sri Ram Hotel, Ayodhya",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Booked my room thru Make My Trip in Feb 2024 for 4 night stay.\nRoom was sold as Super Delux AC Room.\nBut it was a Horrible experience.\nBathroom had No Geyser fitted. Geyser was removed. (See photo attached.)\nHot water was supplied only in the morning thru tap for very limited time only. No hot water in the afternoon or evening or night.\nImagine plight of customer in winter.\nTV was not functioning. Recharge was not done even after complaint. ( See photo attached).\nBehaviour of Reception Team is pathetic, to say the least.\nOnly advantage of this property is the location, NOTHING ELSE.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "The location is the prime selling point of this hotel. It takes hardly 2 mins to reach the entry gate of the Ram Mandir. So one can leave their mobiles and bags and shoes at hotel and can go for darshan at Ram Mandir via fast track. The rooms are descent enough for the price we pay at a pilgrim centre like Ayodhya. The staff is young and friendly and are available all time.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        },
        {
          "text": "Best location in Ayodhya city near Ram Janm Boomi Mandir. Rooms and washrooms are neat and cleen.   Good  quality of foods. Testy hyginic foods.  Restaurant facility are available in here. Staff is very good. Services is slow.",
          "languageCode": "en",
          "rating": [
            4.1
          ]
        }
      ]
    },
    {
      "name": "Royal Heritage Hotel & Resort",
      "rating": [
        4
      ],
      "address": [
        "NH -24 Lucknow, Highway, Sai Nagar, Faizabad, Ayodhya, Uttar Pradesh 271319, India"
      ],
      "reviews": [
        {
          "text": "Do Not book this hotel , i repeat do not book this hotel if you need a room near the Ram temple. This is a scam. They are deceiving customers with their photos with the Ram temple location and don't refund the money when confronted.\n\nI never expected such scams in Ayodhya\n\nThe hotel may be good , I don't know I booked it because they have Google map location near Ram janmabhumi temple. In reality the hotel was not there when I reached. I figured the the hotel is 10/11 km away from the temple. Ridiculous isn't. So don't fall for the location and photos.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Just returned back with a group of 87 business associates from Ayodhya. This place would surely occupy a top rating for its beautiful rooms, splendid banquet halls, magnificent lobby, tasty Indian vegetarian food and service. The hotel staff helped us in providing electric autos for Ram janmbhumi Mandir darshan. Would recommend all our friends to book well in advance.\nRajendra Malushte\nMARKET MOVERS INDIA\nMUMBAI",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Beautiful property for corporate events, everything is in place, staff is very co-operative. Appreciate the support and co-operation given by Mr.Bhupesh Tiwari who is Manager. Overall experience is excellent,",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "Staff and service is ok but they don't respond on calls. We were on the way from the airport and kept on calling them but they did not respond at all. Rooms were stinking and not ventilated at all.",
          "languageCode": "en",
          "rating": [
            4
          ]
        },
        {
          "text": "The rooms were good. Slightly lower than expected from a 3 4 start hotel but still... They were good. The staff was good as well. The receptionists were great and were very friendly and accommodating.\nBeing on the highway it's slightly difficult to get transportation to the city. Otherwise good for a pleasant stay",
          "languageCode": "en",
          "rating": [
            4
          ]
        }
      ]
    },
    {
      "name": "Praveg Tent City Ayodhya, Brahma Kund",
      "rating": [
        4.2
      ],
      "address": [
        "behind Bramh kund Gurudwara, Sai Nagar, Ayodhya, Uttar Pradesh 224123, India"
      ],
      "reviews": [
        {
          "text": "Just returned from a 3D/2N stay at PRAVEG tent city. Excellent facility , unique tent living experience with all modern conveniences. On site dining hall offers all three meals with varying menus, variety and quality. Staff all round are very courteous, attentive and helpful, with a wealth of information on the local environs. I would strongly recommend this facility. There’s WIP all over the temple areas , so the resort cannot be or should not be held responsible. As time passes it will all settle down.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Nice clean well maintained place, breakfast was really good. Staff is well mannered and courteous.\n\nOnly one tiny complaint, its not 0km away from mandir as marketed on their portal, it take good 20 minutes walk to entrance of temple and 5-10 min by e-rickshaw.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Highly costly 12000+ only for tent. No hospitality. Providing only buffet breakfast in the morning. Cancellation policy is also cumbersome. 15% charged even if you cancelled immediately. They ask you reason for cancellation and if they are not satisfied with ur reason no cancellation.restaurent service are also not 24*7 .u will not get tea before 7.30 am. Not worth to spend that much amount on this property.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "Everything was perfect except the noise coming in the tent as they are not that sound proof. Apart from that whole stay was really comfortable. Entire Staff was very helpful, will visit again  for another experience",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        },
        {
          "text": "At their restaurant they keep soft drinks along with buffet, and nowhere its clarified that whether its part of buffet. Then they may charge people (randomly, like some ppl they will charge & some not) for those soft drinks which are highly priced (compared to what you get from a shop) along with 18% tax (which we don’t again understand how they charge above MRP as its included within). It’s a sour experience, where they are following unethical practices & staff at restaurant was also rude.",
          "languageCode": "en",
          "rating": [
            4.2
          ]
        }
      ]
    }
  ]
}