{
    "places_with_reviews": [
        {
            "name": "Hotel",
            "rating": [
                4.8
            ],
            "address": [
                "Doodhpathri Talpora, Road, Gund Dervesh Harawa, 191111"
            ],
            "reviews": [
                {
                    "text": "Feels like it's my own house",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Hii all ....it is place where we can live with peace' .....",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Best for camping\nStaff is friendly",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Amazing",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "feels like house",
                "hii place live peace",
                "best camping staff friendly",
                "nice",
                "amazing"
            ]
        },
        {
            "name": "Water Vibe Resorts, Doodhpathri Khansahib",
            "rating": [
                2.9
            ],
            "address": [
                "WMJ5+X88 Doodhpathri, Khan Sahib, 191111"
            ],
            "reviews": [
                {
                    "text": "Worst hotel in Dodhpathri. Staff is unprofessional also the manager uff!! very very bad behavior. The hotel is like a jail seriously.The view is fantastic no doubt but view is not everything. Overall wastage of money and time ..",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "This resorts is total costly\nAnd service is very bad 🤮🤧🤮🤧\nAnd the stop is rude\nWorst hotel in Dodhpathri. Staff is unprofessional also the manager uff!! very very bad behavior. The hotel is like a jail seriously.The view is fantastic no doubt but view is not everything. Overall wastage of money and time ..",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Love it",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Worst restaurant worst faculty",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst hotel dodhpathri staff unprofessional also manager uff bad behavior hotel like jail seriouslythe view fantastic doubt view everything overall wastage money time",
                "resorts total costly service bad ð\u009f¤®ð\u009f¤§ð\u009f¤®ð\u009f¤§ stop rude worst hotel dodhpathri staff unprofessional also manager uff bad behavior hotel like jail seriouslythe view fantastic doubt view everything overall wastage money time",
                "love",
                "worst restaurant worst faculty"
            ]
        },
        {
            "name": "OYO Home Aalim Homestay",
            "rating": [
                4
            ],
            "address": [
                "Near EDB, Khurd Gurwait Raithan, J &K, Budgam, Raithan, 191111"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "OYO Flagship Tree Boneae Resort",
            "rating": [
                3
            ],
            "address": [
                "Plot 7, Block B, Raiyar, Doodhpathri Road Near Toll Post, Budgam, Srinagar, Raiyar Beruwa, 190001"
            ],
            "reviews": [
                {
                    "text": "1) Unclean bedsheets. Did not change the bedsheets even after repeated requests.\n2) Poorest service. Hotel staff had no idea about our booking when we arrived. We booked one room for 3 people. But the bed they provided was only for 2. After repeated requests, we had to go and fetch for mattress and beddings on our own.\n3) Mattresses were quie uncomfortable.\n4) Bathroom was not clean when we reached. And water gets logged inside the bathroom.\n5) No fan in room. Required in summers only though.\n6)Nice location though\n7) Can't say much about food. Since, their chef was on leave the day we reached and the owner himself cooked dinner for us and was friendly. This was the only good thing about this hotel. Gave one extra star just for this..\n8) There was only one service staff who could barely understand us, our requirements, and was too lousy to provide service to so many people.\n9) No latches in the balcony gates\n10) Suite rooms are big but the washrooms are transparent with curtains outside the washroom. So, its ok if you are comfortable with it!!",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Not bad",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "unclean bedsheets change bedsheets even repeated requests poorest service hotel staff idea booking arrived booked one room people bed provided repeated requests go fetch mattress beddings mattresses quie uncomfortable bathroom clean reached water gets logged inside bathroom fan room required summers though nice location though cant say much food since chef leave day reached owner cooked dinner us friendly good thing hotel gave one extra star one service staff could barely understand us requirements lousy provide service many people latches balcony gates suite rooms big washrooms transparent curtains outside washroom ok comfortable",
                "bad"
            ]
        },
        {
            "name": "Panun Ghar",
            "rating": [
                4.9
            ],
            "address": [
                "WJF8+XG, Gund Dervesh Harawa, 193411"
            ],
            "reviews": [
                {
                    "text": "Such an amazing place, truly breathtaking. Surrounded by nature. We stayed there for 2 days and 1 night. The facilities were amazing. The food was also amazing unlike some other hotels . We stayed in tents as well as tree house, an amazing experience. Takes all your stress away.\nIf you talk about the price, if say it's really affordable given that other hotels charge more and are not even close in terms of beautiful surroundings and up to date facilities.\nRooms are amazing and clean, beds were comfortable too, plus clean washroom hygiene and constant and water supply.\nThe staff members are friendly and treat you like family.\nId say you should give this place a try.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Hospitality best\nNice view\nAll are best...you won't regret visiting\nThis place",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Amazing place. Beautiful scenery, plus affordable price.\nThe staff members are really nice too. Network might not be available sometimes but you go there just to enjoy nature so I'd say less network is a plus point.\nA must visit place . ❤️‍🔥",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Awesome.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Must Visit place",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing place truly breathtaking surrounded nature stayed days night facilities amazing food also amazing unlike hotels stayed tents well tree house amazing experience takes stress away talk price say really affordable given hotels charge even close terms beautiful surroundings date facilities rooms amazing clean beds comfortable plus clean washroom hygiene constant water supply staff members friendly treat like family id say give place try",
                "hospitality best nice view bestyou wont regret visiting place",
                "amazing place beautiful scenery plus affordable price staff members really nice network might available sometimes go enjoy nature id say less network plus point must visit place â\u009d¤ï¸\u008fâ\u0080\u008dð\u009f\u0094¥",
                "awesome",
                "must visit place"
            ]
        },
        {
            "name": "OYO Home Safyan Homestay",
            "rating": [
                2.5
            ],
            "address": [
                "Near Airtel Tawer Dabipora, Khansahib, J&K, Dabi Pora, 191111"
            ],
            "reviews": [
                {
                    "text": "Best",
                    "languageCode": "en",
                    "rating": [
                        2.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best"
            ]
        },
        {
            "name": "Buraq HOTEL AND RESTAURANT Doodhpathri",
            "rating": [
                4.6
            ],
            "address": [
                "Rayar yeach khanshaib, Raiyar Beruwa, 193411"
            ],
            "reviews": [
                {
                    "text": "Don’t believe the good reviews for this hotel. I was excited to eat there because they had a big menu, but it was a huge letdown. They didn’t have mutton, chicken tandoori, or even regular roti because their tandoor was broken. I had to settle for whatever was left. They also made me wait for the chef. When the food finally came, it was terrible. The biryani and chicken seemed old, and the dessert was warm on top and cold at the bottom, and it tasted bad. We could only eat a small part of the meal. I even took a picture of the spoiled dessert before leaving. This was the worst food I’ve had in a long time, especially for the price. Avoid this place.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Absolutely Amazing Food and Service... Best restaurant at doodhpathri...",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Excellent food.... Excellent hospitality.... Best restaurant at doodhpathri......",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Stopped here for lunch on the way to Dudhpatri. This place is like Oasis in dessert, didn't expect such ambience, service and food quality at such remote place. If you're heading to Dudhpatri, this is a good  place for pure vegetarian food. Must try kashmiri pulav and sweet paneer subjee.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Delicious Food....Best Service...Only Fine Dining at Doodhpathri...",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "donâ\u0080\u0099t believe good reviews hotel excited eat big menu huge letdown didnâ\u0080\u0099t mutton chicken tandoori even regular roti tandoor broken settle whatever left also made wait chef food finally came terrible biryani chicken seemed old dessert warm top cold bottom tasted bad could eat small part meal even took picture spoiled dessert leaving worst food iâ\u0080\u0099ve long time especially price avoid place",
                "absolutely amazing food service best restaurant doodhpathri",
                "excellent food excellent hospitality best restaurant doodhpathri",
                "stopped lunch way dudhpatri place like oasis dessert didnt expect ambience service food quality remote place youre heading dudhpatri good place pure vegetarian food must try kashmiri pulav sweet paneer subjee",
                "delicious foodbest serviceonly fine dining doodhpathri"
            ]
        },
        {
            "name": "Snow Peak Chalet",
            "rating": [
                4.8
            ],
            "address": [
                "Tagnar, Doodhpathri, near TRC, Khan Sahib, 191111"
            ],
            "reviews": [
                {
                    "text": "If you really need a break from your hectic and stressful time you need to visit this place.Awesome ambience ,tasty food with great hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Must try",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "really need break hectic stressful time need visit placeawesome ambience tasty food great hospitality",
                "must try"
            ]
        },
        {
            "name": "Tree Bones Resort Doodhpathri",
            "rating": [
                4.8
            ],
            "address": [
                "Doodhpathri, Raiyar Beruwa, 191111"
            ],
            "reviews": [
                {
                    "text": "Mr. Zahid was a life saviour as he agreed to give us a place to stay in a decent price, even though we seeked for the booking on-spot. Good Host !!!",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "We had kashmiri wazwan here, the food was really good, chef Zaahir is well experienced and innovative with his cooking. Try the dhaniawala korma and rista. 👌",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Wonderful location for staying with family and friends, surrounding views are awesome",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Superb food with special reference to Dhaniawali Korma and Rishta.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Had a wonderful experience special thanks to Mr.Umer",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mr zahid life saviour agreed give us place stay decent price even though seeked booking onspot good host",
                "kashmiri wazwan food really good chef zaahir well experienced innovative cooking try dhaniawala korma rista ð\u009f\u0091\u008c",
                "wonderful location staying family friends surrounding views awesome",
                "superb food special reference dhaniawali korma rishta",
                "wonderful experience special thanks mrumer"
            ]
        },
        {
            "name": "Lal bub hotel and restaurant",
            "rating": [
                4.8
            ],
            "address": [
                "Near four way, DOODPATHRI, ROAD, RAIYAR, Khan Sahib, 191111"
            ],
            "reviews": [
                {
                    "text": "The food here was simply amazing. We tried Kahmiri pulao and it was simply delicious. It was made in desi ghee and served with salad and shalgam achar. Very good service and great place. Would definitely recommend to visit.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A lovely respite after our time at Doodhpatri! It was a busy period but the waitstaff were so attentive and apologetic to keep us waiting but they were clearly doing their best, so thank you! The food was lovely and the coffee  was perfect, who knew Nescafé could be made so well!",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The restaurant is amazing! Their hospitality is awesome, staff is very cooperative and humble. They served delicious food, and their kashmiri pulav & kahwa is a must try!",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It was our first time experience of eating the authentic Kashmiri Cuisine. The hospitality of the staffs were amazing and the food was top notch as well. Must visit this place if you want to try the Kashmiri cuisine. Good place, good food! 👍🏻",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Amazing food. Amazing Kashmiri wazawan and Rishta curry, mutton korma curry. Replaced mutton with Potato 🥔 and egg 🥚 for vegetarians too.\nVery tasty Kawa with fresh saffron of best quality and dry fruits.\nFew of us tried Aalo paratha too and it was as good as north India.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food simply amazing tried kahmiri pulao simply delicious made desi ghee served salad shalgam achar good service great place would definitely recommend visit",
                "lovely respite time doodhpatri busy period waitstaff attentive apologetic keep us waiting clearly best thank food lovely coffee perfect knew nescafã© could made well",
                "restaurant amazing hospitality awesome staff cooperative humble served delicious food kashmiri pulav kahwa must try",
                "first time experience eating authentic kashmiri cuisine hospitality staffs amazing food top notch well must visit place want try kashmiri cuisine good place good food ð\u009f\u0091\u008dð\u009f\u008f »",
                "amazing food amazing kashmiri wazawan rishta curry mutton korma curry replaced mutton potato ð\u009f¥\u0094 egg ð\u009f¥\u009a vegetarians tasty kawa fresh saffron best quality dry fruits us tried aalo paratha good north india"
            ]
        }
    ]
}