{
    "places_with_reviews": [
        {
            "name": "Hotel Shikhar",
            "rating": [
                3.8
            ],
            "address": [
                "Mall Rd, near Shikhar Tiraha (Crossroad),The, Paltan Bazar, Dharanaula, Almora, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "This hotel was good. It had elevators to transport your bags. The location was also close to a lot of shops. But in the future, please include soaps and towels in the room. The rooms were old and not maintained properly. But outside on the top porch the city view looked beautiful! Also, they respond to calls quickly. Please make the rooms cleaner.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I've heard about this place because it's known for the oldest and best hotels in town. I went there once, it was late in the evening and i needed a place to stay, so my father recommended this hotel. I went inside and asked, I could not believe the off-season price were so high, anyway i thought to check out the room so I went with the guy in the lift who continuously stared me until we reached the room (the lift to was not in proper working mode). The room was big but it smelled like hell. It may be the biggest hotel but for me it was the worst one. Why build such thing when you can't maintain it? I feel pity for travellers and tourist who want hotel and even after paying good amount are not getting what they atleast deserve.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We stayed at hotel Shikhar for 6 nights and loved it. Our room was clean, bathroom very clean also, plenty of hot water, quiet, staff are friendly and helpful,and we are our meals at their inhouse restaurant and the food was delicious. We will stay here again when in Almora and will recommend to our friends. Thankyou for such a lovely stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Fine hotel, conveniently located at the Mall road near the roadways bus stand. Rooms are fine with basic facilities, do not expect much. Food prices are at a higher rate. Service at hotel and behaviour of the staff is good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very dirty rooms, food quality is very poor.\nBed sheets, blankets were full of dust, toilet is so dirty that we avoided taking bath. Quality of food is very poor.\nOnly advantage is the location.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel good elevators transport bags location also close lot shops future please include soaps towels room rooms old maintained properly outside top porch city view looked beautiful also respond calls quickly please make rooms cleaner",
                "ive heard place known oldest best hotels town went late evening needed place stay father recommended hotel went inside asked could believe offseason price high anyway thought check room went guy lift continuously stared reached room lift proper working mode room big smelled like hell may biggest hotel worst one build thing cant maintain feel pity travellers tourist want hotel even paying good amount getting atleast deserve",
                "stayed hotel shikhar nights loved room clean bathroom clean also plenty hot water quiet staff friendly helpfuland meals inhouse restaurant food delicious stay almora recommend friends thankyou lovely stay",
                "fine hotel conveniently located mall road near roadways bus stand rooms fine basic facilities expect much food prices higher rate service hotel behaviour staff good",
                "dirty rooms food quality poor bed sheets blankets full dust toilet dirty avoided taking bath quality food poor advantage location"
            ]
        },
        {
            "name": "Hotel Aeradyo Inn",
            "rating": [
                4.4
            ],
            "address": [
                "Gas Godam Laxmeshwar, JM57+R7C landmark, Laxmeshwar, Dharanaula, Almora, Almora Range, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Spent a great weekend there.. The staffs were attentive and polite. Special mention for the food which we ordered for dinner was really tasty.\n\nThe view from our room was great too. But we had front facing balcony so we could see the great view.\n\nLocation of the hotel is also easily accessible. Must admit that they a big underground parking lot, one of the reasons why we chose and stayed in the hotel.\n\nMajor attractions are also nearby the hotel.\n\nIt was a good stay and a family hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The best hotel near mall road in almora. Location is excellent and the view from the room is excellent. The best part is the restaurant which serves sumptuous food.\nMall road distance: 1.5km\nEasily accessible to all amenities",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Location is almost 1.5 km from Mall road which is very far on hills by foot. Other than that, everything was good. The rooms were spacious and clean, and the bathroom too. A wide parking area is also available which is the most suitable thing for me otherwise searching for a parking space in hilly areas is the most difficult thing. But a little bit costly.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Stayed at hotel with family.Very good hotel and location superb. Food, cleanliness, hospitality everything was good.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "An excellent place to stay with some really good food at the restaurant. Vies from the front facing balcony rooms amazing you can gaze at the complete valley, sunset golden line is something not to miss.\nStaff is really generous and helpful. A good parking space available at the hotel. Cleanliness and washroom hygiene is top notch.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "spent great weekend staffs attentive polite special mention food ordered dinner really tasty view room great front facing balcony could see great view location hotel also easily accessible must admit big underground parking lot one reasons chose stayed hotel major attractions also nearby hotel good stay family hotel",
                "best hotel near mall road almora location excellent view room excellent best part restaurant serves sumptuous food mall road distance km easily accessible amenities",
                "location almost km mall road far hills foot everything good rooms spacious clean bathroom wide parking area also available suitable thing otherwise searching parking space hilly areas difficult thing little bit costly",
                "stayed hotel familyvery good hotel location superb food cleanliness hospitality everything good",
                "excellent place stay really good food restaurant vies front facing balcony rooms amazing gaze complete valley sunset golden line something miss staff really generous helpful good parking space available hotel cleanliness washroom hygiene top notch"
            ]
        },
        {
            "name": "Hotel Shivalik-Best Himalayan View Hotel In Almora",
            "rating": [
                3.6
            ],
            "address": [
                "L.R.Sah Road, near Vishal Mega Mart, Dharanaula, Almora, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are spacious with balcony. We had a pretty view from balcony. Room and bathroom was clean. Hot water was available 24hr.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Worst room..& food is very bad taste.overcharhing very high..ise acha kise guest house meh stay karna",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "First of all no one is in the Reception at the first time. Very poor facility and staff behaviour is very bad. They don't have sence how to talk to the customers.\nOverall very bad experience.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Except location. This property does not qualify for a hotel. It's a trap. Great pics on hotel booking app. But when you reach rooms smell like he'll, bugs everywhere, cockroaches,spiders, stained bed sheet, filthy sofa, doors windows balcony. LIFTS/AC/TV not working. But they charge you for it 3000 plus INR per night. Rude unprofessional argumentary hotel staff. No tea glass or electric jug in rooms. They ask u to go to kitchen which is also unhygenic to order ur tea food. No intercom. One should  report to govt. authority to shut it down.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "In one word ‘CHEAP’. No one cares to pick up your luggage, Nobody was at the reception even I called before coming. Stairs and Corridor floor are dirty and cheap in appearance. The room has dirty blankets, The noisy and cheap springs in the bedding will give you back pain. Room service is really bad. You have to literally find them to serve you. The only positive is the view and market location. Its a complete waste of such a big property. The owner seriously needs to rethink about the cleanliness, staff and renovation.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms spacious balcony pretty view balcony room bathroom clean hot water available hr",
                "worst room food bad tasteovercharhing highise acha kise guest house meh stay karna",
                "first one reception first time poor facility staff behaviour bad dont sence talk customers overall bad experience",
                "except location property qualify hotel trap great pics hotel booking app reach rooms smell like hell bugs everywhere cockroachesspiders stained bed sheet filthy sofa doors windows balcony liftsactv working charge plus inr per night rude unprofessional argumentary hotel staff tea glass electric jug rooms ask u go kitchen also unhygenic order ur tea food intercom one report govt authority shut",
                "one word â\u0080\u0098cheapâ\u0080\u0099 one cares pick luggage nobody reception even called coming stairs corridor floor dirty cheap appearance room dirty blankets noisy cheap springs bedding give back pain room service really bad literally find serve positive view market location complete waste big property owner seriously needs rethink cleanliness staff renovation"
            ]
        },
        {
            "name": "The Mountain Paradise Resort",
            "rating": [
                4.5
            ],
            "address": [
                "Papsarsali, Binsar, Road, Hawal Bagh, Almora, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Staying at Mountain Paradise Hotel in Almora was an absolute delight! The food was not only delicious but also made with fresh, locally sourced ingredients, adding to the authenticity of the experience. The breathtaking views of the surrounding mountains from the hotel were simply mesmerizing, making every meal a feast for the eyes as well. Additionally, the rooms were clean, comfortable, and provided a cozy retreat after a day of exploring the beautiful surroundings. Highly recommend this hotel for anyone seeking a perfect blend of great food, stunning views, and comfortable accommodation in the heart of nature.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good hotel Food Quality Very yummy staff Behaviour good and very friendly  All Rooms Balcony views Hotel manager Good coprate Thanks to All services Next time Dircet contact to Hotel Booking Mountain paradise...",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I would not recommend to visit anyone to this hotel(specially cottages). Insects were in bathrooms..rooms and bedsheets were Not clean.. Food and service was excellent.. Rakhi yadav one of the office members  in delhi were so rude she was not listening to the feedback as well she didn't even share link for posting review as well.. One of the worst experience..",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Amazing hotel. Very clean and well organized\nStaffs are very nice and cooperative",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Beautiful property with tasty and delicious food... The rooms are  neat and clean...",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staying mountain paradise hotel almora absolute delight food delicious also made fresh locally sourced ingredients adding authenticity experience breathtaking views surrounding mountains hotel simply mesmerizing making every meal feast eyes well additionally rooms clean comfortable provided cozy retreat day exploring beautiful surroundings highly recommend hotel anyone seeking perfect blend great food stunning views comfortable accommodation heart nature",
                "good hotel food quality yummy staff behaviour good friendly rooms balcony views hotel manager good coprate thanks services next time dircet contact hotel booking mountain paradise",
                "would recommend visit anyone hotelspecially cottages insects bathroomsrooms bedsheets clean food service excellent rakhi yadav one office members delhi rude listening feedback well didnt even share link posting review well one worst experience",
                "amazing hotel clean well organized staffs nice cooperative",
                "beautiful property tasty delicious food rooms neat clean"
            ]
        },
        {
            "name": "Hotel Heritage",
            "rating": [
                3.8
            ],
            "address": [
                "Near M.E.S, Main Road, Khatyari, Almora, Sarso, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Pleasant stay, very beautiful lawn around the heritage building. View is amazing from the lawn. Quiet & peaceful. once. Experience in this hotel was just awesome. So cooperative & polite staff. Rooms are wonderful & are spacious enough. Food is tasty. View from the terrace & also from rooms is amazing. Pricing is also reasonable. Wonderful experience. One should must visit atleast",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room and location around are exceptionally good. Himalayan peak Views just from the hotel big lawn is eye catching.  Staff is courteous and food is reasonable.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Horrible hotel and experience. Owner was rude and non available in hotel. Manager gives owner number for any issue and owner then talks rudely. Not fit for hotel industry and customer service.\nI booked hotel through make my trip. Hotel is off route, almost 2km from main Mall road.no vehicle is allowed here. My parents were old and I had kids travelling with us. We walk the entire 2 km. No number information on Google and elsewhere. Nobody in the vicinity knows about the hotel. We were do frustrated as hotel was non contactable. That's why I think they put NON REFUNDABLE in their policy. Room. Provided to us was different from what booked. Rooms were unclean and dusted and not worth of the tariff.\nHorrible experience. The only black stain in our ALMORA trip.\nBeware before you book this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Overall a really good experience, great views and good service. Also, the hotel provides a vintage vibe, if you like historical architecture of British times, you will love the place.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel Heritage Almora is the perfect destination for those seeking a scenic view with heritage-style ambience. Located conveniently on Mall road, this hotel offers plenty of parking space for your vehicles. You can take in the beauty of its sprawling lawn, which promises to make any photo taken here look absolutely picturesque!\nRooms are specious and room service is great.staffs are very friendly and they give special assistance for kids and elderly.\nHotel arranged taxi/ cab  for local sight seeing which is very pocket friendly and driver Thapa ji was good.even one can get drop service to kausani or ranikhet  or nainital from Hotel.\nGreat place to stay",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pleasant stay beautiful lawn around heritage building view amazing lawn quiet peaceful experience hotel awesome cooperative polite staff rooms wonderful spacious enough food tasty view terrace also rooms amazing pricing also reasonable wonderful experience one must visit atleast",
                "room location around exceptionally good himalayan peak views hotel big lawn eye catching staff courteous food reasonable",
                "horrible hotel experience owner rude non available hotel manager gives owner number issue owner talks rudely fit hotel industry customer service booked hotel make trip hotel route almost km main mall roadno vehicle allowed parents old kids travelling us walk entire km number information google elsewhere nobody vicinity knows hotel frustrated hotel non contactable thats think put non refundable policy room provided us different booked rooms unclean dusted worth tariff horrible experience black stain almora trip beware book hotel",
                "overall really good experience great views good service also hotel provides vintage vibe like historical architecture british times love place",
                "hotel heritage almora perfect destination seeking scenic view heritagestyle ambience located conveniently mall road hotel offers plenty parking space vehicles take beauty sprawling lawn promises make photo taken look absolutely picturesque rooms specious room service greatstaffs friendly give special assistance kids elderly hotel arranged taxi cab local sight seeing pocket friendly driver thapa ji goodeven one get drop service kausani ranikhet nainital hotel great place stay"
            ]
        },
        {
            "name": "Sunita Elite by Xperience",
            "rating": [
                4.8
            ],
            "address": [
                "Mall Rd, opposite K.M.O.U Bus Station, near SBI Bank, Paltan Bazar, Dharanaula, Almora, Sarso, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "It's in the heart of the Almora market. Spent 1 night with family. Room was with Morden facilities and views form the room was stunning.  Main lift from the reception was not working so needed to walk long as well as needed to climb some steps. Service was good. Food was okay okay type not great. Overall good experience",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "If you are planning on a trip to almora by your own vehicle where parking is a literal constraint, then you need a hotel with parking & that said & depending upon your budget, this hotel checks most of the requirements.\n\nIt is just located on the main mall road as you enter almora & offers inhouse restaurant, attached bar & decent rooms for family.Food quality is very good with reasonable cost, service is fast.It even had a thick book for tourist attractions at nearby places.\n\nLocation is prime & just into the main market so if you want to explore any nearby markets even after evening, you have the liberty. however nearby markets are not worthy  but thats a diferent story.\n\nFrom here you can get bus , taxi etc for travel to nearby tourist attractions as on some roads big vehicles might be an issue.\n\nRooms are clean, reception staff honest & humble & i liked my stay here.\n\nInfact just to quote..i paid one day charges extra & i remembered it after i left almora.Still the reception staff arranged & reversed my surplus payment.So thats something commendable.\n\nHowever if you want a lonely sight seeing place , morning fresh air & views, solace...then search further.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It's a great experience with sunita ellite almora value for money, it was clean, stylish comffy rooms with excellent service iin where I had a dinner food was delicious and the staff are polite and well behaved specially Mr. Karan, great ambience wiith great view sure I will visit again soon with my family",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Awesome hotel. Ample car parking space and very supportive staff.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Excellent stay .polite staff nd good food .must stay in almora .rooms are clean nd well furnished.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "heart almora market spent night family room morden facilities views form room stunning main lift reception working needed walk long well needed climb steps service good food okay okay type great overall good experience",
                "planning trip almora vehicle parking literal constraint need hotel parking said depending upon budget hotel checks requirements located main mall road enter almora offers inhouse restaurant attached bar decent rooms familyfood quality good reasonable cost service fastit even thick book tourist attractions nearby places location prime main market want explore nearby markets even evening liberty however nearby markets worthy thats diferent story get bus taxi etc travel nearby tourist attractions roads big vehicles might issue rooms clean reception staff honest humble liked stay infact quotei paid one day charges extra remembered left almorastill reception staff arranged reversed surplus paymentso thats something commendable however want lonely sight seeing place morning fresh air views solacethen search",
                "great experience sunita ellite almora value money clean stylish comffy rooms excellent service iin dinner food delicious staff polite well behaved specially mr karan great ambience wiith great view sure visit soon family",
                "awesome hotel ample car parking space supportive staff",
                "excellent stay polite staff nd good food must stay almora rooms clean nd well furnished"
            ]
        },
        {
            "name": "Hotel Himadri",
            "rating": [
                3.9
            ],
            "address": [
                "Inter College, Udaldunga, Mall Rd, near Almora, Khatyari, Almora, Khagmara Kote, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "View from hill facing rooms are nice but overall experience is not good at all. More yhan 85% food items in the menu were not available. Rooms and blankets were not clean enough. We had to ask them to change the pillow covers and blanket cover as it was smelling of deodorant used by the previous boarder. Dustbin in the washroom was dirty as well.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is a budget hotel near vivekanand college located at starting of mall road. Main mall road is around 1.5 KMs far from here.\n\nWe booked deluxe room for 2 adults and 2 children under 6 years age. Rooms and washroom were neat and clean with good mattress.\n\nStaff and management was helpful.\n\nTariff was economical. 1568 for deluxe room including taxes.\n\nMall road was at walking distance. We did walk to mall road in evening.\n\nWe got the room at back side so did not get any view from room.\n\nAmple covered parking space for 6 to 8 cars so you do not have to worry about parking.\n\nFood was average and there is a lot of scope for improvement. Maybe the owners need to talk to chef about food quality. Pricing of food was reasonable.\n\nAll in all, a good hotel with very reasonable tariff if you are not looking for luxury stay.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Average hotel in Kausani. Location is nice. View of Himalaya mountains is great. But the hotel itself is average. Rooms are small with bad lighting. Also rooms are not hygienic. The feel good is not in the room. We reached late in Kausani so we had no choice but to go for it. The main pros for this place are\n1. Great view of Himalaya and\n2. Easy to reach.\n3. Hotel owner was very humble and kind\nCons for this place\n1. Small rooms with bad lighting\n2. Not hygienic\n3. Room service is below average",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "•Rooms and washrooms are spacious and clean.\n•Mattresses are comfortable.\n•Heaters and blowers here mostly do not work.\n•Food isn't good as such. The kitchen closes at 9 or 10 pm.\n•There are spacious wardrobes.\n•Services are fine. Recommended for short stay.\n•Selected staff is nice and well-behaved. The people at reception are quite pestering.\n•I had dropped my earphones here at the terrace by mistake which got stolen later. So, this place remains less reliable for me.\n• No WiFi available.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We booked room via agoda , when we reached ,  there was a person sitting in reception told us that they do not accept bookings from agoda.\nAnd He directly said no to us, and when I asked about refund he told me to ask agoda for that.\n\nAfter intervention from local administration he asked his manager to send the mail immediately.\n\nWe have no choice other than stay there as it was evening. He told us only executive room worth 2000 is available.\nThe room was dirty , towels were not clean and worst things there were cockroaches everywhere, When we complained same to that man he told guest throw away foods here and there so there may be cockroaches.\n\nThe owner of property does not reside there , they should hire some professionals to take care of property.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "view hill facing rooms nice overall experience good yhan food items menu available rooms blankets clean enough ask change pillow covers blanket cover smelling deodorant used previous boarder dustbin washroom dirty well",
                "budget hotel near vivekanand college located starting mall road main mall road around kms far booked deluxe room adults children years age rooms washroom neat clean good mattress staff management helpful tariff economical deluxe room including taxes mall road walking distance walk mall road evening got room back side get view room ample covered parking space cars worry parking food average lot scope improvement maybe owners need talk chef food quality pricing food reasonable good hotel reasonable tariff looking luxury stay",
                "average hotel kausani location nice view himalaya mountains great hotel average rooms small bad lighting also rooms hygienic feel good room reached late kausani choice go main pros place great view himalaya easy reach hotel owner humble kind cons place small rooms bad lighting hygienic room service average",
                "â\u0080¢rooms washrooms spacious clean â\u0080¢mattresses comfortable â\u0080¢heaters blowers mostly work â\u0080¢food isnt good kitchen closes pm â\u0080¢there spacious wardrobes â\u0080¢services fine recommended short stay â\u0080¢selected staff nice wellbehaved people reception quite pestering â\u0080¢i dropped earphones terrace mistake got stolen later place remains less reliable â\u0080¢ wifi available",
                "booked room via agoda reached person sitting reception told us accept bookings agoda directly said us asked refund told ask agoda intervention local administration asked manager send mail immediately choice stay evening told us executive room worth available room dirty towels clean worst things cockroaches everywhere complained man told guest throw away foods may cockroaches owner property reside hire professionals take care property"
            ]
        },
        {
            "name": "Mehra Cottage",
            "rating": [
                4.6
            ],
            "address": [
                "lower mall road Roadways workshop Almora Bus terminal, Paltan Bazar, Dharanaula, Almora, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Experience Tranquility at Mehra Cottage, Almora, Uttarakhand\n\nNestled amidst the breathtaking landscapes of Almora, Mehra Cottage is a serene haven that embodies the essence of a perfect getaway. From the moment you step foot into this charming abode, you're greeted with unparalleled warmth and hospitality that rivals the comfort of home.\n\nThe staff at Mehra Cottage stands out for their remarkable cooperation and genuine care, ensuring that every guest feels like family. Their attentive service creates an atmosphere of ease and relaxation, making your stay a delightful experience.\n\nThe owner's presence adds a personal touch to your visit. Their dedication to ensuring guests' satisfaction is evident in every aspect of the cottage. Whether offering local insights, arranging activities, or simply ensuring your comfort, their friendly demeanor and helpful nature elevate your stay to an unforgettable level.\n\nThe cottage itself exudes a rustic charm combined with modern amenities, offering a perfect balance between comfort and a traditional mountain retreat. Each room is meticulously designed, providing a cozy ambiance that resonates with the surrounding natural beauty.\n\nThe location is simply breathtaking, allowing you to immerse yourself in the tranquility of the Uttarakhand hills. The scenic views from Mehra Cottage are mesmerizing, inviting you to unwind and rejuvenate amidst nature's embrace.\n\nFor those seeking solace, beauty, and exceptional hospitality, Mehra Cottage in Almora, Uttarakhand, is an absolute gem. It's a place where every moment becomes a cherished memory, leaving you longing to return to its serene embrace time and again.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I along with my family recently stayed at this property for two days. The stay was excellent, staff is so courteous which made us comfortable and create the perfect environment. The food was the perfect end to our day.\nThe vast cottage is situated at lower Mall road where one can enjoy the nature. There  were rare species of birds.  The owner  also very humble. You enjoy a spectacular view from terrace of cottage, mountains and greenery around. Most important night view of Almora and nearby area from this cottage is precious thing during whole stay. There is enough space on terrace of cottage for kids to spent there vacation time and enjoy the nature. You can click and retain specious memories from there. I would like to visit and stay here again and highly recommend to my friends and family.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Worst experience I’ve ever had.\nThe photos and property that is shown are wrong. This is just a small house with 2 floors  and this is not a hotel. This homestay is not for family and the vibes are so bad that it is difficult to even stay there for a minute.\nThe rooms are so small and very bad hygiene even the attitude of the receptionist was so rude that shows too much negativity.\n\n* The other mentioned reviews are fake and paid",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The place is absolute value for money. Their homestay has a vibe that will make you wanna come back to Almora. Shankar bhaiya and Mehra uncle are super hospitable and friendly. It's a budget stay so do not compare with the luxury ones. They have a super homely vibe. They have open terrace where you can party and eat your meals just right outside the rooms. It is well decorated and lit. They also have local food available at a very reasonable price. It was a absolute delight to stay Mehra cottage.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Worth the price, good food and the most important thing is the hospitality they provide is great. No overcharges were there. Overall a good recommended place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience tranquility mehra cottage almora uttarakhand nestled amidst breathtaking landscapes almora mehra cottage serene embodies essence perfect getaway moment step foot charming abode youre greeted unparalleled warmth hospitality rivals comfort home staff mehra cottage stands remarkable cooperation genuine care ensuring every guest feels like family attentive service creates atmosphere ease relaxation making stay delightful experience owners presence adds personal touch visit dedication ensuring guests satisfaction evident every aspect cottage whether offering local insights arranging activities simply ensuring comfort friendly demeanor helpful nature elevate stay unforgettable level cottage exudes rustic charm combined modern amenities offering perfect balance comfort traditional mountain retreat room meticulously designed providing cozy ambiance resonates surrounding natural beauty location simply breathtaking allowing immerse tranquility uttarakhand hills scenic views mehra cottage mesmerizing inviting unwind rejuvenate amidst natures embrace seeking solace beauty exceptional hospitality mehra cottage almora uttarakhand absolute gem place every moment becomes cherished memory leaving longing return serene embrace time",
                "along family recently stayed property two days stay excellent staff courteous made us comfortable create perfect environment food perfect end day vast cottage situated lower mall road one enjoy nature rare species birds owner also humble enjoy spectacular view terrace cottage mountains greenery around important night view almora nearby area cottage precious thing whole stay enough space terrace cottage kids spent vacation time enjoy nature click retain specious memories would like visit stay highly recommend friends family",
                "worst experience iâ\u0080\u0099ve ever photos property shown wrong small house floors hotel homestay family vibes bad difficult even stay minute rooms small bad hygiene even attitude receptionist rude shows much negativity mentioned reviews fake paid",
                "place absolute value money homestay vibe make wan na come back almora shankar bhaiya mehra uncle super hospitable friendly budget stay compare luxury ones super homely vibe open terrace party eat meals right outside rooms well decorated lit also local food available reasonable price absolute delight stay mehra cottage",
                "worth price good food important thing hospitality provide great overcharges overall good recommended place stay"
            ]
        },
        {
            "name": "Hotel Shivalik River Retreat",
            "rating": [
                4.1
            ],
            "address": [
                "River Point, Kosi, NH-87, Dhamuwa Kanala, Uttarakhand 263643, India"
            ],
            "reviews": [
                {
                    "text": "Hotel placed at excellent location . having good & cozy rooms with good space . we stayed there for 2 days .staff is very good & supportive . food served was delicious & fresh. i recommend stay  for family's too. there family rooms are very good . if i visit again i will love to stay there.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We stayed at Shivalik for one night (25-Nov). The rooms are very spacious, cozy and neat-clean. Kosi river flows along the property, making it a cooler place, with a temple around as well facilitating a serene vibe.\nBesides, the staff is pretty supportive and generous. Food is good too. Great service. Had a worthy stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I visited this property with my family and pet (Siberian husky) . The staff was well mannered and the owner was welcoming. Food here was delicious especially mouthwatering mint chutney. The open terrace has a beautiful view of the kosi river and shiv Mandir. It's a divine and peaceful experience. Will visit soon and will surely recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Had a stay 5 days out here as we had to attend training at VPKAS, Hawalbagh, Almora. The rooms were nice and clean. Basic necessities were provided. The staffs were great. The foods provided were also great. They catered the food according to our tastes and appetite as most of the trainees got sick or upset stomach due to the terrain and weather. The location is 12 kms away from Almora town near to the river Kosi and walkable distance from Kosi Bazar around 1.5 kms. Grocery shops, SBI Bank and ATM are available within the vicinity of the hotel. WiFi is available 30 Mbps max download. Transportation to Almora town can done through share taxis, buses etc. Overall had a great stay, u can book the hotel for good stay.\n\nNote: The entrances of the hotel will be closed after 9:00-10:00 pm",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Had a great stay at Hotel for 5 long days. Staff were warm and humble providing necessary services as per our need. View from the hotel were scenic",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel placed excellent location good cozy rooms good space stayed days staff good supportive food served delicious fresh recommend stay familys family rooms good visit love stay",
                "stayed shivalik one night nov rooms spacious cozy neatclean kosi river flows along property making cooler place temple around well facilitating serene vibe besides staff pretty supportive generous food good great service worthy stay",
                "visited property family pet siberian husky staff well mannered owner welcoming food delicious especially mouthwatering mint chutney open terrace beautiful view kosi river shiv mandir divine peaceful experience visit soon surely recommend",
                "stay days attend training vpkas hawalbagh almora rooms nice clean basic necessities provided staffs great foods provided also great catered food according tastes appetite trainees got sick upset stomach due terrain weather location kms away almora town near river kosi walkable distance kosi bazar around kms grocery shops sbi bank atm available within vicinity hotel wifi available mbps max download transportation almora town done share taxis buses etc overall great stay u book hotel good stay note entrances hotel closed pm",
                "great stay hotel long days staff warm humble providing necessary services per need view hotel scenic"
            ]
        },
        {
            "name": "Hotel Milam Inn",
            "rating": [
                3.8
            ],
            "address": [
                "Upper link Road, Tilakpur, near GGIC School, near Allahabad Bank, Paltan Bazar, Dharanaula, Almora, Uttarakhand 263601, India"
            ],
            "reviews": [
                {
                    "text": "Staff isn't good. Need to learn 'Hospitality'\nLocation is good though, have good parking space. However in terms of vacation, not much recommended. TV broken, Very late service for tea and water in the morning. Food is fine though.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very good place to live here, near and clean rooms, good room service, they also serve veg and non veg dishes view side rooms, owner Mr Bisht and other staff members r very good and soft spoken, you will get value of your money",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This is the restaurant in Hotel Milam Inn. Even though it looks good the food worst 👎👎👎. We ordered our food at 6:00 pm in evening and we got our dinner at 11:00 at night, can you just imagine. We ordered egg chow mein, chicken manchurian, kashmiri alu dum and fried egg.\nYou won't believe that the chow mein had such nasty smell that you would feel like vomiting but still as I ordered it I decided to taste it. But the moment I put it in my mouth I literally spit it out,  it was so slimy and nasty . As it was egg chow mein there is supposed to be egg in it but to be honest I didn't find a single piece of egg in it.\nWhen I complained them they totally rejected it. My blood was boiling out of anger.\n\nThe Chicken Manchurian, you expect it to have gravy , but they provided us with dry chicken sticks. Still we accepted it but the chicken was so hard and tasteless that 5 piece of chicken was wasted.\nCan you just imagine how the food was😫😫.\nThese were the main problems and other than these , the fried eggs were raw, we found strands of hair in our food and etc.\n\nOverall it was a horrible experience literally horrible.\n\nYou would find my review very long and boring but  PLEASE!! I request you to read it before dining here.\nDon't repeat my mistake and don't waste your money.\nIt's my earnest request to you all.\nThank you.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst experience ever.\nNo geyser or hot water facility after requesting several times.\nWorst washroom.\nNo exhaust fan.Absolutely pathetic.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It was a pleasant experience, service and proper hygiene was there. Heart of the city",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff isnt good need learn hospitality location good though good parking space however terms vacation much recommended tv broken late service tea water morning food fine though",
                "good place live near clean rooms good room service also serve veg non veg dishes view side rooms owner mr bisht staff members r good soft spoken get value money",
                "restaurant hotel milam inn even though looks good food worst ð\u009f\u0091\u008eð\u009f\u0091\u008eð\u009f\u0091\u008e ordered food pm evening got dinner night imagine ordered egg chow mein chicken manchurian kashmiri alu dum fried egg wont believe chow mein nasty smell would feel like vomiting still ordered decided taste moment put mouth literally spit slimy nasty egg chow mein supposed egg honest didnt find single piece egg complained totally rejected blood boiling anger chicken manchurian expect gravy provided us dry chicken sticks still accepted chicken hard tasteless piece chicken wasted imagine food wasð\u009f\u0098 « ð\u009f\u0098 « main problems fried eggs raw found strands hair food etc overall horrible experience literally horrible would find review long boring please request read dining dont repeat mistake dont waste money earnest request thank",
                "worst experience ever geyser hot water facility requesting several times worst washroom exhaust fanabsolutely pathetic",
                "pleasant experience service proper hygiene heart city"
            ]
        }
    ]
}