{
    "places_with_reviews": [
        {
            "name": "GREEN ORAA HOMESTAY AHWA",
            "rating": [
                4.1
            ],
            "address": [
                "37, Sunset Road, beside Seva dham, Hilltop Society, Shastry Colony, Ahwa, Gujarat 394710, India"
            ],
            "reviews": [
                {
                    "text": "Best in Ahwa.\nIf you're willing to stay Ahwa or Saputara, stay here. Best view and rooms",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place, Nice people,, very friendly Bharat bhai, I must thank you for tea on closed Saturday of Ahwa. Be aware that last Saturday  Ahwa market will be totally closed even now tea stall will be open. Very nice view and locality.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Thank you so much Bharat bhai and Sharmila ji🙏 It's the best place to stay at Ahwa. It's a homestay with the feel of home. We stayed there for a few weeks. Their home is ideally situated, just around the famous sunset point. I enjoy photography, and got a few amazing shots of the sunset and surrounding nature. The cherry on top is that the owners are really caring and loving. The rooms are airy, beautiful, clean, and with an attached bathroom. I'll always remember this place. It was a wonderful stay. Thank you again 🙏🙏",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Size of room too big\nCleanliness excallant\nHospitality nice\nFeel safe like home.\nOnly bad thing is the aproach to green orra stay is too small and drive through is tough if cars comes from both end\nBut though i can say i will come again if i plan ahwa",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stay was comfortable. Basic rooms and friendly staff. No food available. Had to arrange it from outside.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best ahwa youre willing stay ahwa saputara stay best view rooms",
                "nice place nice people friendly bharat bhai must thank tea closed saturday ahwa aware last saturday ahwa market totally closed even tea stall open nice view locality",
                "thank much bharat bhai sharmila jið\u009f\u0099\u008f best place stay ahwa homestay feel home stayed weeks home ideally situated around famous sunset point enjoy photography got amazing shots sunset surrounding nature cherry top owners really caring loving rooms airy beautiful clean attached bathroom ill always remember place wonderful stay thank ð\u009f\u0099\u008fð\u009f\u0099\u008f",
                "size room big cleanliness excallant hospitality nice feel safe like home bad thing aproach green orra stay small drive tough cars comes end though say come plan ahwa",
                "stay comfortable basic rooms friendly staff food available arrange outside"
            ]
        },
        {
            "name": "Hotel Maa Shakti",
            "rating": [
                4.6
            ],
            "address": [
                "Panchli Colony, Ahwa, Gujarat 394710, India"
            ],
            "reviews": [
                {
                    "text": "A great place for stay with comfortable rooms and good food as vell the location is also great for night stay during traveling or exploring the Dang 🤩",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Suberb experience... Please visit",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Neat and clean area  Rooms available for stay at reasonable prices..with parking facility... offering various Punjabi, gujarati, chinese delicious food .👌🏻",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nice place on nature's lap.\nOnce visit with family",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very nice place sweet recipe",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great place stay comfortable rooms good food vell location also great night stay traveling exploring dang ð\u009f¤©",
                "suberb experience please visit",
                "neat clean area rooms available stay reasonable priceswith parking facility offering various punjabi gujarati chinese delicious food ð\u009f\u0091\u008cð\u009f\u008f »",
                "nice place natures lap visit family",
                "nice place sweet recipe"
            ]
        },
        {
            "name": "Dosti Ahwa",
            "rating": [
                4.3
            ],
            "address": [
                "Mission colony, near church, Ghandhi Colony, Ahwa, Gujarat 394710, India"
            ],
            "reviews": [
                {
                    "text": "🤞🤞🤞🤞",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ð\u009f¤\u009eð\u009f¤\u009eð\u009f¤\u009eð\u009f¤\u009e"
            ]
        },
        {
            "name": "Star hotel",
            "rating": [
                "Unknown"
            ],
            "address": [
                "QM6V+3QG, Panchli Colony, Ahwa, Gujarat 394710, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}