{
    "places_with_reviews": [
        {
            "name": "Avadh Heritage Resort",
            "rating": [
                4
            ],
            "address": [
                "Varudi, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "Third class  dealer cause cheating with me what he said n gave me room is different without telling me.  Took double the price then our group. No kettle in room no napkins no service on last day.  Licage in bathroom.   Breakfast worst.   Lower staff was good.  But u have to call them.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "There is no hot water to shower .The water heater is too small and the hot water will be for only a minute and no more. No kettles for boiling water  and to have tea or coffee in the rooms. Need to clean rooms. The breakfast  is pathetic  . Also tea served in small paper cups. You have to ask for things.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The rooms are spacious and awesome. Reception Service is a bit sluggish but overall good. Food was good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We stayed there for 2 nights and the staff was through out very rude. A lady in restaurant served us cold buffet and kept us waiting for hot food and evntually shouted and fought with us. Management did not care to respond or take any action. VITS is some management company who has sourced some worst possible staff for the property. It is a plain wedding business hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The taste was awesome, and food quality was superb, even service was good...one of the best restaurant in amreli with quality food 👍🏻👍🏻",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "third class dealer cause cheating said n gave room different without telling took double price group kettle room napkins service last day licage bathroom breakfast worst lower staff good u call",
                "hot water shower water heater small hot water minute kettles boiling water tea coffee rooms need clean rooms breakfast pathetic also tea served small paper cups ask things",
                "rooms spacious awesome reception service bit sluggish overall good food good",
                "stayed nights staff rude lady restaurant served us cold buffet kept us waiting hot food evntually shouted fought us management care respond take action vits management company sourced worst possible staff property plain wedding business hotel",
                "taste awesome food quality superb even service goodone best restaurant amreli quality food ð\u009f\u0091\u008dð\u009f\u008f » ð\u009f\u0091\u008dð\u009f\u008f »"
            ]
        },
        {
            "name": "Angel Lords Eco Inn Amreli",
            "rating": [
                4.4
            ],
            "address": [
                "Old APMC, Market Yard Rd, Amreli Irrigation Division, D.L.B. Society, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "HELLO SIR,\n\nI CAME TO YOUR HOTEL FOR LUNCH, YOUR FOOD WAS THIRDCALSS QUALITY AND THE QUALITY OF 200ML WATER BOTTLE IN RECEPTION IS VERY BAD PLEASE EXCHANGE IT WITH BISLERI.\n\nPLEASE AUCTION ON THIS COMPLAIN OTHERWISE I WILL NEVER COME IN YOUR HOTEL.🙁",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It was great experience. I am stayed in room no 104 and I would like to give one small suggestion about room toilet facility. The toilet jet should be on right hand side but it is installed on left hand side. Which is very much difficult to handle.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Excellent place 5o stay. The road to hotel may you feel lost to wrong place but, once you enter the premises, it's not Amreli like small town.\n\nStaff is so courteous at both reception and restaurant. The allocated parking is also very nice.\n\nFull marks",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Staff was inexperienced,\nThis is not staff mistakes, because manager *Dipak Sharma* doesn’t know about anything as a manager post. So staff can follow him too.\nMini bar is useless.\nNo proper communication.\nAlways charge for extra money.\nUseless place\nAfter leave hotel they are frightened us about police complaints.\n\nDear sir\nIf your payment is not made by 48 hours , a police complaint will be lodged in the name of the guest.\nRegards : Hotel Front Office Department\n\nOther guest also seen message like on top, they are treated as a animal\n\nSo be aware other guests.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Our stay at Hotel Angel Lords Amreli was marred by a regrettable encounter with the manager, Dipak Sharma. His rude behavior, including yelling at us, was entirely unacceptable and a stark departure from the level of service one would expect, especially during a special occasion like a honeymoon.\n\nTo compound matters, we were charged incorrectly, further highlighting serious issues with the hotel's billing accuracy. The combination of a manager's disrespectful conduct and erroneous charges has left an indelibly negative impression on our experience. We hope that the management takes these concerns seriously, as they significantly impacted what was meant to be a joyous and memorable stay.\n\nAdding to the dismay, our disappointment with Hotel Angel Lords Amreli escalated when we received a threatening message. Shockingly, the hotel management not only mishandled our concerns but took it a step further by threatening us with a police complaint. Such unprofessional conduct and intimidation tactics are utterly unacceptable and further tarnish the reputation of the establishment\n\nDuring our honeymoon at Hotel Angel Lords Amreli, the experience was far from what we had anticipated. To our dismay, we were charged extra for items that were supposed to be complimentary. This unexpected and unwarranted expense was frustrating, especially during such a special occasion.\n\nWhat added to the disappointment was the behavior of the hotel staff. Their conduct was nothing short of the worst. Instead of addressing our concerns with courtesy and understanding, they exhibited a lack of professionalism that left a lasting negative impression.\n\nA honeymoon is meant to be a time of joy and celebration, but our experience at Hotel Angel Lords Amreli cast a shadow over these precious moments. It's disheartening when an establishment fails to meet the expectations, especially during such a significant milestone. Our hope is that this feedback serves as a warning to others considering this hotel for their special occasions.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hello sir came hotel lunch food thirdcalss quality quality ml water bottle reception bad please exchange bisleri please auction complain otherwise never come hotelð\u009f\u0099\u0081",
                "great experience stayed room would like give one small suggestion room toilet facility toilet jet right hand side installed left hand side much difficult handle",
                "excellent place stay road hotel may feel lost wrong place enter premises amreli like small town staff courteous reception restaurant allocated parking also nice full marks",
                "staff inexperienced staff mistakes manager dipak sharma doesnâ\u0080\u0099t know anything manager post staff follow mini bar useless proper communication always charge extra money useless place leave hotel frightened us police complaints dear sir payment made hours police complaint lodged name guest regards hotel front office department guest also seen message like top treated animal aware guests",
                "stay hotel angel lords amreli marred regrettable encounter manager dipak sharma rude behavior including yelling us entirely unacceptable stark departure level service one would expect especially special occasion like honeymoon compound matters charged incorrectly highlighting serious issues hotels billing accuracy combination managers disrespectful conduct erroneous charges left indelibly negative impression experience hope management takes concerns seriously significantly impacted meant joyous memorable stay adding dismay disappointment hotel angel lords amreli escalated received threatening message shockingly hotel management mishandled concerns took step threatening us police complaint unprofessional conduct intimidation tactics utterly unacceptable tarnish reputation establishment honeymoon hotel angel lords amreli experience far anticipated dismay charged extra items supposed complimentary unexpected unwarranted expense frustrating especially special occasion added disappointment behavior hotel staff conduct nothing short worst instead addressing concerns courtesy understanding exhibited lack professionalism left lasting negative impression honeymoon meant time joy celebration experience hotel angel lords amreli cast shadow precious moments disheartening establishment fails meet expectations especially significant milestone hope feedback serves warning others considering hotel special occasions"
            ]
        },
        {
            "name": "Hotel Darshan",
            "rating": [
                3.6
            ],
            "address": [
                "Station Rd, D.L.B. Society, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "They deserved lest than 1 star cz there is name of customer service i been waiting for hot water since one hour nd some show up said  whatever is coming that’s the hot water!! I was like seriously\nBut anyway check before you get room !!",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "My worst experience till date. Have to stay in hotel.\nDidn't know how to talk to customers. I was told that customers like you are not needed. I was given checkout time of 10:30 and I left the room at 10:45. I am 15 minutes late Because of which I had to listen so bad",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Staff behaviour not good,  Wifi not available, very bad hotel, for lunch & dinner menu card as compair to physically rates are different.\nPlease avoid to book this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Rest everything is good but the power cut issue. I stayed there for 6 hours and thrice i observed power cut. Electricity was there only for 1 hour and i had to check out and move to another hotel at noon.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Do not stay here if you are traveling. The room smells because there is sewage nearby.\nHot water geysers weren’t working and so compact spaces compared to the price.\nOwners are very rude, will not give you respect and response.\nHope this helps everyone.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "deserved lest star cz name customer service waiting hot water since one hour nd show said whatever coming thatâ\u0080\u0099s hot water like seriously anyway check get room",
                "worst experience till date stay hotel didnt know talk customers told customers like needed given checkout time left room minutes late listen bad",
                "staff behaviour good wifi available bad hotel lunch dinner menu card compair physically rates different please avoid book hotel",
                "rest everything good power cut issue stayed hours thrice observed power cut electricity hour check move another hotel noon",
                "stay traveling room smells sewage nearby hot water geysers werenâ\u0080\u0099t working compact spaces compared price owners rude give respect response hope helps everyone"
            ]
        },
        {
            "name": "HOTEL neptune inn - Best Hotel, Room Booking, Budget Hotels, Ac Hotels",
            "rating": [
                4.5
            ],
            "address": [
                "Street No. 5, Manekpara, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "smelly rooms - there is a sewage gutter next to the hotel and you will get stinking smell in all bathrooms - avoid this hotel. The night shift reception guy is a rude and arrogant clown",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very large and spacious rooms, good location, nice ambience, clean n quite good rooms n facilities. Parking is at open space.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Best newest open hotel at Amreli nice big rooms",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Spacious and clean rooms\nService is also very good\nStaff is very cooperative",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good Hotel but service is Poor\nOut side food is nt much hygiene to order\nFood not served just parcel given as per order\nSpecious room and ok for short stay\nPreferable",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "smelly rooms sewage gutter next hotel get stinking smell bathrooms avoid hotel night shift reception guy rude arrogant clown",
                "large spacious rooms good location nice ambience clean n quite good rooms n facilities parking open space",
                "best newest open hotel amreli nice big rooms",
                "spacious clean rooms service also good staff cooperative",
                "good hotel service poor side food nt much hygiene order food served parcel given per order specious room ok short stay preferable"
            ]
        },
        {
            "name": "HOTEL neptune",
            "rating": [
                3.9
            ],
            "address": [
                "Street Number 2, Manekpara, of, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "So nice place to stay here,\nService is very good,\nPerfect receptionist staff and other staff members,\nThey are so good behaving with everyone\nClean and neet rooms,\nAnd nice atmosphere.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good sarvice and mentenas Staff but parking issue only room is well mentioned",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very bad experience at this hotel ,must say this place could be not considered as staying option . No proper cleaning, not good room service, and staff behaviour is rude, as per rent it's not worthy, they charged too much but service are very disgusting....rooms are so dirty ...if u want to spoil your vacation must visit!",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This Hotel is nearby Rajkot Bus Stand.. Properties is new and room and staff also good .. but I feel space of room is less.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "No proper service, No cleanliness, Rent is high as compared to service and rooms, No proper answer to queries.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place stay service good perfect receptionist staff staff members good behaving everyone clean neet rooms nice atmosphere",
                "good sarvice mentenas staff parking issue room well mentioned",
                "bad experience hotel must say place could considered staying option proper cleaning good room service staff behaviour rude per rent worthy charged much service disgustingrooms dirty u want spoil vacation must visit",
                "hotel nearby rajkot bus stand properties new room staff also good feel space room less",
                "proper service cleanliness rent high compared service rooms proper answer queries"
            ]
        },
        {
            "name": "Hotel Angel",
            "rating": [
                3.8
            ],
            "address": [
                "Bhagwati Chowk, Station Rd, opp. Sudarshan Eye hospital, Manekpara, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "It's situated in the main market of Amreli, so problem starts with car parking on every entry occation! Staff service is good but rooms r too small. Family from big city would not rate this hotel as 3 Star!!!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "A dismal dining experience unfolded at the restaurant—subpar food made with expired ingredients, a shortage of menu items, and semi-skilled staff confessing to the culinary missteps, leaving an overall unsatisfactory impression.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Budget friendly , helpful staff",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "No parking spaces. Rooms are also not good as per room fare.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Let me divide this review in three sections\n1 location and parking:\nThe hotel is located in middle of the town. You can have easy access to bus stand and main market.\nParking is bit small that's why I cut one star.\n2 rooms and room service :\nRooms size was average. The good thing is bathroom. It was large and everything was working properly.\nRoom service was up to the mark.\n3 food:\nFood was good. They served hot in our room. The complimentary breakfast was up to the mark.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "situated main market amreli problem starts car parking every entry occation staff service good rooms r small family big city would rate hotel star",
                "dismal dining experience unfolded restaurantâ\u0080\u0094subpar food made expired ingredients shortage menu items semiskilled staff confessing culinary missteps leaving overall unsatisfactory impression",
                "budget friendly helpful staff",
                "parking spaces rooms also good per room fare",
                "let divide review three sections location parking hotel located middle town easy access bus stand main market parking bit small thats cut one star rooms room service rooms size average good thing bathroom large everything working properly room service mark food food good served hot room complimentary breakfast mark"
            ]
        },
        {
            "name": "RadheShyam Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "RADHESHYAM CHOKDI,Gavadka Road Bay Pass Amreli Bay Pass Road, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "Bcoz it's open I just gave a review.\nIt's a pathetic service and food quality.\nThere are no other options in this areas.\nI'm from Vadodara.\nThis people have to understand how to behave and manage food quality.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We visited this restaurant while returning from Diu. I must say this hotel was our life saver as we looked for restaurants as we were starving a lot and there were no good restaurants on our route. Finally we reached and ordered food.\nRegarding Service/Staffs : I must say, service was best and staff were very polite and professional. We were really happy with the person who was serving food for us.\n\nRegarding food quality : Food was tasty and fresh. Chhanch was awesome. It was an odd time for lunch but still they prepared and served fresh food to us. The quantity was also good.\n\nLocation: Location is perfect as you can locate it from the road.\n\nParking Space : Plenty of space available for parking.\n\nOther attractions - You can enjoy Paan and Kulhad wali Chai. Also branded chocolates are available.\n\nSo overall, I recommend this restaurant. You will surely enjoy their service and food.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Horrible manager. We literally cancelled our order and came out. He told us on face that we have taken an hour to order. Who the hell gives menu and stands in front of us while we are deciding what to order? Every damn restaurant gives us time to decide and come back to take the order. He told he is the only one available to take orders. That's why he was pressuring us🙄\nHe should have given us time to decide the order. Horrible guy. The way he spoke made us walk out.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food test is Ok ok type. One time you may visit.\nFood quality is also average.\n\nService is good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The food was tasty\nMeans they provide taste according to ur requirements\nRotla was so crispy\nTasted so good with dal fry",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bcoz open gave review pathetic service food quality options areas im vadodara people understand behave manage food quality",
                "visited restaurant returning diu must say hotel life saver looked restaurants starving lot good restaurants route finally reached ordered food regarding servicestaffs must say service best staff polite professional really happy person serving food us regarding food quality food tasty fresh chhanch awesome odd time lunch still prepared served fresh food us quantity also good location location perfect locate road parking space plenty space available parking attractions enjoy paan kulhad wali chai also branded chocolates available overall recommend restaurant surely enjoy service food",
                "horrible manager literally cancelled order came told us face taken hour order hell gives menu stands front us deciding order every damn restaurant gives us time decide come back take order told one available take orders thats pressuring usð\u009f\u0099\u0084 given us time decide order horrible guy way spoke made us walk",
                "food test ok ok type one time may visit food quality also average service good",
                "food tasty means provide taste according ur requirements rotla crispy tasted good dal fry"
            ]
        },
        {
            "name": "Hotel Shree Paras",
            "rating": [
                3.7
            ],
            "address": [
                "Bus Stand, opp. S.T, D.L.B. Society, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "The room was not clean and the bedsheets, pillow covers and blanket all were dirty. The location is good as it is close to the bus stand.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice hotel i stay 2 day with best service",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Amazing and beautiful room with all luxury items",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "A Satisfied experience. The rooms are decent with clean toilets.(AC rooms). Provision for Hot Water is available. Vicinity is great to shop around and also for eateries and restaurants. Prices are affordable",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Not a good Hotel to Stay as the Service was not up to mark and the Hotel Incharge Ramesh very Rude, non cooperative, proudy and pathetic person. No respect for Customers.\nThird class Hotel in Amreli with Rude Staff.\nVisit if you wanna spoil your mood and trip.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room clean bedsheets pillow covers blanket dirty location good close bus stand",
                "nice hotel stay day best service",
                "amazing beautiful room luxury items",
                "satisfied experience rooms decent clean toiletsac rooms provision hot water available vicinity great shop around also eateries restaurants prices affordable",
                "good hotel stay service mark hotel incharge ramesh rude non cooperative proudy pathetic person respect customers third class hotel amreli rude staff visit wan na spoil mood trip"
            ]
        },
        {
            "name": "Hotel City Palace",
            "rating": [
                4
            ],
            "address": [
                "OPP MAIN BUS STAND, BUS STAND, ROAD, D.L.B. Society, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "Nice room, very comfortable.staff are good, specially shivam bhai, Manager is very helpful",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice cosy and affordable rooms...any1 coming to Amreli for business trips or couples who arrive here to connect to Rajkot, Bhavnagar or to Diu......will like. Not recommended for those looking for something very lavish and spacious. Food is great. Room service is also fine. Overall great and recommended.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Cleaning, Services and behaviour was very good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel City palace is a one of the good hotels in Amreli with all amenities to make your stay comfortable, there is a restaurant attached which serves breakfast, lunch and dinner. Since it is located on third floor of city point complex there is a lift which has a generator backup, located just opposite to Amreli bus depot. Rooms are clean and spacious. Room service is also good. There are VVIP rooms available as well. Ample Parking available in the basement. Overall a good place.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The Ambience is pretty good! Rates are quite affordable. Food was amazing and Service is satisfactory as well.\n\nBut, Room size was smaller then expected.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice room comfortablestaff good specially shivam bhai manager helpful",
                "nice cosy affordable roomsany coming amreli business trips couples arrive connect rajkot bhavnagar diuwill like recommended looking something lavish spacious food great room service also fine overall great recommended",
                "cleaning services behaviour good",
                "hotel city palace one good hotels amreli amenities make stay comfortable restaurant attached serves breakfast lunch dinner since located third floor city point complex lift generator backup located opposite amreli bus depot rooms clean spacious room service also good vvip rooms available well ample parking available basement overall good place",
                "ambience pretty good rates quite affordable food amazing service satisfactory well room size smaller expected"
            ]
        },
        {
            "name": "The Grand SURYA _ Surya Garden Restaurant",
            "rating": [
                3.9
            ],
            "address": [
                "opp airport, Chital Rd, Yamuna Park, Amreli, Gujarat 365601, India"
            ],
            "reviews": [
                {
                    "text": "It is very good place they have party plot place also I visited it for rongotsav at surya garden on Holi the Holi event food organized by this restaurant it very high quality food and it's unlimited food very nice taste also. I loved this place very good place I Loved also this event very good place for party also. Want to visit one time in Amreli",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very nice food 🤤🤤🤤 osm test",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Ordered Punjabi items. Taste is great, full marks for it. However, staff is mostly untrained and completely lacks courtesy. Ambience is average with moulded plastic chairs which are worn out.\nOverall the quality of service suffers big time for the menu rates this restaurant charges. Expect a roadside eatery like service.\n\nLocation & Accessibility: Great\nFood: Great\nParking: Great\nService: Poor\nBehaviour: Average",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The grand Surya hotel was a awesome and place is peaceful..\nWe are celebrating our ring ceremony, birthday celebration, family function and staff behaviour is very very nice and catering services is Also good..\nAnd must try hotels menu finger liking food provides and healthy food our experience was a best or osm..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's one of the old and best restaurant available in Amreli. It's has garden within it so you can call it garden restaurant also. They provide it during marriage function, birthday celebration and engagement ceremony. Food is really tasty and awesome. They have Chinese, Punjabi and Gujarati options. Their Manchurian are really good!! Outside it there is food plaza where you can find dosa and fast food. Must visit when you are in Amreli.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place party plot place also visited rongotsav surya garden holi holi event food organized restaurant high quality food unlimited food nice taste also loved place good place loved also event good place party also want visit one time amreli",
                "nice food ð\u009f¤¤ð\u009f¤¤ð\u009f¤¤ osm test",
                "ordered punjabi items taste great full marks however staff mostly untrained completely lacks courtesy ambience average moulded plastic chairs worn overall quality service suffers big time menu rates restaurant charges expect roadside eatery like service location accessibility great food great parking great service poor behaviour average",
                "grand surya hotel awesome place peaceful celebrating ring ceremony birthday celebration family function staff behaviour nice catering services also good must try hotels menu finger liking food provides healthy food experience best osm",
                "one old best restaurant available amreli garden within call garden restaurant also provide marriage function birthday celebration engagement ceremony food really tasty awesome chinese punjabi gujarati options manchurian really good outside food plaza find dosa fast food must visit amreli"
            ]
        }
    ]
}