{
    "places_with_reviews": [
        {
            "name": "Hotel Masineni Grand",
            "rating": [
                4.1
            ],
            "address": [
                "15/184, Raju Rd, Kamalanagar, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "Petals restaurant food service is bad on Saturdays and charging more by not serving displayed food items. There is no welcome drink and sweet served on Saturdays. Too many staff no proper organising",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The food at your hotel was really amazing. Depth of flavor and freshness was felt in every dish. Heartfelt thanks for the chef's artistry and the hard work of the team. This experience will always be remembered.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Masineni Grand: A Fusion of Elegance and Comfort\n\nMy recent stay at Masineni Grand was nothing short of exceptional. From the moment I stepped into the lobby, I was greeted by a sense of sophistication that extended throughout my entire experience.\n\nThe hotel's architecture seamlessly blends modern design with traditional elements, creating a captivating ambiance. The staff, notably courteous and attentive, made check-in effortless and offered a warm welcome, setting the tone for my stay.\n\nThe room itself was a haven of comfort. Impeccably clean and tastefully decorated, it exuded a sense of tranquility that made it easy to unwind after a long day of travel. The bed was luxurious and provided a restful night's sleep, while the amenities provided were of top-notch quality.\n\nOne highlight was the culinary experience. The hotel's restaurant served an array of delectable dishes that tantalized the taste buds. From local delicacies to international cuisines, each meal was a delightful journey of flavors. Moreover, the presentation and service were impeccable, adding an extra touch of elegance to every dining experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place, cleaning is good and room service is excellent. A middle class can afford the price. Stayed with my loved one and both loved this place.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Hotel Masineni Grand, and it was an experience worth celebrating. From the moment I entered the lobby, I was impressed by the warm and welcoming atmosphere.\n\nThe staff at Masineni Grand went above and beyond to make my stay enjoyable. Their hospitality was exceptional, and every team member was attentive, friendly, and eager to assist. It truly made me feel like a valued guest.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "petals restaurant food service bad saturdays charging serving displayed food items welcome drink sweet served saturdays many staff proper organising",
                "food hotel really amazing depth flavor freshness felt every dish heartfelt thanks chefs artistry hard work team experience always remembered",
                "masineni grand fusion elegance comfort recent stay masineni grand nothing short exceptional moment stepped lobby greeted sense sophistication extended throughout entire experience hotels architecture seamlessly blends modern design traditional elements creating captivating ambiance staff notably courteous attentive made checkin effortless offered warm welcome setting tone stay room comfort impeccably clean tastefully decorated exuded sense tranquility made easy unwind long day travel bed luxurious provided restful nights sleep amenities provided topnotch quality one highlight culinary experience hotels restaurant served array delectable dishes tantalized taste buds local delicacies international cuisines meal delightful journey flavors moreover presentation service impeccable adding extra touch elegance every dining experience",
                "nice place cleaning good room service excellent middle class afford price stayed loved one loved place",
                "recently pleasure staying hotel masineni grand experience worth celebrating moment entered lobby impressed warm welcoming atmosphere staff masineni grand went beyond make stay enjoyable hospitality exceptional every team member attentive friendly eager assist truly made feel like valued guest"
            ]
        },
        {
            "name": "Alexander Luxury Hotel",
            "rating": [
                3.9
            ],
            "address": [
                "11-120, opp. Municipal Corp, Sapthagiri Circle, Sai Nagar, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "Truly a masterpiece hotel in regards to the amenities and luxury being provided for a Tier-II city.\nFrankly speaking when we had booked the place we weren’t expecting it to be at this level.\nWhen it comes to the team they are truly friendly and ready to help, especially Mr. Rajesh who is the General Manager of the property.\nHats off to the team and do ensure to maintain the standards provided as of date always…",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The service was awesome and restaurant service was done by all women really felt happy with their service. The girl who served us Vasantha she made us to felt like homely.Finaly good experience",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Sorry to say it was a very bad experience we had in our stay to attend a friend's marriage Feb 2024, Very poor in customer service and management.\nAdhoc charge discussion happened in during 11PM in night when night shift operater came and hav a long unpleasant experience thereafter. So\ni request friends reading this post pls ensure to gather room all details in prior about, availability, occupancy duration and additional charges to avoid last minute hazzle.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel location is good and rooms are of decent quality but service is very bad. Staff needs to be trained to handle customers nicely. For 2 plus persond, service provided is for just 1 person ... simple things like towels etc ... food not impressed at all ... breakfast served is cold and no info on the menu. Staff is cold shoulder attitude towards customers during breakfast. As usual need to fallowup multiple times for food.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Worst Front office Staffing. We came here for friends marriage and booked 2 rooms at this hotel. While we came here we didn't get the room for allotted time and delayed by more than 1 hour. Then they given a 1 room to freshup and another room alloted after 3 hours, in the conversation they didn't explained about extra person charge and making check out delayed.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "truly masterpiece hotel regards amenities luxury provided tierii city frankly speaking booked place werenâ\u0080\u0099t expecting level comes team truly friendly ready help especially mr rajesh general manager property hats team ensure maintain standards provided date alwaysâ\u0080¦",
                "service awesome restaurant service done women really felt happy service girl served us vasantha made us felt like homelyfinaly good experience",
                "sorry say bad experience stay attend friends marriage feb poor customer service management adhoc charge discussion happened pm night night shift operater came hav long unpleasant experience thereafter request friends reading post pls ensure gather room details prior availability occupancy duration additional charges avoid last minute hazzle",
                "hotel location good rooms decent quality service bad staff needs trained handle customers nicely plus persond service provided person simple things like towels etc food impressed breakfast served cold info menu staff cold shoulder attitude towards customers breakfast usual need fallowup multiple times food",
                "worst front office staffing came friends marriage booked rooms hotel came didnt get room allotted time delayed hour given room freshup another room alloted hours conversation didnt explained extra person charge making check delayed"
            ]
        },
        {
            "name": "Hotel Rajahamsa",
            "rating": [
                4.3
            ],
            "address": [
                "Opposite APS RTC bustand Lane, Venugopal Nagar, Old Town, Old Town, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "The place is, in one word, flashy. Rooms plush, lights dim, curtains heavy and walls adorned. A little too much for people like me. But nothing in there that made our stay bad.\n\nHowever, the family that took the adjacent room to ours had to relocate to a different one. Apparently the tap system's lever there malfunctioned.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Rooms are neat. Service is good. It's near the bus stop which is in the middle of the city, so don't expect better views.\nSatisfies the range of a 3 star hotel.\nBut price is too high. Could have got better hotels in metropolitan area for the same price. Approx 3500 per day for a couple room.\nSpecial mention about breakfast. Complimentary breakfast is very good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "My stay at this hotel was nothing short of a nightmare. The interior of the room did not appear good, overly ornate with its walls, windows, or lighting.\n\nFirst and foremost, the flush in my room was out of order, which was extremely inconvenient. The extra bed was so uncomfortable that I had trouble getting a good night's sleep.\n\nTo make matters worse, when I ventured outside of my room, the entire area had a foul and nauseating odor. It seemed as if there were serious cleanliness issues in the hotel.\n\nThe buffet was a major disappointment. The food quality was abysmal, and it left a lot to be desired. I couldn't even find a decent meal.\n\nOverall, my experience here was unsatisfactory, and I strongly suggest avoiding scheduling a stay at this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Rooms are very neat and clean with royal look and towels are folded into two swans. The food is very delicious, fish biryani and paneer 65 is amazing, and the fried chicken is also very tasty. There is a nice rooftop restaurant along with swimming pool. I really loved the 24/7 hot water facility",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Rooms are excellent and with plenty of space. Small selection of breakfast buffet but you can order a lot of things. Service is kind of slow but that didn't really matter much in my case. Bad location on the side of a road and no view in the room I got.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place one word flashy rooms plush lights dim curtains heavy walls adorned little much people like nothing made stay bad however family took adjacent room relocate different one apparently tap systems lever malfunctioned",
                "rooms neat service good near bus stop middle city dont expect better views satisfies range star hotel price high could got better hotels metropolitan area price approx per day couple room special mention breakfast complimentary breakfast good",
                "stay hotel nothing short nightmare interior room appear good overly ornate walls windows lighting first foremost flush room order extremely inconvenient extra bed uncomfortable trouble getting good nights sleep make matters worse ventured outside room entire area foul nauseating odor seemed serious cleanliness issues hotel buffet major disappointment food quality abysmal left lot desired couldnt even find decent meal overall experience unsatisfactory strongly suggest avoiding scheduling stay hotel",
                "rooms neat clean royal look towels folded two swans food delicious fish biryani paneer amazing fried chicken also tasty nice rooftop restaurant along swimming pool really loved hot water facility",
                "rooms excellent plenty space small selection breakfast buffet order lot things service kind slow didnt really matter much case bad location side road view room got"
            ]
        },
        {
            "name": "HOTEL GARLICA GRAND",
            "rating": [
                4.7
            ],
            "address": [
                "1-1338-4, Hyderabad - Bangalore Hwy, Rudrampeta, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "Located right besides highway on the service road, easy to access but have to make a U-turn of 1km if coming from Bengaluru, it can get noisy. There's a lift but didn't find a staircase! Rooms are spacious, got AC, cupboard, water kettle, and TV with Internet. Car parking is available besides hotel. Building got 4 floors and underground parking. Overall good.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Hotel and Room was hygienic with the facility of freshness. 24 hrs hot water and Free WiFi service. Management and Service boys are good manner. Value for Money.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Rooms are too good, wash area is a bit messy. It's bit over priced compared to to the same type of hotel at other place. Excellent service and very cooperative staff. Good hospitality. Situated beside highway and a bit distant from anantapur town. For dining not available at the spot you must to explore a bit. Overall experience is good.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good hotel.  Value for money.\nNo breakfast\nBut location wise little far from bus stand and railway station.\nPeople going towards hyderabad or bangalore in car  it's on the highway.\nFor me it's very near to my work place.\nUse to stay in higher tarrif hotel.\nThis gives the same experience",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good ambience,Room cleanliness good & polite staff. Smooth Check in & Check out process",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located right besides highway service road easy access make uturn km coming bengaluru get noisy theres lift didnt find staircase rooms spacious got ac cupboard water kettle tv internet car parking available besides hotel building got floors underground parking overall good",
                "hotel room hygienic facility freshness hrs hot water free wifi service management service boys good manner value money",
                "rooms good wash area bit messy bit priced compared type hotel place excellent service cooperative staff good hospitality situated beside highway bit distant anantapur town dining available spot must explore bit overall experience good",
                "good hotel value money breakfast location wise little far bus stand railway station people going towards hyderabad bangalore car highway near work place use stay higher tarrif hotel gives experience",
                "good ambienceroom cleanliness good polite staff smooth check check process"
            ]
        },
        {
            "name": "Hotel SR Grand",
            "rating": [
                4.1
            ],
            "address": [
                "6-5-246, 80 Feet Rd, Andhra Bank Colony, Ram Nagar, Maruthi Nagar, Anantapur, Andhra Pradesh 515004, India"
            ],
            "reviews": [
                {
                    "text": "Very good rooms ..neat and clean..but dedicated parking for hotel I'd not available",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Decent lodge with restaurant. Restaurant boasts of serving ‘bongu’ biryani (biryani cooked in a bamboo). The quality of meat (lamb in our case) was dismal which brought down the rating considerably. If one wants to taste this speciality expect to pay for the flavor (which was no great shakes either) and do not expect much for meat.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Fantastic food and nice service and with a politeness good place to visit with family nd will experience the best of it",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Awesome service and excellent view  .. this is d one of d best restaurant in anantapur...very friendly staff 🥰 naresh service is excellent",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is very tasty and decent service by Ankit Rawat. Excellent menu and quality is good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good rooms neat cleanbut dedicated parking hotel id available",
                "decent lodge restaurant restaurant boasts serving â\u0080\u0098bonguâ\u0080\u0099 biryani biryani cooked bamboo quality meat lamb case dismal brought rating considerably one wants taste speciality expect pay flavor great shakes either expect much meat",
                "fantastic food nice service politeness good place visit family nd experience best",
                "awesome service excellent view one best restaurant anantapurvery friendly staff ð\u009f¥° naresh service excellent",
                "food tasty decent service ankit rawat excellent menu quality good"
            ]
        },
        {
            "name": "Hotel Sapthagiri Balla",
            "rating": [
                3.8
            ],
            "address": [
                "Sapthagiri Circle, opposite Municipal office, Sai Nagar, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "Good ambiance, good service.\nThe day when  I check in the hotel, restaurant is not working.\nHotel is in prime location we didn’t find the any difficult to find restaurants.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good peaceful stay , nice staff at reception, well maintained ,overall good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good Rooms , Good hygiene, Spice garden food also hygiene and tasty. Fav restaurant in ATP",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Really good and Value for Money hotel.\nRooms are speckless and staff were friendly.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Went to this location to book room, just surprised with their tariffs, having very old and cigarette flavoured rooms. Came back immediately and got very good room in affordable prices near to same location. Stil it is mistory how it is 3 star hotel 🤧🤧🤧",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good ambiance good service day check hotel restaurant working hotel prime location didnâ\u0080\u0099t find difficult find restaurants",
                "good peaceful stay nice staff reception well maintained overall good",
                "good rooms good hygiene spice garden food also hygiene tasty fav restaurant atp",
                "really good value money hotel rooms speckless staff friendly",
                "went location book room surprised tariffs old cigarette flavoured rooms came back immediately got good room affordable prices near location stil mistory star hotel ð\u009f¤§ð\u009f¤§ð\u009f¤§"
            ]
        },
        {
            "name": "Sree Theja Residency",
            "rating": [
                4.9
            ],
            "address": [
                "Bellary - Uravakonda - Anantapur Rd, Azad Nagar, Kovur Nagar, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "Very good service,  we were received well and made the arrangements as requested. A perfect place to stop and stay after tired drive. Rooms are neat and well maintained.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Good Location to stay in Bellery Road,Located to Hyderabad-Bengaluru Highway.Reception and Maintenance Staff Good response with Guests.Reasonable price in Ànanthapur Town.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best rooms in less cost ..A/c are best while comparing with non A/c rooms.\n\nWater and electricity facility is awesome 👍👍 kindly visit this residency while visiting anantapur",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Rooms were clean and comfortable with all basic stuff which includes towel soaps mosquito repellent etc.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Friendly staff and flexible service , cleaning is very good and , I like their support and I like the way they are treating , overall good service .",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good service received well made arrangements requested perfect place stop stay tired drive rooms neat well maintained",
                "good location stay bellery roadlocated hyderabadbengaluru highwayreception maintenance staff good response guestsreasonable price ã\u0080nanthapur town",
                "best rooms less cost ac best comparing non ac rooms water electricity facility awesome ð\u009f\u0091\u008dð\u009f\u0091\u008d kindly visit residency visiting anantapur",
                "rooms clean comfortable basic stuff includes towel soaps mosquito repellent etc",
                "friendly staff flexible service cleaning good like support like way treating overall good service"
            ]
        },
        {
            "name": "Hotel Pasupala residency",
            "rating": [
                3.9
            ],
            "address": [
                "12-5-406, Housing board, 80 Feet Rd, near Ram naresh function hall, Housing Board Colony, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "We've booked the whole place (all rooms ) for guests for a wedding. The place was pretty decent. Value for money. Service can be better.\n\nOverall good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The Executive Room is a little bit smaller than usual...\nGood service with a smiling face..\nComplicated to reach RTC complex and Rlwy jn.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good residency and good services,\nClean and good rooms\n\nMy rating 4/5",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I just had a stopover for a night to catch up on sleep on my way to hyderabad from Tamilnadu. Though I have got the deal at a low budget, rooms were not neat. Could find cockroaches and the ac water was leaking inside the room.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Bad location first it placed in between houses, no privacy and rooms are also so small and having bad smell, person at desk also have bad attitude has no good response.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "weve booked whole place rooms guests wedding place pretty decent value money service better overall good",
                "executive room little bit smaller usual good service smiling face complicated reach rtc complex rlwy jn",
                "good residency good services clean good rooms rating",
                "stopover night catch sleep way hyderabad tamilnadu though got deal low budget rooms neat could find cockroaches ac water leaking inside room",
                "bad location first placed houses privacy rooms also small bad smell person desk also bad attitude good response"
            ]
        },
        {
            "name": "Hotel Sri7 Inn",
            "rating": [
                3.4
            ],
            "address": [
                "Gooty Rd, beside Sree7 Convention, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "I would  just like to say that this is very bad hotel we have stayed in.\nWe had booked 2 rooms in this hotel through Agoda a day prior to our visit. Unfortunately,  we were late to reach. It was around 9.30 Pm when we reached.\nWhen we first arrived, we were told that price shown online through agoda was very less and we were asked to pay extra amount or we need to cancel the room. As it was late, with kids and family,we had no other options other than staying. We paid extra and agreed to stay. When we went to room, we could see cockroaches moving around and we didn't get proper hot water for bathing.\nTotally very bad experience of stay here.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Worst service received,, booked room on Oyo with 1140.. they charged me 1400 after reaching there,\nAC wont work to adjust temperature.\nThe bathrooms were slippery, with all yellow stains, hairs and rubbish..",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "1. The worst stay I have ever stayed in my entire life. They charged me as they run a 4 star hotel. When we open the room the complete room was visible. No privacy and not recommended for family or couples to stay.\n2. No TV connection. They said they disconnected the cable services since Corona days and I stayed for a night on 17 May 2023.\n3. They didn't provide me a glass for drinking water. After I asked what kind of a hotel, then they gave me a disposable paper cup.\n4. After I opened my suitcase for changing my clothes, I tried to close the window curtains. The complete curtain with the curtain rod had fallen down. later I fixed it and opened the bathroom where I was surprised to see the condition of the bathroom. Pathetic,  Even the flush was not working\n5. Finally, the best part was, the receptionist was requesting me to give good rating while was checking out.\nThe owner might be least interested.\nAll the travel agents should take out this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "No cleanliness in rooms, rude staff, mosquitoes and what not, very bad experience not worth the money",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Worst hotel ever visited, booked online, but they are not ready to accept booking. I paid extra money after lot of discussion",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "would like say bad hotel stayed booked rooms hotel agoda day prior visit unfortunately late reach around pm reached first arrived told price shown online agoda less asked pay extra amount need cancel room late kids familywe options staying paid extra agreed stay went room could see cockroaches moving around didnt get proper hot water bathing totally bad experience stay",
                "worst service received booked room oyo charged reaching ac wont work adjust temperature bathrooms slippery yellow stains hairs rubbish",
                "worst stay ever stayed entire life charged run star hotel open room complete room visible privacy recommended family couples stay tv connection said disconnected cable services since corona days stayed night may didnt provide glass drinking water asked kind hotel gave disposable paper cup opened suitcase changing clothes tried close window curtains complete curtain curtain rod fallen later fixed opened bathroom surprised see condition bathroom pathetic even flush working finally best part receptionist requesting give good rating checking owner might least interested travel agents take hotel",
                "cleanliness rooms rude staff mosquitoes bad experience worth money",
                "worst hotel ever visited booked online ready accept booking paid extra money lot discussion"
            ]
        },
        {
            "name": "Neem Tree Hotel (A boutique stay)",
            "rating": [
                4.9
            ],
            "address": [
                "Sunkanna Bhavan, Yes Bank building, Ram Nagar Flyover, Ram Nagar, Aravinda Nagar, Anantapur, Andhra Pradesh 515001, India"
            ],
            "reviews": [
                {
                    "text": "the hotel staff is highly praised by many guests with their friendly and excellent service. The great location near hyway in City with easy access to transportation makes it convenient for guests. The range received positive feedback from guests. The spacious and clean rooms make for a peaceful stay",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "As a frequent traveller to the town i must say this hotel has to be one of the best i have stayed. They have very good rooms with corporate style interiors and facilities. The staff was well behaved and informative with travel related quires and bookings.\nBest part being they have parking facility for the guests which is a big relief.\nI recommend this hotel for anyone who is travelling alone/friends or even with family.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "My stay at the lodging hotel was a truly exceptional experience. From the warm welcome at check-in to the impeccable service throughout, the staff went above and beyond to ensure my comfort. The room was not just a space; it was a haven of relaxation with thoughtful details. The attention to detail and genuine hospitality created a memorable stay. I highly recommend this hotel for anyone seeking a delightful blend of comfort and top-notch service.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The hotel staff is very friendly and polite. Rooms and common areas are fully hygienic and clean all the time. We enjoyed the stay to the fullest.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Honor of the property is really caring for the guest. You'll get all the comfort there. They are just amazing book the room without a second thought. Its really nearby to national highway also",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel staff highly praised many guests friendly excellent service great location near hyway city easy access transportation makes convenient guests range received positive feedback guests spacious clean rooms make peaceful stay",
                "frequent traveller town must say hotel one best stayed good rooms corporate style interiors facilities staff well behaved informative travel related quires bookings best part parking facility guests big relief recommend hotel anyone travelling alonefriends even family",
                "stay lodging hotel truly exceptional experience warm welcome checkin impeccable service throughout staff went beyond ensure comfort room space relaxation thoughtful details attention detail genuine hospitality created memorable stay highly recommend hotel anyone seeking delightful blend comfort topnotch service",
                "hotel staff friendly polite rooms common areas fully hygienic clean time enjoyed stay fullest",
                "honor property really caring guest youll get comfort amazing book room without second thought really nearby national highway also"
            ]
        }
    ]
}