{
    "places_with_reviews": [
        {
            "name": "Bakkhali Eco Park & Tents",
            "rating": [
                4.2
            ],
            "address": [
                "Lakshmipur Abad, West Bengal 743339, India"
            ],
            "reviews": [
                {
                    "text": "Good rooms but the room service was not that great. Everything there was pricey and had slow service. Food is great and they even have a beach nearby. Great place to go with friends and family but everything there was overpriced and had slow service that made us wait for a long time. Main beaches are a little far so I recommend to take other totos and not the ones they give from the resort because they charge more.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The experience is truly serene. It's located a Km before the Main Bakkhali Beach where most of the Hotels are cramped. It will be best if you stay here with your own mode of transport (They do have open parking within the premises). The staff is attentive and will try to provide resolutions to the best of their abilities. The Tents are clean and cleaned regularly. The staff did inquire if we would like to get our tent cleaned on the second day of our stay. The suite bathrooms were clean although a little small (but you can't expect more from a tent). Bonus, it has a small Pine Tree Forest where you can click noice photos. Also privacy shouldn't be an issue.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's a very family friendly resort. All time under CCTV under. Very nice atmosphere. tent are very nice. Most nice thing it's a attached toilet. Also include AC, TV. Hot water service. Most of beautiful thing stuff behaviour fantastic. One of stuff name Biswajit was a nice person. Most of all nice experience",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's a Pleasant experience. Specially mention the Service. The Boys are Very Good in Management and providing Good Service to the dwellers. Laxmipur Beach can be called the Personal Beach for the property and this is the best part of our stay. Food quality is average, but their politeness makes it tastier 😊. Overall it was a nice experience for us.\nSuggestion - The property can be A Pet Friendly Property because of its space - it is A Request to the Owners of the Property to think on this, as We have very very less properties as Pet friendly property in West Bengal and in India as well.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This place was really nice... tent outstanding. View very good. Food also outstanding. All over very nice place. Good atmosphere. And main thing 1 stuff name Biswajit very nice. Very polite & hard working boy.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good rooms room service great everything pricey slow service food great even beach nearby great place go friends family everything overpriced slow service made us wait long time main beaches little far recommend take totos ones give resort charge",
                "experience truly serene located km main bakkhali beach hotels cramped best stay mode transport open parking within premises staff attentive try provide resolutions best abilities tents clean cleaned regularly staff inquire would like get tent cleaned second day stay suite bathrooms clean although little small cant expect tent bonus small pine tree forest click noice photos also privacy shouldnt issue",
                "family friendly resort time cctv nice atmosphere tent nice nice thing attached toilet also include ac tv hot water service beautiful thing stuff behaviour fantastic one stuff name biswajit nice person nice experience",
                "pleasant experience specially mention service boys good management providing good service dwellers laxmipur beach called personal beach property best part stay food quality average politeness makes tastier ð\u009f\u0098\u008a overall nice experience us suggestion property pet friendly property space request owners property think less properties pet friendly property west bengal india well",
                "place really nice tent outstanding view good food also outstanding nice place good atmosphere main thing stuff name biswajit nice polite hard working boy"
            ]
        },
        {
            "name": "Hotel Icon Heritage",
            "rating": [
                3.9
            ],
            "address": [
                "National Highway 12 Mouza Laxmipur, Amrabati, P.O- Frazerganj coastal, Bakkhali, Lakshmipur Abad, West Bengal 743339, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is excellent. All stuffs are very good and cooperative. The food is really tasty & delicious. Rooms are well decorated and the pool was very well maintained. Overall we enjoyed staying over there.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Me &my family visited last week.The hotel is excellent.The room was very good and bathroom was clean. The poolwas very well maintained. Food quality is very nice. Excellent staff behaviour specially Manab , yetish , subham , Mithun , Arijit , Ram , pulak.If we come to bakkhali again, we will stay here.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "A budget friendly property just adjacent to the sea beach. Rooms are spacious but few developments are required for a more travel friendly property like: -\nA. To add a landline in the room for calling reception and kitchen.\nB. Although the TV was installed, no channels were displayed.\nC. The bed was more like a stone bed not at all comfortable.\nD. The parking inside the hotel is too small one has to park his/her car in an open space adjacent to the property.\nE. Few necessary items (Like Water) were being charged above MRP which I found to be very surprising. Management must look into this as they know that the same is illegal.\nOverall a budget friendly and good place to chill with friends and family.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We went with a family of 22 people over there. We really liked the swimming pool, the furnitures and the common space they had in between the rooms. Some of the rooms had some incomplete features may be due to the fact that the building was built very recently. Other than that, everything was working. We had all our meals over there. Food quality is okay. Overall we enjoyed staying over there.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is excellent, perhaps the best in Bakkhali. It is very close to the centre. The beach is just beside the hotel. There are Toto drivers beside the beach to take you sightseeing. The staff is very cooperative. The food is really good. Delicious and stomach friendly at the same time. The hotel is sprawling and lovely for night time walks. Great experience. If we come to bakkhali again, which we will, we will stay here for sure.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel excellent stuffs good cooperative food really tasty delicious rooms well decorated pool well maintained overall enjoyed staying",
                "family visited last weekthe hotel excellentthe room good bathroom clean poolwas well maintained food quality nice excellent staff behaviour specially manab yetish subham mithun arijit ram pulakif come bakkhali stay",
                "budget friendly property adjacent sea beach rooms spacious developments required travel friendly property like add landline room calling reception kitchen b although tv installed channels displayed c bed like stone bed comfortable parking inside hotel small one park hisher car open space adjacent property e necessary items like water charged mrp found surprising management must look know illegal overall budget friendly good place chill friends family",
                "went family people really liked swimming pool furnitures common space rooms rooms incomplete features may due fact building built recently everything working meals food quality okay overall enjoyed staying",
                "hotel excellent perhaps best bakkhali close centre beach beside hotel toto drivers beside beach take sightseeing staff cooperative food really good delicious stomach friendly time hotel sprawling lovely night time walks great experience come bakkhali stay sure"
            ]
        },
        {
            "name": "HOTEL DEEPAK",
            "rating": [
                3.8
            ],
            "address": [
                "Frazer Gunj, Bakkhali, West Bengal 743357, India"
            ],
            "reviews": [
                {
                    "text": "I have a decent experience there. Room and room service very good. Time cruised well in swimming pool. A stone throw from fresergang beach which is being renovated. Food quality is wonderfully good, though price is a bit high than average.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Recently visited this property on 27.10.2023. Its a huge property. The manager and all the staff members were courteous and well behaved. They have a inhouse kitchen and bar. The food quality and quantity both were extremely well maintained. The beach is more than 1km away from this property.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room no. 215. Filthy and dirty and alarmingly unhygienic.\nRooms are horribly unclean with broken bed, dirty mattress, pillows and linen. The AC hums so loud, I had to switch it off at night. TV doesn't work, and is covered in dust.The icing is the washroom which is comparable to public urinals with the stench and slime and mould. This place is similar to cheap motels which rent rooms by the hour.\nIt was a nightmare and regret staying at this sleazy place.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I have been going to that place for a long time but today I went to this hotel for the first time. It is one of the oldest hotels in this place. One and a half kilometers from sea beach but the place is not bad. A large garden hanging system, a small water fall, a marriage hall is the perfect place.Hotel rooms are also good AC non AC. I will not say that the quality of the food is bad, the quality of the food is also good, fresh fish is available, you can try it. This hotel has a bar where you can get fish items, chicken items, salads and kind of beverages is available. Compared to other Metrocityies, the hotel bar rates here are a little lower. There may be many more hotels near sea beach but in case if never get hotel booking then definitely book this hotel. I can recommend.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The Hotel  Deepak is in good location with nature  attached with good services by all team of Hotel Deepak,\n\nVery much satisfactory with happy moment",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent experience room room service good time cruised well swimming pool stone throw fresergang beach renovated food quality wonderfully good though price bit high average",
                "recently visited property huge property manager staff members courteous well behaved inhouse kitchen bar food quality quantity extremely well maintained beach km away property",
                "room filthy dirty alarmingly unhygienic rooms horribly unclean broken bed dirty mattress pillows linen ac hums loud switch night tv doesnt work covered dustthe icing washroom comparable public urinals stench slime mould place similar cheap motels rent rooms hour nightmare regret staying sleazy place",
                "going place long time today went hotel first time one oldest hotels place one half kilometers sea beach place bad large garden hanging system small water fall marriage hall perfect placehotel rooms also good ac non ac say quality food bad quality food also good fresh fish available try hotel bar get fish items chicken items salads kind beverages available compared metrocityies hotel bar rates little lower may many hotels near sea beach case never get hotel booking definitely book hotel recommend",
                "hotel deepak good location nature attached good services team hotel deepak much satisfactory happy moment"
            ]
        },
        {
            "name": "Hotel Amarabati",
            "rating": [
                3.7
            ],
            "address": [
                "National Highway 117, Bakkhali, West Bengal 743357, India"
            ],
            "reviews": [
                {
                    "text": "It is one of the luxury hotels to be found within a standard price range. The rooms are spacious and comfortable. There's a very well maintained swimming pool at the backside of the hotel. The food and services are of great quality. Also, the prices are quite affordable.\n\nOverall a very good place for a stay of 1 or 2 days.\n\nHowever, the only drawback for some might be the distance from the beach, which is again less than 5 minutes via Toto or Car. And all the places to visit like, Henry Island, Kargil Beach, Etc. are within 15-20 mins distance from the hotel.\n\nAnyhow, according to me this place is very much recommended.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "One of the good hotels in Bakkhali. Not much far from the beach approx 1.5 km from the beach.\nGot the rooms for 3000/- including breakfast.\nThere is a restaurant in the hotel which serve good food.\nThe rooms were clean and the floor of the room has carpet. The washroom has a geyser and Bathtub.\nThere is also a swimming pool. It was fun swimming there.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Stayed in super deluxe with AC, rooms are clean and tidy , but not like real super deluxe. But overall rooms are good and clean. The back side pool view was awesome. Well behaved staff.\nRestaurant food was good, well behaved restaurant staff.\nThey have elevator.\nOverall experience was very good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Budget friendly hotel and food. Food is good in both quality and quantity. Behaviour is nice. Looking for a short and budget friendly tour? Go for it!!! Good place for couples too!!!",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "My room was spacious, well-maintained, and offered a breathtaking view of the surrounding area. The bed was exceptionally comfortable, and the room amenities were well thought out, enhancing the overall comfort of my stay.\n\nThe staff exhibited a high level of professionalism and courtesy throughout my stay. They were quick to address any queries or requests, making me feel valued as a guest.\n\nOverall , it was delightful experience",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one luxury hotels found within standard price range rooms spacious comfortable theres well maintained swimming pool backside hotel food services great quality also prices quite affordable overall good place stay days however drawback might distance beach less minutes via toto car places visit like henry island kargil beach etc within mins distance hotel anyhow according place much recommended",
                "one good hotels bakkhali much far beach approx km beach got rooms including breakfast restaurant hotel serve good food rooms clean floor room carpet washroom geyser bathtub also swimming pool fun swimming",
                "stayed super deluxe ac rooms clean tidy like real super deluxe overall rooms good clean back side pool view awesome well behaved staff restaurant food good well behaved restaurant staff elevator overall experience good",
                "budget friendly hotel food food good quality quantity behaviour nice looking short budget friendly tour go good place couples",
                "room spacious wellmaintained offered breathtaking view surrounding area bed exceptionally comfortable room amenities well thought enhancing overall comfort stay staff exhibited high level professionalism courtesy throughout stay quick address queries requests making feel valued guest overall delightful experience"
            ]
        },
        {
            "name": "Tapama Resort",
            "rating": [
                4.8
            ],
            "address": [
                "NH12, Bakkhali, Susni Island, West Bengal 743339, India"
            ],
            "reviews": [
                {
                    "text": "Excellent, courteous and helpful staff. Rooms are clean and functional. The resort is at very close proximity from the sea beach; specially from the hidden gems of Kargil Beach and the upcoming sensation, Frasenganj Beach. The night spend well with friends and excellent host.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A very beautiful resort in a great environment, surrounded by nature, away from all the crowds.  Staffs are very nice and very helpful.  Excellent food quality.  Really want to go again and again...  And the sea is very close within 500 meters.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "They are very much cooperative. Every stuffs are like family. Rabin da was very good to us. He arranged for us everything. We are fully satisfied.oh! One more thing Tapama Resort is kind of budget friendly also and 5 minutes distance from the beach ❤",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It was the worst experience, I pre-booked a Tent which was near the beach as per the photo and when reached the resort I saw the tent was near the bathroom and the beach far as far from the resort. They told me that they'd set the tent in the room like what a stupid idea it was. They don't know how to behave with guests. That's why left the resort I did not stay there I left on the same day after seeing all this nonsense and they did not refund my money yet.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very poor experience, the caretaker refused the room at n arrival whereas our rooms were pre booked.\nBehaved very rudely.\nThe food was really bad in terms of preparation, not sure what type of oil they use ..\nThe water in washroom was very fishy in n smell..",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent courteous helpful staff rooms clean functional resort close proximity sea beach specially hidden gems kargil beach upcoming sensation frasenganj beach night spend well friends excellent host",
                "beautiful resort great environment surrounded nature away crowds staffs nice helpful excellent food quality really want go sea close within meters",
                "much cooperative every stuffs like family rabin da good us arranged us everything fully satisfiedoh one thing tapama resort kind budget friendly also minutes distance beach â\u009d¤",
                "worst experience prebooked tent near beach per photo reached resort saw tent near bathroom beach far far resort told theyd set tent room like stupid idea dont know behave guests thats left resort stay left day seeing nonsense refund money yet",
                "poor experience caretaker refused room n arrival whereas rooms pre booked behaved rudely food really bad terms preparation sure type oil use water washroom fishy n smell"
            ]
        },
        {
            "name": "BALAKA LODGE",
            "rating": [
                3.9
            ],
            "address": [
                "PO, L.Prabartak, Bakkhali, West Bengal 743357, India"
            ],
            "reviews": [
                {
                    "text": "Very good location with very prompt room service .. well mannered staff. Food quality is very good and tasty.. hygienic place.. you can come here with family and friends. Safe place",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Best stay in Bakkhali... Had been there few days back.. it possess all the essential needs which makes a hotel remarkable. The food, the behaviour of the staff, the location, the room everything is great.. specially a guy in the restaurant named Amar, he is a gem, whenever we need anything he was there. They take extra care to make the food for my two years baby. Want to be there again and Again.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "After seeing photos of this lodge in YouTube,I decided to stay here for two nights. I was deeply disappointed. Rooms were clean and well maintained. But service was bad. TV channels were all deactivated, geezers did not work. Food quality was mediocre and prices were too high. I would definitely not recommend this Lodge to my friends.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The manager is excessively shrewd, nagging, persuasive and manipulative. Room is extremely small compared to the price. Not kid-friendly at all.\nTry to push their foods to the customer. However, the other staffs are friendly and helpful.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel is good for staying purposes, however I would prefer to avoid their restaurant, food was not up to the mark, they served stale fish and even vegetable curry was not good. Overall location is fine but room tariffs were bit high. If you prefer having normal meal then better to try outside.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good location prompt room service well mannered staff food quality good tasty hygienic place come family friends safe place",
                "best stay bakkhali days back possess essential needs makes hotel remarkable food behaviour staff location room everything great specially guy restaurant named amar gem whenever need anything take extra care make food two years baby want",
                "seeing photos lodge youtubei decided stay two nights deeply disappointed rooms clean well maintained service bad tv channels deactivated geezers work food quality mediocre prices high would definitely recommend lodge friends",
                "manager excessively shrewd nagging persuasive manipulative room extremely small compared price kidfriendly try push foods customer however staffs friendly helpful",
                "hotel good staying purposes however would prefer avoid restaurant food mark served stale fish even vegetable curry good overall location fine room tariffs bit high prefer normal meal better try outside"
            ]
        },
        {
            "name": "Shree Hotel Bakkhali",
            "rating": [
                3.8
            ],
            "address": [
                "Bus stop, near NH117, Bakkhali, Lakshmipur Abad, West Bengal 743357, India"
            ],
            "reviews": [
                {
                    "text": "We visited on 18 -20 Mar'22 during Holi & stayed in room no 203. Rate was obviously high, Non-AC standard room @AC-Delux (understandable given the pick season).\n\nRoom was not good at all. First of all bed sheet was not clean & had several stain marks. There was no table in case you wish to dine in your own room. you have to sit on bed & have food. The sofa had a hole on the arm rest. Bathroom was ok. Had a tiny balcony with a open view. Only consolation was their service. Actions were co-operative & prompt and everyday once they cleaned room & bathroom (comp.) around 9-11 am. Encountered power-cuts more than once, generator runs on mood rather than fuel.\n.\nHad ordered food once, they have a tie-up with a nearby restaurant. Rate was above average, Food's raw material (fish & crab) were very good however, preparation was very bad. They just wasted that fresh Hilsa with an inedible gravy.\n\nHotel's distance is more than a km from sea & it will take 15 min to reach the sea on a normal pace. Toto cost is Rs.10/head.\n\nManager Manoj Sahoo is polite & professional.\n\nVerdict: Should be your last resort.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The Hotel is quite far from sea beach, but still a good and cheap place to stay.\nAmbiance, rooms are not bad at all. And staffs are good too, atleast I haven't seen anything wrong in this hotel. Mr Sahoo is also a good man.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel was at a quiet place, a little far from the beach, would need to use toto to move to and from the beach.\n\nThe rooms we stayed in were AC rooms, tariff was 1500. Food was an add on.\n\nRooms were ordinary, nothing special. Not too clean though. The flush in our washroom was broken. The ac was making weird noises.\nOverall the room wasn't upto the mark.\n\nThe food was abysmal. We had the misfortune of ordering lunch there. Ordered the chicken thali. It was as bad as it could have been. Every item on the thali were not at all tasty. It wasn't worth it at all.\n\nThere are much better hotels and restaurants in bakhhali. Avoid shree hotel at all costs. There is a government restaurant recently opened near the beach. It serves better quality food. Although the thali is not too good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "First of all the hotel is too far from the bakkhali sea beach. And the receptionist's behaviour is not so good. I have booked a non-AC room of 750 for one day and when I went there they just open the door of the room and did not even ask anything if I needed. The fan is too worse. Everything was there but of no use. Almirah's door was broken, The tv is not opening, the door can't be open or closed quickly, the lights are not proper, goodnight machine was there with a blank refill. 750 was too much for that room. In night I asked for a stand fan from there but they told me that they hadn't any fan extra. Only thing they know to come and knock on the door before the check out time. I would never book the hotel if I knew this previously.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "With prompt service and good facilities, it's the ideal hotel to stay at in Bakkhali. The rooms are spacious and clean, and the staff are there to help 24/7. It's a little far from the beach, but it's a 10 minute walk which is no big deal.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited mar holi stayed room rate obviously high nonac standard room acdelux understandable given pick season room good first bed sheet clean several stain marks table case wish dine room sit bed food sofa hole arm rest bathroom ok tiny balcony open view consolation service actions cooperative prompt everyday cleaned room bathroom comp around encountered powercuts generator runs mood rather fuel ordered food tieup nearby restaurant rate average foods raw material fish crab good however preparation bad wasted fresh hilsa inedible gravy hotels distance km sea take min reach sea normal pace toto cost rshead manager manoj sahoo polite professional verdict last resort",
                "hotel quite far sea beach still good cheap place stay ambiance rooms bad staffs good atleast havent seen anything wrong hotel mr sahoo also good man",
                "hotel quiet place little far beach would need use toto move beach rooms stayed ac rooms tariff food add rooms ordinary nothing special clean though flush washroom broken ac making weird noises overall room wasnt upto mark food abysmal misfortune ordering lunch ordered chicken thali bad could every item thali tasty wasnt worth much better hotels restaurants bakhhali avoid shree hotel costs government restaurant recently opened near beach serves better quality food although thali good",
                "first hotel far bakkhali sea beach receptionists behaviour good booked nonac room one day went open door room even ask anything needed fan worse everything use almirahs door broken tv opening door cant open closed quickly lights proper goodnight machine blank refill much room night asked stand fan told hadnt fan extra thing know come knock door check time would never book hotel knew previously",
                "prompt service good facilities ideal hotel stay bakkhali rooms spacious clean staff help little far beach minute walk big deal"
            ]
        },
        {
            "name": "Sundari Tourist Complex (West Bengal State Fisheries Development Corporation Ltd.)",
            "rating": [
                4
            ],
            "address": [
                "Henry's Island Fisheries Project, Bakkhali, Henry Island, West Bengal 743339, India"
            ],
            "reviews": [
                {
                    "text": "This place is under WB Govt Fisheries department. Location is offbeat. Henry's island is a very beautiful beach.\nRooms are not well maintained. Bathroom is clean but not maintained. Curtains in the rooms are not hygienic very dirty. AC and geyser is available. Food here is awesome. Food is bit costly as this place is in interior.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It is a new resort and facilities are pretty decent. You need your own vehicle so that you can move around easily. The Henry Islan beach is just a stone throw away. Some awesome fish and lobsters are on offer here. Don't miss the place. And yes, you must book it online .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "If you want secluded place, Henry Island is the best place. And Sundari complex is only option there. Mangrove complex is far from beach. I've booked Ac deluxe room, which is 5 min walking distance from restaurant & office. Night walk after dinner is really creepy. Service is not up to the mark. Delayed in food preparation though ordered much earlier.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It was a surreal experience, especially in a moonlit night -- in fact I couldn't sleep properly🙂. I booked a room literally in the middle of the lakes and far away from the reception -- almost 200 meter away. It was very quiet there. Rooms are basic, but with all required amenities (there are bigger family rooms). Food was excellent. The staff was nice and very cooperative. Will be back again. Heard that one can find fishing cats here.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good.\nWent to Henry Island, while returning back had lunch in the restaurant of Sundari Tourist complex.\nFood was good. Rooms available here starting approx 1500/-.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place wb govt fisheries department location offbeat henrys island beautiful beach rooms well maintained bathroom clean maintained curtains rooms hygienic dirty ac geyser available food awesome food bit costly place interior",
                "new resort facilities pretty decent need vehicle move around easily henry islan beach stone throw away awesome fish lobsters offer dont miss place yes must book online",
                "want secluded place henry island best place sundari complex option mangrove complex far beach ive booked ac deluxe room min walking distance restaurant office night walk dinner really creepy service mark delayed food preparation though ordered much earlier",
                "surreal experience especially moonlit night fact couldnt sleep properlyð\u009f\u0099\u0082 booked room literally middle lakes far away reception almost meter away quiet rooms basic required amenities bigger family rooms food excellent staff nice cooperative back heard one find fishing cats",
                "good went henry island returning back lunch restaurant sundari tourist complex food good rooms available starting approx"
            ]
        },
        {
            "name": "Hotel Inodoy (Nirala)",
            "rating": [
                3.9
            ],
            "address": [
                "Laxmipur, PS - Freserganj, Costal, Bakkhali, Fedric Island, West Bengal 743357, India"
            ],
            "reviews": [
                {
                    "text": "Pet friendly hotel with plenty of car parking space at the back yard. Three of us with our golden retriever stayed in a sea facing superior room at no extra charge for the sofa cum bed for the 3rd person but Rs 250/- for the pet. Centralised warm water system at bathrooms throughout the year. Does not have elaborate meal menu as many restaurants are available on the nearby main road. Separate approach to the beach avoiding the crowded market area. Free WiFi, Tatasky TV channels.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's so so. Rooms are too good to stay. Location at a narrow road. Parking is there but to reach hotel little bit difficult. Food is also good but services to be updated",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The rooms are not spacious but surprisingly cozy. The staffs are well behaved and help you out in every other ways. You cn try the food here, absolutely delicious.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is  situated at almost 500 meter distance from the beach, you can walk or take a readily available Toto.\n\nThe hotel is quite big with parking facilities.\n\nThe check in and check out is hassle-free. The staff are quite courteous and helpful. They also have an in-house restaurant which provides good food, also will cook the items if and when you buy from the fishermen and brought here.\n\nThe rooms are spacious and basic amenities are all available.\n\nLift is available and they are pet friendly.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Behaviour of hotel owner was really good . I went there with my pets (2) . Like family they allow us to keep my  pets home made food to put in hotel's refrigerator .They also allow to access their rooftop with my pets . Really love this pet friendly destruction . Neat and clean area, they have open parking area too. Lift warks properly . Bathroom was neat and clean ... Rooms are not too big , but it can be managed ... Nice one ...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pet friendly hotel plenty car parking space back yard three us golden retriever stayed sea facing superior room extra charge sofa cum bed rd person rs pet centralised warm water system bathrooms throughout year elaborate meal menu many restaurants available nearby main road separate approach beach avoiding crowded market area free wifi tatasky tv channels",
                "rooms good stay location narrow road parking reach hotel little bit difficult food also good services updated",
                "rooms spacious surprisingly cozy staffs well behaved help every ways cn try food absolutely delicious",
                "hotel situated almost meter distance beach walk take readily available toto hotel quite big parking facilities check check hasslefree staff quite courteous helpful also inhouse restaurant provides good food also cook items buy fishermen brought rooms spacious basic amenities available lift available pet friendly",
                "behaviour hotel owner really good went pets like family allow us keep pets home made food put hotels refrigerator also allow access rooftop pets really love pet friendly destruction neat clean area open parking area lift warks properly bathroom neat clean rooms big managed nice one"
            ]
        },
        {
            "name": "Hotel Sanjog",
            "rating": [
                3.7
            ],
            "address": [
                "743369, Watch Tower, Bakkhali, West Bengal 743339, India"
            ],
            "reviews": [
                {
                    "text": "Well decorated rooms, location is superb but there is little distance from beach....outside food is allowed... So overall its outstanding for family and married couple...",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Manager have nothing knowledge how to talk  with customers, he asking me for advance payment on everyday wise but don't give me any receipt for that .\nGuiser not working properly but he has no idea that the room needs to be changed.\nThe room was not swept only mopped , bed sheets are not changed only on the 1st day when the room was taken but not changed from the 2nd day.\nWashroom also washable after forcing to the utility staff to wash.\nIf everything has to be said then there's no point a 2nd time visit and no acquaintance should be suggested to go the Sanjog Hotel.\nIf anyone go with family thn I say no, then best choice will be hotel balaka, Bhorer alo, Sonar Bangla.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I did a booking through Makemytrip and had entered a wrong date by mistake. So I tried to call them and change the date even while agreeing to pay extra. They took 4000 for 3 sub standard rooms and did not give a single penny back. Instead where asking for 4000 more to change the date. Absolutely disgusting and worthless hotel. Kiranmayee Or something is the name of the owner. He is a con man.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Decent rooms, polite stuffs , timely service , with dedicated parking within the premises is the best thing .",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Room are quite decent. But, One thing remember when you book the room by call confirm the price before visit the hotel. Because, Every time charge extra money than they promised. So, remember it. According to the infrastructure, quality and distance from the beach to hotel the value of room rent should be 800-1000/per night.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "well decorated rooms location superb little distance beachoutside food allowed overall outstanding family married couple",
                "manager nothing knowledge talk customers asking advance payment everyday wise dont give receipt guiser working properly idea room needs changed room swept mopped bed sheets changed st day room taken changed nd day washroom also washable forcing utility staff wash everything said theres point nd time visit acquaintance suggested go sanjog hotel anyone go family thn say best choice hotel balaka bhorer alo sonar bangla",
                "booking makemytrip entered wrong date mistake tried call change date even agreeing pay extra took sub standard rooms give single penny back instead asking change date absolutely disgusting worthless hotel kiranmayee something name owner con man",
                "decent rooms polite stuffs timely service dedicated parking within premises best thing",
                "room quite decent one thing remember book room call confirm price visit hotel every time charge extra money promised remember according infrastructure quality distance beach hotel value room rent per night"
            ]
        }
    ]
}