{
    "places_with_reviews": [
        {
            "name": "Platinum 52 Resort, Bhor - Resort near Pune Mumbai",
            "rating": [
                4.3
            ],
            "address": [
                "3km, Bhor, off Ambeghar, Chikhalavade, Maharashtra 412206, India"
            ],
            "reviews": [
                {
                    "text": "A great Resort Platinum 52 at very serene location, go there if you want to relax in nature's lap. When I went to Bhor.. I had plan for only one night's stay as recommended by friends but the location of the resort was perfect, we enjoyed the mountain breeze and chirping of the birds, eventually we extended our stay for one more day. Property has a very safe and secure parking, staff is very polite and helpful. Food is tasty and quality is also great.\nWe really enjoyed dining in their open air restuarant, enjoying the fresh air.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Our stay at Platinum52 Resort was fantastic! The surroundings are beautiful with mountains nearby. The place has a great vibe and the property is very clean. The rooms are spotless and they take hygiene seriously. I definitely suggest staying here",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The view at Platinum Resort is beautiful! The service is great too. The manager, Ram, was really helpful. Everyone there is friendly. Our family had a great time during our 2-day stay. The kids didn't want to leave!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "During my recent visit to Platinum 52 Resort near Bhor, I encountered some issues that I believe future visitors should be aware of.\n\nThe rooms and toilets weren't as clean as I hoped for, and the overall cleanliness of the resort left something to be desired. Unfortunately, the fun and sports activities advertised were not in working order and seemed neglected in terms of maintenance. The food quality, while not terrible, was only average.\n\nI do want to mention that the resort manager did their best to assist us, but it was evident that they were short-staffed, which affected the overall service and ability to address all our concerns promptly.\n\nIn light of my experience, I would caution others to consider alternative options before choosing Platinum 52 Resort for their stay. I hope sharing this feedback helps both future guests and the resort management in making necessary improvements.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We celebrated our marriage anniversary at Platinum 52 and it was awesome experience. Food was nice. Service was excellent. I would like to thank manager Ram and his team for the decorations they did and to make our day special.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great resort platinum serene location go want relax natures lap went bhor plan one nights stay recommended friends location resort perfect enjoyed mountain breeze chirping birds eventually extended stay one day property safe secure parking staff polite helpful food tasty quality also great really enjoyed dining open air restuarant enjoying fresh air",
                "stay platinum resort fantastic surroundings beautiful mountains nearby place great vibe property clean rooms spotless take hygiene seriously definitely suggest staying",
                "view platinum resort beautiful service great manager ram really helpful everyone friendly family great time day stay kids didnt want leave",
                "recent visit platinum resort near bhor encountered issues believe future visitors aware rooms toilets werent clean hoped overall cleanliness resort left something desired unfortunately fun sports activities advertised working order seemed neglected terms maintenance food quality terrible average want mention resort manager best assist us evident shortstaffed affected overall service ability address concerns promptly light experience would caution others consider alternative options choosing platinum resort stay hope sharing feedback helps future guests resort management making necessary improvements",
                "celebrated marriage anniversary platinum awesome experience food nice service excellent would like thank manager ram team decorations make day special"
            ]
        },
        {
            "name": "Umber Valley Resort",
            "rating": [
                4.4
            ],
            "address": [
                "Gat.no.394, At, Post, Natambi, Bhor, Maharashtra 412206, India"
            ],
            "reviews": [
                {
                    "text": "The resort stay is worthy. Prices are less, staffs are very good, food is very good. Near by activities like river trekking and hill trek is awesome. They allowed and arranged for us to cook separately too. Night vibe is awesome.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Could have been better but not managed properly.\nTea is horrible, must not try.\nFood is below average.\nButtermilk is noting other than water.\nPlastic chairs are pathetic. Not good corporate events.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "A very good place for a one day picnic\nRates are quite high\nVery good veg and non veg food\nUnlimited morning breakfast, lunch, evening snacks, high tea/coffee\nSwimming pool, indoor and outdoor games, River walk....\nOverall good experience\nRecommended for family/friends/official get together",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Experience was great,  had a very good time in a very rich and green habitat. Food was yummy and tasty. Service was excellent. Staff were very good and cooperative . Worth visiting the resort again",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Been to Umber Valley Resort in December with my wife, son and in-laws. The best part of the stay was the great hospitality showed by the Resort staff, the property owner himself who happened to be on the premise on our 1st day and mainly the Meyome representative Dnyandeep.\nHe ensured that the experience is great not only for me and my wife, but equally for my in-laws who are senior citizens. The actions were proactive without even requesting for it.\nThe resort was booked by a large corporate group and though the group was one of the most well behaved group I have seen, he ensured that families still have the peace they deserve.\nThe food was excellent and the staff ensured that the same items are not repeated for guests staying for more than 1 day which needed multiple dishes to be cooked.\nThe smooth experience started with the booking itself where after hearing out the requirements, Amit from Meyome suggested us the Bhor resort from the other resorts with Meyome.\n\nI would be again visiting the Umber Valley Resort with 32 members of my team next month. Hoping to have a great stay again.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort stay worthy prices less staffs good food good near activities like river trekking hill trek awesome allowed arranged us cook separately night vibe awesome",
                "could better managed properly tea horrible must try food average buttermilk noting water plastic chairs pathetic good corporate events",
                "good place one day picnic rates quite high good veg non veg food unlimited morning breakfast lunch evening snacks high teacoffee swimming pool indoor outdoor games river walk overall good experience recommended familyfriendsofficial get together",
                "experience great good time rich green habitat food yummy tasty service excellent staff good cooperative worth visiting resort",
                "umber valley resort december wife son inlaws best part stay great hospitality showed resort staff property owner happened premise st day mainly meyome representative dnyandeep ensured experience great wife equally inlaws senior citizens actions proactive without even requesting resort booked large corporate group though group one well behaved group seen ensured families still peace deserve food excellent staff ensured items repeated guests staying day needed multiple dishes cooked smooth experience started booking hearing requirements amit meyome suggested us bhor resort resorts meyome would visiting umber valley resort members team next month hoping great stay"
            ]
        },
        {
            "name": "Rohida Fort- Bajarwadi Grameen Paryatan",
            "rating": [
                4.9
            ],
            "address": [
                "Bajarwadi, Bhor, Maharashtra 412206, India"
            ],
            "reviews": [
                {
                    "text": "Rohida Fort Trek\nMy school friend Gopal Mirajkar, his wife Vidya and me did Rohida Fort Trek on Thursday, 10th August 2023. Due to Shrawan Maas (Adhik Shravan) there was exceptionally beautiful nature.... Lush green, cool, play of rains & sun light.... Simply wonderful climate.\nRohida or Vichitragad or Rohideshwar are different names of this fort. It is in village Bajar wadi near Bhor. Just about 68 kms from Pune. We parked car at the base & sarted walking. The climb starts right from Bajar Wadi entrance & slowly keeps becoming steap. We took 1.5 hrs to reach the top. Just near the top, stones & mud had come down due to landslide below Ganesh Darwaja buruj. This was very slippery; but we managed to overcome it. There are different historical sites on the fort like Ganesh Darwaja, ancient water storage, Fatteh buruj, Sarja buruj, Chor darwaja etc. We were in the fort for almost two hours. We saw sites, had food & started decending. We met two youngsters on top. They were quite enthusiastic. We enjoyed their company. Apart from we five, there were no humans on the fort.\nTwo three dogs accompanied us when we reached top. They were quite friendly and of helping nature. They literaly guided way to us.\nIt was one of the memorable trek....",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Important fort of Maratha Empire, situated near Bhor taluka of Pune district. Fatteh Buruj, sarja buruj, waghjai buruj & patan buruj and some water cisterns are present on fort I'm good condition. Temple of rohidehswar is another place of attraction. 2 lithograph are encraved on wall near the 3 rd entrance. Base Village is Bazaar wadi.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "I had a very nice rural immersion experience in Bajarwadi. The fort itself is beautiful, the route to it more so, the people are really caring and helpful and the activities we did with them were an experience of a kind.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The fort is a lovely morning trek, not too difficult (took us an hour, and I'm a rookie). Viewing the sunrise over the hills was a truly breathtaking experience, with gorgeous views all around. The fort at the top is quite grand.\nThe village itself is very hospitable and welcoming. As part of a homestay, we toured the village, saw the fields and took in the most beautiful night sky. The food is very tasty, fresh and a refreshing change from the usual.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "It's very nice fort#awesome environment#beautiful nature in rainy season#mind refreshing one day trip from Pune....",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rohida fort trek school friend gopal mirajkar wife vidya rohida fort trek thursday th august due shrawan maas adhik shravan exceptionally beautiful nature lush green cool play rains sun light simply wonderful climate rohida vichitragad rohideshwar different names fort village bajar wadi near bhor kms pune parked car base sarted walking climb starts right bajar wadi entrance slowly keeps becoming steap took hrs reach top near top stones mud come due landslide ganesh darwaja buruj slippery managed overcome different historical sites fort like ganesh darwaja ancient water storage fatteh buruj sarja buruj chor darwaja etc fort almost two hours saw sites food started decending met two youngsters top quite enthusiastic enjoyed company apart five humans fort two three dogs accompanied us reached top quite friendly helping nature literaly guided way us one memorable trek",
                "important fort maratha empire situated near bhor taluka pune district fatteh buruj sarja buruj waghjai buruj patan buruj water cisterns present fort im good condition temple rohidehswar another place attraction lithograph encraved wall near rd entrance base village bazaar wadi",
                "nice rural immersion experience bajarwadi fort beautiful route people really caring helpful activities experience kind",
                "fort lovely morning trek difficult took us hour im rookie viewing sunrise hills truly breathtaking experience gorgeous views around fort top quite grand village hospitable welcoming part homestay toured village saw fields took beautiful night sky food tasty fresh refreshing change usual",
                "nice fortawesome environmentbeautiful nature rainy seasonmind refreshing one day trip pune"
            ]
        },
        {
            "name": "Rohida Fort/Vichitragad hotel (हाॅटेल रोहिडा-Hotel Rohida)",
            "rating": [
                4.7
            ],
            "address": [
                "A/P Bajarwadi , Tal, Dist, Bhor, Bajarwadi, Maharashtra 412206, India"
            ],
            "reviews": [
                {
                    "text": "We visited in Nov of 2023. Road conditions (from Pune) are excellent except for small bad patches, so no worries for sedans or low slung cars. This is not very popular, hence go only on a weekend so that you have some co-trekkers. The best time to go is oct first week to view the lush greenery, any later is not that great. Absolutely nothing en route, so pack water and snacks. Parking is safe and Rs 50 for cars, available at the trek starting point.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Fantastic fort, one day trek from Pune.About 55 ka from Pune.Takes around two hours to climb, an hour to see the fort.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Simple, Best nd classic fort.. atmosphere is too good specially in rainy season",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Hotel Rohida is very descent ...and Natural Place ..one can enjoy the bliss ..",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Awesome",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited nov road conditions pune excellent except small bad patches worries sedans low slung cars popular hence go weekend cotrekkers best time go oct first week view lush greenery later great absolutely nothing en route pack water snacks parking safe rs cars available trek starting point",
                "fantastic fort one day trek puneabout ka punetakes around two hours climb hour see fort",
                "simple best nd classic fort atmosphere good specially rainy season",
                "hotel rohida descent natural place one enjoy bliss",
                "awesome"
            ]
        },
        {
            "name": "Hotel shivray",
            "rating": [
                "Unknown"
            ],
            "address": [
                "4R2C+Q5X, Maharashtra 412206, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL PRANALI",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Bhor Mandhardevi Rd, Bhor, Maharashtra 412206, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Ganesh bhel&hotel",
            "rating": [
                4
            ],
            "address": [
                "Bhor Mandhardevi Rd, Gokavadi, Maharashtra 412206, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Roo",
            "rating": [
                4.5
            ],
            "address": [
                "3QGX+WPJ, Nazare, Maharashtra 412206, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}