{
    "places_with_reviews": [
        {
            "name": "Khinnanauli Forest Rest House",
            "rating": [
                4.6
            ],
            "address": [
                "Dhikala Zone, HWC3+6F3, F-3, Uttarakhand 246142, India"
            ],
            "reviews": [
                {
                    "text": "Khinanauli FRH was built in 1974 in the middle of the Khinanauli chaur and is connected by a road to Dhikala. The road is exceptionally beautiful. In the end March the vast stretch is laden with dry leaves,  make the place more charming. One can remember the ‘fall’ in the western world. The construction of this forest rest house was affected several times by elephants, and as a result wide trench was dug around it. The verandah in front of the forest rest house provides a majestic view of the Khinanauli chaur, where tiger and other animals can  be seen crossing the road towards Ramganga.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "A jewel in the forest.  The British legacy deep the forest of Uttarakhand. If u can .. do stay here once. A lifetime experience.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Harish ji took good care. Very well maintained. Peaceful place to be in.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Wonderful place deep in the forest. Has quite a few birds and insects around the place. Herds of elephants and spotted deer are visible from the rest house. It has nightjars visiting at night. Place is well managed and maintained. Only issue is electricity for which you would need to take your own diesel for the generator. Of course, the same applies to food and water... You have to carry your own.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Heritage Forest Rest House. Good facilities. Tourist may encounter tiger movement in front of the guest house premises. The Chief Conservator of Forest has right of booking few rooms. Rest other rooms tourist can booked over online. Very beautiful location.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "khinanauli frh built middle khinanauli chaur connected road dhikala road exceptionally beautiful end march vast stretch laden dry leaves make place charming one remember â\u0080\u0098fallâ\u0080\u0099 western world construction forest rest house affected several times elephants result wide trench dug around verandah front forest rest house provides majestic view khinanauli chaur tiger animals seen crossing road towards ramganga",
                "jewel forest british legacy deep forest uttarakhand u stay lifetime experience",
                "harish ji took good care well maintained peaceful place",
                "wonderful place deep forest quite birds insects around place herds elephants spotted deer visible rest house nightjars visiting night place well managed maintained issue electricity would need take diesel generator course applies food water carry",
                "heritage forest rest house good facilities tourist may encounter tiger movement front guest house premises chief conservator forest right booking rooms rest rooms tourist booked online beautiful location"
            ]
        }
    ]
}