{
    "places_with_reviews": [
        {
            "name": "Regenta Central City Vilas Palace",
            "rating": [
                4.3
            ],
            "address": [
                "9th Milestone LHS, Ambala - Chandigarh Expy, Kakru, Ambala, Haryana 134007, India"
            ],
            "reviews": [
                {
                    "text": "🚂🚂🚂                                                      I had not gone inside I just took coffee from barista drive throw counter outside it washroom are very neat clean, food and some outlets are inside the building while some fast food outlets are outside the building it's on main road on its ENTRY GATE they have kept a REAL TRAIN 🚂 ENGINE not working just for attraction and photographs.                   🚂 🚂 🚂  The front of building 🏫 has a look of ancient palace",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It is a newly built Hotel in Ambala City. Situated on a highway, earlier was composed of only Haveli which now has made this part of hotel as well.\nThe hotel is good, quite spacious. Has 3 boardrooms, 1 bar, 1 all day dining place and a roof swimming pool which gives good vibes as one can see the roads from there and in the morning, the sunrise is a great view to watch.\nThe rooms are spacious and the services are also great.\nThe staff is courteous and polite. Behave professionally.\nThe food is also delicious.\nIt has the potential to become one of the best hotels in Ambala if it continues to maintain the services and enhances a bit of everything at the hotel.\nIt is situated just 3 km from Jaggi City Centre, towards Chandigarh",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had an family event there last month.. dewan-e- khas hall and lawn area combined is small for 150 pacs good for 100 pacs .... bit pricey.. some elements were missing which were decided at the time of booking and breifing so keep a check on it until the last moment.. food items were too missing at the time of serve which were there on the docket we signed... overall was a mix experience .. not smooth .. at managerial level there's a lot of confusion and fuss there which will bitter your experience.... overall it was good. can't say its awesome or even best.,, .. this was my nd my family experience .... thanks..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Was invited for a party on Friday last at their restaurant pinxx. Service was real poor, the whole place had only we 12 guests and their was just one waiteress to manage. We were told the staff isbusy in other parties. What a poor excuse. If you cannot arrange staff why not close the restaurant. Snacks reached cold and in between for full 20 minutes there was break in service of the snacks. Host was running around himself to get the things in order. Host told me that inspite of placing order boforehand for the party , this was situation.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The property is at the highway. It has spacious and clean rooms. The food here is amazing. It is a great place for a stopover for onward journey.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ð\u009f\u009a\u0082ð\u009f\u009a\u0082ð\u009f\u009a\u0082 gone inside took coffee barista drive throw counter outside washroom neat clean food outlets inside building fast food outlets outside building main road entry gate kept real train ð\u009f\u009a\u0082 engine working attraction photographs ð\u009f\u009a\u0082 ð\u009f\u009a\u0082 ð\u009f\u009a\u0082 front building ð\u009f\u008f « look ancient palace",
                "newly built hotel ambala city situated highway earlier composed haveli made part hotel well hotel good quite spacious boardrooms bar day dining place roof swimming pool gives good vibes one see roads morning sunrise great view watch rooms spacious services also great staff courteous polite behave professionally food also delicious potential become one best hotels ambala continues maintain services enhances bit everything hotel situated km jaggi city centre towards chandigarh",
                "family event last month dewane khas hall lawn area combined small pacs good pacs bit pricey elements missing decided time booking breifing keep check last moment food items missing time serve docket signed overall mix experience smooth managerial level theres lot confusion fuss bitter experience overall good cant say awesome even best nd family experience thanks",
                "invited party friday last restaurant pinxx service real poor whole place guests one waiteress manage told staff isbusy parties poor excuse arrange staff close restaurant snacks reached cold full minutes break service snacks host running around get things order host told inspite placing order boforehand party situation",
                "property highway spacious clean rooms food amazing great place stopover onward journey"
            ]
        },
        {
            "name": "Palmdale Resort Ambala Lawns & Banquets",
            "rating": [
                4.3
            ],
            "address": [
                "NH-65, Ambala - Hissar Rd, Village Durkhara, Ambala, Haryana 134003, India"
            ],
            "reviews": [
                {
                    "text": "I am the owner of Devbhumi Hills Tour and Travels or a professional driver by profession, often I have seen that driver rooms are available in hotels or resorts. Thanks for this, but they are still dirty and smelly, no attention is paid to cleanliness. That's why we mostly sleep in our car, no matter how cold it is, but this time when I saw this insanity, I was not afraid to even look into my eyes. This resort made my sleeping arrangements very well and clean and I was able to spend my night well that too in such cold weather. The gentleman at the reception spoke very nicely and I noticed that no matter who the staff was, he spoke very nicely to his guests, leaving no stone unturned in meeting their needs. The location is very nice which is on the main road or it is the perfect location for parties, weddings, or other meetings gathering, special attention has been taken to cleanliness here. The food was also good and healthy...anyone can spend their time well here as it is a very peaceful place.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I would definitely recommend this place for remote stay, destination wedding or any other occasions where you want a best experience for. Good thing is that this is bit away from the city and as a result this place is quite peaceful. Rooms are awesome and the service is also awesome.\nThis place is even good for staycation.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Beautiful property with wonderful services by the entire staff. Special thanks to Mr. Rajesh Yadav who managed to get all things in shape. It is a must visit if you visit Ambala city. Food quality is super amazing all thanks to the skilled chef. Overall it was a great stay experience.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very beautiful ❤️ and very big resort and marriage place.Palmdale Resort is a popular destination for tourists and travelers looking for a relaxing and luxurious stay. The resort offers a range of amenities, including swimming pools, spa services, The rooms and suites are spacious and well-appointed, providing a comfortable stay for guests. The resort's location in a scenic area adds to its charm and appeal. Overall, Palmdale Resort appears to be a great choice for those seeking a luxurious and peaceful getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "One of the best venues for different gathering sizes with options of multiple Halls and lawn. Nice aroma of the place. Suits fit for destination wedding and catchy location.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "owner devbhumi hills tour travels professional driver profession often seen driver rooms available hotels resorts thanks still dirty smelly attention paid cleanliness thats mostly sleep car matter cold time saw insanity afraid even look eyes resort made sleeping arrangements well clean able spend night well cold weather gentleman reception spoke nicely noticed matter staff spoke nicely guests leaving stone unturned meeting needs location nice main road perfect location parties weddings meetings gathering special attention taken cleanliness food also good healthyanyone spend time well peaceful place",
                "would definitely recommend place remote stay destination wedding occasions want best experience good thing bit away city result place quite peaceful rooms awesome service also awesome place even good staycation",
                "beautiful property wonderful services entire staff special thanks mr rajesh yadav managed get things shape must visit visit ambala city food quality super amazing thanks skilled chef overall great stay experience",
                "beautiful â\u009d¤ï¸\u008f big resort marriage placepalmdale resort popular destination tourists travelers looking relaxing luxurious stay resort offers range amenities including swimming pools spa services rooms suites spacious wellappointed providing comfortable stay guests resorts location scenic area adds charm appeal overall palmdale resort appears great choice seeking luxurious peaceful getaway",
                "one best venues different gathering sizes options multiple halls lawn nice aroma place suits fit destination wedding catchy location"
            ]
        },
        {
            "name": "Hotel Golden Orchid",
            "rating": [
                4.6
            ],
            "address": [
                "Kalka chownk, New Vita Enclave Rd, near vita milk plant, New Pratap Nagar, Ambala, Haryana 134003, India"
            ],
            "reviews": [
                {
                    "text": "It was a good stay at the hotel. Rooms are spacious.\n\nBed and linens were clean.\nStaff is really good and helpful. They were open to negotiations since we arrived here quite late in the night.\n\nThey have good parking space available.\nDriver stay facility is also available.\n\nBiggest con -\nBathrooms are dirty and smelly. Shower was not working properly.\n\nOverall a decent stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We booked this property for my sister’s wedding. All the functions and events were arranged here, we got the best service and arrangements here. Rooms were clean and with good lights, food quality and quantity bestest. All our guests and friends praised the food quality. All the hotel staff and members were available on one call and delivered what we expected.\nOverall experience very very good.\nHIGHLY RECOMMENDED ❤️❤️\nThank You Lukesh 👍🏻",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The staff at this property are all great! They all go above and beyond to make your stay comfortable.\nHotel Manager Mr. Ajay Pathania is a nice person and makes it an easy stay by allowing early check-ins if the rooms are available and also assists with taxi bookings.\nOver all a good package.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Hotel Golden Orchird in Ambala with my family, and I must say it exceeded my expectations in every way possible.\n\nThe room we stayed in was spacious, providing ample space for my family to move around comfortably. The large windows in the room allowed plenty of natural light to filter in, creating a warm and inviting atmosphere.\n\nWhat truly impressed me was the exceptional customer service we received. Despite booking a super deluxe room, we were pleasantly surprised to be upgraded to an executive room at no extra cost. This unexpected gesture not only enhanced our experience but also showcased the hotel's commitment to ensuring guest satisfaction.\n\nFrom the well-appointed rooms to the attentive staff, our stay at Hotel Golden Orchird was nothing short of delightful. I highly recommend this hotel to anyone visiting Ambala and looking for a comfortable and memorable stay",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We held our whole wedding functions here, It was very great experience overall. Excellent service and delicious food. Highly recommended , also the owner lokesh is very kind and co operative.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good stay hotel rooms spacious bed linens clean staff really good helpful open negotiations since arrived quite late night good parking space available driver stay facility also available biggest con bathrooms dirty smelly shower working properly overall decent stay",
                "booked property sisterâ\u0080\u0099s wedding functions events arranged got best service arrangements rooms clean good lights food quality quantity bestest guests friends praised food quality hotel staff members available one call delivered expected overall experience good highly recommended â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f thank lukesh ð\u009f\u0091\u008dð\u009f\u008f »",
                "staff property great go beyond make stay comfortable hotel manager mr ajay pathania nice person makes easy stay allowing early checkins rooms available also assists taxi bookings good package",
                "recently pleasure staying hotel golden orchird ambala family must say exceeded expectations every way possible room stayed spacious providing ample space family move around comfortably large windows room allowed plenty natural light filter creating warm inviting atmosphere truly impressed exceptional customer service received despite booking super deluxe room pleasantly surprised upgraded executive room extra cost unexpected gesture enhanced experience also showcased hotels commitment ensuring guest satisfaction wellappointed rooms attentive staff stay hotel golden orchird nothing short delightful highly recommend hotel anyone visiting ambala looking comfortable memorable stay",
                "held whole wedding functions great experience overall excellent service delicious food highly recommended also owner lokesh kind co operative"
            ]
        },
        {
            "name": "DRIVE IN 22",
            "rating": [
                4.1
            ],
            "address": [
                "Ambala Chandigarh Expressway, NH22, Lalru, Dangdehri, Punjab 140501, India"
            ],
            "reviews": [
                {
                    "text": "Experience the Ultimate Comfort and Luxury:  Stay at a Beautiful Hotel\n\nUnveiling the Charm of a \"Very Nice Stay\"\nluxury accommodation, comfortable hotel stay,and Memorable\n\nluxurious amenities, exceptional service, breathtaking views, premium bedding, top-notch facilities\n\nSavoring Every Moment: Indulge in Fine Dining and Culinary Delights During Your Hotel Stay\n\nfine dining experience, gourmet cuisine, exquisite restaurants, culinary offerings at hotel\n\nRelaxation and Recreation: Unwind and Rejuvenate with Spa Treatments and Leisure Activities at the Hotel\n\nspa services, wellness retreats, leisure activities at hotel, relaxation amenities\n\nYour Home Away from Home: How to Make the Most of Your \"Very Nice Stay\" at the Hotel\n\ntips for enjoyable hotel stay, creating memorable experiences during hotel visit,\n\nSaying Goodbye is Hard: Cherish the Memories of Your Wonderful Stay at this Beautiful Hotel!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best hotel in ambala very big space .... Very good food quality... Pool area party is awesome... Staff is very friendly polite talking.. I'm local so I'm doing regularly party here with friends and family.... ⭐⭐⭐⭐⭐",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Never book this vanue for marriage . This is only for small kitti or lunch ...very bad service ...food quality is also very poor . Room service is very bad . No cleaning in rooms . No decoration . Milk food quality is very poor ..never book for marriage plz",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Awesome experience with comfort and luxurious feel and also staff is also very cooperative and disciplined\nOverall experience wonderful",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Incredible teamwork and dedication at v spark. They truly understand our brand's essence.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience ultimate comfort luxury stay beautiful hotel unveiling charm nice stay luxury accommodation comfortable hotel stayand memorable luxurious amenities exceptional service breathtaking views premium bedding topnotch facilities savoring every moment indulge fine dining culinary delights hotel stay fine dining experience gourmet cuisine exquisite restaurants culinary offerings hotel relaxation recreation unwind rejuvenate spa treatments leisure activities hotel spa services wellness retreats leisure activities hotel relaxation amenities home away home make nice stay hotel tips enjoyable hotel stay creating memorable experiences hotel visit saying goodbye hard cherish memories wonderful stay beautiful hotel",
                "best hotel ambala big space good food quality pool area party awesome staff friendly polite talking im local im regularly party friends family â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090",
                "never book vanue marriage small kitti lunch bad service food quality also poor room service bad cleaning rooms decoration milk food quality poor never book marriage plz",
                "awesome experience comfort luxurious feel also staff also cooperative disciplined overall experience wonderful",
                "incredible teamwork dedication v spark truly understand brands essence"
            ]
        },
        {
            "name": "Sangeet Resorts",
            "rating": [
                4.4
            ],
            "address": [
                "65, Kaithal - Ambala Road Hissar, Kaithal - Ambala Rd, Ambala, Haryana 134003, India"
            ],
            "reviews": [
                {
                    "text": "Sangeet Resort, located near Hissar Road in Ambala, offers a serene and comfortable retreat for travelers seeking relaxation and tranquility. Nestled amidst lush greenery, the resort provides a picturesque setting for guests to unwind and rejuvenate.\n\nThe resort boasts well-appointed rooms equipped with modern amenities to ensure a comfortable stay for visitors. Whether it's a family vacation, a romantic getaway, or a business trip, Sangeet Resort caters to various accommodation needs with its range of room options.\n\nIn addition to comfortable lodging, the resort offers an array of facilities and services to enhance guests' experience. From a swimming pool and fitness center for recreational activities to banquet halls and conference rooms for events and meetings, Sangeet Resort caters to diverse requirements.\n\nThe on-site restaurant serves delicious meals, including local delicacies and international cuisines, prepared by skilled chefs. Guests can indulge in culinary delights while enjoying the serene ambiance of the resort.\n\nMoreover, the courteous staff members ensure attentive service and strive to make guests feel welcomed throughout their stay. With its tranquil ambiance, modern amenities, and attentive hospitality, Sangeet Resort in Ambala near Hissar Road promises a memorable and enjoyable experience for discerning travelers.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Big and spacious resort. Food quality is good.\nDecoration was too good",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It's one of the best wedding place in Ambala. Have a huge laws and halls. Hospitality and Catering that they provide is one of the best. The organizers here follow latest trends in Wedding Decor. Not too far from City's center so approachable. It have ample parking space. They also take care of last minute needs and asks of clients. One must consider them if planning a wedding or any such occasion.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Excellent place good food and courteous staff.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Loved the place the vibe and decoration and food everything was top class👍🏻",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sangeet resort located near hissar road ambala offers serene comfortable retreat travelers seeking relaxation tranquility nestled amidst lush greenery resort provides picturesque setting guests unwind rejuvenate resort boasts wellappointed rooms equipped modern amenities ensure comfortable stay visitors whether family vacation romantic getaway business trip sangeet resort caters various accommodation needs range room options addition comfortable lodging resort offers array facilities services enhance guests experience swimming pool fitness center recreational activities banquet halls conference rooms events meetings sangeet resort caters diverse requirements onsite restaurant serves delicious meals including local delicacies international cuisines prepared skilled chefs guests indulge culinary delights enjoying serene ambiance resort moreover courteous staff members ensure attentive service strive make guests feel welcomed throughout stay tranquil ambiance modern amenities attentive hospitality sangeet resort ambala near hissar road promises memorable enjoyable experience discerning travelers",
                "big spacious resort food quality good decoration good",
                "one best wedding place ambala huge laws halls hospitality catering provide one best organizers follow latest trends wedding decor far citys center approachable ample parking space also take care last minute needs asks clients one must consider planning wedding occasion",
                "excellent place good food courteous staff",
                "loved place vibe decoration food everything top classð\u009f\u0091\u008dð\u009f\u008f »"
            ]
        },
        {
            "name": "Khanna Farm & The Glen Manor",
            "rating": [
                4.3
            ],
            "address": [
                "Patti Rangran, Haryana 133006, India"
            ],
            "reviews": [
                {
                    "text": "Location was very nice but little bit mosquitoes inside the hall otherwise hall was very nice for marrige parties",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice place with lots of parking well behaved staff and a neat and clean place",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Location is great, Venue is just terrific but no good parking space and food sucked (can't blame the farm for that though but heres the catch)\nVenue is big and divided into 4 parts which can't interact with each other so you as guest have to wander around and find out.. Especially if you have leg problem.. Its a full day thing for you as 2 of these halls are on stairs and big steps enough for a gym\n\nRest at my insta video \"harshyii\"",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice place to have wedding and family ceremony, I was happy with their service, The only negative is rooms toilets stinks all the time and even after repeated complaints it was not resolved",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It was really a nice ambience and decoration inside the farm.\nDivided into 3 portion, 1st portion- is open for breakfast, 2nd- portion is covered for various functions and lunch facilities and last one is again open for photoshoot and phere to be done ...\n\nStaff was also professionally dressed and caters good service to the guests...\nHighly recommended everyone to have a visit .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location nice little bit mosquitoes inside hall otherwise hall nice marrige parties",
                "nice place lots parking well behaved staff neat clean place",
                "location great venue terrific good parking space food sucked cant blame farm though heres catch venue big divided parts cant interact guest wander around find especially leg problem full day thing halls stairs big steps enough gym rest insta video harshyii",
                "nice place wedding family ceremony happy service negative rooms toilets stinks time even repeated complaints resolved",
                "really nice ambience decoration inside farm divided portion st portion open breakfast nd portion covered various functions lunch facilities last one open photoshoot phere done staff also professionally dressed caters good service guests highly recommended everyone visit"
            ]
        },
        {
            "name": "Sona Pristine",
            "rating": [
                4
            ],
            "address": [
                "39KM Highway, Ambala - Chandigarh Expy, next to Omaxe green, Ambala, Jharmari, Punjab 134003, India"
            ],
            "reviews": [
                {
                    "text": "Bad experience. Management has changed. New management pathetic. You call them for room. They say available. When u reach hotel, they say room is not available. No geyser is some rooms. They will provide hot water balti on demand..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Ambience - 8/10\n\nService - 7/10 extremely fast\n\nHospitality - 2/10\n\nGenuine review\nI have been to this place at least 10 times over the past year.\nThe food is great, the ambience is great but the rating is because of the hospitality we expected in this sector. We asked for normal drinking water instead of bottled water. They said they do not serve bottled water at this place which is against govt norms and also unbecoming of a restaurant.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very bad experience\n\nGM Brijesh Updhay is a very non sense person.\n\nNo manners to talk with customers\n\nVery rustic behavior by Brijesh Updhay",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The room is very clean, the food is absolutely delicious, I really enjoyed my stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Excellent service. Well mannered staff. Good food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience management changed new management pathetic call room say available u reach hotel say room available geyser rooms provide hot water balti demand",
                "ambience service extremely fast hospitality genuine review place least times past year food great ambience great rating hospitality expected sector asked normal drinking water instead bottled water said serve bottled water place govt norms also unbecoming restaurant",
                "bad experience gm brijesh updhay non sense person manners talk customers rustic behavior brijesh updhay",
                "room clean food absolutely delicious really enjoyed stay",
                "excellent service well mannered staff good food"
            ]
        },
        {
            "name": "Hotel Amar Palace",
            "rating": [
                4
            ],
            "address": [
                "567 C, Treasury Rd, Patti Mehar, Ambala, Haryana 134003, India"
            ],
            "reviews": [
                {
                    "text": "Worst Food Service, no sense to talk when you tell them that I have received wrong items.And clearly denied by saying’Abi Hamare pass Ladka nahi hai’ .The ordered the items for Rs 1845 via Zomato and frankly telling it has no worth to spend money on such restaurants who compromises in the food quality and sent wrong and stale food! Pathetic place.. will not advice anyone in Future…!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Guyzzz everything was great nice ambiance goos service and  everything but pls add more washromm plsss i had to wait soo long for my turnnn 😭💀😂😂😂\nAlgo bar more washrooms plsss 😂😂😂",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Behaviour not good specially night shift\nHmari bike hotel k piche krdi bin puche and then argument bhi kr rhe h\nTotally disappointed for staying in hotel",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great place for dinner. Good service & great food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food is very delicious one of my favourite restaurants in ambala",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst food service sense talk tell received wrong itemsand clearly denied sayingâ\u0080\u0099abi hamare pass ladka nahi haiâ\u0080\u0099 ordered items rs via zomato frankly telling worth spend money restaurants compromises food quality sent wrong stale food pathetic place advice anyone futureâ\u0080¦",
                "guyzzz everything great nice ambiance goos service everything pls add washromm plsss wait soo long turnnn ð\u009f\u0098­ð\u009f\u0092\u0080ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082 algo bar washrooms plsss ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082",
                "behaviour good specially night shift hmari bike hotel k piche krdi bin puche argument bhi kr rhe h totally disappointed staying hotel",
                "great place dinner good service great food",
                "food delicious one favourite restaurants ambala"
            ]
        },
        {
            "name": "Hotel Grace",
            "rating": [
                3.6
            ],
            "address": [
                "Nicholson Road, Main Crossing, Sadar Bazar, Ambala Cantt, Ambala Sadar, Haryana 133001, India"
            ],
            "reviews": [
                {
                    "text": "I really liked the room and staff member of the hotel. It is very nearby to the railway station ambala cantt, anyone can reach the place by e-rikshaw for only a price of Rs.30/- . The price is also in budget and the room is spacious.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Rooms are bad.water leakage from AC\nFrom pipes. wrost condition Hotel infrastructure is out dated, AC without remote, stinky smell inside the room",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I can't explain the condition of this hotel.... Even they don't deserve one star..very poor service .",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Location is Good with ample parking space. The rooms are clean and spacious..\nNeed to work on the service part ..\nStill its value for money💰💰💰💰",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Everything is good but no parking in the hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "really liked room staff member hotel nearby railway station ambala cantt anyone reach place erikshaw price rs price also budget room spacious",
                "rooms badwater leakage ac pipes wrost condition hotel infrastructure dated ac without remote stinky smell inside room",
                "cant explain condition hotel even dont deserve one starvery poor service",
                "location good ample parking space rooms clean spacious need work service part still value moneyð\u009f\u0092°ð\u009f\u0092°ð\u009f\u0092°ð\u009f\u0092°",
                "everything good parking hotel"
            ]
        },
        {
            "name": "Hotel Clarks Inn",
            "rating": [
                3.7
            ],
            "address": [
                "Jaggi city centre, Jammu - Delhi Rd, 9Q9X+6W7, Model Town Rd, Sena Nagar, Dholkot, Crossing, Ambala Cantt, Haryana 133001, India"
            ],
            "reviews": [
                {
                    "text": "My family and I found ourselves in an incredibly tough spot one night due to dense fog, zero visibility, and extreme cold. Desperate for shelter and safety, we approached this hotel, hoping for a warm room to protect our kids and ourselves.\n\nHowever, despite the late hour and the emergency situation, we were turned away because of their policy against allowing a couple with two kids to share a room. It was heartbreaking and frustrating to be denied accommodation when we needed it the most.\n\nWe understand policies exist for reasons, but in moments of crisis and urgency, we expected a bit of compassion and understanding. We were left outside, shivering in the bitter cold, feeling utterly abandoned by an establishment that valued rules over human well-being.\n\nI urge this hotel to reconsider its policies or at least have some flexibility for emergencies. No family should ever be denied a room when seeking refuge in such dire conditions. This experience was not just disappointing but also deeply upsetting.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Service and Location was good. I went there to attend a function in the Hall, so I can't review the Rooms. 4 stars are being given because I didn't really like the Food Quality, it might be because of the Menu chosen by the host. But it is not expected from the Clarks. Hopefully, I will update my review if I get better food on my next visit.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Rooms are adequate, location is good but beware that if you are unlucky enough to get a room on the second floor that you will be under the party hall which the hotel staff claim is not part of theirs or under their control despite being in the same building so you are at the mercy of the partygoers and when they will turn their music off so you and your family can actually try to get some sleep",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I must say it is one of the best hotel of the city of Ambala which lies in the state of Haryana. The clock in how to live mostly all the basic abilities and facilities for their customers. Food is quite good and I miss is quite peaceful and comfortable with cosy furniture out there.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location is the only advantage for this hotel otherwise all otherwise services are very poor, staff is not supportive, very high tariff with no special services,\n\nI suggest not to visit there",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "family found incredibly tough spot one night due dense fog zero visibility extreme cold desperate shelter safety approached hotel hoping warm room protect kids however despite late hour emergency situation turned away policy allowing couple two kids share room heartbreaking frustrating denied accommodation needed understand policies exist reasons moments crisis urgency expected bit compassion understanding left outside shivering bitter cold feeling utterly abandoned establishment valued rules human wellbeing urge hotel reconsider policies least flexibility emergencies family ever denied room seeking refuge dire conditions experience disappointing also deeplyâ upsetting",
                "service location good went attend function hall cant review rooms stars given didnt really like food quality might menu chosen host expected clarks hopefully update review get better food next visit",
                "rooms adequate location good beware unlucky enough get room second floor party hall hotel staff claim part control despite building mercy partygoers turn music family actually try get sleep",
                "must say one best hotel city ambala lies state haryana clock live mostly basic abilities facilities customers food quite good miss quite peaceful comfortable cosy furniture",
                "location advantage hotel otherwise otherwise services poor staff supportive high tariff special services suggest visit"
            ]
        }
    ]
}