{
    "places_with_reviews": [
        {
            "name": "Royale Regency",
            "rating": [
                3.8
            ],
            "address": [
                "NH 66, Oachira, Kerala 690526, India"
            ],
            "reviews": [
                {
                    "text": "I had a memorable stay at Royale Regency Ochira. Staff were amazing and they go an extra mile to help and assist where possible. Akshay Prasad was truly a wonderful chap. Serves with not only a smile but was a great help when I needed help most. A superb staff deserves all the commendation. Royale Regency has committed and loyal staff who deserves nothing but praise.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I happened to stay at Royal Regency for two days recently and honestly speaking it was a great experience! The front office staff , room service staff and house keeping staff are all very dedicated and work towards making the guests comfortable . Kudos to their hospitality 👍👍 Special thanks to Sajis, Nithin and Anand for extending such a warm welcome and catering to the guests needs each time. You all have a great smile guys 😃😃😃",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We stalyed there for one night. A couple and a kid. Reaching there is little task cuz of road work. Rooms are neat and clean but basic amenities like drinking water, Glass, spoon, paste etc...was not there. Restaurant had limited food options and highly priced too. They gave us the menu for dinner and told us there is limted option only. Didnt understand why they gave us the menu. Hot water is on solar so had to wait and call the support staff for help. It took almost 30 min to set it up.  Didnt find any other guest around loby or restaurant. Can make the service better.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The AC rooms were really good even if we asked for an extra bed it came around quickly . The room service was also really good and the rooms were really clean with the AC being in good condition and the beds doubled It was a really good experience . The amenities provided by them were also nice and we could connect to reception easily in case of anything. The Tv also had most of the channels subscribed. The wifi was also available only till the 3rd floor above that we could not connect to it .The only drawback would be the bathroom as it was not that clean . A good place to stay considering it's just on the side of the highway.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Located on the NH highway. Easily reachable one. Hotel has its own conventional centre celebrate the family function and etc. Also it has Bar facilities with restaurant. Cleanliness of the rooms are good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "memorable stay royale regency ochira staff amazing go extra mile help assist possible akshay prasad truly wonderful chap serves smile great help needed help superb staff deserves commendation royale regency committed loyal staff deserves nothing praise",
                "happened stay royal regency two days recently honestly speaking great experience front office staff room service staff house keeping staff dedicated work towards making guests comfortable kudos hospitality ð\u009f\u0091\u008dð\u009f\u0091\u008d special thanks sajis nithin anand extending warm welcome catering guests needs time great smile guys ð\u009f\u0098\u0083ð\u009f\u0098\u0083ð\u009f\u0098\u0083",
                "stalyed one night couple kid reaching little task cuz road work rooms neat clean basic amenities like drinking water glass spoon paste etcwas restaurant limited food options highly priced gave us menu dinner told us limted option didnt understand gave us menu hot water solar wait call support staff help took almost min set didnt find guest around loby restaurant make service better",
                "ac rooms really good even asked extra bed came around quickly room service also really good rooms really clean ac good condition beds doubled really good experience amenities provided also nice could connect reception easily case anything tv also channels subscribed wifi also available till rd floor could connect drawback would bathroom clean good place stay considering side highway",
                "located nh highway easily reachable one hotel conventional centre celebrate family function etc also bar facilities restaurant cleanliness rooms good"
            ]
        },
        {
            "name": "Canalview Cottage",
            "rating": [
                4.6
            ],
            "address": [
                "Azheekal Rd, Ayiramthengu, Karunagappalli, Azheekal, Kerala 690547, India"
            ],
            "reviews": [
                {
                    "text": "The whole experience was good, the location and the related views are awesome. There's a canal in front of the cottage and you can have your morning/evening tea with such a beautiful and nature riched view. Good environment and customer friendly services. Even though the cuisines were not much expected.\n\nOverall nice .....❤️",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "My husband and I stayed at Canal view cottage and Reghunath was truly a wonderful host. Really kind and helpful. He helped us with calling Renju’s auto for transport and food delivery from Saanz Bay seafood restaurant and serving us excellent traditional breakfast. Quiet safe family neighborhood and walkable distance to beach and 11 minutes to Amma ashram. Views: Lots of birds to watch in the area, red crabs and fish in the water and fishing boats floating by. We truly had a pleasant experience 🙏🏽",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "*Affordable Price(aprx 1800 for Ac rooms)\n*Neat Rooms\n*Nice front view\n*Nearby Restaurants available\n*friendly owner",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We stayed here for a night..Food was great and Shaji and Raghunath was very courteous and helpful..and was flexible for any requests.. Has a good view of the canal with fishing boats plying every 5 minutes... Access is bit narrow for SUVs, else do recommend from all other aspects",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "This was undoubtedly the best day out experience. This cottage doesn't boast of it's great area but what makes it special is the location. The service rendered by Shaji the care taker was very nice. The staff is also very courteous. Food was the best I ever had deliverd from a sea side restaurant   A paradise for nature and legacy lovers, Coconut Lagoon, the alluring\nbackwater well maintained economy overall a great day out for my family",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "whole experience good location related views awesome theres canal front cottage morningevening tea beautiful nature riched view good environment customer friendly services even though cuisines much expected overall nice â\u009d¤ï¸\u008f",
                "husband stayed canal view cottage reghunath truly wonderful host really kind helpful helped us calling renjuâ\u0080\u0099s auto transport food delivery saanz bay seafood restaurant serving us excellent traditional breakfast quiet safe family neighborhood walkable distance beach minutes amma ashram views lots birds watch area red crabs fish water fishing boats floating truly pleasant experience ð\u009f\u0099\u008fð\u009f\u008f½",
                "affordable priceaprx ac rooms neat rooms nice front view nearby restaurants available friendly owner",
                "stayed nightfood great shaji raghunath courteous helpfuland flexible requests good view canal fishing boats plying every minutes access bit narrow suvs else recommend aspects",
                "undoubtedly best day experience cottage doesnt boast great area makes special location service rendered shaji care taker nice staff also courteous food best ever deliverd sea side restaurant paradise nature legacy lovers coconut lagoon alluring backwaterâ well maintained economy overall great day family"
            ]
        },
        {
            "name": "Lake Bay",
            "rating": [
                4.8
            ],
            "address": [
                "Puthuppally, Near, Koottumvathukkal Bridge, Kayamkulam, Puthuppally, Kerala 690527, India"
            ],
            "reviews": [
                {
                    "text": "The stay experience was amazing... Very neat and beautiful place to stay. The view outside is one of the most beautiful site to watch... The amenities here are very useful... I will for sure stay here again if i get a chance... Hoping they will keep up the place well maintained in the future...\nThe only reason i didn't give 5 star is you have to park your car on the road side in your own risk and from there we have to walk atleast 100 meters to reach the entrance which is not a pleasant way to walk. Didn't feel safe at all and not a neat path..\nOther than that everything else is fine....",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very beutyful place and good atmosphere 🔥",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Suitable for the couples and familys that like very private and beautiful experience with a very beautiful lake view",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Really enjoyed the stay here. Beautiful ambience. The rooms were clean, very comfortable & the staffs are always warm & welcoming. Very friendly\nmanagement who make our stay enjoyable. Lake views are awesome.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A place where Nature, Art and emotions are blended in a perfect manner. An awesome place to hang out for couples ,friends &family . The place is gifted with serine lake view, soothing breezy atmosphere and breathtaking sunset. Hats off for the team for great conceptual  design nurturing the golden ages and the wonderful service with great foods. Keep it up,Will come again in my next holiday to kerala.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay experience amazing neat beautiful place stay view outside one beautiful site watch amenities useful sure stay get chance hoping keep place well maintained future reason didnt give star park car road side risk walk atleast meters reach entrance pleasant way walk didnt feel safe neat path everything else fine",
                "beutyful place good atmosphere ð\u009f\u0094¥",
                "suitable couples familys like private beautiful experience beautiful lake view",
                "really enjoyed stay beautiful ambience rooms clean comfortable staffs always warm welcoming friendly management make stay enjoyable lake views awesome",
                "place nature art emotions blended perfect manner awesome place hang couples friends family place gifted serine lake view soothing breezy atmosphere breathtaking sunset hats team great conceptual design nurturing golden ages wonderful service great foods keep upwill come next holiday kerala"
            ]
        },
        {
            "name": "Kadaltheeram Homestay",
            "rating": [
                4.1
            ],
            "address": [
                "4FH8+3W4, Azheekkal, Azheekal, Kerala 690547, India"
            ],
            "reviews": [
                {
                    "text": "It's a good place to take a break, the beach is about a hundred feet away. Breakfast is provided.\nThe hospitality is warm and the host is interested in you.\nThe one aspect that leaves much to be desired is the water pressure when you take a bath.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A simple room. No luxuries. No cupboards. No hot water. Only one charging plug. Spartan but clean bathroom. No washbasin in the bathroom but in the common lobby. No TV and happy about that. Backup power is there. Clean towels. But with all these draw backs i rate the hospitality high. Ms.Hema the owner serves fantastic food. Breakfast is free. Other food is charged nominally. Beach is across the road. You will see and hear the roar of the sea from the balcony. MsHema will arrange transport for you to go around, but the local transport is not cheap. Will go back again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place to stay. I found exact place for my family. We were treated with good sea food. The sea was very close and I was hearing the sound of waves right through night. Wonderful experience sleeping close to the sea. Very homely stay. The people around were very cordial and affectionate.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Amazing homestay, right next to Azheekal beach. The view from balcony is simply superb. The house owner serves amazing breakfast. Neat and clean rooms with all facilities. Would recommend 10/10",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very nice room....just near the beach.  Very homely and safe for family.  Will never forget chechis putty, patit with pappadam for breakfast.  Thank you for accommodating us.🙏😀",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place take break beach hundred feet away breakfast provided hospitality warm host interested one aspect leaves much desired water pressure take bath",
                "simple room luxuries cupboards hot water one charging plug spartan clean bathroom washbasin bathroom common lobby tv happy backup power clean towels draw backs rate hospitality high mshema owner serves fantastic food breakfast free food charged nominally beach across road see hear roar sea balcony mshema arrange transport go around local transport cheap go back",
                "nice place stay found exact place family treated good sea food sea close hearing sound waves right night wonderful experience sleeping close sea homely stay people around cordial affectionate",
                "amazing homestay right next azheekal beach view balcony simply superb house owner serves amazing breakfast neat clean rooms facilities would recommend",
                "nice roomjust near beach homely safe family never forget chechis putty patit pappadam breakfast thank accommodating usð\u009f\u0099\u008fð\u009f\u0098\u0080"
            ]
        },
        {
            "name": "HYMAM TOURIST HOME",
            "rating": [
                3.4
            ],
            "address": [
                "opp. South Indian Bank, Oachira, Kerala 690526, India"
            ],
            "reviews": [
                {
                    "text": "Too BAD,No one should take a room here to sleep,There is a large gym on top .There is always the sound of the terrifying Dumbels falling and the deafening music.I am now getting headaches because I can't sleep through the night..",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "It was relay great stay for us.property is neat and clean. Adjustable room rent.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Good rooms, cleanliness room&bathroom, good parking place and near to city access.....",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Good clean room. Good behaviour staff.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "🙁",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "badno one take room sleepthere large gym top always sound terrifying dumbels falling deafening musici getting headaches cant sleep night",
                "relay great stay usproperty neat clean adjustable room rent",
                "good rooms cleanliness roombathroom good parking place near city access",
                "good clean room good behaviour staff",
                "ð\u009f\u0099\u0081"
            ]
        },
        {
            "name": "Homely meals vallikavu",
            "rating": [
                4.7
            ],
            "address": [
                "Sugunananda Building, Amritapuri, Vallikavu, Kerala 690546, India"
            ],
            "reviews": [
                {
                    "text": "Fish curry thali meals.\n\nServed with 2 types of fish. Several vegetables, rice, sambar, buttermilk, and I enjoyed the lime pickle.\n\nThis is home style Kerala cooking. I was impressed with the food and appreciated  smiling owners.\n\nI will definitely return.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The best food you can get in Vallikav🤤🤤🤤",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fish curry thali meals served types fish several vegetables rice sambar buttermilk enjoyed lime pickle home style kerala cooking impressed food appreciated smiling owners definitely return",
                "best food get vallikavð\u009f¤¤ð\u009f¤¤ð\u009f¤¤"
            ]
        },
        {
            "name": "Hotel kashinath",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Junction, Vallikavu, Kerala 690546, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Green Lagoon Resort",
            "rating": [
                3.8
            ],
            "address": [
                "4FGM+73F, Kollam, Kerala 690547, India"
            ],
            "reviews": [
                {
                    "text": "Very personal and friendly place. Only 2 quite simple rooms available at the moment (nov 17) but they will extend the place with more rooms. The owner just changed recently and makes everything possible to make your stay as comfortable as possible.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Affordable price . Nn nice seafoods. ♥️ Natural view.. overall 3.9/5",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice place\nBeautiful  view to the backwater nice and fresh air and spicy and tasty food",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Awesome food bt not so safe",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Place with lots of peacefull vibes..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "personal friendly place quite simple rooms available moment nov extend place rooms owner changed recently makes everything possible make stay comfortable possible",
                "affordable price nn nice seafoods â\u0099¥ï¸\u008f natural view overall",
                "nice place beautiful view backwater nice fresh air spicy tasty food",
                "awesome food bt safe",
                "place lots peacefull vibes"
            ]
        },
        {
            "name": "Rocky's Area",
            "rating": [
                "Unknown"
            ],
            "address": [
                "4GG5+6V5, Oachira, Kerala 690546, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "SPOT ON 81550 Sana Tourist Home",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Bus Stop, 2A, Changankulangara Vallikunnam Road, Changankulangara, Kerala 690546, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}