{
    "places_with_reviews": [
        {
            "name": "SMJ GRAND HOTEL & MAHAL",
            "rating": [
                4.1
            ],
            "address": [
                "107, 3B2, Grand Southern Trunk Rd, Acharapakkam, Tamil Nadu 603301, India"
            ],
            "reviews": [
                {
                    "text": "Hotel rooms and surrounding area was clean to a sparkle.\nReception received was very pleased and always speaking with a smiling and dinner support was very pleased and satisfied.\nWish you all the best to continue the way it is serviced now.\nTotally is was a nice stay for me.\nOnce again thanks for the courtesy extended during my stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Rooms all so good front office reception wist good and food service good🥰",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms was so neat. The staff were so polite. A special mention to Akash adhi kesavan, he is so polite and his work is so neat and clean. He is so friendly and genuine in his work.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Not worth staying for the amount paid. Bathroom was not clean when we occupy the room. All the bathroom fittings are rusty. Water stagnate at bathroom and not draining fast. Hard water and therefore not feeling well after bath. They need to purify the water and supply to the bathroom. Drinking water and glasses are not provided. Very poor bathroom light. Promised to provide free breakfast and delayed it without proper reason. Room boy/ helper not available. At ground floor, the visitors are not guided and hence, they knock every room to find out their contact person which is causing abnormal disturbance to our privacy.\nWon't prefer to choose it again  for staying .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good ambience...\nIt is good to have 300 pax at a time in the hall & 100 pax in dining.\nNeatly maintained rest rooms.\nAir ventilation is sufficient for this much big hall, that need to be improved",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel rooms surrounding area clean sparkle reception received pleased always speaking smiling dinner support pleased satisfied wish best continue way serviced totally nice stay thanks courtesy extended stay",
                "rooms good front office reception wist good food service goodð\u009f¥°",
                "rooms neat staff polite special mention akash adhi kesavan polite work neat clean friendly genuine work",
                "worth staying amount paid bathroom clean occupy room bathroom fittings rusty water stagnate bathroom draining fast hard water therefore feeling well bath need purify water supply bathroom drinking water glasses provided poor bathroom light promised provide free breakfast delayed without proper reason room boy helper available ground floor visitors guided hence knock every room find contact person causing abnormal disturbance privacy wont prefer choose staying",
                "good ambience good pax time hall pax dining neatly maintained rest rooms air ventilation sufficient much big hall need improved"
            ]
        },
        {
            "name": "HOTEL SAKTHI PARK & CONVENTIONS",
            "rating": [
                3.7
            ],
            "address": [
                "26/6, Cheyur - Vandavasi Rd, Melmaruvathur, Sothupakkam, Tamil Nadu 603319, India"
            ],
            "reviews": [
                {
                    "text": "D worst room and services, that I have ever stayed in my life journey. They charge you more, it's partnership is with Oyo. Don't go cheated form seeing hotel from outside, inside the rooms are too badly maintained.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Not a worthy place to stay for the money you pay it only fits for emergency purpose we stay only for few hours and we vacated early morning.... Rooms are very old one with no balcony and nearby building wall against window and you can spot stains on bed linens and bedsheets given were very light damaged ones with holes in it.... We didnt use ac as it rainy but window ac is placed near bathroom in downside.... Bathrooms are not great with hardwater stains allaround with mosquitos and insects will come through ventilated windows.... Room staff will give only 2 bedsheets and not given extra bedsheet for our kid.... car parking we parked the car nearby mahal complex Behind hotel which is not a big issue",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We were supposed to  check  in on  25th November  2023 when we  went there no body was present  in reception  since we were  new to this  place  we were  forced  to search for the receptionist  and we finally  found him after 15 minutes  since  we  had traveled we  were very tired  finally  he allotted  rooms  on entering room to our surprise  no bedsheets  were there the intercom phone  kept for name sake  not working  when enquired  in reception  receptionist  told  bedsheets  have been  given  for dry cleaning   you will  get by evening  when enquired  he told you will get by 20.00 hrs  even after 20.00 hrs bedsheets  were not provided  finally  at 22.00 hrs they provided  running  a hotel  where customers  are coming  for stay after a long travel  can't  they keep  spare bedsheets  for providing  to customers  any how we had a very very bad experience  in staying  in this hotel  hoping  for remedial  action  from hotel management  for not treating  visitors  like  this,and take action  against  persons  who are not performing  their  duty properly",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "One of the worst hotel I have ever been!\nThey do not even provide a proper service and treat the guest to bad",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Everything is fine, except the toilet is a little bit small and there is no Wi-Fi. Rooms are good with two separate beds and a very vast car parking area.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst room services ever stayed life journey charge partnership oyo dont go cheated form seeing hotel outside inside rooms badly maintained",
                "worthy place stay money pay fits emergency purpose stay hours vacated early morning rooms old one balcony nearby building wall window spot stains bed linens bedsheets given light damaged ones holes didnt use ac rainy window ac placed near bathroom downside bathrooms great hardwater stains allaround mosquitos insects come ventilated windows room staff give bedsheets given extra bedsheet kid car parking parked car nearby mahal complex behind hotel big issue",
                "supposed check th november went body present reception since new place forced search receptionist finally found minutes since traveled tired finally allotted rooms entering room surprise bedsheets intercom phone kept name sake working enquired reception receptionist told bedsheets given dry cleaning get evening enquired told get hrs even hrs bedsheets provided finally hrs provided running hotel customers coming stay long travel cant keep spare bedsheets providing customers bad experience staying hotel hoping remedial action hotel management treating visitors like thisand take action persons performing duty properly",
                "one worst hotel ever even provide proper service treat guest bad",
                "everything fine except toilet little bit small wifi rooms good two separate beds vast car parking area"
            ]
        },
        {
            "name": "Sri Sakthi Siva Lodge",
            "rating": [
                4.2
            ],
            "address": [
                "NA, S.V.S Nagar, G.S.T Road, Chennai - Theni Hwy, Bharathiyar Nagar, Melmaruvathur, Indianull, Tamil Nadu 603319, India"
            ],
            "reviews": [
                {
                    "text": "I had booked it through Agoda App. But When I reached there the manager denied the stay and said that the hotel doesnt have any collaboration with Agoda. I had struggled to get a room at that night and finally forced to slept inside my car. So dont book this hotel through agoda. I dont know about the bookings through other Apps. But If you book through agoda then the money will be rest with the fraudsters.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Room is good but manager is fraud especially supervisor with Jesus dollar I booked for 1000 but they charged 2000 kindly try to avoid",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Neat and tidy rooms with TV and AC. Walking distance to the temple. Good for a stay. They charged 1k for AC room.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Little over priced for the size of the room and facilities, apart the toilets are kept clean and satellite channel available.\n\nNo wifi, bedspread quality to be improved",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good and very clean n tidy rooms , And even the price is also not high , for a night it's just Re 800 , 24*7 geyser I'd there for hot water, along with drinking water facility.. one can stay here for a long time without any worries.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked agoda app reached manager denied stay said hotel doesnt collaboration agoda struggled get room night finally forced slept inside car dont book hotel agoda dont know bookings apps book agoda money rest fraudsters",
                "room good manager fraud especially supervisor jesus dollar booked charged kindly try avoid",
                "neat tidy rooms tv ac walking distance temple good stay charged k ac room",
                "little priced size room facilities apart toilets kept clean satellite channel available wifi bedspread quality improved",
                "good clean n tidy rooms even price also high night geyser id hot water along drinking water facility one stay long time without worries"
            ]
        },
        {
            "name": "OYO Flagship Hotel Annai",
            "rating": [
                1.7
            ],
            "address": [
                "1, 7 Car Street, Hospital Rd, Melmaruvathur, Tamil Nadu 603319, India"
            ],
            "reviews": [
                {
                    "text": "Booked and paid for a room on October 20. Hotel does not exist and Oyo refuses to refund my money.  WARNING to everyone, OYO does not check any of its hotels in India and is full of scams.  Book directly with hotels for peace of mind or you will not get a nights sleep.",
                    "languageCode": "en",
                    "rating": [
                        1.7
                    ]
                },
                {
                    "text": "Fake hotels mapped at Oyo don't go with Oyo ,Oyo don't have any agreement with that hotel ,Oyo is cheating the customers",
                    "languageCode": "en",
                    "rating": [
                        1.7
                    ]
                },
                {
                    "text": "It is doesn't exist in this place, it's in another place\nAnd it didn't tie-up with Oyo it's fake",
                    "languageCode": "en",
                    "rating": [
                        1.7
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        1.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked paid room october hotel exist oyo refuses refund money warning everyone oyo check hotels india full scams book directly hotels peace mind get nights sleep",
                "fake hotels mapped oyo dont go oyo oyo dont agreement hotel oyo cheating customers",
                "doesnt exist place another place didnt tieup oyo fake",
                "nice"
            ]
        },
        {
            "name": "Thendral Residency",
            "rating": [
                3.3
            ],
            "address": [
                "72, 8A3, Grand Southern Trunk Rd, Melmaruvathur, Sirungalur, Tamil Nadu 603319, India"
            ],
            "reviews": [
                {
                    "text": "This is the worst hotel I have ever been to... Avoid this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Waste Room. AC Not working properly. Receptionist very worst behaviour. Restroom flush not working. Not suitable for bachelor boys and families.......",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Room was good and neet",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst hotel ever avoid hotel",
                "waste room ac working properly receptionist worst behaviour restroom flush working suitable bachelor boys families",
                "room good neet"
            ]
        }
    ]
}