{
    "places_with_reviews": [
        {
            "name": "Ramada by Wyndham Alleppey",
            "rating": [
                4.2
            ],
            "address": [
                "Nehru Trophy, Punnamada, Finishing Point, Alappuzha, Kerala 688013, India"
            ],
            "reviews": [
                {
                    "text": "The service here is excellent! The hotel it's clean. The rooms were functional. We did have some trouble accessing the channels on the TV and the AC didnt really cool as much as we'd like but it was comfortable and suited our needs. The Venice restaurant had great food and a variety of drink options. The highlight was the houseboat experience. We booked an exclusive ride so it was nice and private with plenty of food, air conditioning, and comfortable seating inside and out. Would recommend staying here!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Everything about the place is perfect.\n\nWe visited for dinner and were treated with exceptional service and a great spread for a buffet dinner.\n\nThe staff were exceptionally well trained, and had great attention to detail.\n\nThe spread for dinner was great and the taste was exceptional.\n\nThe ambience, the location, the service and staff ensured we had a great evening.\nHad a good experience here. If you want to relax and have some good food this is the place. The view from the rooms is good, a balcony would make it even better but we couldn't get one. Really good buffet options.\n\nOverall a pleasant stay.\n\nWould highly recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The hotel is situated at the finishing line of the Nehru Trophy Boat Tri race.\nThe lake view from the room is very beautiful.\nThe Houseboats are available from the hotel for few hours stay or overnight stay.\nThe staff are good, cooperative.\nThe hospitality of the Hotel staff is excellent , but not so professional.\n\nThe rooms are value for the money and they are spacious too.\n\nBuffet breakfast was good.\nIn the restaurant local taste items are less.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It was a really good experience. The property is located quite close to the Alleppey Back waters and also to other beaches around. Rooms were pretty clean and was equipped with state of the art facilities. Good aesthetic vibes all around the lobby. We're greeted with Tilak and the staff was very helpful and welcoming! Would love to visit again!!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We were a group of 8 people the majority of senior citizens. The stay was amazing and memorable. All three rooms were upgraded to the premium Lake view and Mr. Amal was promised that while taking the reservations. Thank you team Ramada.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service excellent hotel clean rooms functional trouble accessing channels tv ac didnt really cool much wed like comfortable suited needs venice restaurant great food variety drink options highlight houseboat experience booked exclusive ride nice private plenty food air conditioning comfortable seating inside would recommend staying",
                "everything place perfect visited dinner treated exceptional service great spread buffet dinner staff exceptionally well trained great attention detail spread dinner great taste exceptional ambience location service staff ensured great evening good experience want relax good food place view rooms good balcony would make even better couldnt get one really good buffet options overall pleasant stay would highly recommend",
                "hotel situated finishing line nehru trophy boat tri race lake view room beautiful houseboats available hotel hours stay overnight stay staff good cooperative hospitality hotel staff excellent professional rooms value money spacious buffet breakfast good restaurant local taste items less",
                "really good experience property located quite close alleppey back waters also beaches around rooms pretty clean equipped state art facilities good aesthetic vibes around lobby greeted tilak staff helpful welcoming would love visit",
                "group people majority senior citizens stay amazing memorable three rooms upgraded premium lake view mr amal promised taking reservations thank team ramada"
            ]
        },
        {
            "name": "Sterling Lake Palace Alleppey",
            "rating": [
                4.3
            ],
            "address": [
                "Thirumala Ward, Pallathuruthy, Chungam, Alappuzha, Kerala 688011, India"
            ],
            "reviews": [
                {
                    "text": "we have had a very good experience in this beautiful property.\nyour restaurant is excellent with a reasonably good complimentary breakfast.\nthe beautiful and peaceful walkways are really a plus point to the resort.\nthe swimming pool in the centre of the lake to be worth mentioned.\non the other hand the room service has to be improved.\nyour information centre has got no clue about the activities going on in the resort!\nwe do appreciate the positive and helpful attitude of the staff all around.\nin total it was a very nice stay in this marvelous atmosphere and wish to come back again!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Built on an island on the backwaters, the property is stunning, surrounded entirely by water. There are plenty of activities inside the property and you will be too occupied to go to the town during your first couple days of stay in the place. A complementary sunset boat ride was included with our booking - a must have experience at Alappuzha. Make sure to watch the cultural performance that is conducted every evening!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Having recently dined at a local establishment, I find myself compelled to share my thoughts on the disappointing culinary experience I endured. From the moment I stepped through the door, I was met with an ambiance that promised much but delivered little. The decor attempted to exude sophistication, but it felt forced and contrived.\n\nAs for the food, it fell far short of expectations. The menu boasted a variety of options, but the execution left much to be desired. My appetizer, touted as a delicacy, arrived lukewarm and lacking in flavor. The main course, purportedly the highlight of the meal, was overcooked and bland, leaving me struggling to find any redeeming qualities.\n\nFurthermore, the service was lackluster at best. Our waiter seemed disinterested and inattentive, disappearing for extended periods without explanation. Requests for refills and condiments went unanswered, leaving us feeling neglected and frustrated.\n\nOverall, my experience at this establishment was thoroughly underwhelming. While I had hoped for a memorable dining experience, I instead left feeling disappointed and dissatisfied. I cannot in good conscience recommend this restaurant to others, as it simply does not meet the standard expected of a reputable dining establishment.\nWould not recommend this hotel to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The resort provided a luxurious stay and served as an excellent escape from the city.\n\nService was exceptional.\n\nThe swimming pool surrounded by water was one of the nicest features.\n\nGym, indoor activities, complimentary cruise ride, complimentary breakfast, and free transportation inside the resort are all added benefits.\n\nThe cruise begins at 5 p.m. daily and lasts one hour across the Alleppey backwaters.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We recently stayed at resort ⛵ for a quick family getaway. Despite the short stay, we were impressed by the resort's beautiful location, lake view and well-maintained facilities. The room was spacious and comfortable, providing a relaxing environment for our overnight stay. The staff was friendly and accommodating, ensuring that our needs were met promptly. Although we only had one night, our experience left us eager to return for a longer stay in the future. Highly recommend for a peaceful retreat with family.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good experience beautiful property restaurant excellent reasonably good complimentary breakfast beautiful peaceful walkways really plus point resort swimming pool centre lake worth mentioned hand room service improved information centre got clue activities going resort appreciate positive helpful attitude staff around total nice stay marvelous atmosphere wish come back",
                "built island backwaters property stunning surrounded entirely water plenty activities inside property occupied go town first couple days stay place complementary sunset boat ride included booking must experience alappuzha make sure watch cultural performance conducted every evening",
                "recently dined local establishment find compelled share thoughts disappointing culinary experience endured moment stepped door met ambiance promised much delivered little decor attempted exude sophistication felt forced contrived food fell far short expectations menu boasted variety options execution left much desired appetizer touted delicacy arrived lukewarm lacking flavor main course purportedly highlight meal overcooked bland leaving struggling find redeeming qualities furthermore service lackluster best waiter seemed disinterested inattentive disappearing extended periods without explanation requests refills condiments went unanswered leaving us feeling neglected frustrated overall experience establishment thoroughly underwhelming hoped memorable dining experience instead left feeling disappointed dissatisfied good conscience recommend restaurant others simply meet standard expected reputable dining establishment would recommend hotel anyone",
                "resort provided luxurious stay served excellent escape city service exceptional swimming pool surrounded water one nicest features gym indoor activities complimentary cruise ride complimentary breakfast free transportation inside resort added benefits cruise begins pm daily lasts one hour across alleppey backwaters",
                "recently stayed resort â\u009bµ quick family getaway despite short stay impressed resorts beautiful location lake view wellmaintained facilities room spacious comfortable providing relaxing environment overnight stay staff friendly accommodating ensuring needs met promptly although one night experience left us eager return longer stay future highly recommend peaceful retreat family"
            ]
        },
        {
            "name": "Uday Backwater Resort",
            "rating": [
                4.6
            ],
            "address": [
                "Punnamada, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are quite spacious and good. Service in general is good, but staff looks new and need some more training. Entry is through a very narrow road which is difficult via Google maps as well. Evening activities are recommended to ensure there is something to do in the evening.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The stay was amazing. The hotel is beautiful and very well maintained. The restaurant at the hotel was very good and the staff helped us to celebrate our daughter's birthday. They arranged for everything and were available for queries at all the times. Very prompt staff. Service is excellent. Highly recommend to everyone.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The experience was good. The property is beautiful and is maintained. The staff is courteous around the hotel. The in house restaurant is very nice as well. The food tastes great and the staff is helpful, warm and nice.\n\nWe got all the services what we requested for , thanks to the entire staff , the reception and restaurant staff.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The place has a good vibe and great view.\nWith heated swimming pool and ferry rides in the backwater it's a perfect weekend get away.\nGetting to the place is a bit hard but definitely worth it.\nFood is good quality and you can play indoor and outdoor games.\nWould love to come back here again.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Stayed at this backwater resort in Alleppey.\nWhile the rooms were comfortable, the price seemed a bit steep for what was offered.\n\nThe food, however, was fantastic, but unfortunately, the staff seemed slow and disinterested, lacking basic hospitality training. Service for ordered food took unreasonably long.\n\nOn the bright side, the property's location was breathtaking, offering stunning views of the backwaters surrounded by coconut trees and nature's beauty. The supportive guards added to the experience.\n\nOverall, the location was perfect, but improvements are needed in staff efficiency and service quality to match the serene setting.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms quite spacious good service general good staff looks new need training entry narrow road difficult via google maps well evening activities recommended ensure something evening",
                "stay amazing hotel beautiful well maintained restaurant hotel good staff helped us celebrate daughters birthday arranged everything available queries times prompt staff service excellent highly recommend everyone",
                "experience good property beautiful maintained staff courteous around hotel house restaurant nice well food tastes great staff helpful warm nice got services requested thanks entire staff reception restaurant staff",
                "place good vibe great view heated swimming pool ferry rides backwater perfect weekend get away getting place bit hard definitely worth food good quality play indoor outdoor games would love come back",
                "stayed backwater resort alleppey rooms comfortable price seemed bit steep offered food however fantastic unfortunately staff seemed slow disinterested lacking basic hospitality training service ordered food took unreasonably long bright side propertys location breathtaking offering stunning views backwaters surrounded coconut trees natures beauty supportive guards added experience overall location perfect improvements needed staff efficiency service quality match serene setting"
            ]
        },
        {
            "name": "Punnamada Resort",
            "rating": [
                4.2
            ],
            "address": [
                "Punnamada, Finishing Point, Alappuzha, Aryad South, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "A resort filled with greenery.  The backwaters gives an added advantage to relax and enjoy the water, the house boats. The rooms are spacious, comfortable and clean. The food served is hot and tasty . Staff is very humble and helpful.  All together had a  great time with family. Thank you 😍",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A 5-star resort represents the epitome of luxury and excellence in the hospitality industry. Such resorts typically offer a combination of top-notch services, amenities, and facilities to provide guests with an extraordinary and indulgent experience. Here are key aspects that define a 5-star resort:\n\n1. **Accommodations:** Luxurious and spacious rooms or suites with high-end furnishings, premium bedding, and advanced technology for comfort.\n\n2. **Dining:** Multiple fine dining restaurants offering a diverse range of cuisines, often with renowned chefs creating exceptional culinary experiences.\n\n3. **Service:** Impeccable and personalized service with attentive staff trained to meet the highest standards, ensuring guests' needs are anticipated and fulfilled promptly.\n\n4. **Amenities:** Extensive and upscale amenities such as spa and wellness facilities, swimming pools, fitness centers, and recreational activities to cater to various interests.\n\n5. **Attention to Detail:** Meticulous attention to detail in every aspect of the guest experience, from the quality of linens to the design of public spaces, contributing to an overall sense of luxury.\n\nA 5-star resort strives to exceed expectations, providing a lavish and memorable stay for guests seeking the utmost in comfort, service, and sophistication.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We had a bad experience last year in this Punnamada resort. We were 8 people.The resort is extremely dirty and poorly managed.The resort seriously needs to evaluate options for improving general cleanliness. Rooms cot with fungus, water also was muddy during our time of stay. They simply told us it was because of their maintenance work. Unprofessionally took care. But food was really good. If you're looking for a hygienic rooms and stay opt for another.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The spa was really nice, if a bit overpriced. The views are simply beautiful. All the staff were really nice to talk to. You might have to receive some furry visitors at night though. Overall, really good :)",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The property is beautiful. It's located on the lovely punnammada backwaters. The furnishing is done in a way that it gives it a vintage look. The food is decent and the staff is polite. If you want to laze around band have a relaxed holiday, it's the perfect place to be in.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort filled greenery backwaters gives added advantage relax enjoy water house boats rooms spacious comfortable clean food served hot tasty staff humble helpful together great time family thank ð\u009f\u0098\u008d",
                "star resort represents epitome luxury excellence hospitality industry resorts typically offer combination topnotch services amenities facilities provide guests extraordinary indulgent experience key aspects define star resort accommodations luxurious spacious rooms suites highend furnishings premium bedding advanced technology comfort dining multiple fine dining restaurants offering diverse range cuisines often renowned chefs creating exceptional culinary experiences service impeccable personalized service attentive staff trained meet highest standards ensuring guests needs anticipated fulfilled promptly amenities extensive upscale amenities spa wellness facilities swimming pools fitness centers recreational activities cater various interests attention detail meticulous attention detail every aspect guest experience quality linens design public spaces contributing overall sense luxury star resort strives exceed expectations providing lavish memorable stay guests seeking utmost comfort service sophistication",
                "bad experience last year punnamada resort peoplethe resort extremely dirty poorly managedthe resort seriously needs evaluate options improving general cleanliness rooms cot fungus water also muddy time stay simply told us maintenance work unprofessionally took care food really good youre looking hygienic rooms stay opt another",
                "spa really nice bit overpriced views simply beautiful staff really nice talk might receive furry visitors night though overall really good",
                "property beautiful located lovely punnammada backwaters furnishing done way gives vintage look food decent staff polite want laze around band relaxed holiday perfect place"
            ]
        },
        {
            "name": "Paloma Back Water Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Thottuvathala, Kainakary, Kainakary South, Kerala 688501, India"
            ],
            "reviews": [
                {
                    "text": "Best place to stay in Alleppey.  The hotel is well spread out and the rooms are spacious.  The rooms overlook the lake and the views are spectacular.  For a premium you van get the executive rooms with your own sink pool.The swimming pool is a good size and clean with towels readily available. The staff of Paloma are their  greatest asset. They are very friendly and helpful. The chefs prepare an amazing array of dishes and are ready to make it to your taste and likes. Do take the complimentary evening boat ride, worth every minute. We'll done team Paloma and thank you for making our stay an absolute delight. Till next time.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A Serene Retreat….\n\nNestled amidst lush greenery, my recent stay at Palomar pool villa property was nothing short of magical.\nThe villa itself was a sanctuary of luxury, with spacious rooms adorned with elegant furnishings and amenities but the star attraction was the private pool.\nThe attentive staff ensured that every need was met, from arranging soothing spa treatments for my parents to organizing exciting excursions - shikara ride, speed boat etc\nWhether I was enjoying by the pool with family  or indulging in mouthwatering cuisine at the restaurant, every moment was filled with relaxation and bliss.\nIf you're looking for the perfect getaway to recharge and reconnect with yourself, look no further than a pool villa property.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Stayed here for 2 nights as a part of my Kerala Trip The property is beside the lake.The Deluxe rooms are not that great but Premium lake view rooms are really good.They also provide 1 hour complimentary Shikara ride and fishing rods.\nThe only let down is the food.The quality of food was really bad and it needs a lot of improvement .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This resort is quiet interiors where you won't find nothing nearby. You also cannot venture outside the hotel because there's nothing outside its gate. The property is so amazing along with the lake view so that you can just chill in the evening and in the pool. I must say this is one of the best properties I have visited in recent times, but, but, the service is not at all up to the mark. You need to make repetitive calls for anything you require, be it for housekeeping or room service. There are very limited options for vegetarians and the spread in the breakfast was also quite limited. The only saviour of this property is the lake view and the rooms which are quite good. The hotel also provides complimentary one-hour shikara ride which you can enjoy, but there's lack of manpower, personnel to cater to the needs of the guest when we visited in the first week of December 2023. But this resort has got a wonderful sunset view.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great water resort in Aleppy. Little far from town is only negative. We feel great surroundings and extraordinary rooms make us feel great. Beautiful scenery and views. They offer free shikara 1hr ride for the members who are staying in this resort. All photogenic locations around. Lake view rooms make our stay more precious. Must check in resort if you are interested in that budget range.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place stay alleppey hotel well spread rooms spacious rooms overlook lake views spectacular premium van get executive rooms sink poolthe swimming pool good size clean towels readily available staff paloma greatest asset friendly helpful chefs prepare amazing array dishes ready make taste likes take complimentary evening boat ride worth every minute well done team paloma thank making stay absolute delight till next time",
                "serene retreatâ\u0080¦ nestled amidst lush greenery recent stay palomar pool villa property nothing short magical villa sanctuary luxury spacious rooms adorned elegant furnishings amenities star attraction private pool attentive staff ensured every need met arranging soothing spa treatments parents organizing exciting excursions shikara ride speed boat etc whether enjoying pool family indulging mouthwatering cuisine restaurant every moment filled relaxation bliss youre looking perfect getaway recharge reconnect look pool villa property",
                "stayed nights part kerala trip property beside lakethe deluxe rooms great premium lake view rooms really goodthey also provide hour complimentary shikara ride fishing rods let foodthe quality food really bad needs lot improvement",
                "resort quiet interiors wont find nothing nearby also venture outside hotel theres nothing outside gate property amazing along lake view chill evening pool must say one best properties visited recent times service mark need make repetitive calls anything require housekeeping room service limited options vegetarians spread breakfast also quite limited saviour property lake view rooms quite good hotel also provides complimentary onehour shikara ride enjoy theres lack manpower personnel cater needs guest visited first week december resort got wonderful sunset view",
                "great water resort aleppy little far town negative feel great surroundings extraordinary rooms make us feel great beautiful scenery views offer free shikara hr ride members staying resort photogenic locations around lake view rooms make stay precious must check resort interested budget range"
            ]
        },
        {
            "name": "Chaandhni Lake View",
            "rating": [
                4.5
            ],
            "address": [
                "Nehru Trophy Starting Point, Avalokkunnu, PO, Punnamada, Starting Point, Alappuzha, Mullakkal, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "My family and I recently spent a night at Chaandhni Lake View, and while our stay had its ups and downs, there were some positive aspects worth mentioning.\n\nFirstly, the service provided by the staff was commendable. They were attentive and accommodating, ensuring that our needs were met promptly. Additionally, we found the breakfast spread to be delightful, offering a variety of tasty options to kickstart our day.\n\nFurthermore, despite some cleanliness issues in the washroom and the presence of small insects in the room, the overall ambiance of the hotel was pleasant. The view from our room, although not extraordinary, still provided a decent backdrop.\n\nWhile the swimming pool was on the smaller side, it still offered a refreshing dip, albeit a brief one.\n\nAlthough we encountered challenges with the reception staff regarding a late checkout request, the overall experience was not entirely negative.\n\nIn conclusion, while Chaandhni Lake View may have its flaws, including cleanliness issues and limited facilities, the attentive service and enjoyable breakfast contribute to a mixed but ultimately memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "we really enjoyed our time staying at Chaandhni Lake  view resort for a night. The location of the resort is fantastic as we can see the house boats floating across the lake . The room was spacious and hygienic, The service was also great and the food as well. We had a blast staying at Chaandhni Lake view Resort.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Excellent lake view resort within budget. The service was really good and spacious rooms available. We stayed in the family suite and was travelling with a 7 month old baby, had no issues at the resort. It’s quite and no disturbing noises, the private shikara ride arranged by the manager was really good and we enjoyed it a lot.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It was a nice stay with our family of 15 members.  The staff were cooperative. They arrange the boats at the hotel itself as the property is located on the banks of the lake. The food was okay and available at a nominal price. Rooms are spacious and clean.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It was a wonderful stay at Chaandini lake view. The rooms are really spacious and well maintained. Good for family. The view of the backwaters and house boats sailing along is a treat to the eyes. Recommend stay here when in Alleypey.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "family recently spent night chaandhni lake view stay ups downs positive aspects worth mentioning firstly service provided staff commendable attentive accommodating ensuring needs met promptly additionally found breakfast spread delightful offering variety tasty options kickstart day furthermore despite cleanliness issues washroom presence small insects room overall ambiance hotel pleasant view room although extraordinary still provided decent backdrop swimming pool smaller side still offered refreshing dip albeit brief one although encountered challenges reception staff regarding late checkout request overall experience entirely negative conclusion chaandhni lake view may flaws including cleanliness issues limited facilities attentive service enjoyable breakfast contribute mixed ultimately memorable stay",
                "really enjoyed time staying chaandhni lake view resort night location resort fantastic see house boats floating across lake room spacious hygienic service also great food well blast staying chaandhni lake view resort",
                "excellent lake view resort within budget service really good spacious rooms available stayed family suite travelling month old baby issues resort itâ\u0080\u0099s quite disturbing noises private shikara ride arranged manager really good enjoyed lot",
                "nice stay family members staff cooperative arrange boats hotel property located banks lake food okay available nominal price rooms spacious clean",
                "wonderful stay chaandini lake view rooms really spacious well maintained good family view backwaters house boats sailing along treat eyes recommend stay alleypey"
            ]
        },
        {
            "name": "Palmgrove Lake Resort",
            "rating": [
                4.1
            ],
            "address": [
                "NT Ward, Punnamada, Alappuzha, Aryad South, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "We had a very pleasant stay at Palmgrove. I would recommend it to anyone wishing for a calm, beautiful lake view stay. The room was clean,  spacious and architecturally wonderful. The staff were friendly and approachable and tended to all our needs quickly. The breakfast was also very good with an awesome lake facing dining area.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I spent a day in the houseboat and the night at the resort. The room was neat and clean and offered all we needed. I tried the outdoor shower and had an awesome experience. The parc is specifically pleasant and peaceful, with local vegetation growing up everywhere.\nThe boat ride was really nice too. The boat itself is really comfy. We had a few stops to sip up some coconut, we could check out the rice plantations from close up, and also went in between the houses in a canoe. This was an insight on local life.\nThe staff was really nice and helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A pleasant place to stay. It is conveniently located and offers a picturesque view of the backwaters. The rooms are of acceptable quality. However, we experienced frequent power outages during our stay, which were inconvenient and disrupted our enjoyment. The service provided could be improved. On the positive side, the food available at the resort is excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is the most wonderful place. Fabulous people. The best Kerala food. Such warm, thoughtful and easy hospitality. An ambience that couldn’t be more idyllic and just the best possible way to spend true quality time.\n\nWe were here 3 days with 12 cousins who had not met for decades. What a perfect place to have this very precious reunion…",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I recently stayed at Palmgrove Resort and was impressed by their exceptional hospitality. The staff went above and beyond to ensure a comfortable stay. The resort's serene ambiance provided a perfect escape, creating an atmosphere of tranquility. It's a peaceful oasis that allows guests to unwind and connect with nature. Overall, Palmgrove Resort offers a harmonious blend of excellent service, inviting ambiance, and a peaceful retreat. Highly recommended for those seeking a rejuvenating experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pleasant stay palmgrove would recommend anyone wishing calm beautiful lake view stay room clean spacious architecturally wonderful staff friendly approachable tended needs quickly breakfast also good awesome lake facing dining area",
                "spent day houseboat night resort room neat clean offered needed tried outdoor shower awesome experience parc specifically pleasant peaceful local vegetation growing everywhere boat ride really nice boat really comfy stops sip coconut could check rice plantations close also went houses canoe insight local life staff really nice helpful",
                "pleasant place stay conveniently located offers picturesque view backwaters rooms acceptable quality however experienced frequent power outages stay inconvenient disrupted enjoyment service provided could improved positive side food available resort excellent",
                "wonderful place fabulous people best kerala food warm thoughtful easy hospitality ambience couldnâ\u0080\u0099t idyllic best possible way spend true quality time days cousins met decades perfect place precious reunionâ\u0080¦",
                "recently stayed palmgrove resort impressed exceptional hospitality staff went beyond ensure comfortable stay resorts serene ambiance provided perfect escape creating atmosphere tranquility peaceful oasis allows guests unwind connect nature overall palmgrove resort offers harmonious blend excellent service inviting ambiance peaceful retreat highly recommended seeking rejuvenating experience"
            ]
        },
        {
            "name": "Ramada Alleppey Resort – Kerala",
            "rating": [
                4.2
            ],
            "address": [
                "Ramada Alleppy, Nehru Trophy Boat Race Finishing Point Stadium, Punnamada, Finishing Point, Alappuzha, Kerala 688001, India"
            ],
            "reviews": [
                {
                    "text": "This hotel offers a breathtaking view of the sunrise, providing guests with a truly mesmerizing experience.The buffet offered at the hotel is a gastronomic delight, featuring a wide array of delectable dishes that cater to a variety of taste preferences, leaving guests with a memorable culinary experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We stayed here as part of the club mahindra member.\n\nMy overall feedback on this property is good. Usually, CM properties are far away from the cities, but this is a tied up property and is right in the heart of Allepey Town and perhaps very few of those which has its own access to the backwaters.\n\nThe hotel is not like a resort but a business property. The hotel has all amenities like a proper gym, bar, restaurant,  swimming pool etc.\n\nPerhaps Ramada is one of few hotels to have its own bar on Allepey, and it serves right priced beer.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Bar with sometimes open roof terrace on 7th floor. Decent prices with excellent views over the lake.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It’s just next to the sea so it’s easy to just go out to the ferry/boats for your ride.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Great place to stay while enjoying Alleppey back waters... perfect location, spacious rooms, furnished to high standards, outstanding customer service and decent dining options",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "thisâ hotelâ offersâ aâ breathtakingâ viewâ ofâ theâ sunriseâ providingâ guestsâ withâ aâ trulyâ mesmerizingâ experiencethe buffet offered hotel gastronomic delight featuring wide array delectable dishes cater variety taste preferences leaving guests memorable culinary experience",
                "stayed part club mahindra member overall feedback property good usually cm properties far away cities tied property right heart allepey town perhaps access backwaters hotel like resort business property hotel amenities like proper gym bar restaurant swimming pool etc perhaps ramada one hotels bar allepey serves right priced beer",
                "bar sometimes open roof terrace th floor decent prices excellent views lake",
                "itâ\u0080\u0099s next sea itâ\u0080\u0099s easy go ferryboats ride",
                "great place stay enjoying alleppey back waters perfect location spacious rooms furnished high standards outstanding customer service decent dining options"
            ]
        },
        {
            "name": "Canoe Ville",
            "rating": [
                4.2
            ],
            "address": [
                "Choolakadavu Road, Punnamada, Kottankulangara, Alappuzha, Aryad South, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "I recently had the pleasure of staying at Canoe Ville in Alleppey, and it was an experience I won't soon forget. Nestled amidst the serene backwaters of Kerala, Canoe Ville offers a tranquil escape from the hustle and bustle of city life.\n\nFrom the moment I arrived, I was greeted with warm hospitality and genuine smiles from the staff. The accommodation options are charming and comfortable, providing a perfect blend of modern amenities and traditional charm. Overall, my experience at Canoe Ville was nothing short of magical. Whether you're seeking a romantic getaway or a peaceful retreat, Canoe Ville offers the perfect setting to relax and rejuvenate amidst the beauty of Alleppey's backwaters.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Beutiful place with good vibes.Its a small resort with four bedrooms.Its suitable for destination wedding.It have a wonderful lake view too.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We had a wonderful stay here. It is a in beautiful surroundings and we were able to arrange a backwater tour through the venue who picked us up by boat!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent place to enjoy beautiful lakeview. Also a great place to host small get togethers or functions. All this at affordable rates.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's awesome place wt nice  ambience\nLimited place of parking\nBest place for small functions",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently pleasure staying canoe ville alleppey experience wont soon forget nestled amidst serene backwaters kerala canoe ville offers tranquil escape hustle bustle city life moment arrived greeted warm hospitality genuine smiles staff accommodation options charming comfortable providing perfect blend modern amenities traditional charm overall experience canoe ville nothing short magical whether youre seeking romantic getaway peaceful retreat canoe ville offers perfect setting relax rejuvenate amidst beauty alleppeys backwaters",
                "beutiful place good vibesits small resort four bedroomsits suitable destination weddingit wonderful lake view",
                "wonderful stay beautiful surroundings able arrange backwater tour venue picked us boat",
                "excellent place enjoy beautiful lakeview also great place host small get togethers functions affordable rates",
                "awesome place wt nice ambience limited place parking best place small functions"
            ]
        },
        {
            "name": "Malayalam Lake Resorts",
            "rating": [
                4.5
            ],
            "address": [
                "Punnamada Road, East of Thottathodu Bridge, Opposite to, Coconut Boom Island Resort Near, Punnamada, Starting Point, Alappuzha, Mullakkal, Kerala 688006, India"
            ],
            "reviews": [
                {
                    "text": "The location of the resort in the Backwaters of Kerala is excellent.\nThe rooms are located directly at the water.The houseboats sail right past.\nThe service is also excellent.\nIf you have a question or you need something there is always somebody from the staff present.\nThe resort serves a good breakfast.\nFor other food the resort have connections with restaurants in the neighbourhood. You place your order and the relevant restaurant delivers your order at the room within a certain time.\nYou can also walk to a restaurant.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We stayed there for a couple of days. Beautiful location just overlooking the back waters. Quiet and serene. The rooms were also good. They don't provide food, but they do have a couple of restaurant menus who promptly deliver food to the room. Both the owner brothers r very polite and helpful. Would love to visit agin",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We thoroughly enjoyed our stay at Malayalam Resorts. The location provides a calm and tranquil escape from the town, and the view of the river is stunning. We actually changed our plans so I could spend more time watching the boats pass from the comfort of the porch. Staff are wonderfully friendly and really made out stay excellent. They have access to boat hire which is convenient, and their connection with 2 local restaurants mean you can order food and eat your meal from the calm peace of the resort. A short Tuktuk will take you in to town, and this was never a issue. We hope to come back again in the future ❤️",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Amazing small and cute hotel right by the water. The host was so friendly and helped us with everything imaginable. It was unexpectedly hot when we arrived and our host kindly offered air-conditioning. The small balcony was such a lovely place to watch the river and the boats floating by",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We had an amazing stay at your hotel. Truly enjoyed the lake view from the room. It was such an wonderful time in Alleppey.\nEspecially the hotel owner helped us with kind support and advise to manage out trip. We really appreciate your full support. I will be sure to stay at your hotel next time.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location resort backwaters kerala excellent rooms located directly waterthe houseboats sail right past service also excellent question need something always somebody staff present resort serves good breakfast food resort connections restaurants neighbourhood place order relevant restaurant delivers order room within certain time also walk restaurant",
                "stayed couple days beautiful location overlooking back waters quiet serene rooms also good dont provide food couple restaurant menus promptly deliver food room owner brothers r polite helpful would love visit agin",
                "thoroughly enjoyed stay malayalam resorts location provides calm tranquil escape town view river stunning actually changed plans could spend time watching boats pass comfort porch staff wonderfully friendly really made stay excellent access boat hire convenient connection local restaurants mean order food eat meal calm peace resort short tuktuk take town never issue hope come back future â\u009d¤ï¸\u008f",
                "amazing small cute hotel right water host friendly helped us everything imaginable unexpectedly hot arrived host kindly offered airconditioning small balcony lovely place watch river boats floating",
                "amazing stay hotel truly enjoyed lake view room wonderful time alleppey especially hotel owner helped us kind support advise manage trip really appreciate full support sure stay hotel next time"
            ]
        }
    ]
}