{
    "places_with_reviews": [
        {
            "name": "Hotel Baghal Valley",
            "rating": [
                4.2
            ],
            "address": [
                "Bakhalag-Arki Road, Teh, Arki, Khali, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Wonderful place located in scenic beauty full of nature. I wish to visit again very soon. Food was great and hospitality was superb 👌",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "My stay was extremely comfortable .The rooms were clean, very comfortable, and the staff was amazing. Excellent view from the hotel .Amazing wines, food and service, staff are extremely knowledgeable and make great recommendations.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It was great stay here rooms were very clean and spacious, view from the room balcony was just awesome and loved the food we had here also the staff was very good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The hotel and its room is so pretty and beautiful also Great Staff and so humble in nature. They also guide me about the routes. I want to visit this hotel again and again.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The stay was amazing with a picturesque view. Also the staff was quite cooperative and the services rendered were top notch!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wonderful place located scenic beauty full nature wish visit soon food great hospitality superb ð\u009f\u0091\u008c",
                "stay extremely comfortable rooms clean comfortable staff amazing excellent view hotel amazing wines food service staff extremely knowledgeable make great recommendations",
                "great stay rooms clean spacious view room balcony awesome loved food also staff good",
                "hotel room pretty beautiful also great staff humble nature also guide routes want visit hotel",
                "stay amazing picturesque view also staff quite cooperative services rendered top notch"
            ]
        },
        {
            "name": "P.W.D Rest House",
            "rating": [
                4.4
            ],
            "address": [
                "5X39+7VM, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Well serenity has peace and a good view.  This place has it.  Its just a walking distance from main bus stop and is also drivable.  A good view of Palace of the King of Arki is visible from here",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "P.W.D rest house\nwell located\npeacefull place\nbeautiful gardning\nGood Rooms\nWell Cleaned\nGood Quality food\nWell Equiped\nPlaying garden",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very good place. Nicely maintained.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Felt nice in the room",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "well serenity peace good view place walking distance main bus stop also drivable good view palace king arki visible",
                "pwd rest house well located peacefull place beautiful gardning good rooms well cleaned good quality food well equiped playing garden",
                "good place nicely maintained",
                "felt nice room",
                "good"
            ]
        },
        {
            "name": "Hotel Palace View",
            "rating": [
                3.7
            ],
            "address": [
                "5X28+RJQ, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Very good and suitable trip for the location and hotel room and meal very good trip very awesome",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location and property is good 👍\nNeed improvement in services.\nQuality of food good with average taste.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Overcharging guests - at first they will ask for 2000/room but if you walk away they will even come down to 1200. They think of guest as a milk cow, taking advantage of them as there aren't any more hotel in Arki.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Food is alright.... So is the service. The ambience is like regular Indian homes. Quite dull to be precise. I just used their restaurant. Nothing extraordinary. But since this is the only place in Arki to have food outside, giving one extra star than it deserved.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It's good service and good staff food is fantastic highen kitchen",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good suitable trip location hotel room meal good trip awesome",
                "location property good ð\u009f\u0091\u008d need improvement services quality food good average taste",
                "overcharging guests first ask room walk away even come think guest milk cow taking advantage arent hotel arki",
                "food alright service ambience like regular indian homes quite dull precise used restaurant nothing extraordinary since place arki food outside giving one extra star deserved",
                "good service good staff food fantastic highen kitchen"
            ]
        },
        {
            "name": "Hotel Check In",
            "rating": [
                5
            ],
            "address": [
                "ward no. 07, near petrol pump, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Best place to stay at Arki.",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place stay arki"
            ]
        },
        {
            "name": "Hari sharnam Home stay and restaurant",
            "rating": [
                4.9
            ],
            "address": [
                "New gahar, road, near civil supply store, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "It was good place for arki purely vegetarian and good Indian or chainese food and it was so peaceful here good service delicious food you should go here for your happy hours great place",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Rooms quality is good and food quality and quantity is also very good",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place arki purely vegetarian good indian chainese food peaceful good service delicious food go happy hours great place",
                "rooms quality good food quality quantity also good"
            ]
        },
        {
            "name": "Roti mojo hotel",
            "rating": [
                4.8
            ],
            "address": [
                "NH205, Shalaghat, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Tranquil Stopover on the Way to Manali\n\nI recently spent a night in Shimla on my way to Manali, and it turned out to be a delightful experience. The location is conveniently situated en route to Manali, making it an ideal stopover.\n\nThe peaceful ambiance of the place was a breath of fresh air. The staff members were incredibly welcoming and hospitable, adding a personal touch to the stay. Their attentiveness and friendliness made the experience even more memorable.\n\nThe food served was not only delicious but also reflected the local flavors. It was a culinary delight that enhanced my overall satisfaction. The accommodation provided was comfortable and well-maintained, ensuring a restful night's sleep.\nmy last night in Shimla was a pleasant surprise, and I would highly recommend this place to fellow travelers. It made my journey to Manali even more enjoyable, leaving me with fond memories of a peaceful stopover.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Good place for tea coffee lunch brackfast dinar or night stay",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "In my 5 days trip first time I had my excellent dinner.  Must visit … on the way to shalaghat 👌👌👌👌",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very very tasty foid",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Food is very good 😋",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "tranquil stopover way manali recently spent night shimla way manali turned delightful experience location conveniently situated en route manali making ideal stopover peaceful ambiance place breath fresh air staff members incredibly welcoming hospitable adding personal touch stay attentiveness friendliness made experience even memorable food served delicious also reflected local flavors culinary delight enhanced overall satisfaction accommodation provided comfortable wellmaintained ensuring restful nights sleep last night shimla pleasant surprise would highly recommend place fellow travelers made journey manali even enjoyable leaving fond memories peaceful stopover",
                "good place tea coffee lunch brackfast dinar night stay",
                "days trip first time excellent dinner must visit â\u0080¦ way shalaghat ð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008c",
                "tasty foid",
                "food good ð\u009f\u0098\u008b"
            ]
        },
        {
            "name": "R.K Food Corner",
            "rating": [
                4.3
            ],
            "address": [
                "Near New Bus Stand, Manju Road, Opposite To Gas Agency, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Yummy home made food. Do try it if you are not much fussy about the ambience etc. Place a bit congested but the food compensates for everything.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Testy food with Hiamchali test .\nMorning 7AM to Night 9PM",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "yummy home made food try much fussy ambience etc place bit congested food compensates everything",
                "testy food hiamchali test morning night pm"
            ]
        },
        {
            "name": "Dev Food Corner.and Home Stay",
            "rating": [
                4.3
            ],
            "address": [
                "5XJF+399, Kotli, Himachal Pradesh 173235, India"
            ],
            "reviews": [
                {
                    "text": "Good food & stay...also staff behaviour was appreciable.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A restaurant cum small hotel in lonely sight with lovely food.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "At very nice & calm place. Most important thing is the owner duo of son and father are really nice, respectful and helpful towards guests. 100% recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good food facility available here and arounding area environment so fure and beautiful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great place good food",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good food stayalso staff behaviour appreciable",
                "restaurant cum small hotel lonely sight lovely food",
                "nice calm place important thing owner duo son father really nice respectful helpful towards guests recommended",
                "good food facility available arounding area environment fure beautiful",
                "great place good food"
            ]
        },
        {
            "name": "StayVista at Arki Heritage Haveli",
            "rating": [
                5
            ],
            "address": [
                "The Palace, Plot No 21B, Arki Fort Rd, near Hotel Check In, Arki, Himachal Pradesh 173208, India"
            ],
            "reviews": [
                {
                    "text": "Home away from home. Lovely hosts and amazing hospitality. ❤️",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "it was good experience",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "home away home lovely hosts amazing hospitality â\u009d¤ï¸\u008f",
                "good experience"
            ]
        },
        {
            "name": "Forest rest House",
            "rating": [
                "Unknown"
            ],
            "address": [
                "4XW6+J77, SH 9, Batal, Himachal Pradesh 173208, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}