{
    "places_with_reviews": [
        {
            "name": "Ananta Spa & Resort Pushkar",
            "rating": [
                4.4
            ],
            "address": [
                "Village-Leela Sevri, Ajmer, Pushkar Rd, Pushkar, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "A literal gem in a perfectly situated place of Pushkar, hands down a real  resort with everything you could wish for.\nCheck in to check out everything was very smooth, they offer you each and everything how it should be in a very courteous way.\nIt's a beautiful property with lush green gardens and views to look out for, they also have bicycles if you're interested in taking a round of their property.\nThe pool is perfect too, placed in the centre of the property. They also have a huge lawn with swings and what not for kids as well as for hosting a party.\nI had booked 2 rooms for 2 days, which were Balcony sit out with Bali theme shower which was really out of my expectations and it was huge.\nOther room was luxury tent which was kinda small and situated near the highway plus it was kinda smaller than the other one so I wasn't really happy, the service there was slow because it was on very side of the resort plus monkeys are a menace there.\nComing to the food, dinner buffet options was very limited and Breakfast was the only buffet that was kinda upto my liking and taste.\nI was impressed with the overall service the resort provided us with, I had misplaced my sunglasses and they had found them out after I told them that I have misplaced them.\nI am sure I'll be visiting this place again with my family and friends.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It's always great to stay in Ananta. It's my family trip and it's Frist time in Pushkar. Enjoyed stay here in Ananta. Superb ambience as well as services and hospitality is as great as always. Will recommend my mates this property.\nThanks Ananta &team.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "A beautiful resort just outside of the main Pushkar city. A quick 10-minute drive by taxi and a little longer by Tuk-Tuk, and you are in the bustle city.\nThe resort was clean with friendly staff and all the amenities you could need. The gym was nice and chilled with a trainer to help you if needed. My favorite place was to relax by the pool.  The room we were in had a beautiful outdoor shower, and the body wash and lotion felt so good on my skin. I enjoyed the food and cocktails too.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "So we stayed here for 3nights with our 1 year old. The property is amazing the location is excellent BUT the service is extremely poor. The staff is very slow. We had bf and dinner at restaurant of hotel and mind you the staff is so slow in helping us. There is no help no chef who can cook baby food. It was very upsetting. Go there if you like slow service n have ample time to enjoy. Rest I give 3 star for beauty of property.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The rooms are good, property is also good. Surrounded by nature. Beautiful rooms and awesome food we enjoyed our leisure time here and surely looking forward for.more trips and will recommend and we liked the pool ambience so and and even the activities were good.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "literal gem perfectly situated place pushkar hands real resort everything could wish check check everything smooth offer everything courteous way beautiful property lush green gardens views look also bicycles youre interested taking round property pool perfect placed centre property also huge lawn swings kids well hosting party booked rooms days balcony sit bali theme shower really expectations huge room luxury tent kinda small situated near highway plus kinda smaller one wasnt really happy service slow side resort plus monkeys menace coming food dinner buffet options limited breakfast buffet kinda upto liking taste impressed overall service resort provided us misplaced sunglasses found told misplaced sure ill visiting place family friends",
                "always great stay ananta family trip frist time pushkar enjoyed stay ananta superb ambience well services hospitality great always recommend mates property thanks ananta team",
                "beautiful resort outside main pushkar city quick minute drive taxi little longer tuktuk bustle city resort clean friendly staff amenities could need gym nice chilled trainer help needed favorite place relax pool room beautiful outdoor shower body wash lotion felt good skin enjoyed food cocktails",
                "stayed nights year old property amazing location excellent service extremely poor staff slow bf dinner restaurant hotel mind staff slow helping us help chef cook baby food upsetting go like slow service n ample time enjoy rest give star beauty property",
                "rooms good property also good surrounded nature beautiful rooms awesome food enjoyed leisure time surely looking forward formore trips recommend liked pool ambience even activities good"
            ]
        },
        {
            "name": "Pushkara Resort and Spa",
            "rating": [
                4.2
            ],
            "address": [
                "Pushkar Bypass Rd, near Sudha Bai Budha, Nedaliya, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "I stayed in this hotel on 8/9 th April. Worst service. No cleanliness. Staff are illiterate. Service is also very bad. I called them 5 times to pick up my luggage at time of check out. But nobody came l.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I think all comes to service and hospitality these days most of the resorts are well maintained situated at gud locations. This Resort lacks in both of these elements. The staff was ignorant and arrogant only few were there to help or assist otherwise rest of the staff wasn't helping. We were calling room service 3 or 4 times to get things done. Never seen such a delayed response everytime we called. There were times wen they didn't even answered our calls. I won't recommend any1 to come here.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This place has my heart. One of the best resorts I have been to. Staff is good. Location of the resort is excellent it has mountain view. The place is very well maintained and it is very clean and silent. If you are in Pushkar or Ajmer you must book this resort as it is budget friendly and great place.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "My experience is not good as the hospitality is not up to mark which paid. I have booked complete tent house for marriage function, initially after check in the response was good but as the time comes to check out there is no response from reception, I have talked to reception from room but the response was very bad and not satisfactory, then Mr.Sayed come when we called him,he then provide service himself. The name Pushkara which is premium with facility and paid accordingly. The name which we have taken is not good to us. Pushkara has to  improve upon",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst hotel of our 3-week trip in India. Poor service , dirty rooms  and public spaces.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed hotel th april worst service cleanliness staff illiterate service also bad called times pick luggage time check nobody came l",
                "think comes service hospitality days resorts well maintained situated gud locations resort lacks elements staff ignorant arrogant help assist otherwise rest staff wasnt helping calling room service times get things done never seen delayed response everytime called times wen didnt even answered calls wont recommend come",
                "place heart one best resorts staff good location resort excellent mountain view place well maintained clean silent pushkar ajmer must book resort budget friendly great place",
                "experience good hospitality mark paid booked complete tent house marriage function initially check response good time comes check response reception talked reception room response bad satisfactory mrsayed come called himhe provide service name pushkara premium facility paid accordingly name taken good us pushkara improve upon",
                "worst hotel week trip india poor service dirty rooms public spaces"
            ]
        },
        {
            "name": "Jollywood Banquet and Resort",
            "rating": [
                4.2
            ],
            "address": [
                "KHASRA NO 889/1473 ,BUDHA PUSHKAR KANAS TEH. PUSHKAR, DIST, Nedaliya, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "I am so excited to tell you about this absolutely stunning resort that I recently visited! It was like stepping into a dreamland. From the moment I arrived, I was captivated by the sheer beauty and tranquility of the place.\n\nThe resort was nestled amidst lush greenery, with towering trees and vibrant flowers all around. The air was so fresh and invigorating, it felt like a breath of pure serenity. The resort was designed in a way that perfectly blended with its natural surroundings, creating a harmonious and peaceful atmosphere.\n\nThe view from the resort was absolutely breathtaking. It overlooked a crystal-clear lake, with majestic mountains in the distance. I spent hours just gazing at the mesmerizing scenery, feeling completely at peace with the world.\n\nThe resort had a wide range of amenities to offer. There was a luxurious spa where I indulged in rejuvenating treatments and massages. The swimming pool was like a sparkling oasis, perfect for a refreshing dip. And the food! Oh, the food was simply divine. The resort had multiple restaurants serving a variety of cuisines, each dish crafted with utmost care and bursting with flavors.\n\nOne of my favorite features of the resort was the abundance of activities. I went on nature walks, exploring the surrounding trails and discovering hidden gems along the way. I also tried my hand at various water sports on the lake, which added an extra dose of excitement to my stay.\n\nThe staff at the resort were incredibly warm and attentive, ensuring that every aspect of my experience was nothing short of perfection. Their hospitality truly made me feel like royalty.\n\nOverall, my time at this beautiful resort was nothing short of magical. It was a place where I could escape from the hustle and bustle of everyday life and immerse myself in nature's embrace. I left feeling refreshed, rejuvenated, and with memories that will last a lifetime. I cannot recommend this resort enough to anyone seeking a truly enchanting getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Attended a wedding, the location, the property, the whole set up is great. Being a sought after location for a destination wedding, hotel management needs to have additional staff to ensure rooms are ready in time. Hotel management needs to have a supervisor to see whether the cleaning staff has cleaned the room properly , ours was not flushed when handed to us.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Improvement area : Food quality\nService is slow\nOver cost-cutting need to avoid\nMissing thing tissues papers\nGood quality sloon at every stall\nDrinking Water bottle and water cooler quality\nBrand is missing\nTee cup quality is very compromise. Even disposal cups are very very small\n90% of the time the food was cold .\n\nStaff behaviour was rude my child shared lots of incidents of rude behavior.\n\nFood was over spicy not meeting international even national standards\n\nThe staff dress is very compromised we feel the lack of professionalism , behavior training and sustainability of the brand image due to bad apparence.\n\nAll above things compromise stay in jolly wood resort.\n\nAdvice for installing RO and water coolers in the common area for self service.\n\nAdvice for a proper heating system in a live kitchen and food area\n\nAdvice to install a few microwaves in common area",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I came with family at this resort very poor service by management, poor food quality, v.poor room services, feel very bad after paying so much but not single thing is good never visit I request you their is sahdev , pushkara, annta, aram bagh etc many other reasonable and highly comfortable resorts available.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We were one of the guests who had visited the Jollywood banquet and resort at Pushkar near Ajmer. We like the venue and the arrangements for the wedding function. The facilities are really  excellent and the staff too were very cooperative. The road connectivity of about 2 kms off the main pushkar road is not very good, poor lighting in the night. The area is developing further for wedding destinations.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excited tell absolutely stunning resort recently visited like stepping dreamland moment arrived captivated sheer beauty tranquility place resort nestled amidst lush greenery towering trees vibrant flowers around air fresh invigorating felt like breath pure serenity resort designed way perfectly blended natural surroundings creating harmonious peaceful atmosphere view resort absolutely breathtaking overlooked crystalclear lake majestic mountains distance spent hours gazing mesmerizing scenery feeling completely peace world resort wide range amenities offer luxurious spa indulged rejuvenating treatments massages swimming pool like sparkling oasis perfect refreshing dip food oh food simply divine resort multiple restaurants serving variety cuisines dish crafted utmost care bursting flavors one favorite features resort abundance activities went nature walks exploring surrounding trails discovering hidden gems along way also tried hand various water sports lake added extra dose excitement stay staff resort incredibly warm attentive ensuring every aspect experience nothing short perfection hospitality truly made feel like royalty overall time beautiful resort nothing short magical place could escape hustle bustle everyday life immerse natures embrace left feeling refreshed rejuvenated memories last lifetime recommend resort enough anyone seeking truly enchanting getaway",
                "attended wedding location property whole set great sought location destination wedding hotel management needs additional staff ensure rooms ready time hotel management needs supervisor see whether cleaning staff cleaned room properly flushed handed us",
                "improvement area food quality service slow costcutting need avoid missing thing tissues papers good quality sloon every stall drinking water bottle water cooler quality brand missing tee cup quality compromise even disposal cups small time food cold staff behaviour rude child shared lots incidents rude behavior food spicy meeting international even national standards staff dress compromised feel lack professionalism behavior training sustainability brand image due bad apparence things compromise stay jolly wood resort advice installing ro water coolers common area self service advice proper heating system live kitchen food area advice install microwaves common area",
                "came family resort poor service management poor food quality vpoor room services feel bad paying much single thing good never visit request sahdev pushkara annta aram bagh etc many reasonable highly comfortable resorts available",
                "one guests visited jollywood banquet resort pushkar near ajmer like venue arrangements wedding function facilities really excellent staff cooperative road connectivity kms main pushkar road good poor lighting night area developing wedding destinations"
            ]
        },
        {
            "name": "Sahdev Bagh Pushkar | Best Hotel in Pushkar",
            "rating": [
                4.2
            ],
            "address": [
                "Budha Pushkar Rd, Nedaliya, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "Amazing Place.\nBreakfast Buffet was just amazing.\nRooms were too clean and big.\nService was exceptional by the hotel staff, felt like living in a King's Palace because of the ambience and the design of the hotel.\nJust one drawback, very difficult to get a cab to ajmer city from this place as it's a little inside from the Main Road/ Pushkar City, so I would say plan accordingly.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We stayed there for 3 days . The hotel and ambience is fabulous. but I had only one complain to restaurant staff not with all .first two days restaurant staff was so polite and co operative. But last day shift has changed. And on that day staff was so non co operative and rude . Which one I asked they compleltly denied without understanding my problem. The previous staff was so sensible and understand my issue very politely. But last my experience was worst ...It was really disappointed me so much. my check in on 25 Feb 2024 and check out on 28 Feb 2024 .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Property looks good, rooms are good barring a little wear and tear. Location is away (15 mins) from the main city so good if you want to be away. If you have your own vehicle it's great to get into the city, otherwise cabs can be expensive to get to and come back from the Lake/city centre.\n\nFood is okay- could definitely be better, we ordered a tandoor platter which came cold.\n\nThe jacuzzi in the Maharani suite - should be maintained, took more than an hour to clean, fill, clean, start the system. I guess they aren't prepared for guests to use it?\n\nOtherwise the bathtub and room is nice and spacious. But lacklustre in terms of amenities already there and not able to use without so much effort.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Amazing stay with amazing mountain view. This is a well maintained property with one the finest food. Overall a must to visit for next time. Great hospitality ffom bharat singh at the breakfast buffet",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "WE happened to stay in this hotel for one night during a visit to Pushkar for attending a wedding ceremony. The hotel is well located and adjacent to Jollywood resort known for the destination weddings. The rooms were awesome and the staff too were so good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing place breakfast buffet amazing rooms clean big service exceptional hotel staff felt like living kings palace ambience design hotel one drawback difficult get cab ajmer city place little inside main road pushkar city would say plan accordingly",
                "stayed days hotel ambience fabulous one complain restaurant staff first two days restaurant staff polite co operative last day shift changed day staff non co operative rude one asked compleltly denied without understanding problem previous staff sensible understand issue politely last experience worst really disappointed much check feb check feb",
                "property looks good rooms good barring little wear tear location away mins main city good want away vehicle great get city otherwise cabs expensive get come back lakecity centre food okay could definitely better ordered tandoor platter came cold jacuzzi maharani suite maintained took hour clean fill clean start system guess arent prepared guests use otherwise bathtub room nice spacious lacklustre terms amenities already able use without much effort",
                "amazing stay amazing mountain view well maintained property one finest food overall must visit next time great hospitality ffom bharat singh breakfast buffet",
                "happened stay hotel one night visit pushkar attending wedding ceremony hotel well located adjacent jollywood resort known destination weddings rooms awesome staff good"
            ]
        },
        {
            "name": "Savitri Resorts Pushkar",
            "rating": [
                4.3
            ],
            "address": [
                "Ganehera, Motisar Rd, near Railway Station, Pushkar, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "Immaculate property with spacious rooms and mountain views. This property in nestled among green trees with expansive grounds. Family friendly with multiple pools. The staff could not be more accommodating tending to your every need. Food is delicious with a great variety. Just a short drive to the town center, this resort offers rest and relaxation. I highly recommend!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very nice resort with beautiful location. When we enjoy nature By the pool side,it feels like heaven too. The behaviour of the staff is also good .Food is very good ,Even sleeping or eating arrangements were made for my driver. I think this resort is best for you. 5/5 stars for this resort by me and my family . Thanks to all savitri resort team I will definitely come again. 😊",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I stayed here for 2 days to attend a destination wedding.  Property is good at an average location of Pushkar but service of the staff is not upto the mark. Especially Reception staff tries to avoide any support . They have very good patience and waits till you get the solution of your problem by any other means or ignore / forget that. Although they wouldn't commit  more than 5 minutes to help you but help ............",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good spacious rooms.  Overall good location and property has pool ,good mountain views ...pushar is already a tourist town so it gets its vibe , good place ...here in a marriage visit but overall good and service also decent and clean.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Attended a marriage ceremony here. Enjoyed a lot. Very well maintained resort and nice well mannered staff. Will love to visit again and again.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "immaculate property spacious rooms mountain views property nestled among green trees expansive grounds family friendly multiple pools staff could accommodating tending every need food delicious great variety short drive town center resort offers rest relaxation highly recommend",
                "nice resort beautiful location enjoy nature pool sideit feels like heaven behaviour staff also good food good even sleeping eating arrangements made driver think resort best stars resort family thanks savitri resort team definitely come ð\u009f\u0098\u008a",
                "stayed days attend destination wedding property good average location pushkar service staff upto mark especially reception staff tries avoide support good patience waits till get solution problem means ignore forget although wouldnt commit minutes help help",
                "good spacious rooms overall good location property pool good mountain views pushar already tourist town gets vibe good place marriage visit overall good service also decent clean",
                "attended marriage ceremony enjoyed lot well maintained resort nice well mannered staff love visit"
            ]
        },
        {
            "name": "Bamboo Saa Mulberry Resort, Pushkar",
            "rating": [
                4.4
            ],
            "address": [
                "GG2X+58V, Sunil Gour Devnagar Rd, opp. Gaushala, Pushkar, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "The stay was amazing.The food was really delicious and staff was really friendly. Swimming pool is well maintained.\nOverall it was a great experience and we enjoyed a lot",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "GM Uttam and his team is truly humble and professional at the same time. They know how to pay respect to their guests with small gestures. Well trained team by Manager. Room was spacious and clean, in fact can beat any good five star hotel. They are using chemicals free bathroom amenities. Room linen is best of the quality.\n\nWe booked our stay for one night but extended for 2. We ate both nights at hotel and the food is outstanding. Service is also quick. Reception team always having smiling face which is very important. The security guard at the main gate always folds hand while we are going out and coming in.\n\nThank you Uttam and team for making our stay so comfortable.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "My recent stay at Mulberry Bamboosa Resort, Pushkar was nothing short of exceptional. From the moment we arrived, we were enveloped in an atmosphere of relaxation and luxury.\n\nThe resort's location is stunning, nestled amidst Aravali Range, offering breathtaking views and a sense of tranquility. The rooms were beautifully appointed, spacious, and meticulously maintained.\n\nWhat truly stood out was the impeccable service provided by the staff. They were attentive, friendly, and went above and beyond to ensure our comfort throughout our stay.\n\nThe dining experience was equally delightful. The resort's restaurants offered a diverse array of delicious dishes, showcasing both local flavors and international cuisine. Each meal was a culinary delight.\n\nThe pool area was another highlight, perfect for unwinding under the sun with a refreshing drink in hand.\n\nI would highly recommend Bamboosa Mulberry Resort to anyone looking for a memorable and rejuvenating getaway. Many thanks to the entire team for their warm hospitality. We can't wait to visit again!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Had a fantastic stay at Bamboo Saa Mulberry in Pushkar! The room was spotlessly clean and well-maintained. The breakfast was delightful. Conveniently located, it's just a short distance from both Pushkar Lake and the shopping center. Overall, a very pleasant experience – highly recommended for a comfortable and enjoyable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "\"The staff at the wedding hotel exceeded our expectations. Their attention to detail, professionalism, and warm hospitality made our celebration truly exceptional. Every team member contributed to the seamless flow of events, and we're grateful for their dedication in making our special day even more memorable.\"",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay amazingthe food really delicious staff really friendly swimming pool well maintained overall great experience enjoyed lot",
                "gm uttam team truly humble professional time know pay respect guests small gestures well trained team manager room spacious clean fact beat good five star hotel using chemicals free bathroom amenities room linen best quality booked stay one night extended ate nights hotel food outstanding service also quick reception team always smiling face important security guard main gate always folds hand going coming thank uttam team making stay comfortable",
                "recent stay mulberry bamboosa resort pushkar nothing short exceptional moment arrived enveloped atmosphere relaxation luxury resorts location stunning nestled amidst aravali range offering breathtaking views sense tranquility rooms beautifully appointed spacious meticulously maintained truly stood impeccable service provided staff attentive friendly went beyond ensure comfort throughout stay dining experience equally delightful resorts restaurants offered diverse array delicious dishes showcasing local flavors international cuisine meal culinary delight pool area another highlight perfect unwinding sun refreshing drink hand would highly recommend bamboosa mulberry resort anyone looking memorable rejuvenating getaway many thanks entire team warm hospitality cant wait visit",
                "fantastic stay bamboo saa mulberry pushkar room spotlessly clean wellmaintained breakfast delightful conveniently located short distance pushkar lake shopping center overall pleasant experience â\u0080\u0093 highly recommended comfortable enjoyable stay",
                "staff wedding hotel exceeded expectations attention detail professionalism warm hospitality made celebration truly exceptional every team member contributed seamless flow events grateful dedication making special day even memorable"
            ]
        },
        {
            "name": "Aaram Baagh by Pachar Group, Pushkar",
            "rating": [
                4
            ],
            "address": [
                "Village Motisar, Tehsil, Dist, Ganahera, Pushkar, Surajkund, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "The only maintained area of the resort is the reception. I would not even rate single star to service. The staff and the hotel administration were pathetic, lazy, and unresponsive to even basic needs like water, cleaning and first-aid. Not worth the money. The property is big but useless when not maintained. Common pool was not clean. Private pools were not filled up. Bedding was not arranged properly. Worst experience ever.\nWould not recommend at all.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The only maintained area of the resort is the reception. I would not even rate single star to service. The staff and the hotel administration is pathetic, lazy, and unresponsive to even basic needs like water, cleaning and first-aid. Currently I stay in the bunglow. I asked the management to make clean our private pool, 1.5 hour has been passed no one come yet. Not worth the money. The property is big but useless when not maintained and managed. Common pool was not clean. Private pools were not filled up. Bedding was not arranged properly. Worst experience ever.\nWould not recommend at all.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I went there for my school adventure camp and the experience was not good at all..\n\nIf you enter the “hotel” first time it will good but when you enter the rooms the lights were not working, thankfully we reached in the afternoon. There was only cold water and no soap in the washroom, the pipe made noise every time we flushed the toilet. The TV in the room looks so old. The only light that we had was NOT working. The stage outside was dirty The rooms were creepy… I have so much more to say but it is going to make a long list☹️",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Magical retreat! Mesmerizing blend of history and luxury. Spacious rooms with breathtaking views. Ideal location. Can't wait to return!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Beautiful view location interior exterior space well maintained but food is zero, staff service is zero food quality zero highly expensive food with no taste",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "maintained area resort reception would even rate single star service staff hotel administration pathetic lazy unresponsive even basic needs like water cleaning firstaid worth money property big useless maintained common pool clean private pools filled bedding arranged properly worst experience ever would recommend",
                "maintained area resort reception would even rate single star service staff hotel administration pathetic lazy unresponsive even basic needs like water cleaning firstaid currently stay bunglow asked management make clean private pool hour passed one come yet worth money property big useless maintained managed common pool clean private pools filled bedding arranged properly worst experience ever would recommend",
                "went school adventure camp experience good enter â\u0080\u009chotelâ\u0080\u009d first time good enter rooms lights working thankfully reached afternoon cold water soap washroom pipe made noise every time flushed toilet tv room looks old light working stage outside dirty rooms creepyâ\u0080¦ much say going make long listâ\u0098¹ï¸\u008f",
                "magical retreat mesmerizing blend history luxury spacious rooms breathtaking views ideal location cant wait return",
                "beautiful view location interior exterior space well maintained food zero staff service zero food quality zero highly expensive food taste"
            ]
        },
        {
            "name": "Clarks Safari Pushkar",
            "rating": [
                4.3
            ],
            "address": [
                "Clarks Safari Pushkar, Motisar Rd, Village, Ganahera, Pushkar, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "Good property with good rooms and location.Gives you a proper villas and village feel. Food is good,fresh and tasty. Services are an area of improvement in every area .They are good to handle small groups and a few families at a time but need to improve services for big groups.Overall value for money and budget friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It was an above average experience.\nLook, feel and space in rooms and Services were good.\nFriendly staff. Ready to attend your requirement at any given time of day and night.\nWe had Breakfast and Dinner in resort. Food taste was good but limited variety. We feel local cuisine of Rajasthan was missing to give travellers feel of Local cuisine.\nSince not much things nearby, we recommend to book resort with Breakfast and 1 meal atleast.\nMany activities to do in resort like Game room, vollyball, badminton, swimming, gym, fruit picking from trees etc.\nParking space was available.\nLocation is near to Camal Desert Safari (Negotiate big time) and Brahma Temple.\n\nSince the location is in mid of Jungle do expect few reptiles appearing in your room.\nWe had company of couple of lizard in our room which impacted sleeping comfort for my family.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Worst service experience ever.\nRequested multiple times for water but no quick response.\nRequested for bon fire but refused even set up is already there and we offered more money.\nNot enough lights in the free space outside the rooms.\nMilk and tea are very expensive.\nGiving live review.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We booked rooms for our guests who attended the wedding and everyone spoke very highly of the location ,the manner in which clustering is the rooms  was done and ambience and overall service extended by hotel staff. Pankaj GM of the hotel is a combination of business and friendliness and very easy frank person to interact with all in all a very good experience",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Beautiful resort, very good ambiance and well maintained. A little bit far away from the Pushkar town. Cottage type rooms, but not enough lighting in the room, no exhaust fan in the toilet.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good property good rooms locationgives proper villas village feel food goodfresh tasty services area improvement every area good handle small groups families time need improve services big groupsoverall value money budget friendly",
                "average experience look feel space rooms services good friendly staff ready attend requirement given time day night breakfast dinner resort food taste good limited variety feel local cuisine rajasthan missing give travellers feel local cuisine since much things nearby recommend book resort breakfast meal atleast many activities resort like game room vollyball badminton swimming gym fruit picking trees etc parking space available location near camal desert safari negotiate big time brahma temple since location mid jungle expect reptiles appearing room company couple lizard room impacted sleeping comfort family",
                "worst service experience ever requested multiple times water quick response requested bon fire refused even set already offered money enough lights free space outside rooms milk tea expensive giving live review",
                "booked rooms guests attended wedding everyone spoke highly location manner clustering rooms done ambience overall service extended hotel staff pankaj gm hotel combination business friendliness easy frank person interact good experience",
                "beautiful resort good ambiance well maintained little bit far away pushkar town cottage type rooms enough lighting room exhaust fan toilet"
            ]
        },
        {
            "name": "Wild Rose Resort & Spa",
            "rating": [
                4.7
            ],
            "address": [
                "Khasra 2031, Tilora, Pushkar, Ajmer, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "We came for our first anniversary, It was a great experience staying here. They have provided us all the service very politely and timely. The resort was super clean. The property was really amazing, we had fun with all outdoor and indoor games. We visited on long weekend so there was complimentary Camel ride and 2 days live music which was really amazing. Only thing which was lacking was the location, it was around 2.5km inside the main road because of which at night you can't visit the local places.\nWe asked for some anniversary decor which was really beautiful.\nI will definitely visit here again with my family for relaxing stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "My recent stay at Wild Rose was an absolute delight. The attentive and friendly staff went above and beyond, ensuring a seamless and enjoyable experience. The highlight for me was the breathtaking swimming pools – a true oasis of relaxation with pristine water and inviting surroundings.\n\nThe culinary offerings exceeded my expectations, with a diverse menu of delicious dishes that catered to various tastes. Whether indulging in a family dinner or enjoying a meal with friends, the restaurant at Wild Rise left a lasting impression.\n\nWild Rise, as its name suggests, truly rises above the ordinary, making it an ideal destination for both family vacations and bachelor getaways. The carefully crafted atmosphere and attention to detail make every moment special. I wholeheartedly recommend Wild Rise for anyone seeking a luxurious and memorable",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I usually don't write reviews, but this place deserves more than that. This resort feels like a second home to me. Nestled in a tranquil and natural setting, it's an ideal spot for relaxation. The staff goes above and beyond, treating you like family with their fantastic hospitality. The rooms offer a beautiful view, and the food is exceptionally amazing. The chef, a state winner by the way, is both talented and down-to-earth.\n\nI find myself returning to this place because of its comforting and welcoming atmosphere. I highly recommend it to anyone seeking a simple and relaxing getaway. Give it a try, and you won't regret it!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We stayed in the cottage rooms. Great setup with a private garden, felt like we were in nature. Lovely pool and lawn. Holi celebration was also very nicely organized. Food was okay. Our tent (possibly only ours) had a horrible smell that did not go away, which really dampened our experience. Camel ride and closing the cows was very nice. They've really maintained the property well.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Couldn't have asked for more. I loved the room, the green surroundings and the service.\nThe property is adequately maintained and is very clean, including the pool area,  gardens as well as the rooms.\nThe bed linen was neat and clean. The bathrooms were highly clean too.\nI'd suggest to go for the room with garden view and bathtub/ plunge pool.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "came first anniversary great experience staying provided us service politely timely resort super clean property really amazing fun outdoor indoor games visited long weekend complimentary camel ride days live music really amazing thing lacking location around km inside main road night cant visit local places asked anniversary decor really beautiful definitely visit family relaxing stay",
                "recent stay wild rose absolute delight attentive friendly staff went beyond ensuring seamless enjoyable experience highlight breathtaking swimming pools â\u0080\u0093 true oasis relaxation pristine water inviting surroundings culinary offerings exceeded expectations diverse menu delicious dishes catered various tastes whether indulging family dinner enjoying meal friends restaurant wild rise left lasting impression wild rise name suggests truly rises ordinary making ideal destination family vacations bachelor getaways carefully crafted atmosphere attention detail make every moment special wholeheartedly recommend wild rise anyone seeking luxurious memorable",
                "usually dont write reviews place deserves resort feels like second home nestled tranquil natural setting ideal spot relaxation staff goes beyond treating like family fantastic hospitality rooms offer beautiful view food exceptionally amazing chef state winner way talented downtoearth find returning place comforting welcoming atmosphere highly recommend anyone seeking simple relaxing getaway give try wont regret",
                "stayed cottage rooms great setup private garden felt like nature lovely pool lawn holi celebration also nicely organized food okay tent possibly horrible smell go away really dampened experience camel ride closing cows nice theyve really maintained property well",
                "couldnt asked loved room green surroundings service property adequately maintained clean including pool area gardens well rooms bed linen neat clean bathrooms highly clean id suggest go room garden view bathtub plunge pool"
            ]
        },
        {
            "name": "Hotel Golden Heritance - Pushkar",
            "rating": [
                4.3
            ],
            "address": [
                "Jamni Kund Road, Ganahera, Pushkar, Rajasthan 305022, India"
            ],
            "reviews": [
                {
                    "text": "⭐⭐⭐⭐⭐\nMy stay at Hotel Golden Heritage in Pushkar was absolutely fantastic! From the moment I arrived, I was greeted with warm hospitality and impeccable service. The staff went above and beyond to ensure that my every need was met, making me feel like a VIP throughout my entire stay. The room was spacious, clean, and beautifully decorated, providing a peaceful retreat after a day of exploring Pushkar. The hotel's picturesque surroundings and tranquil atmosphere added to the overall charm of the experience. Additionally, the delicious cuisine served at the on-site restaurant left me craving for more. I highly recommend Hotel Gorden Heritage to anyone looking for a luxurious and memorable stay in Pushkar.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at the Golden Heritance Hotel in Pushkar and was thoroughly impressed with my experience. From the moment I arrived, I received a warm welcome from the staff, setting the tone for a fantastic stay. Manager Dhruv went above and beyond to ensure my comfort, even providing a complimentary upgrade to my room, which was a delightful surprise.\n\nThe property itself is impeccably maintained, boasting a clean and neat environment throughout. The rooms are beautifully furnished, offering both comfort and style, making it easy to relax after a day of exploring Pushkar.\n\nOne of the highlights of my stay was the food. Not only was it delicious, but the rates were also very reasonable, making dining at the hotel a convenient and enjoyable option.\n\nOverall, my experience at the Golden Heritage Hotel was nothing short of excellent. From the warm hospitality to the well-maintained property and delicious food, it exceeded my expectations in every way. I would highly recommend this hotel to anyone visiting Pushkar.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I had an incredible stay at this hotel! The bathrooms were truly outstanding, providing a clean and inviting atmosphere. The breakfast offered was of high quality, and the pool was impeccably maintained. The cleanliness of the bedsheet added to the overall positive experience.\n\nA notable highlight was the bathroom tiles, which not only looked aesthetically pleasing but were also non-slippery, ensuring both style and safety. The spaciousness of the bathroom, coupled with the well-maintained shower, contributed to a comfortable and enjoyable experience. The attention to hygiene throughout the stay was commendable.\n\nIn summary, my time at the hotel was marked by excellence, from the fantastic bathroom amenities to the delicious breakfast and pristine pool. I would highly recommend this hotel to others seeking a combination of comfort, cleanliness, and aesthetic appeal.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good budget hotel. It is located in a narrow lane in pushkar. The property is nice, and the food is okay too. Service is excellent. Washrooms are large and tidy. It's a good place to stay for one night in pushkar if you're looking for a budget friendly hotel. The view from the hotel is nice too. Overall, we had a decent stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very clena and hygenic Hotel and surrounding with affordable price compared to nearby hotels. Mainly Mr. Dhruv Parashar is very kind and helpful. The best in the town. The Taste of the food is excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090 stay hotel golden heritage pushkar absolutely fantastic moment arrived greeted warm hospitality impeccable service staff went beyond ensure every need met making feel like vip throughout entire stay room spacious clean beautifully decorated providing peaceful retreat day exploring pushkar hotels picturesque surroundings tranquil atmosphere added overall charm experience additionally delicious cuisine served onsite restaurant left craving highly recommend hotel gorden heritage anyone looking luxurious memorable stay pushkar",
                "recently pleasure staying golden heritance hotel pushkar thoroughly impressed experience moment arrived received warm welcome staff setting tone fantastic stay manager dhruv went beyond ensure comfort even providing complimentary upgrade room delightful surprise property impeccably maintained boasting clean neat environment throughout rooms beautifully furnished offering comfort style making easy relax day exploring pushkar one highlights stay food delicious rates also reasonable making dining hotel convenient enjoyable option overall experience golden heritage hotel nothing short excellent warm hospitality wellmaintained property delicious food exceeded expectations every way would highly recommend hotel anyone visiting pushkar",
                "incredible stay hotel bathrooms truly outstanding providing clean inviting atmosphere breakfast offered high quality pool impeccably maintained cleanliness bedsheet added overall positive experience notable highlight bathroom tiles looked aesthetically pleasing also nonslippery ensuring style safety spaciousness bathroom coupled wellmaintained shower contributed comfortable enjoyable experience attention hygiene throughout stay commendable summary time hotel marked excellence fantastic bathroom amenities delicious breakfast pristine pool would highly recommend hotel others seeking combination comfort cleanliness aesthetic appeal",
                "good budget hotel located narrow lane pushkar property nice food okay service excellent washrooms large tidy good place stay one night pushkar youre looking budget friendly hotel view hotel nice overall decent stay",
                "clena hygenic hotel surrounding affordable price compared nearby hotels mainly mr dhruv parashar kind helpful best town taste food excellent"
            ]
        }
    ]
}