{
    "places_with_reviews": [
        {
            "name": "HOTEL CRYSTAL INN",
            "rating": [
                4.1
            ],
            "address": [
                "Annabhau Sathe Chowk, XQW3+3H3 Vardaman Chambers, Jalana Rd, near Reliance Trend, sathechouk, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "One of the best hotels to stay in Beed. Safe and secure. Room service is prompt and quick. The quality of food is too good and there are more varieties to try. The cost is also affordable and not pricey...\nThe room and toilets are well maintained and no complaints.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "My time at Crystal Inn in Beed City was awful. The hotel didn't deliver on its promises, the staff acted rudely like local troublemakers, and it didn't feel safe for families. On top of that, they didn't stick to the prices they initially quoted, making the whole experience even worse.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was a bad stay the bed sheets literally have holes in them and juice was so bitter even when I added sugar it was bitter and tea was very cold after telling that to the staff they sent another tea but still it was cold and it took 30 for only tea and bread and 45 mins for juice.the beds ok ok but not the matress",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's a good hotel to stay in Beed. Rooms and toilet was clean. Hot water was available in toilet. Complimentary breakfast was ok. They have basement and ground level parking available. Food in their restaurant was ok.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good hotel to stay with family..staff is cooperative good service rooms are clean but bathroom need to be more clean",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best hotels stay beed safe secure room service prompt quick quality food good varieties try cost also affordable pricey room toilets well maintained complaints",
                "time crystal inn beed city awful hotel didnt deliver promises staff acted rudely like local troublemakers didnt feel safe families top didnt stick prices initially quoted making whole experience even worse",
                "bad stay bed sheets literally holes juice bitter even added sugar bitter tea cold telling staff sent another tea still cold took tea bread mins juicethe beds ok ok matress",
                "good hotel stay beed rooms toilet clean hot water available toilet complimentary breakfast ok basement ground level parking available food restaurant ok",
                "good hotel stay familystaff cooperative good service rooms clean bathroom need clean"
            ]
        },
        {
            "name": "Hotel Golden Choice",
            "rating": [
                4.1
            ],
            "address": [
                "someshwar Mandir, Driving School St, oppozite, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "It was a nice stay overall. Had taken the family interconnected room and it was very convenient and spacious. Both the rooms had AC. Only things that I felt needed attention was 1) the choice of food and availability and 2) the bathroom room is scrambled beside the connecting doors and either one needs to be shut for the other to open.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's a good hotel for a stay.\nThey have a restaurant for breakfast and dinner.\nParking space is also available in front of the hotel.\nRooms are quite spacious with a balcony.\n\nCleanliness can be improved for making the stay more pleasant.(Pest control needs to be checked out periodically)",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I'm giving a review for my stay\n\nThe manager is not proficient, it's not okay to take customers for granted.\nYour messages will not be heard and conveyed properly.\n\nThey will call u n say they are  shifting your luggage in your absence (you will be in your important business outside).  They will say they have bulk booking and want your room vacant for the same.\nI switched to another hotel after this incident.\nThey will keep you disturbed for unnecessary reasons.\nRooms:\nMany cockroaches in every room.\nNo complimentary drinking water in the rooms.\nMany faults in construction. Some rooms especially need to be vastu compliant for ex. mirrors on the south wall and washrooms at North East corner.(well it's upto their perception)\n\nThere are chances.... in future someone will surely fall from such \"Blind steps\" which appear after getting out of the lift(photo posted)...need to rectify at the earliest.\n\nThe only positive thing is food at taste.\n\nThey need much more effort to give service as equal as 3* for lodging.\n\nBetter for visiting the restaurant for food.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good enough rooms for a quick stopover or a few days stay. I stayed for just 1 nightz with family and while traveling across the state.\n\nThe services are good and fast. Reception check-in was fast. Their restaurant caters to food requests in-house and till 2300 hours.\nDeluxe rooms are priced in the 2000-3000 range and it meets expectations in this range.  There's a paan shop in the parking itself.\n\nBathrooms are decent but can be better cleaned. Solar geyser provides stored hot water through the night. Basic toiletries are provided.\n\nWhen leaving the place, consider leaving early in the morning to avoid the rush hour traffic of the city. Folks in smaller towns wake up early :) I saw 2 large gatherings of 50+ people on the road before 0700!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent stay. Nice food. Nice location. Nice room ambience. Staff is cooperative.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice stay overall taken family interconnected room convenient spacious rooms ac things felt needed attention choice food availability bathroom room scrambled beside connecting doors either one needs shut open",
                "good hotel stay restaurant breakfast dinner parking space also available front hotel rooms quite spacious balcony cleanliness improved making stay pleasantpest control needs checked periodically",
                "im giving review stay manager proficient okay take customers granted messages heard conveyed properly call u n say shifting luggage absence important business outside say bulk booking want room vacant switched another hotel incident keep disturbed unnecessary reasons rooms many cockroaches every room complimentary drinking water rooms many faults construction rooms especially need vastu compliant ex mirrors south wall washrooms north east cornerwell upto perception chances future someone surely fall blind steps appear getting liftphoto postedneed rectify earliest positive thing food taste need much effort give service equal lodging better visiting restaurant food",
                "good enough rooms quick stopover days stay stayed nightz family traveling across state services good fast reception checkin fast restaurant caters food requests inhouse till hours deluxe rooms priced range meets expectations range theres paan shop parking bathrooms decent better cleaned solar geyser provides stored hot water night basic toiletries provided leaving place consider leaving early morning avoid rush hour traffic city folks smaller towns wake early saw large gatherings people road",
                "excellent stay nice food nice location nice room ambience staff cooperative"
            ]
        },
        {
            "name": "Hotel Grand Yashoda",
            "rating": [
                4.2
            ],
            "address": [
                "Solapur Aurangabad Highway, Driving School St, Sahara Colony, Swaraj Nagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Very conveniently located. Relatively new construction hence rooms and bathrooms were nice, modern style and clean. Toiletries were supplied. The restaurant is really good. Food is very tasty here.\nCons- I had a feeling that linen were not changed after every use. Thankfully I had my own in the car so used it for a nights sleep .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The important feature of the hotel is the test the food here is so tasty delight delicious serving time is little quality and observation is best food quality also much greater per person the average bill becomes about 200 to 300 there is also beautiful garden there is lighting very beautiful day results over rooftop everything here is good parking also good this is indeed a grand hotel",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The food was very tasty, some of the best in the beed. The service was awesome especially Mr. Kamal singh he was very helpful in selecting the dishes and very pleasant. The restaurant also has very nice ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Had a great dinner with friends... The waiters provided a very good service especially our atendee Mr. Kamal Singh who even did suggest us our meal .Overrall the staff was very pleasant and food was very tasty",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The food was of great quality and I loved the taste 🤩, ambience of hotel is nice , the service provided by Mr. Kamal is a good man , he was polite and experienced .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "conveniently located relatively new construction hence rooms bathrooms nice modern style clean toiletries supplied restaurant really good food tasty cons feeling linen changed every use thankfully car used nights sleep",
                "important feature hotel test food tasty delight delicious serving time little quality observation best food quality also much greater per person average bill becomes also beautiful garden lighting beautiful day results rooftop everything good parking also good indeed grand hotel",
                "food tasty best beed service awesome especially mr kamal singh helpful selecting dishes pleasant restaurant also nice ambience",
                "great dinner friends waiters provided good service especially atendee mr kamal singh even suggest us meal overrall staff pleasant food tasty",
                "food great quality loved taste ð\u009f¤© ambience hotel nice service provided mr kamal good man polite experienced"
            ]
        },
        {
            "name": "Hotel Yashraj Inn , Beed",
            "rating": [
                3.8
            ],
            "address": [
                "Jalana Rd, Hina Nagar, Sawata Nagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Overall service was really good. we really loved the taste. The ambience was kid friendly. Pocket friendly restaurant. Go for it.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I am so happy to stay in Yashraj inn Hotel. I was on the way to go Shirdi Sai baba. Here Room size is very big with neat and clean. Inside room you can feel like your staying in 3 star hotel. Service & Staff is soo good and cooperative as well.\n1. If you are going with big family you can take extra charges\n2. You can get here Dinner and lunch\n3.You will get complimentary sandwich Grill.\n4. Owner of the Hotel is very nice.\n5. You can stay with your kids.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good service and Quality of room is good with affordable rent.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "One of the best veg restaurant in beed, various food options are available.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The cheapest hotel in Beed City for a birthday celebration when compared to other options.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall service really good really loved taste ambience kid friendly pocket friendly restaurant go",
                "happy stay yashraj inn hotel way go shirdi sai baba room size big neat clean inside room feel like staying star hotel service staff soo good cooperative well going big family take extra charges get dinner lunch get complimentary sandwich grill owner hotel nice stay kids",
                "good service quality room good affordable rent",
                "one best veg restaurant beed various food options available",
                "cheapest hotel beed city birthday celebration compared options"
            ]
        },
        {
            "name": "Hotel City",
            "rating": [
                4
            ],
            "address": [
                "XQQ4+PRQ, Karanja Rd, Bir, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "One of the best hotel, not only in Beed but in entire district, famous for all types of food n it's delicious as well... Biryani is the signature dish...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Amazing Biryani. The best biryani in the world. City hotel satisfying my taste buds for last 25 years.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place for non veg.Mutton biryani is just wow! One of the best biryani I have eaten.Will visit soon",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst.....test\nVery bad experience\nOver priced\nThe ambiance is not good. It's not clean and hygienic",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Midle in the City.\nNice taste.\nGood destination For non veg lovers.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best hotel beed entire district famous types food n delicious well biryani signature dish",
                "amazing biryani best biryani world city hotel satisfying taste buds last years",
                "best place non vegmutton biryani wow one best biryani eatenwill visit soon",
                "worsttest bad experience priced ambiance good clean hygienic",
                "midle city nice taste good destination non veg lovers"
            ]
        },
        {
            "name": "Hotel Gaurav",
            "rating": [
                4.3
            ],
            "address": [
                "opp. S.P. Office, Bir, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Very clean and ambient hotel in Beed city\nDidn’t expect to find something like this\nIt is reasonable as well and the AC is also good which is much much needed in Beed over all best hotel for stay in beed\nThey can increase the breakfast menu\nThey just have one option\nRest was a good experience",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice rooms and good food with fast service.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very bad experience there is no privacy there staff enter your rooms without your permission food was also not good room light was not working properly there's no water in washroom even they don't provide washroom kit they don't give drinking water plz don't go there",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Just checked in  so cannot comment for stay experience.\n\nBut for Bar and restaurant on 2nd floor 100% satisfied.,as belong from pune and I am on official visit so didn’t expect such good ambience..pune wala feeling aagya..\n\nNote - For any help at the hotel ask for mamu.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's very bad service all staff and mainegar please properly breff all staff and how to handle the costumr\nPlease change all staff and inqulding mainger",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean ambient hotel beed city didnâ\u0080\u0099t expect find something like reasonable well ac also good much much needed beed best hotel stay beed increase breakfast menu one option rest good experience",
                "nice rooms good food fast service",
                "bad experience privacy staff enter rooms without permission food also good room light working properly theres water washroom even dont provide washroom kit dont give drinking water plz dont go",
                "checked comment stay experience bar restaurant nd floor satisfiedas belong pune official visit didnâ\u0080\u0099t expect good ambiencepune wala feeling aagya note help hotel ask mamu",
                "bad service staff mainegar please properly breff staff handle costumr please change staff inqulding mainger"
            ]
        },
        {
            "name": "Hotel SHANTAI",
            "rating": [
                3.3
            ],
            "address": [
                "Shop No 1, Jalana Rd, opp. Hp Petrol Pump, Shahunagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Bad experience\n1) Staff behaviour is very rude\n2) no hot water facility\n3) AC not working\n4) only Drunk people stay here.\n5) No hygiene.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Super friendly staff & delicious food. Everything great :)",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Very bad service….No locks in washroom…very unhygienic washroom…flush not working….No bedsheet…bring your own bedsheet, pillow, towel, soap if you are willing to stay at this hotel…No dustbin as well….very very very bad service",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "The food was of awesome Quality, the service provided to us by waiter was just perfect, nothing more nothing less. They also have Lodging facility just behind the restaurant with quality rooms AC Nd Non-AC both options available for effective cost. Do Visit.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Location is good on highway,  service is also ok (good), rate is much cheaper, but room looks untidy as well as old... bathroom is very untidy... need some renovation in bathroom",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience staff behaviour rude hot water facility ac working drunk people stay hygiene",
                "super friendly staff delicious food everything great",
                "bad serviceâ\u0080¦no locks washroomâ\u0080¦very unhygienic washroomâ\u0080¦flush workingâ\u0080¦no bedsheetâ\u0080¦bring bedsheet pillow towel soap willing stay hotelâ\u0080¦no dustbin wellâ\u0080¦very bad service",
                "food awesome quality service provided us waiter perfect nothing nothing less also lodging facility behind restaurant quality rooms ac nd nonac options available effective cost visit",
                "location good highway service also ok good rate much cheaper room looks untidy well old bathroom untidy need renovation bathroom"
            ]
        },
        {
            "name": "Hotel Hina",
            "rating": [
                3.4
            ],
            "address": [
                "Jalana Rd, near SBI bank, Sahayog Nagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Very bad service. They are charging for everything without any prior notice. Receptionist asks extra money while checking out. Extremely disappointed. Don't book this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Pathetic service rude behaviour n arrogant like gundas",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Not good ,rooms condition sooo poor",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Best rooms for single traveler,\nAnd Family.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Good service but not too good rooms",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad service charging everything without prior notice receptionist asks extra money checking extremely disappointed dont book hotel",
                "pathetic service rude behaviour n arrogant like gundas",
                "good rooms condition sooo poor",
                "best rooms single traveler family",
                "good service good rooms"
            ]
        },
        {
            "name": "Hotel Sagar Executive",
            "rating": [
                3.9
            ],
            "address": [
                "National HIghway 211, Shahunagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Food quality is good but 4 wheeler parking not available road tuch hotel rush area",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Best place to stay when in Beed. Rooms are pretty good. Food is lovely. Staff is gentle. 5 out of 5.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Pathetic service, bad room condition,\nRoom service improper, room was not cleaned before checkin.\nAC not working.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good place to stay, it offers complimentary breakfast and tea.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice food n cheap n best",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food quality good wheeler parking available road tuch hotel rush area",
                "best place stay beed rooms pretty good food lovely staff gentle",
                "pathetic service bad room condition room service improper room cleaned checkin ac working",
                "good place stay offers complimentary breakfast tea",
                "nice food n cheap n best"
            ]
        },
        {
            "name": "Mukta lawns (Jagdish Naik)",
            "rating": [
                3.9
            ],
            "address": [
                "DHAND NAGAR, Driving School St, Shahinshah Nagar, Swaraj Nagar, Beed, Maharashtra 431122, India"
            ],
            "reviews": [
                {
                    "text": "Exellent place for marrige and anniversary and we take rest in  this  lawns..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Decent not so big not so small . Good for wedding and functions",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Everything thing get nice our branch",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice place for various events",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Too smallest and not providing any feselity",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "exellent place marrige anniversary take rest lawns",
                "decent big small good wedding functions",
                "everything thing get nice branch",
                "nice place various events",
                "smallest providing feselity"
            ]
        }
    ]
}