{
    "places_with_reviews": [
        {
            "name": "Marina's Motel",
            "rating": [
                4
            ],
            "address": [
                "Bihar More, towards Nepal Road, Uttar Bagdogra, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "So we were looking for a place to eat before boarding the flight and just stumbled over this place.Wow ! The place has an old world charm , Excellently curated menu.....Sonny Boy was pleased with Spaghetti Carbonara while Dad enjoyed the Mutton. Added bonus was the Glenary's  outlet in the premises.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Short stay at Bagdogra or plan to visit the mountains while avoiding the morning Siliguri Traffic. This place is awesome and very well located. Superb food, too polite staffs. The choice of dinner was superb.\n\nYou have ample parking. I even got my car cleaned and washed within the parking ( you need to enquire and pay for the service at the security area )\n\nRooms were superb with balcony. Clean washrooms, daily newspaper, complimentary tea and coffee.\n\nI had complimentary breakfast, it was really nice and my child enjoyed it very much.\n\nI would definitely recommend this place",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Marina's went above and beyond to cater to our needs. The rooms were well cleaned and comfortable. The food was amazing and the chef, owner, even asked how they could cook some American meals to help make us feel welcome. The hotel is well located for air travel and for visiting local tea gardens!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are clean and reasonably ok considering Bagdogra a place where you don't have much options. Interior needs urgent renovation. It is located conveniently near airport. If you don't want to enter the Siliguri town, Marina can be decent option. However, it is a bit pricey considering there are no gyms and swimming pools.\n\nOne peculiar thing is they charge double amount if you order food to your room. This policy is made to discourage eating food at room. Restaurant is present inside the hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Other than the location proximity to Bagdogra airport, nothing good about this hotel. The rooms are pretty old (>45yrs) and the interiors are poor. The quality of the bed sheets and the washroom is bad and doesn't live up to 3 star facilities. The breakfast menu is worst possible and have no options, even the dinner food quality is not great. The right price for the hotel should be between 1.5-2K per night as it falls on borderline 2 star experience. Only location is saving this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "looking place eat boarding flight stumbled placewow place old world charm excellently curated menusonny boy pleased spaghetti carbonara dad enjoyed mutton added bonus glenarys outlet premises",
                "short stay bagdogra plan visit mountains avoiding morning siliguri traffic place awesome well located superb food polite staffs choice dinner superb ample parking even got car cleaned washed within parking need enquire pay service security area rooms superb balcony clean washrooms daily newspaper complimentary tea coffee complimentary breakfast really nice child enjoyed much would definitely recommend place",
                "marinas went beyond cater needs rooms well cleaned comfortable food amazing chef owner even asked could cook american meals help make us feel welcome hotel well located air travel visiting local tea gardens",
                "rooms clean reasonably ok considering bagdogra place dont much options interior needs urgent renovation located conveniently near airport dont want enter siliguri town marina decent option however bit pricey considering gyms swimming pools one peculiar thing charge double amount order food room policy made discourage eating food room restaurant present inside hotel",
                "location proximity bagdogra airport nothing good hotel rooms pretty old yrs interiors poor quality bed sheets washroom bad doesnt live star facilities breakfast menu worst possible options even dinner food quality great right price hotel k per night falls borderline star experience location saving hotel"
            ]
        },
        {
            "name": "Marigold Hotel",
            "rating": [
                4.5
            ],
            "address": [
                "Bhuttabari, South Bagdogra, near Airport, Siliguri, Dakshin Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are small but clean, clear. Staff behaviour was very helpful and polite. Me and my husband stayed there for a night as we had an early morning flight and this hotel is located very near to the airport. They had their own kitchen so you can order food there. The food was good also. If needed we'll prefer to stay there again in future.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This is a transit hotel so please read the review accordingly. It’s a small place in a village but really close to bagdogra airport. Absolutely inexpensive and should give 100% credit to the staff(and the owner), the service is impeccable. They have their own kitchen, will give you good food. The village just behind is quaint and nice. They have their own auto service which can take you to town. Rooms are obviously small but have all facilities required for a transit hotel. I had low expectations but really enjoyed my stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I stayed here for a day a pretty good hotel very near to the airport. The hospitality was really good. I arrived early so host was kind enough to help me out with spending time till my next flight. All the staff in the place were also friendly and helpful. I would definitely recommend this place if you want a stay near the airport.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It gets the job done. I had a hard time picking a hotel as it seems every business in India has a bunch of one star reviews. But this hotel was overall agreeable for the price. The owner and most of his staff were helpful, the location is unbeatable for access to the airport, and the bed was comfy. Honestly, if they took the time to clean the dead bugs, fingerprints, and smudges off the wall, I’d give it 5 stars for what it is. Also, just a heads up, their arranged airport drop off doesn’t take you all the way to the gate. Not their fault as it’s the airports rules but it’s a few minute walk to the entrance which isn’t bad at all but might be if it’s raining or you have a lot of luggage. Overall, I’d stay here again when passing through.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Fantastic place to stay, ita very close to airport. The owner was super kind to arrange a drop to airport. Very clean and tidy rooms. Overall 10/10. Thank you for the amazing stay",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms small clean clear staff behaviour helpful polite husband stayed night early morning flight hotel located near airport kitchen order food food good also needed well prefer stay future",
                "transit hotel please read review accordingly itâ\u0080\u0099s small place village really close bagdogra airport absolutely inexpensive give credit staffand owner service impeccable kitchen give good food village behind quaint nice auto service take town rooms obviously small facilities required transit hotel low expectations really enjoyed stay",
                "stayed day pretty good hotel near airport hospitality really good arrived early host kind enough help spending time till next flight staff place also friendly helpful would definitely recommend place want stay near airport",
                "gets job done hard time picking hotel seems every business india bunch one star reviews hotel overall agreeable price owner staff helpful location unbeatable access airport bed comfy honestly took time clean dead bugs fingerprints smudges wall iâ\u0080\u0099d give stars also heads arranged airport drop doesnâ\u0080\u0099t take way gate fault itâ\u0080\u0099s airports rules itâ\u0080\u0099s minute walk entrance isnâ\u0080\u0099t bad might itâ\u0080\u0099s raining lot luggage overall iâ\u0080\u0099d stay passing",
                "fantastic place stay ita close airport owner super kind arrange drop airport clean tidy rooms overall thank amazing stay"
            ]
        },
        {
            "name": "Orbit Hotel Bagdogra",
            "rating": [
                3.5
            ],
            "address": [
                "Airport Plaza, Upper, More, near Bihar, Uttar Bagdogra, Bagdogra, Siliguri, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is located in a old building with a coaching center below it, and other weird people were also nearby. The rooms are very okayish and the toilets aren't clean but okay. We ordered the food and it got prepared 1.5 hours later!!. Visit only if you have layovers at the nearby airport. It isn't recommended for family",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Just 10 minutes away from Airport, Food and Service was impeccable. Rooms were spacious, if you are travelling with kids, you might want to consider this hotel. This is a ex-summit group hotel property, lack of proper maintenance and upkeeping is clearly visible though. Food was delicious, and complimentary breakfast was served by 7:20. staffs were helpful and manager was courteous .",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "We stayed here for a night on our way to Darjeeling.\nThough the hotel was quite decent but in our room geyser, water heater nothing was working. But the staffs were really helpful mainly Mr. Ram. As the geyser was not working they asked us to use bathroom in a different room. And for food they serve at room,you just need to call the reception and tell them what you want. But overall the stay was not pleasant as the rooms were not equipped with the facilities it mentioned.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "We just stayed here for a night since it is Near to airport. Decent rooms, they do have restaurant and provide breakfast as complementary. They also arrange cabs to airport which has to be paid by the guest.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Had a good experience here. The rooms were clean, service was quick, the food was deliciously homely, and the staff was very helpful.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel located old building coaching center weird people also nearby rooms okayish toilets arent clean okay ordered food got prepared hours later visit layovers nearby airport isnt recommended family",
                "minutes away airport food service impeccable rooms spacious travelling kids might want consider hotel exsummit group hotel property lack proper maintenance upkeeping clearly visible though food delicious complimentary breakfast served staffs helpful manager courteous",
                "stayed night way darjeeling though hotel quite decent room geyser water heater nothing working staffs really helpful mainly mr ram geyser working asked us use bathroom different room food serve roomyou need call reception tell want overall stay pleasant rooms equipped facilities mentioned",
                "stayed night since near airport decent rooms restaurant provide breakfast complementary also arrange cabs airport paid guest",
                "good experience rooms clean service quick food deliciously homely staff helpful"
            ]
        },
        {
            "name": "Hotel Jagat",
            "rating": [
                3.8
            ],
            "address": [
                "Nh 31, Airport More ,Main Road, Bagdogra, Dumriguri, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Property is located very close to the airport . They have decent rooms, kept clean and tidy . Friendly staff and owner made sure our stay was just fine . Overall recommend the property if one is looking for a place to stay at Bagdogra.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We chose this hotel for a night stay on the way to Kalimpong, we were worried about our CAT Boy \"Anjelo\", as many hotels do not allow pets, to our surprise the hotel owner and all the service staff were so accommodating, and helpful starting from checkin with Anjelo till time of check out. We took 3 bed room, was big enough to make Anjelo and my daughter play around, my suggestion if you are looking for a hotel with car parking (basement has parking) and pet friendly near Bagdogra Airport, please look no further, go for Hotel Jagat. Has an in-house kitchen, for tasty indian and indo Chinese recipes. Thank you for making our stay wonderful ❤️❤️❤️❤️.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This is actually unreal. The best hotel and restaurant experience we had till NOW 💯.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Checked in just a night. Easy access to the airport if you have early flight from IXB. Budget non AC rooms are not that great considering the premium rooms. Friendly staff and owner. Infant I have visited multiple times.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very helpful manager. Safe and secure underground car parking. Comfortable two king size double beds, enough for four adults.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property located close airport decent rooms kept clean tidy friendly staff owner made sure stay fine overall recommend property one looking place stay bagdogra",
                "chose hotel night stay way kalimpong worried cat boy anjelo many hotels allow pets surprise hotel owner service staff accommodating helpful starting checkin anjelo till time check took bed room big enough make anjelo daughter play around suggestion looking hotel car parking basement parking pet friendly near bagdogra airport please look go hotel jagat inhouse kitchen tasty indian indo chinese recipes thank making stay wonderful â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
                "actually unreal best hotel restaurant experience till ð\u009f\u0092¯",
                "checked night easy access airport early flight ixb budget non ac rooms great considering premium rooms friendly staff owner infant visited multiple times",
                "helpful manager safe secure underground car parking comfortable two king size double beds enough four adults"
            ]
        },
        {
            "name": "AIRPORT LODGE",
            "rating": [
                3.9
            ],
            "address": [
                "Vivekananda Pally, behind Merina Hotel, Uttar Bagdogra, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Please don't choose this hotel, even though the room says ac, they will not turn it on!! Saying ac is there but it's not mentioned it'll be turned on , what a joke!!! They don't seem to understand and have basic courtesy. Also the way they talk is impolite! Stinky bedsheet , room and low quality cushions, seems like they have never replaced it!!! If you care about your skin and money, better to stay anywhere else except this place",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This place is a joke!! Right beside dumpyard, might get disease because of filthiness just outside the hotel !! I would suggest people to refrain this place, please please dont visit. They dont seem to underatand anything you say, and the room is dirty, with stinky pillows and bedsheets, that seems to be never have been replaced.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The new and best hotel near bagdogra airport.\nWe are lucky for the sweet young man who puck up and lets us stay here .",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very neat and clean, very good staffs. Excellent service. Only problem is the approach road which is narrow and filthy.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Well furnished, neat and clean , spacious rooms with washroom equipped with modern amenities.\nStaffs are very welcoming and polite. 10 mins distance from bagdogra airport. Room tariff is affordable. Cab service is also available.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "please dont choose hotel even though room says ac turn saying ac mentioned itll turned joke dont seem understand basic courtesy also way talk impolite stinky bedsheet room low quality cushions seems like never replaced care skin money better stay anywhere else except place",
                "place joke right beside dumpyard might get disease filthiness outside hotel would suggest people refrain place please please dont visit dont seem underatand anything say room dirty stinky pillows bedsheets seems never replaced",
                "new best hotel near bagdogra airport lucky sweet young man puck lets us stay",
                "neat clean good staffs excellent service problem approach road narrow filthy",
                "well furnished neat clean spacious rooms washroom equipped modern amenities staffs welcoming polite mins distance bagdogra airport room tariff affordable cab service also available"
            ]
        },
        {
            "name": "Bagdogra Home Stay",
            "rating": [
                3.7
            ],
            "address": [
                "Airport More, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Bagdogra Homestay is suitable for budget travelers only, especially considering its proximity to Bagdogra Airport, making it the most economical option in the area. The rooms, albeit old-fashioned and lacking a cozy ambiance, served the purpose for a cost-effective stay. Location is in between the crowded market.\n\nUnfortunately, the rooms lacked basic amenities such as a single hook for hanging clothes, and both the rooms and bathrooms were devoid of mirrors, toiletries. The absence of facilities for obtaining hot water in the bathroom was notable, although the staff exhibited exceptional service by offering a bucket of hot water from an external source. Bed sheets and blankets were not cleaned properly.\n\nThe room's storage options were limited to an open concrete structure shelf, and the absence of a dustbin was a noticeable oversight. However, it's essential to note that given the price paid for rooms near the airport, setting overly high expectations may not be necessary.\n\nIn summary, Bagdogra Homestay is a reasonable choice for those on a budget, especially due to its proximity to Bagdogra Airport. While the rooms may lack certain conveniences, the accommodating staff and affordability make it a sensible option for those looking for a cost-effective stay near the airport.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Room's are very good..you will get towel, blanket & free wifi as well .House keeping staffs not good.over all an avarage experience.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "do not book here! polluted, dirty market area with litter everywhere. unsafe feeling/ vibe. closed. no elevator. I asked for a refund and had to find another place to stay thankfully with the help of a local auto driver. I asked for refund, nor resolution - they said outright NO.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It's meaningless to be defined as home stay.  The owner nicely cheating the tourists. This is in crowdy market complex. Maintenance is pathetic, unhygienic... Overall its like staying in footpath/ platform. Not worth for even single *",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location is good for airport but staff was very rude to words all the senior ladies also and demanding more extra charge for rooms , water, hot water  pathetic conditions of room and room was not cleaned and  soap is also not available  every thing we have to pay",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bagdogra homestay suitable budget travelers especially considering proximity bagdogra airport making economical option area rooms albeit oldfashioned lacking cozy ambiance served purpose costeffective stay location crowded market unfortunately rooms lacked basic amenities single hook hanging clothes rooms bathrooms devoid mirrors toiletries absence facilities obtaining hot water bathroom notable although staff exhibited exceptional service offering bucket hot water external source bed sheets blankets cleaned properly rooms storage options limited open concrete structure shelf absence dustbin noticeable oversight however essential note given price paid rooms near airport setting overly high expectations may necessary summary bagdogra homestay reasonable choice budget especially due proximity bagdogra airport rooms may lack certain conveniences accommodating staff affordability make sensible option looking costeffective stay near airport",
                "rooms goodyou get towel blanket free wifi well house keeping staffs goodover avarage experience",
                "book polluted dirty market area litter everywhere unsafe feeling vibe closed elevator asked refund find another place stay thankfully help local auto driver asked refund resolution said outright",
                "meaningless defined home stay owner nicely cheating tourists crowdy market complex maintenance pathetic unhygienic overall like staying footpath platform worth even single",
                "location good airport staff rude words senior ladies also demanding extra charge rooms water hot water pathetic conditions room room cleaned soap also available every thing pay"
            ]
        },
        {
            "name": "Das Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "Bihar More, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "In our personal experience if your concern is budget go for this place, we got scammed as our driver took this place, they ended up charging 1300 rs , when this place was worth less then 1000 rs .\n\nGot get fooled by facade of exterior and suit wearing receptionist..the rooms are standard of lodge then hotel...no phone connection..and biggest scam don't try to order food from room service ...they get you cheap Chinese food and charge exorbitant price for really bad tasting food.\n\nPS: If you are looking for room to stay over in Bagdogra.highly recommend you to search for other hotel instead of this...you can get better quality stay and food in other hotels",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It's awesome, the stay in this hotel is unforgettable, staff are so polite and humble,, rooms are very clean, I wish my every friend come and enjoy the hospitality of this hotel,,",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I would not recommend this hotel to anyone in normal circumstances. However, if you want to stay in a nearby hotel to Bagdogra Airport then you can choose this one. Otherwise, not cost worthy.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The hotel is in good market place but just ok to spend a night and catch the train the next morning.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "WiFi connection is very slow. 3 bed non AC 1500 which is very high compare to quality. Bed cover is not clean. Not recommend",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "personal experience concern budget go place got scammed driver took place ended charging rs place worth less rs got get fooled facade exterior suit wearing receptionistthe rooms standard lodge hotelno phone connectionand biggest scam dont try order food room service get cheap chinese food charge exorbitant price really bad tasting food ps looking room stay bagdograhighly recommend search hotel instead thisyou get better quality stay food hotels",
                "awesome stay hotel unforgettable staff polite humble rooms clean wish every friend come enjoy hospitality hotel",
                "would recommend hotel anyone normal circumstances however want stay nearby hotel bagdogra airport choose one otherwise cost worthy",
                "hotel good market place ok spend night catch train next morning",
                "wifi connection slow bed non ac high compare quality bed cover clean recommend"
            ]
        },
        {
            "name": "Kundu Hotel - Hotel in Bagdogra",
            "rating": [
                3.6
            ],
            "address": [
                "Bihar more, Bagdogra, Dist.- Darjeeling, West Bengal, Pin- 734014, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Stayed here 1 night to catch a flight on the next morning. Good service. Clean hotel rooms. Airport here 7 min distance in car. Hotel authority can arrange the car in the early morning.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Bathroom is fully wet as shower is leaking. Rooms are smelly. No water, tea/coffee available in room. And prices are too high in comparison to facilities.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I stayed on 31st October 23 for one night.. I stayed Room No.205 it was okay type.. Location Bihar More ,5-10 minutes from Bagdogra airport . They have their own Restaurant.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good to stay one night but the food quality is not satisfactory",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The restaurant serves good quality food. Try to avoid fish thali. Service is excellent",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed night catch flight next morning good service clean hotel rooms airport min distance car hotel authority arrange car early morning",
                "bathroom fully wet shower leaking rooms smelly water teacoffee available room prices high comparison facilities",
                "stayed st october one night stayed room okay type location bihar minutes bagdogra airport restaurant",
                "good stay one night food quality satisfactory",
                "restaurant serves good quality food try avoid fish thali service excellent"
            ]
        },
        {
            "name": "Collection O Relax Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "Unnamed Road, Bagdogra, Siliguri, Bagdogra, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "Horrible service. The owner cancelled my booking from oyo which was prepaid. I lost my money and he has no empathy that we are stuck in a new city. Very greedy person that won't take booking from his preferred channel. Please avoid this fraud at any cost",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The owner of the hotel was very helpful and caring person (a rare trait in current Times) ...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "My stay at this hotel was absolutely fantastic! The hotel's ambiance was delightful, and the room was both comfortable and elegant. The staff's hospitality was exceptional, and one particular staff member, Tarun, made my experience truly unforgettable. His attention to detail and genuine care for guests set the standard for outstanding service. I can't wait to return to this gem of a hotel!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The colours seem more vibrant for rooms in which we prefer to rest.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Apart from very well maintained hotel rooms, the owner of the hotel  is a very warm and helpful human being. It appears that a lot of thought has been given while providing amenities in the hotel rooms. I would recommend 10/10 times a person desiring to stay near Bagdogra airport should stay at this hotel. The owner also arranged cabs for outstation / local sight-seeing at very reasonable rates, cheaper than what other operators were asking.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "horrible service owner cancelled booking oyo prepaid lost money empathy stuck new city greedy person wont take booking preferred channel please avoid fraud cost",
                "owner hotel helpful caring person rare trait current times",
                "stay hotel absolutely fantastic hotels ambiance delightful room comfortable elegant staffs hospitality exceptional one particular staff member tarun made experience truly unforgettable attention detail genuine care guests set standard outstanding service cant wait return gem hotel",
                "colours seem vibrant rooms prefer rest",
                "apart well maintained hotel rooms owner hotel warm helpful human appears lot thought given providing amenities hotel rooms would recommend times person desiring stay near bagdogra airport stay hotel owner also arranged cabs outstation local sightseeing reasonable rates cheaper operators asking"
            ]
        },
        {
            "name": "Mayer Anchal",
            "rating": [
                4
            ],
            "address": [
                "MAYER ANCHAL BUILDING, AH3 College More, Bagdogra, Rupsing, West Bengal 734014, India"
            ],
            "reviews": [
                {
                    "text": "nice and cleanest hotel around this area in bagdogra. also at resonalable price.\nallowed me to do late check out as my flight was delayed.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "New hotel with very big glass windows from floor to roof in front side of highway...hills can be viewed...good scenic beauty.The behaviour of the staff is very cordial with valuable assistance.The restaurant facility is not there.However the food is arranged by staff and is available from nearby restaurant.Ths room has a facility of hot water,AC,smart TV etc.It is located very close to Bagdogra Airport .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very unhygienic..they didn't clean the room since the last person..washroom was so dirty felt like vomiting...when I asked if it can be cleaned he said no it can't be as it is evening now...this is not a hotel..it's like lodge .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Newly constructed not very good only okay if you need a place to crash at night and you have a flight to catch in the morning.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's a very good hotel beside the National Highway.\nPeople's are very friendly.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice cleanest hotel around area bagdogra also resonalable price allowed late check flight delayed",
                "new hotel big glass windows floor roof front side highwayhills viewedgood scenic beautythe behaviour staff cordial valuable assistancethe restaurant facility therehowever food arranged staff available nearby restaurantths room facility hot wateracsmart tv etcit located close bagdogra airport",
                "unhygienicthey didnt clean room since last personwashroom dirty felt like vomitingwhen asked cleaned said cant evening nowthis hotelits like lodge",
                "newly constructed good okay need place crash night flight catch morning",
                "good hotel beside national highway peoples friendly"
            ]
        }
    ]
}