{
    "places_with_reviews": [
        {
            "name": "Hotel Royal Fort",
            "rating": [
                3.9
            ],
            "address": [
                ", New Trunk Road., 5W23+9C2, Infantry Road, Housing Board Colony, Sanjay Gandhi Nagar, Ballari, Karnataka 583104, India"
            ],
            "reviews": [
                {
                    "text": "Dear [Hotel Management],\n\nI am writing to express my profound disappointment with the service provided during a reception function organized at your establishment a few months ago. Despite the prepayment for the event and the booking of rooms for our guests, the level of service and professionalism exhibited by your staff was shockingly inadequate.\n\nDuring the reception, it became apparent that there was a significant shortage of desserts and snacks, despite the fact that the number of guests was nearly 100 persons fewer than expected. Upon inquiry, we were dismayed to discover that your staff had packed the desserts and distributed them to guests without seeking our acknowledgment or consent. This disregard for our arrangements and failure to communicate with us regarding such actions is completely unacceptable.\n\nFurthermore, despite our attempts to provide feedback and address our concerns with the management, we were met with a complete lack of responsiveness. Our feedback was dismissed, and there was no effort made to rectify the situation or address our grievances in a satisfactory manner.\n\nTo compound matters, we have been subjected to persistent harassment by your receptionist, who continues to contact our guests demanding payment for dues that we have rightfully refused to settle. This persistent pursuit of payment further illustrates the lack of professionalism and accountability within your establishment.\n\nGiven the unacceptable level of service we experienced and the failure to address our concerns, we cannot, in good faith, consider paying any outstanding dues. We demand a formal apology and a comprehensive resolution to this matter. Additionally, we expect assurances that measures will be implemented to prevent similar incidents from occurring in the future.\n\nWe trust that you will take this matter seriously and respond promptly to address our concerns.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We stayed here for one day. We have booked 2 Rooms, checked in around 3.30 pm. Rooms were big and nice. AC was not working in both the rooms. Complained to the reception, after quite long time they sent some staff to attend the AC. They could rectify AC of one room and another's room they couldn't attend, we are asked to shift to to adjacent room. It was really troublesome to shift all our luggages, which were in unpacked condition. WiFi was not working inside the rooms. Room service very very bad. We ordered coffee and tea around 6.00 pm, after repeated reminders finally it was served around 7 pm. Morning complimentary breakfast was there, we went to restaurant, there was no buffet system. We were asked to wait in the lounge, since restaurant was full. Finally we got the seats. Total confusion in taking the order. What we ordered we didn't get. Food was average. Very very unpleasant experience.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Overall Iam giving single star as I don't find rating lesser than that. Two rooms we booked, both the rooms are big and spacious. But bathrooms and bedsheets were so dirty looks it wasn't cleaned for years. Bathrooms are smelling.  Not satisfied with the stay.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I enjoyed my stay at Royal Fort. The best part about the hotel is its location. You will have an amazing view of Bellary Fort and most of the business and government offices are in proximity. Although, room facilities could be better, I enjoyed my food at its modest restaurant. Shushma and Shashidar made my check in and checkout process smooth. Overall a nice experience.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's good hotel to stay in the heart of city. Very near to the main road. Service was good. Very kind receptionist they've,they talk very politely and makes you feel comfortable. Thank you Sushma Raj(Receptionist)",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dear hotel management writing express profound disappointment service provided reception function organized establishment months ago despite prepayment event booking rooms guests level service professionalism exhibited staff shockingly inadequate reception became apparent significant shortage desserts snacks despite fact number guests nearly persons fewer expected upon inquiry dismayed discover staff packed desserts distributed guests without seeking acknowledgment consent disregard arrangements failure communicate us regarding actions completely unacceptable furthermore despite attempts provide feedback address concerns management met complete lack responsiveness feedback dismissed effort made rectify situation address grievances satisfactory manner compound matters subjected persistent harassment receptionist continues contact guests demanding payment dues rightfully refused settle persistent pursuit payment illustrates lack professionalism accountability within establishment given unacceptable level service experienced failure address concerns good faith consider paying outstanding dues demand formal apology comprehensive resolution matter additionally expect assurances measures implemented prevent similar incidents occurring future trust take matter seriously respond promptly address concerns",
                "stayed one day booked rooms checked around pm rooms big nice ac working rooms complained reception quite long time sent staff attend ac could rectify ac one room anothers room couldnt attend asked shift adjacent room really troublesome shift luggages unpacked condition wifi working inside rooms room service bad ordered coffee tea around pm repeated reminders finally served around pm morning complimentary breakfast went restaurant buffet system asked wait lounge since restaurant full finally got seats total confusion taking order ordered didnt get food average unpleasant experience",
                "overall iam giving single star dont find rating lesser two rooms booked rooms big spacious bathrooms bedsheets dirty looks wasnt cleaned years bathrooms smelling satisfied stay",
                "enjoyed stay royal fort best part hotel location amazing view bellary fort business government offices proximity although room facilities could better enjoyed food modest restaurant shushma shashidar made check checkout process smooth overall nice experience",
                "good hotel stay heart city near main road service good kind receptionist theyvethey talk politely makes feel comfortable thank sushma rajreceptionist"
            ]
        },
        {
            "name": "iRoomz Hotel Nakshatra-LR",
            "rating": [
                3.9
            ],
            "address": [
                "Gopala Swamy Rd, opp. Anjana Diagnostic Center, KHB Colony, Tekur Compound, Gandhi Nagar, Ballari, Karnataka 583103, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are not well maintained compared to when it started 5-6 years ago.\n\nSpecially bathrooms, they use some kind of cleaner that stinks like a pesticide.\nParking area is nit clean. Food was nit good. Room service is not up to the mark\n\nNot worth the money what they charge.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are very neat and hygiene. staff , service, food everything is awesome.\nThey provide welcome kit with shampoo, soaps , brushes, paste, comb, handiplast.\nThey provide complimentary breakfast which is also great taste. When we visited we had idli, Vada, sweet and khara Pongal, umpma, masala dosa, plain dosa, water melon juice , banana, coffee, tea and many more. Each and every dish was super taste. Worth staying here. Must recommended",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Our room which was initially allotted was very bad. The AC was working but was not taking commands from the remote. On complaining, at least three remotes were checked. We were asked to switch off and switch on the AC according to our needs. Finally we were allotted another room at 09.30 PM.\nBreakfast was good. We didn't eat anything else so can't comment.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Located in Bellary town.  One of the best hotels available in Bellary.  Serves north and south indian food.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It’s not that much’WoW’ to say. Just ok while considering the location. Facility having party halls, veg &non veg restaurants with bar available.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms well maintained compared started years ago specially bathrooms use kind cleaner stinks like pesticide parking area nit clean food nit good room service mark worth money charge",
                "rooms neat hygiene staff service food everything awesome provide welcome kit shampoo soaps brushes paste comb handiplast provide complimentary breakfast also great taste visited idli vada sweet khara pongal umpma masala dosa plain dosa water melon juice banana coffee tea many every dish super taste worth staying must recommended",
                "room initially allotted bad ac working taking commands remote complaining least three remotes checked asked switch switch ac according needs finally allotted another room pm breakfast good didnt eat anything else cant comment",
                "located bellary town one best hotels available bellary serves north south indian food",
                "itâ\u0080\u0099s muchâ\u0080\u0099wowâ\u0080\u0099 say ok considering location facility party halls veg non veg restaurants bar available"
            ]
        },
        {
            "name": "Hotel Pola Paradise Bellary",
            "rating": [
                3.8
            ],
            "address": [
                "New Trunk Bund Road, Siddartha Nagar, Cantonment, Ballari, Karnataka 583104, India"
            ],
            "reviews": [
                {
                    "text": "A good location to sit out within the facility.  A good range of south and north Indian dishes are available.  Attached with a children play area and some commercial shops",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "wonderful experience during my recent stay. The room was lovely, the hospitality was exceptional, and the food was absolutely delicious. Your team's dedication to providing excellent service made my stay truly memorable. I look forward to returning and will definitely recommend your hotel to others.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good old hotel with very little amenities.\nRoom furniture n curtains are old n limited.\nThe washroom also has very bland looks,\nDamaged n clogged shower n taps.\nOld commode.\nWater leakages.\nNo Buffet breakfast included even for double AC Rooms at INR 2800 for single occupancy.\nHigh rates.\nNot worth the price.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This is an old building. The staff is clueless about which room has proper taps. We had booked a room but the tap was faulty. Then we had to shift. At least the staff should check before allocation.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "One of the oldest and popular restaurants in Ballari, that serves both Veg and  Non Veg food items, had ordered Veg Kadai and Phulkas which were pretty decent in taste with not much masala and oil, Jeera Rice was comforting.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good location sit within facility good range south north indian dishes available attached children play area commercial shops",
                "wonderful experience recent stay room lovely hospitality exceptional food absolutely delicious teams dedication providing excellent service made stay truly memorable look forward returning definitely recommend hotel others",
                "good old hotel little amenities room furniture n curtains old n limited washroom also bland looks damaged n clogged shower n taps old commode water leakages buffet breakfast included even double ac rooms inr single occupancy high rates worth price",
                "old building staff clueless room proper taps booked room tap faulty shift least staff check allocation",
                "one oldest popular restaurants ballari serves veg non veg food items ordered veg kadai phulkas pretty decent taste much masala oil jeera rice comforting"
            ]
        },
        {
            "name": "Hotel Bala Regency",
            "rating": [
                3.8
            ],
            "address": [
                "Parvathi Nagar Main Road, KHB Colony, Parvathi Nagar, Ballari, Karnataka 583103, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is located in the central part of the city and easily accessible. The breakfast buffet spread was average considering their charges and can be much better. The restaurant section is not up to the mark and looks more like a make shift arrangement. The overall service from check in to check out was however great along with very helpful staff.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "No living facility for the driver. They charge an extra 500rs per night for driver accommodation.\n\nIn my opinion, the staff was not supportive and cooperative.\n\nI am from pune and I hired a driver from Andhra. Since we could understand each other, the guys at reception were found making fun of us.\n\nI had breakfast in the morning. In my opinion, it was not the best quality.\n\nIf I come to bellary again, for sure I won't prefer the Bala Residency Hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "First of all, becareful for these fake reviews. You can see the trend and you can know.I got to know from one my friend about this hotel they recently visited. Highly unprofessional and they will put you in trouble at the last moment.They would cheat you at any cost. They would charge you extra money too. There is a third class bar ( Rickshaw pullers you will find ) on the roof top, I would not recommend to go with family.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Felt like age old room. But management can surely think on keeping it upto latest trends. Blanket provided were not soo good. Indian Railways provide best quality blankets than these. Please improve room ambiance.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good accommodation budget friendly, with good parking area,but no washrooms drivers.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel located central part city easily accessible breakfast buffet spread average considering charges much better restaurant section mark looks like make shift arrangement overall service check check however great along helpful staff",
                "living facility driver charge extra rs per night driver accommodation opinion staff supportive cooperative pune hired driver andhra since could understand guys reception found making fun us breakfast morning opinion best quality come bellary sure wont prefer bala residency hotel",
                "first becareful fake reviews see trend knowi got know one friend hotel recently visited highly unprofessional put trouble last momentthey would cheat cost would charge extra money third class bar rickshaw pullers find roof top would recommend go family",
                "felt like age old room management surely think keeping upto latest trends blanket provided soo good indian railways provide best quality blankets please improve room ambiance",
                "good accommodation budget friendly good parking areabut washrooms drivers"
            ]
        },
        {
            "name": "HOTEL ALLUM GOKULAM PARK (Please do not pay any advance for room booking)",
            "rating": [
                3.9
            ],
            "address": [
                "Beside Allum Bhavan, A.D.City, by pass of, Bellary - Uravakonda - Anantapur Rd, Venkateswara Nagar, Bandimot, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "I had my wedding reception at this property on 31.Jan.24, which was the best decision we made.\nFor a small city like Bellary, this is the only best property.\n\nRooms & Halls:\nWe had 20 rooms booked for our guests which were quite spacious and had absolutely no complaints in any which way, and the Hotel Halls were decorated and organised very well with all requirements.\n\nFood:\nWe had booked all 3 meals for our guests, Breakfast, lunch and dinner. Along with evening snack.\n\nWe had about 600 guests for lunch, and about 100 guests for both breakfast and dinner.\nAll 3 meals were phenomenal.\nThe food menu was really amazing.\n\nOverall the whole day went absolutely smooth with zero complaints.\nMe and my family had all the time for us in celebrating the event rather than wasting time in organising things.\nWhich I believe any one would look forward to.\n\nI have to give all the credit to the Hotel Manager Mr. Antaryami, who was extremely cooperative and friendly, and planned and organised the whole event for us.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "To be very honest, this is the worst hotel I have stayed in. We faced a really bad experience during the check out and were made to wait in the lobby before our actual check out time.\nGod bless the mosquitos.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Had stayed for one night here the staff in the buffet breakfast was pathetic. Very dissatisfied for a coffee I had to wait for 30 mins.\nThe staff in reception was good and was Swift. Restaurant staff during the breakfast was very bad.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The service is poor because they have skeletal staff on Sundays. On another day the cafeteria was closed because they were catering to a marriage party . The space is less & congested. The location is not good as it is located on the Bypass road with heavy traffic of trucks raising red dust.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Had stayed for two days, rooms vr large and clean but room service poor, the hotel located almost on outskirts of city has a good parking place the hall bedides it is also good but has very few wash rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wedding reception property jan best decision made small city like bellary best property rooms halls rooms booked guests quite spacious absolutely complaints way hotel halls decorated organised well requirements food booked meals guests breakfast lunch dinner along evening snack guests lunch guests breakfast dinner meals phenomenal food menu really amazing overall whole day went absolutely smooth zero complaints family time us celebrating event rather wasting time organising things believe one would look forward give credit hotel manager mr antaryami extremely cooperative friendly planned organised whole event us",
                "honest worst hotel stayed faced really bad experience check made wait lobby actual check time god bless mosquitos",
                "stayed one night staff buffet breakfast pathetic dissatisfied coffee wait mins staff reception good swift restaurant staff breakfast bad",
                "service poor skeletal staff sundays another day cafeteria closed catering marriage party space less congested location good located bypass road heavy traffic trucks raising red dust",
                "stayed two days rooms vr large clean room service poor hotel located almost outskirts city good parking place hall bedides also good wash rooms"
            ]
        },
        {
            "name": "MANASA INN LODGE",
            "rating": [
                3.8
            ],
            "address": [
                "Dr RajKumar Road, beside BDA Football stadium, Satya Narayana Pet, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "The filthiest hotel every seen. Avoid booking here, rooms are littered with cigarette ash and bed sheets are not washed atall, rooms are full of dust and spiderwebs, provided bedsheets are practically unusable. There are other better hotels nearby so don't book hear unless you want to regret.\nP.S.: It would be beneficial if the owner could allocate a small fraction, let's say around 1%, of the attention given to managing online reviews towards enhancing basic cleanliness and hygiene standards in this filthy hotel. Addressing these fundamental aspects would likely contribute to a more positive guest experience rather than claiming customer is wrong. Now I am completely conviced the 3+ rating maintained in maps is due to hyper activeness of the owner towards online reviews.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The hotel provides satisfactory service despite subpar room quality. While the accommodations may not meet high standards, the attentive and efficient service compensates for the shortcomings, ensuring a pleasant overall experience.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had a very bad experience because of the staff behaviour at the reception, As we booked the room once we reached the hotel they didn't have any record of bookings done. after showing the call log they started to show some room's which is un hygienic, then they showed another room which we selected but they dined to provide that particular room saying they booked for a regular customers that to for after one day. One person in the reception ( mid age person ) area had too much of ignorance and there was no part in convincing in spite of their  mistake. I strongly suggest never go to this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Never book a room here, first thing rooms & washrooms are not spacious and the attender is not cooperative at all, as the room which they show us to confirm will not be provided the same one\nToo much of attitude and ignorance from the hotel attender even for the ladies.\nPls ignore booking rooms in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Location is mid of city , good hotel stay solo bathroom is average , room also average.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "filthiest hotel every seen avoid booking rooms littered cigarette ash bed sheets washed atall rooms full dust spiderwebs provided bedsheets practically unusable better hotels nearby dont book hear unless want regret ps would beneficial owner could allocate small fraction lets say around attention given managing online reviews towards enhancing basic cleanliness hygiene standards filthy hotel addressing fundamental aspects would likely contribute positive guest experience rather claiming customer wrong completely conviced rating maintained maps due hyper activeness owner towards online reviews",
                "hotel provides satisfactory service despite subpar room quality accommodations may meet high standards attentive efficient service compensates shortcomings ensuring pleasant overall experience",
                "bad experience staff behaviour reception booked room reached hotel didnt record bookings done showing call log started show rooms un hygienic showed another room selected dined provide particular room saying booked regular customers one day one person reception mid age person area much ignorance part convincing spite mistake strongly suggest never go hotel",
                "never book room first thing rooms washrooms spacious attender cooperative room show us confirm provided one much attitude ignorance hotel attender even ladies pls ignore booking rooms hotel",
                "location mid city good hotel stay solo bathroom average room also average"
            ]
        },
        {
            "name": "Hotel Pawan",
            "rating": [
                3.9
            ],
            "address": [
                "4WVP+3C8, Venkateswara Nagar, Bandimot, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "The room was clean, but we faced a few issues.\nService was slow, and we had to ask multiple times for simple things like a water bottle. At one point, the person was like can I give the bottle tomorrow, and only after insisting that we need it on the same day, did they provide us with one.\n\nThe bathroom fittings seriously need renovation. The taps were leaking , the shower was not working , and the hot water knob was not working either.\n\nWe had booked two rooms, and it was the same issue with both rooms",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Visited this place several times, for food. It is very clean and well maintained. Both veg and non veg food available here. South Indian meals available only during lunch time. South meals is very good, better than many hotels in Ballari. Attached bar also there.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are good. Service is very very bad. If we asked atleast 3 times only they will send it. Less than 1 star is not available",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Excellent place to stay. Rooms are a bit expensive compared to other hotels but quite clean, neat, and ample parking space. Breakfast is complimentary. Has an attached bar/restaurant with good food.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "0 ratings not worthy for 1 Star .Worst\nExperience ever..\n\nReception guys are not responsive. They say no for everything.\nWe don't get water bottles, in rooms even kept water mug buy there was no water inside after paying that much money no basic requirement in hotel.\n\nWhen I inquired for drinking water, the hotel receptionist replied that water bottles are not in stock and that he should offer water in a cup instead of a water bottle When I asked why the room boy was supplying water in someone else's bottles, they said, Reception said water bottle are not available hence he done this activity reception person asked me to pay the  charged for water bottles and supply sudden arranged initially water bottles was not available bottles...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room clean faced issues service slow ask multiple times simple things like water bottle one point person like give bottle tomorrow insisting need day provide us one bathroom fittings seriously need renovation taps leaking shower working hot water knob working either booked two rooms issue rooms",
                "visited place several times food clean well maintained veg non veg food available south indian meals available lunch time south meals good better many hotels ballari attached bar also",
                "rooms good service bad asked atleast times send less star available",
                "excellent place stay rooms bit expensive compared hotels quite clean neat ample parking space breakfast complimentary attached barrestaurant good food",
                "ratings worthy star worst experience ever reception guys responsive say everything dont get water bottles rooms even kept water mug buy water inside paying much money basic requirement hotel inquired drinking water hotel receptionist replied water bottles stock offer water cup instead water bottle asked room boy supplying water someone elses bottles said reception said water bottle available hence done activity reception person asked pay charged water bottles supply sudden arranged initially water bottles available bottles"
            ]
        },
        {
            "name": "Grande Idhanta",
            "rating": [
                3.5
            ],
            "address": [
                "Royal Circle, Dr RajKumar Rd, opp. Giria's home appliances, near ICICI bank, Old Katte Gudda, Cowl Bazaar, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is extremely poorly managed.The hotel seriously needs to evaluate options for improving general cleanlness and facilities.Had one of the worst experience in my life.Staff are terrible....front desk guys were worst and indifferent..i went and they have no consideration...rooms are worst quality.\nIn the Room ware no TV recharged and not there provide worst condition of blanket and take 1700 INR for single room.\n\nI wanted to write more but i think it is waste of time.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Entire hotel is smelling with ciggerate smoking. In some rooms fan regulator is itself not there. For some rooms lock is not working. Dust is everywhere. Bathroom fittings are rusted. Mug and bucket is slippery. No hot water just like warm water. Never visit this hotel. Not recommended one.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Worst experience with this hotel, they didn't even clean the room and washroom before our checkin.\nWe reached there late night with small kids so we had no option but to check in as it's just for a night stay.. Floor was dirty, blanket had holes n stinky smell was coming, had to request for a new blanket.\nPlease check the room before checkin.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Worst and unprofessional staff.\nDirty bathrooms, den of Rats, guest are offered Torn bedsheets and blankets. Receptionist in a drunkard.\nI don't recommend this property to anybody.\nWaste of money.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Such a worst experience we have called and enquired about the availability and the room price the hotel guy said us a different price at call and a different price when we visited and also they didn’t tell us that lift is not working we had been with family so there were old aged people they couldn’t climb stairs till 2nd & 3rd floor we requested them to arrange one room in ground floor and we questioned him why didn’t you people tell that lift isn’t working the hotel guy started screaming on us that it’s our mistake we should have said him that we have old ages people with us so then he would have said lift isn’t working they are so ruff and the harsh language and the way we enter to hotel they have dig the road where there is very less space to enter hotel to parking lot and there no security or any hotel staff to guide very irresponsible behaviour and useless staff I don’t recommend this stay",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel extremely poorly managedthe hotel seriously needs evaluate options improving general cleanlness facilitieshad one worst experience lifestaff terriblefront desk guys worst indifferenti went considerationrooms worst quality room ware tv recharged provide worst condition blanket take inr single room wanted write think waste time",
                "entire hotel smelling ciggerate smoking rooms fan regulator rooms lock working dust everywhere bathroom fittings rusted mug bucket slippery hot water like warm water never visit hotel recommended one",
                "worst experience hotel didnt even clean room washroom checkin reached late night small kids option check night stay floor dirty blanket holes n stinky smell coming request new blanket please check room checkin",
                "worst unprofessional staff dirty bathrooms den rats guest offered torn bedsheets blankets receptionist drunkard dont recommend property anybody waste money",
                "worst experience called enquired availability room price hotel guy said us different price call different price visited also didnâ\u0080\u0099t tell us lift working family old aged people couldnâ\u0080\u0099t climb stairs till nd rd floor requested arrange one room ground floor questioned didnâ\u0080\u0099t people tell lift isnâ\u0080\u0099t working hotel guy started screaming us itâ\u0080\u0099s mistake said old ages people us would said lift isnâ\u0080\u0099t working ruff harsh language way enter hotel dig road less space enter hotel parking lot security hotel staff guide irresponsible behaviour useless staff donâ\u0080\u0099t recommend stay"
            ]
        },
        {
            "name": "Hotel Vishnu Priya",
            "rating": [
                4
            ],
            "address": [
                "D.No 113/A,Ward, 20, Court Rd, Satya Narayana Pet, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "The service of this hotel is good and also the location is quite familiar not far from the railway station. one can get the booking via phone call as well.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are really good and staff are in their nicest behaviour. One can definitely check in as compared to surrounding they serve a better service.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "No Room cleaness no hygienic,, TV unable to watch tv,, started tv after complaint only free chanals",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good quality rooms this price ₹1120. Clean maintain in the room also. Thank you",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good boarding and lodging hotel 🏨, well maintained, safety parking space,..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service hotel good also location quite familiar far railway station one get booking via phone call well",
                "rooms really good staff nicest behaviour one definitely check compared surrounding serve better service",
                "room cleaness hygienic tv unable watch tv started tv complaint free chanals",
                "good quality rooms price â\u0082¹ clean maintain room also thank",
                "good boarding lodging hotel ð\u009f\u008f¨ well maintained safety parking space"
            ]
        },
        {
            "name": "iRoomz Vaishali Residency",
            "rating": [
                3.9
            ],
            "address": [
                "Station Rd, opp. BSNL OFFICE, BSNL Colony, Cowl Bazaar, Ballari, Karnataka 583101, India"
            ],
            "reviews": [
                {
                    "text": "Visited just the restaurant. Clean washrooms available. Seating & Self-service restaurant offering tasty dishes. Snacks, Meals, Juices, Ice-creams available. Pan shop located outside. Ample parking space available on the backside of restaurant. Easily accessible by Main Road.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The rooms were neat and clean, the receptionist was also very polite and the room services were appreciable, it has two restaurants next to it. The room was well ventilated and the lift was also in good condition. I would recommend this hotel to everyone.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "As we were hungry and running out of time, we went to this hotel for lunch. I can say in one word it was like (uppinangadi -salty). We ordered chilli Gobi, South meals, curd rice, everything was bit salty. Plus point of curd rice is that they added more dry fruits. Service is fast. Parking is a hazle as it is located on the busy road.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I stayed at this hotel overnight during a late night stopover in Hyderabad from Sringeri and booked non-AC room. The other hotels were fully occupied\n-  The hotel is satisfactory\n-  Found cockroaches in the room and the lingering cigar smell. The restrooms were not properly maintained\n-  Assuming AC room would be better in this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Best rooms and maintained very well",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited restaurant clean washrooms available seating selfservice restaurant offering tasty dishes snacks meals juices icecreams available pan shop located outside ample parking space available backside restaurant easily accessible main road",
                "rooms neat clean receptionist also polite room services appreciable two restaurants next room well ventilated lift also good condition would recommend hotel everyone",
                "hungry running time went hotel lunch say one word like uppinangadi salty ordered chilli gobi south meals curd rice everything bit salty plus point curd rice added dry fruits service fast parking hazle located busy road",
                "stayed hotel overnight late night stopover hyderabad sringeri booked nonac room hotels fully occupied hotel satisfactory found cockroaches room lingering cigar smell restrooms properly maintained assuming ac room would better hotel",
                "best rooms maintained well"
            ]
        }
    ]
}