{
    "places_with_reviews": [
        {
            "name": "Hyatt Regency Kolkata",
            "rating": [
                4.4
            ],
            "address": [
                "JA-1, JA Block, Sector 3, Bidhannagar, Kolkata, West Bengal 700106, India"
            ],
            "reviews": [
                {
                    "text": "5 stars for wheelchair -accessibility at the entrance as well as inside the premises. Didn't find any ramp leading to the pool area, so have my doubts. Also , the carpet in the doorway was a bit too thick for easy maneuvering of luggage trolley bags as well. Our room had an ironing board but no iron and my friend's room had an iron but no ironing board. Bonus points for really well mannered staff . It was peak season so there was a wait queue for dinner and breakfast seating. Overall, nice ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Me and my husband spent a great time. Room was clean and comfortable. Breakfast buffet was really delicious..we had ordered chicken biriyani from ird, rice was awesome but the chicken was very very hard, chef had served us brownie with icecream from his end which was really a great and yummy..thank you Hyatt and team, keep up the good work.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "You know, the Hyatt Regency Kolkata is a real treat! The moment you walk through those doors, you're embraced by elegance and comfort. The rooms? Oh, they're like your own private sanctuary, offering stunning city views and all the comforts you could ask for.\nBut what really sets this place apart is the people. The staff here? Absolutely top-notch. They go out of their way to make sure your stay is nothing short of amazing. And let's talk about the food! From mouthwatering Indian dishes to international delights, every meal is a flavor explosion.\nAnd don't even get me started on the amenities. The pool? Perfect for a relaxing dip. The fitness center? Well-equipped for a good workout. And the spa? Pure bliss.\nOverall, the Hyatt Regency Kolkata is more than just a hotel. It's like a friend who knows exactly how to make your stay unforgettable.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Amazing location,very posh property , huge swimming pool , rooms nicely spacious all perfect but few suggestions .\n1) My bed had a very bad iron rod coming beneath..it was the broken spring which would have penetrated through.Anubhav was very kind and he was positive for taking an immediate action.\n2) One light button has all light on and off..so if I have to use the washroom at night I need to put on all lights\n3) Staff coming to ask if the carpet is new or old ?????\nOr if you have laundry ????\nNo tag on the door for DO Not Distrub or clean my room..\nPlease make this changes to make an amazing experience.\n\nBreakfast was super good and the staff their all were excellent..\n\nWill surly higly recommended this property",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "My recent experience at Hyatt Regency Kolkata surpassed all expectations, leaving me thoroughly impressed with both their meeting facilities and accommodations. From the moment I stepped into the lobby, I was greeted with warm hospitality and a seamless check-in process that set the tone for an exceptional stay.\n\nThe meeting facilities at Hyatt Regency Kolkata are truly top-notch. As someone who frequently organizes corporate gatherings, I was thoroughly impressed by the professionalism and efficiency of their event staff. The meeting rooms were spacious, well-equipped with modern amenities, and offered a conducive environment for productive discussions and presentations. The attention to detail and personalized service ensured that every aspect of our meeting was taken care of, allowing us to focus solely on our agenda.\n\nIn terms of accommodations, Hyatt Regency Kolkata offers a luxurious and comfortable stay that is second to none. The rooms are elegantly designed, featuring contemporary furnishings and plush bedding that guarantee a restful night's sleep. The impeccable housekeeping service ensured that the rooms were always pristine and well-maintained throughout my stay.\n\nWhile my experience at Hyatt Regency Kolkata was overwhelmingly positive, I must address the issue of mosquitoes in the area, which proved to be the only dampener during my visit. Although the hotel takes measures to mitigate this inconvenience, such as providing mosquito repellents in the rooms and maintaining the surrounding landscape, it remains an unavoidable aspect of the location's tropical climate. However, I appreciate the hotel's efforts in addressing this issue and ensuring the comfort of their guests to the best of their abilities.\n\nOverall, my stay at Hyatt Regency Kolkata was nothing short of exceptional. The combination of outstanding meeting facilities, luxurious accommodations, and impeccable service truly sets this hotel apart. I would highly recommend it to anyone looking for a seamless and memorable experience in Kolkata.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stars wheelchair accessibility entrance well inside premises didnt find ramp leading pool area doubts also carpet doorway bit thick easy maneuvering luggage trolley bags well room ironing board iron friends room iron ironing board bonus points really well mannered staff peak season wait queue dinner breakfast seating overall nice ambience",
                "husband spent great time room clean comfortable breakfast buffet really deliciouswe ordered chicken biriyani ird rice awesome chicken hard chef served us brownie icecream end really great yummythank hyatt team keep good work",
                "know hyatt regency kolkata real treat moment walk doors youre embraced elegance comfort rooms oh theyre like private sanctuary offering stunning city views comforts could ask really sets place apart people staff absolutely topnotch go way make sure stay nothing short amazing lets talk food mouthwatering indian dishes international delights every meal flavor explosion dont even get started amenities pool perfect relaxing dip fitness center wellequipped good workout spa pure bliss overall hyatt regency kolkata hotel like friend knows exactly make stay unforgettable",
                "amazing locationvery posh property huge swimming pool rooms nicely spacious perfect suggestions bed bad iron rod coming beneathit broken spring would penetrated throughanubhav kind positive taking immediate action one light button light offso use washroom night need put lights staff coming ask carpet new old laundry tag door distrub clean room please make changes make amazing experience breakfast super good staff excellent surly higly recommended property",
                "recent experience hyatt regency kolkata surpassed expectations leaving thoroughly impressed meeting facilities accommodations moment stepped lobby greeted warm hospitality seamless checkin process set tone exceptional stay meeting facilities hyatt regency kolkata truly topnotch someone frequently organizes corporate gatherings thoroughly impressed professionalism efficiency event staff meeting rooms spacious wellequipped modern amenities offered conducive environment productive discussions presentations attention detail personalized service ensured every aspect meeting taken care allowing us focus solely agenda terms accommodations hyatt regency kolkata offers luxurious comfortable stay second none rooms elegantly designed featuring contemporary furnishings plush bedding guarantee restful nights sleep impeccable housekeeping service ensured rooms always pristine wellmaintained throughout stay experience hyatt regency kolkata overwhelmingly positive must address issue mosquitoes area proved dampener visit although hotel takes measures mitigate inconvenience providing mosquito repellents rooms maintaining surrounding landscape remains unavoidable aspect locations tropical climate however appreciate hotels efforts addressing issue ensuring comfort guests best abilities overall stay hyatt regency kolkata nothing short exceptional combination outstanding meeting facilities luxurious accommodations impeccable service truly sets hotel apart would highly recommend anyone looking seamless memorable experience kolkata"
            ]
        },
        {
            "name": "ITC Royal Bengal, a Luxury Collection Hotel, Kolkata",
            "rating": [
                4.8
            ],
            "address": [
                "1, JBS Haldane Ave, Tangra, Kolkata, West Bengal 700046, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are, as usual, ITC grand in nature.\n\n1. Service needs to improve. I have to call up twice and wait for 20 minutes for a shaving kit.\n\n2. Check-in took more than 40 minutes, with long queues,  there were empty check-in desks, however no one was present, out of five desks 3 were operational. And no floor manager was available to take quick action.\n\n3. I requested for a pain killer, reception desk diverted me to the bell boy desk, there they told me that they do not have and asked me to call up the reception from the room..I just left the request there.\n\n4. At the breakfast area, I was told to wait,suggesting there were no empty tables,\nLater, the desk person vanished, then again  waited for 7 minutes, went inside, and requested a single person occupying a 4 seater table. He was fine sharing the table, had my breakfast.\n\nIt's not a great service experience.\n.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "We went over there for Lunch @Grand Market Pavilion on Bengali New year day . It was total chaos, any food counter you go .... you need luck to get food , Irony was Main course Plate was not there for sometime and people were shouting about that ,  after 2:30 PM desert section nothing was there , mainly cake, ooh forgot to say about desert spoon  🥄 .. nope it was too vanished... Refill of food Nope ! What else I  can say ,it was horrible experience after all. Lesson learned \"Don't visit such Hyped place on Big occasion.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Hotel looks great. Room in which I stayed was really big and had all luxury features.\nEnjoyed the stay. Food was okay and as expected it was expensive. View from the room was beautiful. One thing is, reception wont tell you the facilities available. You will have to explore on your own. Overall it was a great stay.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It is one of the Luxurious places at Kolkata. I was invited by one of my friends. Here are my thoughts.\n1. Ample space.\n2. The ambiance was very good.\n3. The ala carte option for food was not adequate.\n4. Food prices are obviously quite expensive.\n5. The staff, service and everything was picture perfect for me.\n\nIf you are looking for a luxurious stay, definitely recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "We had a great stay in ITC Royal Bengal. We were celebrating a birthday, and special thanks to Richa and the team for for making it extra special. A big shout out to Sourish in the front desk team for indulging us and making our stay extra comfortable. We enjoyed dining at Avartana, the kids loved the pool, and the playroom had them entertained for many hours. The gym is very well equipped and I enjoyed my workouts. A small request is to pay a little more attention to the breakfast buffet. Kolkata has so many culinary delights to offer, however everything we ate at this breakfast left us underwhelmed. Other than this, a fantastic experience, and look forward to staying there again.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms usual itc grand nature service needs improve call twice wait minutes shaving kit checkin took minutes long queues empty checkin desks however one present five desks operational floor manager available take quick action requested pain killer reception desk diverted bell boy desk told asked call reception roomi left request breakfast area told waitsuggesting empty tables later desk person vanished waited minutes went inside requested single person occupying seater table fine sharing table breakfast great service experience",
                "went lunch grand market pavilion bengali new year day total chaos food counter go need luck get food irony main course plate sometime people shouting pm desert section nothing mainly cake ooh forgot say desert spoon ð\u009f¥\u0084 nope vanished refill food nope else say horrible experience lesson learned dont visit hyped place big occasion",
                "hotel looks great room stayed really big luxury features enjoyed stay food okay expected expensive view room beautiful one thing reception wont tell facilities available explore overall great stay",
                "one luxurious places kolkata invited one friends thoughts ample space ambiance good ala carte option food adequate food prices obviously quite expensive staff service everything picture perfect looking luxurious stay definitely recommend",
                "great stay itc royal bengal celebrating birthday special thanks richa team making extra special big shout sourish front desk team indulging us making stay extra comfortable enjoyed dining avartana kids loved pool playroom entertained many hours gym well equipped enjoyed workouts small request pay little attention breakfast buffet kolkata many culinary delights offer however everything ate breakfast left us underwhelmed fantastic experience look forward staying"
            ]
        },
        {
            "name": "Aquatica Banquet Resort & Water Park",
            "rating": [
                4.2
            ],
            "address": [
                "Kouchpukur,P.O Hathgachia,P.S. :K.L.C थक्दारी मार्ग, Township, near Rajarhat, Jodthbhim, Newtown, Dhapa Manpur P, West Bengal 700156, India"
            ],
            "reviews": [
                {
                    "text": "I would not bother.  The place is in bad repair. It's probably due to covid. The only ride attraction that was working was the children's splash park, but the average age looked closer to 20 than . The wave pool and lazy river did not operate.  The 3 water slides were not operational. One was for a little while.  The place is in extreme need of a makeover. The changing room was bad, and the restroom was worse.  I get it. This is India but I have seen wonderful places in India in my travels.  This was just not one of them. Not worth 700 rupees.  The only positive was that the food was cheap and plentiful.  A bit bland.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Quite safe but you might get stuck inside the covered slides which is pitch dark inside and you can't see a single thing (it's damn scary). And definitely the slides need more maintainance. Food quality was average and the pricing was a bit on the higher side but considering it a water park, it can be excused. The changing rooms and showering rooms are not clean enough. During the waves 🌊 , you'll get to see something worthy and that justifies the money you have paid ( go there and discover) 🤪",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "please buy your tickets online....on spot, they are way too expensive. Children above the height of of of 4ft needs a full ticket.\nIn the rooms, every time you order, you need to pay, they dont accept payment at check out.\nI had asked for water, I was told to take it on my own from the place where the water is kept in the corridor. The serive was not good at all. Very are very few options for food. But the taste was good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The toilet was worse than roadside sulabh toilets. We were 8 persons. All of us have the same experience. The authority doesn’t clean toilets. Poop was found even in the showers. There was poop everywhere in the toilets.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's fun place to enjoy with family and kids. The food they are serving is also tasty and value for money 🤑.\nThe location and roads improved drastically and become more convenient to reach and they  provide huge free parking space",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "would bother place bad repair probably due covid ride attraction working childrens splash park average age looked closer wave pool lazy river operate water slides operational one little place extreme need makeover changing room bad restroom worse get india seen wonderful places india travels one worth rupees positive food cheap plentiful bit bland",
                "quite safe might get stuck inside covered slides pitch dark inside cant see single thing damn scary definitely slides need maintainance food quality average pricing bit higher side considering water park excused changing rooms showering rooms clean enough waves ð\u009f\u008c\u008a youll get see something worthy justifies money paid go discover ð\u009f¤ª",
                "please buy tickets onlineon spot way expensive children height ft needs full ticket rooms every time order need pay dont accept payment check asked water told take place water kept corridor serive good options food taste good",
                "toilet worse roadside sulabh toilets persons us experience authority doesnâ\u0080\u0099t clean toilets poop found even showers poop everywhere toilets",
                "fun place enjoy family kids food serving also tasty value money ð\u009f¤\u0091 location roads improved drastically become convenient reach provide huge free parking space"
            ]
        },
        {
            "name": "The Park Hotel",
            "rating": [
                4.4
            ],
            "address": [
                "17, Mother Teresa Sarani, Taltala, Kolkata, West Bengal 700016, India"
            ],
            "reviews": [
                {
                    "text": "The club downstairs plays music till 4am in the morning, on a Monday. I was staying on the 4the floor and couldn't sleep due to the constant thumping music sounds.\nGuy at the reception says sir we have a few clubs at the hotel and I've asked them to reduce the volume.\nNothing happened. Eventually moved to a new room.\nLetting this review stay here for visibility.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "My stay at the Park Hotel was superb. From the warm welcome at reception to the luxurious room and impeccable service, every aspect exceeded expectations. The dining experience was exceptional, offering a diverse menu with exquisite flavors. The hotel's facilities, including the gym and spa, were well-maintained and provided a perfect way to unwind. I highly recommend the Park Hotel for a memorable and indulgent stay.❤️👍🏻",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "A very very bad experience. Firstly they do not have any facility for wheel chaired guests. One has to bodily lift the wheelchair with the guest to enter the dining arena. The washrooms are also not designed for the same. This was the first hotel / resort in India and abroad we experienced such drawbacks. Secondly there is no doctor on their payroll to attend an emergency call. They provided someone from outside who did not even examine the basics like BP as he had no equipments to do so. But charged ₹2000/- without any bill for consultation.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Great food and great ambience. Very satisfied with the service. My first day brunch experience and loved it. I will definitely come again. Especially the grilled and carving section had my heart.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I really enjoyed my stay at this hotel. The rooms are clean, staff very friendly, and the place has several restaurants/bars/clubs/live music, whatever entertainment you are looking for they had it. My only suggestion for improvement would be to not crank up the AC so much, it was extremely cold in many of the areas of the hotel including the lobby.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "club downstairs plays music till morning monday staying floor couldnt sleep due constant thumping music sounds guy reception says sir clubs hotel ive asked reduce volume nothing happened eventually moved new room letting review stay visibility",
                "stay park hotel superb warm welcome reception luxurious room impeccable service every aspect exceeded expectations dining experience exceptional offering diverse menu exquisite flavors hotels facilities including gym spa wellmaintained provided perfect way unwind highly recommend park hotel memorable indulgent stayâ\u009d¤ï¸\u008fð\u009f\u0091\u008dð\u009f\u008f »",
                "bad experience firstly facility wheel chaired guests one bodily lift wheelchair guest enter dining arena washrooms also designed first hotel resort india abroad experienced drawbacks secondly doctor payroll attend emergency call provided someone outside even examine basics like bp equipments charged â\u0082¹ without bill consultation",
                "great food great ambience satisfied service first day brunch experience loved definitely come especially grilled carving section heart",
                "really enjoyed stay hotel rooms clean staff friendly place several restaurantsbarsclubslive music whatever entertainment looking suggestion improvement would crank ac much extremely cold many areas hotel including lobby"
            ]
        },
        {
            "name": "Novotel Kolkata - Hotel & Residences",
            "rating": [
                4.7
            ],
            "address": [
                "Sub-Central Business District(Action Area 1), Action Area 1C, Rajarhat, New Town, Kolkata, West Bengal 700156, India"
            ],
            "reviews": [
                {
                    "text": "Breakfast and Dinner were good and had variety of dishes. As a family we needed rooms together (better interconnected) but we were given rooms that were far away from each other. Rooms looked like of old ages. Exhaust fan of 1 of the washroom was not working despite of complaint it was not resolved. Otherwise it was a good stay at Novotel.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at your establishment and wanted to share my overall positive experience. The staff was courteous, and the ambiance was delightful. However, I would like to offer a suggestion to enhance the guest experience further.\n\nThe rooms were comfortable, but a slight improvement in certain aspects could elevate the stay. Additionally, expanding the breakfast options a bit could add more variety for guests.\n\nDespite these minor points, I genuinely enjoyed my time at your hotel and appreciate the warm hospitality. I believe these adjustments would contribute to an even more exceptional stay for future guests.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great hotel at the right location. Highest ratings goes for the staff service for their hospitality. Room and bathroom very clean Special recognition to staff kankana very helpful. Food was great specially breakfast options are exciting. I will visit again for the hospitality from staff I received.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It was wonderful stay here in Novotel Kolkata. Hotel's crew were there to help at all stages. Such a kind and polite behaviour from all the staff. Cleanliness and Hygiene maintained. Breakfast buffet was awesome. Enjoyed a lot with my Colleagues.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Novotel has a fantastic location. The best part that we loved is that they have staff from different zone which  helps in the upliftment of the society as a whole. This touched our heart. Thanks to all of you at Novotel for a warm stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "breakfast dinner good variety dishes family needed rooms together better interconnected given rooms far away rooms looked like old ages exhaust fan washroom working despite complaint resolved otherwise good stay novotel",
                "recently pleasure staying establishment wanted share overall positive experience staff courteous ambiance delightful however would like offer suggestion enhance guest experience rooms comfortable slight improvement certain aspects could elevate stay additionally expanding breakfast options bit could add variety guests despite minor points genuinely enjoyed time hotel appreciate warm hospitality believe adjustments would contribute even exceptional stay future guests",
                "great hotel right location highest ratings goes staff service hospitality room bathroom clean special recognition staff kankana helpful food great specially breakfast options exciting visit hospitality staff received",
                "wonderful stay novotel kolkata hotels crew help stages kind polite behaviour staff cleanliness hygiene maintained breakfast buffet awesome enjoyed lot colleagues",
                "novotel fantastic location best part loved staff different zone helps upliftment society whole touched heart thanks novotel warm stay"
            ]
        },
        {
            "name": "JW Marriott Hotel Kolkata",
            "rating": [
                4.6
            ],
            "address": [
                "4A, JBS Haldane Ave, Tangra, Kolkata, West Bengal 700105, India"
            ],
            "reviews": [
                {
                    "text": "The hotel's ambiance is a perfect blend of modern luxury and classic charm. The lobby is tastefully decorated, with plush furniture and an inviting atmosphere. The attention to detail in the interior design creates a sense of comfort and sophistication.\n\nMy room was nothing short of spectacular. The attention to cleanliness was evident, and the room was well-appointed with all the amenities one could ask for. The bed was incredibly comfortable, ensuring a restful night's sleep. The room's design showcased a thoughtful mix of contemporary style and practical functionality.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "JW Marriott hotels are known for their luxury and comfort, and my experience at one did not disappoint. From the moment I entered the lobby, I was greeted by a sense of elegance and hospitality. The rooms were spacious and well-appointed, with modern amenities and comfortable bedding.\n\nThe dining options were outstanding, offering a range of culinary experiences to suit different tastes. The staff was attentive and courteous, always ready to assist with any request.\n\nOne of the standout features was the spa and wellness facilities, which provided a perfect opportunity for relaxation and rejuvenation. The hotel's location was convenient, often situated in prime locations within cities.\n\nOverall, my stay at a JW Marriott hotel was a luxurious and enjoyable experience, making it a great choice for travelers looking for a high-end hotel experience.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at JW Marriott Hotel, and it was an exceptional experience from start to finish. The luxurious ambiance, impeccable service, and attention to detail truly set this hotel apart. The rooms were spacious, elegantly furnished, and provided breathtaking views of the city. The staff went above and beyond to ensure a comfortable stay, catering to every need with a warm and friendly demeanor. The culinary offerings were outstanding, with a diverse range of delicious options that satisfied even the most discerning palate. The hotel's central location made it convenient for exploring the city's attractions. Overall, JW Marriott Hotel exceeded my expectations, and I highly recommend it for a remarkable and indulgent stay. Five stars without a doubt! 👏🏼🌟",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very quite and The Architecture\nThe Services,Complimentary Breakfast & Welcome Snacks,Hotel Amenities. Room & Its Amenities\nHigh-Level Security\nAbiding Secrecy\nImmaculate Surroundings are so wonderful.\nAnd the most glamorous hospitality locations in the world due to the level of service they provide.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The attention to detail in every aspect of my stay was truly impressive. The elegant decor and comfortable accommodations created a memorable experience. The staff's hospitality was exceptional, making me feel truly pampered throughout my visit. I highly recommend this hotel for a top-notch and indulgent stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotels ambiance perfect blend modern luxury classic charm lobby tastefully decorated plush furniture inviting atmosphere attention detail interior design creates sense comfort sophistication room nothing short spectacular attention cleanliness evident room wellappointed amenities one could ask bed incredibly comfortable ensuring restful nights sleep rooms design showcased thoughtful mix contemporary style practical functionality",
                "jw marriott hotels known luxury comfort experience one disappoint moment entered lobby greeted sense elegance hospitality rooms spacious wellappointed modern amenities comfortable bedding dining options outstanding offering range culinary experiences suit different tastes staff attentive courteous always ready assist request one standout features spa wellness facilities provided perfect opportunity relaxation rejuvenation hotels location convenient often situated prime locations within cities overall stay jw marriott hotel luxurious enjoyable experience making great choice travelers looking highend hotel experience",
                "recently pleasure staying jw marriott hotel exceptional experience start finish luxurious ambiance impeccable service attention detail truly set hotel apart rooms spacious elegantly furnished provided breathtaking views city staff went beyond ensure comfortable stay catering every need warm friendly demeanor culinary offerings outstanding diverse range delicious options satisfied even discerning palate hotels central location made convenient exploring citys attractions overall jw marriott hotel exceeded expectations highly recommend remarkable indulgent stay five stars without doubt ð\u009f\u0091\u008fð\u009f\u008f¼ð\u009f\u008c\u009f",
                "quite architecture servicescomplimentary breakfast welcome snackshotel amenities room amenities highlevel security abiding secrecy immaculate surroundings wonderful glamorous hospitality locations world due level service provide",
                "attention detail every aspect stay truly impressive elegant decor comfortable accommodations created memorable experience staffs hospitality exceptional making feel truly pampered throughout visit highly recommend hotel topnotch indulgent stay"
            ]
        },
        {
            "name": "The Westin Kolkata Rajarhat",
            "rating": [
                4.5
            ],
            "address": [
                "Plot No. Cbd/2 Action Area - Ii, New Town, CDB(AA-II), Rajarhat, New Town, West Bengal 700156, India"
            ],
            "reviews": [
                {
                    "text": "I recently had the pleasure of staying at The Westin for a weekend getaway, and I must say, it exceeded all my expectations. From the moment I stepped into the lobby, I was greeted by the warm and welcoming staff, who ensured a smooth check-in process.\n\nThe room itself was a haven of comfort and elegance. The bed was luxuriously plush, providing a restful night's sleep after a long day of exploring the nearby attractions. The attention to detail in the room decor did not go unnoticed, with thoughtful touches that added to the overall ambiance.\n\nOne of the highlights of my stay was the impeccable service provided by the staff. Whether it was arranging transportation, recommending local restaurants, or attending to any requests I had, they were always courteous, professional, and went above and beyond to ensure my stay was nothing short of perfect.\n\nThe hotel's amenities were also top-notch. I particularly enjoyed unwinding in the spa after a day of sightseeing, where I indulged in a rejuvenating massage that left me feeling refreshed and revitalized. Additionally, the on-site restaurant offered a delightful culinary experience, with a diverse menu showcasing the finest local ingredients.\n\nThe location of the hotel was another standout feature. Situated in the heart of the city, it was within walking distance of numerous attractions like Ecopark, making it the perfect base for exploring everything the area has to offer.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The ambience is amazing but the chefs need to follow more food safe guidelines like wearing gloves while preparing food and also keeping in mind the shelf life of food products. Otherwise it was a great experience..",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This place is amazing with beautiful structure and view from the hotel. The view of the two towers connecting with a swimming pool on the 3rd floor looks stunning. The restaurant ambience is quite good and it is located on the 10th floor. Mostly people prefer a buffet as it serves a variety of dishes which is good as per price. You can hangout with family and friends and have a pleasant stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Loved the ambience. It is a nice place to stay with lovely view. I stayed with my family for 4 days and we had a wonderful experience. The food was tasty and staff was very friendly.  Infact my room view was close to swimming pool and i enjoyed sitting beside the window. it was great experience. Must visit the restaurant",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Smooth check in. Excellent amenities placed in the room. Wonderful views from the room windows. Ms. Vineeta is a very good hostess. Warm and kind. Loved her smile. The Executive Lounge has nice decor and wonderful people. Service has improved a lot. Food was delicious and the ambience of the restaurant was nice. All the staff at the restaurant were always on their toes.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently pleasure staying westin weekend getaway must say exceeded expectations moment stepped lobby greeted warm welcoming staff ensured smooth checkin process room comfort elegance bed luxuriously plush providing restful nights sleep long day exploring nearby attractions attention detail room decor go unnoticed thoughtful touches added overall ambiance one highlights stay impeccable service provided staff whether arranging transportation recommending local restaurants attending requests always courteous professional went beyond ensure stay nothing short perfect hotels amenities also topnotch particularly enjoyed unwinding spa day sightseeing indulged rejuvenating massage left feeling refreshed revitalized additionally onsite restaurant offered delightful culinary experience diverse menu showcasing finest local ingredients location hotel another standout feature situated heart city within walking distance numerous attractions like ecopark making perfect base exploring everything area offer",
                "ambience amazing chefs need follow food safe guidelines like wearing gloves preparing food also keeping mind shelf life food products otherwise great experience",
                "place amazing beautiful structure view hotel view two towers connecting swimming pool rd floor looks stunning restaurant ambience quite good located th floor mostly people prefer buffet serves variety dishes good per price hangout family friends pleasant stay",
                "loved ambience nice place stay lovely view stayed family days wonderful experience food tasty staff friendly infact room view close swimming pool enjoyed sitting beside window great experience must visit restaurant",
                "smooth check excellent amenities placed room wonderful views room windows ms vineeta good hostess warm kind loved smile executive lounge nice decor wonderful people service improved lot food delicious ambience restaurant nice staff restaurant always toes"
            ]
        },
        {
            "name": "Taj Bengal, Kolkata",
            "rating": [
                4.7
            ],
            "address": [
                "34-B, Belvedere Rd, Alipore, Kolkata, West Bengal 700027, India"
            ],
            "reviews": [
                {
                    "text": "It was such grand infra with unique luxury comfort for their clients. Staff is amazingly cooperative. Such lavish lavatories, you will feel like that washrooms are better conference rooms, ha ha! But seriously I fell in love with the massive lounge areas surround with trees and highly appreciated handicrafts.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The place is so good in customer care. Every one in hotel can go to any extent possible to help you. I guess that's what Taj is known of. I have such a nice experience in cafe Cal 27 and especially thanks to Mr Vijay for such a nice hospitality. I wish him very best.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Extravaganza at its best. Been on a conference so limited time spent. Overall its a classic heritage location. Ambiance, reception, food, beverage, the interiors all resemble a separate class of its own. A truly great experience. Always recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Taj Bengal in Kolkata, and it was an unforgettable experience. The hotel truly lives up to its reputation for luxury and impeccable service. My room was not only spacious but also elegantly furnished, providing a comfortable and relaxing retreat.\n\nThe dining options at Taj Bengal are exceptional. I indulged in a variety of cuisines, from traditional Indian dishes to international favorites, and each meal was a delight for my taste buds. The attention to detail and quality of service at the restaurants were impressive.\n\nOne of the highlights of my stay was the hotel's facilities. The fitness center was well-equipped, allowing me to stick to my workout routine, and the spa treatments were incredibly rejuvenating. I also enjoyed relaxing by the beautiful swimming pool area.\n\nThe hotel's location is another advantage, with easy access to popular attractions in Kolkata. Whether I wanted to explore the vibrant markets or immerse myself in the city's rich cultural heritage, everything was within reach from Taj Bengal.\n\nOverall, my stay at Taj Bengal was exceptional, thanks to the luxurious accommodations, delectable dining options, and top-notch amenities. It's definitely a place I would recommend to anyone visiting Kolkata.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Stayed here for a day on a business trip! The lobby was beautifully lit for the holiday season and had a Christmas feel all around. The reception staff were warm and welcoming. Overall a very good stay.\nA major shout out to Mr. Vijay from the restaurant for his amazing hospitality and kindness. Always smiling and ready to help. Please convey my regards to him.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "grand infra unique luxury comfort clients staff amazingly cooperative lavish lavatories feel like washrooms better conference rooms ha ha seriously fell love massive lounge areas surround trees highly appreciated handicrafts",
                "place good customer care every one hotel go extent possible help guess thats taj known nice experience cafe cal especially thanks mr vijay nice hospitality wish best",
                "extravaganza best conference limited time spent overall classic heritage location ambiance reception food beverage interiors resemble separate class truly great experience always recommended",
                "recently pleasure staying taj bengal kolkata unforgettable experience hotel truly lives reputation luxury impeccable service room spacious also elegantly furnished providing comfortable relaxing retreat dining options taj bengal exceptional indulged variety cuisines traditional indian dishes international favorites meal delight taste buds attention detail quality service restaurants impressive one highlights stay hotels facilities fitness center wellequipped allowing stick workout routine spa treatments incredibly rejuvenating also enjoyed relaxing beautiful swimming pool area hotels location another advantage easy access popular attractions kolkata whether wanted explore vibrant markets immerse citys rich cultural heritage everything within reach taj bengal overall stay taj bengal exceptional thanks luxurious accommodations delectable dining options topnotch amenities definitely place would recommend anyone visiting kolkata",
                "stayed day business trip lobby beautifully lit holiday season christmas feel around reception staff warm welcoming overall good stay major shout mr vijay restaurant amazing hospitality kindness always smiling ready help please convey regards"
            ]
        },
        {
            "name": "Vedic Village Spa Resort",
            "rating": [
                4.2
            ],
            "address": [
                "Shikharpur P.O, Bagu, Newtown, Sikharpur, West Bengal 700135, India"
            ],
            "reviews": [
                {
                    "text": "The resort covers a large area. The resort is located outside of the city limits, thus it is free of all noise. The food was too delicious. There were many options to explore, such as sightseeing and play areas. It was a pleasant experience to be there.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The location and ambience of the resort is nice and calming. Far from city noise you can look out for a tranquil getaway for a weekend. Food is good too. The resort although lack in hospitality service. Also I was allocated room after 3pm although checkin time is 2pm. I arrived early so had to wait long to get the room which was not good in my experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The entire resort is situated covering a huge area. The resort has varieties of Rooms (Villas),  we stayed where we had a private pool on the terrace. The place is definitely very peaceful, the other guests were sophisticated, good crowd. The service was really nice, room dining foods were Okay type (need improvements), but the breakfast buffet was amazing. Private vehicles/ Cabs are must  to reach the location. Overall it was a good stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This is a beautiful, idyllic and serene place to spend a few days in peace. Overall, it is not a place for people seeking luxury but for those who seek a calm and relaxed escape from the buzz of cities and high end properties in the middle of one.\n\nThe staff is very cordial and responsive. Nothing to deduct even half a mark for.  They only lose one star for the uniformity of experience across the tiers of rooms. Maybe I am hard to please but that's what makes me a proud critic.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The location is inside the vedic Village and little far from the city hence location wise it's a little difficult as cabs also charge huge amounts. But the resort itself is beautiful.. superb greenery around and superb weather. The rooms are nice and spacious. The service is really good. But the food is okay.. limited vegetarian options. Travel can be difficult as public transport is bad. But if you decide to stay in the resort itself then a great plan.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort covers large area resort located outside city limits thus free noise food delicious many options explore sightseeing play areas pleasant experience",
                "location ambience resort nice calming far city noise look tranquil getaway weekend food good resort although lack hospitality service also allocated room pm although checkin time pm arrived early wait long get room good experience",
                "entire resort situated covering huge area resort varieties rooms villas stayed private pool terrace place definitely peaceful guests sophisticated good crowd service really nice room dining foods okay type need improvements breakfast buffet amazing private vehicles cabs must reach location overall good stay",
                "beautiful idyllic serene place spend days peace overall place people seeking luxury seek calm relaxed escape buzz cities high end properties middle one staff cordial responsive nothing deduct even half mark lose one star uniformity experience across tiers rooms maybe hard please thats makes proud critic",
                "location inside vedic village little far city hence location wise little difficult cabs also charge huge amounts resort beautiful superb greenery around superb weather rooms nice spacious service really good food okay limited vegetarian options travel difficult public transport bad decide stay resort great plan"
            ]
        },
        {
            "name": "Fairfield by Marriott Kolkata",
            "rating": [
                4.3
            ],
            "address": [
                "Cb 218, CB Block(Newtown), Action Area 1C, Newtown, Kolkata, New Town, West Bengal 700156, India"
            ],
            "reviews": [
                {
                    "text": "Been there on a few occasions. My stay was great.\n\nWell maintained property. Great room service. Every employee is very helpful.\n\nThe quality and the taste of Food and Drinks is awesome.\n\nShopping Malls is just beside.\nApart from this Eco Park, the Wax Museum is very close.\n\nHighly Recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Stayed at Marriott for 2 days and the experience was amazing ..Rooms were clean and so were bathrooms We got connected room  one with queen bed and other with twin bed.Both the rooms had amazing view..Behavior of the staffs were really amazing . Breakfast exceeded the expectation , taste was amazing .. Overall experience was top notch ..Loved staying at the hotel . Surely recommend it to family and friends and will come back .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "If you are looking for great service and ambience then you are in the right place. This hotel offers you a good view, good location, and the good food . Yes the rooms are small but service and staff here make you forget about this little thing.Mr Abhi Mukherjee , I appreciate your excellent service and thank you for making my stay enjoyable.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I thoroughly enjoyed my stay at Fairfield by Marriott. Despite having an early morning flight, the experience was peaceful and delightful. Vertex bar stands out for its incredible cocktails and top-notch food. There is another restaurant called Kava, which i haven't tried but the vibe is perfect there. The only area for improvement is the check-in process, which felt slightly unprofessional. Overall, if you're seeking a comfortable stay with fantastic food, I highly recommend Fairfield by Marriott.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Quite new hotel in Kolkata New City. Dinner and breakfast were better than expected. Price is reasonable. Good service for the airport pickup but a bit slow to find a room ready at 9 AM despite the fact I had booked both a day use from 9 am and then then room for the full night. Once they sorted it out all went well.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "occasions stay great well maintained property great room service every employee helpful quality taste food drinks awesome shopping malls beside apart eco park wax museum close highly recommended",
                "stayed marriott days experience amazing rooms clean bathrooms got connected room one queen bed twin bedboth rooms amazing viewbehavior staffs really amazing breakfast exceeded expectation taste amazing overall experience top notch loved staying hotel surely recommend family friends come back",
                "looking great service ambience right place hotel offers good view good location good food yes rooms small service staff make forget little thingmr abhi mukherjee appreciate excellent service thank making stay enjoyable",
                "thoroughly enjoyed stay fairfield marriott despite early morning flight experience peaceful delightful vertex bar stands incredible cocktails topnotch food another restaurant called kava havent tried vibe perfect area improvement checkin process felt slightly unprofessional overall youre seeking comfortable stay fantastic food highly recommend fairfield marriott",
                "quite new hotel kolkata new city dinner breakfast better expected price reasonable good service airport pickup bit slow find room ready despite fact booked day use room full night sorted went well"
            ]
        }
    ]
}