{
    "places_with_reviews": [
        {
            "name": "Fort Tiracol Heritage Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "Pernem, Taluka, Tiracol, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "Very very beautiful but we made a mistake of not doing enough research. U reach this place with a ferry and the ferry stops from 330 to 8pm due to low tide. We reached at 3pm, had to leave without food or even seeing the property properly",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Stopped by at the restaurant after a visit to Querim beach. Magnificent view from the restaurant. Also requested the front desk to show us a room and she obliged. Beautiful , large rooms with sea view and nice decor.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A Unique Slice of Goan History and Luxury\n\nSet along the northern shores of Goa, the Fort Tiracol Heritage Hotel is a one-of-a-kind destination that seamlessly blends centuries-old history with modern luxury. Nestled within the walls of a 450-year-old Portuguese fort, this property offers guests an immersive experience that transports them back in time while still providing all the comforts of a high-end resort.\n\nUpon arrival, the sheer scale and grandeur of the fort are immediately awe-inspiring. The beautifully preserved structure, with its impressive ramparts and striking white facade, instantly sets the tone for an unforgettable stay. As you step through the entryway, the transition from the bustling outside world to the serene, almost meditative atmosphere of the hotel grounds is palpable.\n\nThe suites are uniquely designed, paying homage to the property's storied past while offering every contemporary amenity. Each of them is designed with Portuguese interiors and cutely named after the seven days of the week.  Spacious layouts, plush furnishings, and stunning views of the Tiracol River or the Arabian Sea create an undeniably regal ambiance. The attention to historical detail is remarkable, with elements like exposed stone walls and antique furniture pieces effortlessly complementing the modern comforts.\n\nWhat truly sets Fort Tiracol apart, however, is its ability to transport guests to a bygone era while still providing all the luxuries of a modern resort. The seamless blend of historical ambiance and contemporary comforts creates an experience that is truly unparalleled, making it a must-visit destination for anyone seeking a unique and unforgettable stay in Goa.\n\nLOCATION: Close to the Konkan coast of Maharashtra than Goa, it is located within easy reach from popular beaches of Goa like ARAMBOL, MAJORIM, QUERNEM, etc.\n\nDINE + DRINK: The in-house lounge bar (called The TAVERN) is an ode to old Portuguese taverns and comes with lovely views of the Sea. There’s also an all-day café serving Goan, Indian, and European snacks and pastries right by the river\n\nROOM: We stayed in a Room called FRIDAY, so this review is based on that;  SIZE: Spacious enough for 2 adults and simple baggage; VIEW: Sweet view of the sea from the cute attached balcony; AIR-CON: Perfectly functioning cooler that helped in setting the perfect room temperature; BED: Comfortable bed that played the expected part of putting us to sleep; BATHROOM: Stand-in shower; TOILETRIES: Good quality toiletries by INARA brand\n\nFACILITIES: No Gym or pool on site, pure Beachfront chill!\n\nSERVICE: Friendly staff that took care of all our needs with a smile and made us feel pampered and well taken care of.\n\nHOW WIRED YOU WILL BE: Free Wi-Fi that works well all over the property, and the speed is good! Big Smart TV dishing out a wide variety of channels spanning sports, news, music, movies, and  entertainment in multiple languages",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We just visited the fort and were not staying there. It has been converted to a hotel, hence cannot be seen. The best part is the ferry ride, which is the only means to reach here. This ferry carries your car as well.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Fort Tiracol Hotel is an absolutely unique amazing experience. We stayed here few times and loved it. The rooms are beautifully decorated, very clean and stylish. If you’d like to stay in the only hotel in Goa that has this historical feeling, drink tea on the little balcony with the best view possible, surrounded by tranquil wild nature, listen the waves in the night, enjoying long relaxing breakfast watching the sea, this is definitely the place to go.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful made mistake enough research u reach place ferry ferry stops pm due low tide reached pm leave without food even seeing property properly",
                "stopped restaurant visit querim beach magnificent view restaurant also requested front desk show us room obliged beautiful large rooms sea view nice decor",
                "unique slice goan history luxury set along northern shores goa fort tiracol heritage hotel oneofakind destination seamlessly blends centuriesold history modern luxury nestled within walls yearold portuguese fort property offers guests immersive experience transports back time still providing comforts highend resort upon arrival sheer scale grandeur fort immediately aweinspiring beautifully preserved structure impressive ramparts striking white facade instantly sets tone unforgettable stay step entryway transition bustling outside world serene almost meditative atmosphere hotel grounds palpable suites uniquely designed paying homage propertys storied past offering every contemporary amenity designed portuguese interiors cutely named seven days week spacious layouts plush furnishings stunning views tiracol river arabian sea create undeniably regal ambiance attention historical detail remarkable elements like exposed stone walls antique furniture pieces effortlessly complementing modern comforts truly sets fort tiracol apart however ability transport guests bygone era still providing luxuries modern resort seamless blend historical ambiance contemporary comforts creates experience truly unparalleled making mustvisit destination anyone seeking unique unforgettable stay goa location close konkan coast maharashtra goa located within easy reach popular beaches goa like arambol majorim quernem etc dine drink inhouse lounge bar called tavern ode old portuguese taverns comes lovely views sea thereâ\u0080\u0099s also allday cafã© serving goan indian european snacks pastries right river room stayed room called friday review based size spacious enough adults simple baggage view sweet view sea cute attached balcony aircon perfectly functioning cooler helped setting perfect room temperature bed comfortable bed played expected part putting us sleep bathroom standin shower toiletries good quality toiletries inara brand facilities gym pool site pure beachfront chill service friendly staff took care needs smile made us feel pampered well taken care wired free wifi works well property speed good big smart tv dishing wide variety channels spanning sports news music movies entertainment multiple languages",
                "visited fort staying converted hotel hence seen best part ferry ride means reach ferry carries car well",
                "fort tiracol hotel absolutely unique amazing experience stayed times loved rooms beautifully decorated clean stylish youâ\u0080\u0099d like stay hotel goa historical feeling drink tea little balcony best view possible surrounded tranquil wild nature listen waves night enjoying long relaxing breakfast watching sea definitely place go"
            ]
        },
        {
            "name": "Hotel Hill Rock Goa",
            "rating": [
                4.4
            ],
            "address": [
                "P. O Arambol Tiracol, Arambol, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "Fresh and tasty fish and other sea foods. Lepe fish, squid and prawn are very delicious.  I liked it very much. There is also a variety of beverages.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Highly recommended. The seafood was great specially the open rawa fry prawns. We came all the way from Arambol for the sea food. Must visit place for seafood. Definitely coming back again.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very good service, food quality and cooperative staff. The sea view is really great!! ⛵🌊",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Let's just say it's a decent stop over if you're headed from North Goa into Maharashtra or vice versa, the food is okay-Ish, nothing great to write home about, the rooms are aged the door hinges may creek and squeal from time to time, the bed, the closets and furniture is outdated, for the price they charge you may get some smaller but better decent staying options in Arambol or nearby areas, what makes it popular that this hotel has an attached bar and restaurant and a wine shop all in a single file!\nThey have a huge courtyard that comes with a swimming pool with a wonderful view of the Terekhol river and the Arabian sea, the mornings and evenings are very pleasant.\nMind you there is no room service, you will have to walk to their restaurant cum bar, which is a stone’s throw away, and sadly this is the only eating joint and watering hole nearby.\nThey do serve you a complimentary breakfast along with some coffee or tea, both of which are forgettable at best.\nI wouldn’t say that this is a place for families or couples per se, this place is mostly occupied by hordes of tourists who come in large groups, buy alcohol from the attached wine shop, get food from the restaurant themselves, occupy the tables in the courtyard, play loud music, revel, shout, bellow to their hearts content oblivious to the fact that there are other people around trying to get some shut eye. What’s worse is that that all the litter left behind is haphazardly gathered in the morning and what gets left behind is simply chuck over the fence into the valley below.\nI had made a reservation for 3 nights but hightailed it back to Konkan after spending only one evening here, and I honestly do not see myself going back to this place.\nBut hey, if you’re in for a night full of revelry with a bunch of rowdy mates in an affordable accommodation with dirt cheap alcohol and edible food, then this could very well be your joint, by all means have at it!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Every visit to this amazing place the same, fantastic. Staff friendly and helpful, food, quick, reasonable and delicious 😋.\nVisit at sunset for a great evening, recommended 👌",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fresh tasty fish sea foods lepe fish squid prawn delicious liked much also variety beverages",
                "highly recommended seafood great specially open rawa fry prawns came way arambol sea food must visit place seafood definitely coming back",
                "good service food quality cooperative staff sea view really great â\u009bµð\u009f\u008c\u008a",
                "lets say decent stop youre headed north goa maharashtra vice versa food okayish nothing great write home rooms aged door hinges may creek squeal time time bed closets furniture outdated price charge may get smaller better decent staying options arambol nearby areas makes popular hotel attached bar restaurant wine shop single file huge courtyard comes swimming pool wonderful view terekhol river arabian sea mornings evenings pleasant mind room service walk restaurant cum bar stoneâ\u0080\u0099s throw away sadly eating joint watering hole nearby serve complimentary breakfast along coffee tea forgettable best wouldnâ\u0080\u0099t say place families couples per se place mostly occupied hordes tourists come large groups buy alcohol attached wine shop get food restaurant occupy tables courtyard play loud music revel shout bellow hearts content oblivious fact people around trying get shut eye whatâ\u0080\u0099s worse litter left behind haphazardly gathered morning gets left behind simply chuck fence valley made reservation nights hightailed back konkan spending one evening honestly see going back place hey youâ\u0080\u0099re night full revelry bunch rowdy mates affordable accommodation dirt cheap alcohol edible food could well joint means",
                "every visit amazing place fantastic staff friendly helpful food quick reasonable delicious ð\u009f\u0098\u008b visit sunset great evening recommended ð\u009f\u0091\u008c"
            ]
        },
        {
            "name": "Mermaid Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Arambol, Corgao Road, near Kalawati Temple, Bhatwadi, Korgaon, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "Mermaid resorts are very budget friendly and the rooms are so neat and clean ,as it was bit far to the city but very near to some beaches such as (arambol beach ,mandram beach,ashvem beach) we stayed for 4nights accomodation was so good and the staff was very helpful the main thing in the resort is food, such a homely and traditional food and the view from the resort pretty cool and there are another resort of mermaid the upgrade version need to stay there tooo ,finally this was the best stay in goa who needs peace with less crowded with full of greenery ❤️",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It’s very good  place to stay , camel cafe food is delicious and it’s very close to sweet lake and mud bath. It’s very close to arambol beach.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good ambition\nHelpful staff\nBest part of my trip is food\nDelicious food 😋",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice ac rooms, also food provided is home made",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "There was Voltage Fluctuations in first floor Room, AC and Fan was not working properly but hotel person shifted us to ground floor and it was good. Toilet would have been bit more cleaner. The wooden infra was good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mermaid resorts budget friendly rooms neat clean bit far city near beaches arambol beach mandram beachashvem beach stayed nights accomodation good staff helpful main thing resort food homely traditional food view resort pretty cool another resort mermaid upgrade version need stay tooo finally best stay goa needs peace less crowded full greenery â\u009d¤ï¸\u008f",
                "itâ\u0080\u0099s good place stay camel cafe food delicious itâ\u0080\u0099s close sweet lake mud bath itâ\u0080\u0099s close arambol beach",
                "good ambition helpful staff best part trip food delicious food ð\u009f\u0098\u008b",
                "nice ac rooms also food provided home made",
                "voltage fluctuations first floor room ac fan working properly hotel person shifted us ground floor good toilet would bit cleaner wooden infra good"
            ]
        },
        {
            "name": "Palm Paradise Resort",
            "rating": [
                4.8
            ],
            "address": [
                "128, Thorlebag, Querim, Arambol, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "Wow !!! Amazing hotel!!!!\n\nI am currently staying at Palm Paradise, completing a 200 Hour YTTC that is being held here, and it is Pardise.\n\nI have  been coming to India many years, and this is most definitely the best place I have ever stayed.\n\nThe rooms are spacious, modern, and shower is always hot!!!! Which you don't often get in India, so a great plus for that alone.\n\nThe cleanliness can not be faulted. The pool area is very well cared for and lovely and relaxing to sit by.\n\nThe food is to die for!!! We get 3 very tasty, varied meals every day, with much choice . So many thanks to Chef Rupesh 🥲❤️\n\nThe staff are very lovely, they cannot do enough for you, especially Rajan, who always has a smile on his face. He makes my day with his smile when I see him in the morning. 😁\n\nThey have all made us feel like family. Our stay here is proving to be very special and feel blessed that we have another 2 and a half weeks here.\n\nThe location is very tranquil and peaceful with amazing views.  The beach is not far and there are restaurants and cafes in the area.\n\nThey have a beautiful yoga studio on the top floor. Everything about the hotel has been well thought out and just can't be faulted.\n\nThank you Palm Paradise, for making our stay so so special. We feel very  grateful to be here we will definitely be coming back",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "This was our first hotel stay during a 3 week trip in India and it was the perfect place to settle down and relax after spending a full day in transit. Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Nice & well maintained property but service is very poor, indians are kept on low priority...mostly you will find Russian guests here :D",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The best place to stay in Qwerim! Peaceful hotel, afar from noise, with everything you need to rest: swimming pool, clean one,  clean rooms, new wooden furniture, conditioner, kettle,hairdrier. Very good restaurant inside. Room service as often as you need. Hot water all time.\n12 min walk to the Qwerim beach, 5-10 min walk to  foodshops or cafe.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I must say, I was thoroughly impressed with my experience here. From start to finish, the staff were welcoming, accommodating, and attentive to my needs.\n\nThe room itself was immaculate and spacious, with modern decor and all the amenities I needed for a comfortable stay. The bed was especially comfortable, with a view of mesmerizing view of greenery from the balcony.\n\nOne of the highlights of my stay was the breakfast buffet, which offered an impressive spread of fresh, delicious options to suit every taste, whether you're a foreign tourist or Indian\n\nFinally, I have to mention the location of the hotel. Away from the rush & chaos of cities like panajim.\n\nThe pool is clean, well-maintained, and surrounded by beautiful landscaping that creates a peaceful and inviting atmosphere.\n\nOverall, I would highly recommend palm paradise resort to anyone looking for a top-notch hotel experience. The staff, amenities, and location all exceeded my expectations, and I look forward to returning in the future.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wow amazing hotel currently staying palm paradise completing hour yttc held pardise coming india many years definitely best place ever stayed rooms spacious modern shower always hot dont often get india great plus alone cleanliness faulted pool area well cared lovely relaxing sit food die get tasty varied meals every day much choice many thanks chef rupesh ð\u009f¥²â\u009d¤ï¸\u008f staff lovely enough especially rajan always smile face makes day smile see morning ð\u009f\u0098\u0081 made us feel like family stay proving special feel blessed another half weeks location tranquil peaceful amazing views beach far restaurants cafes area beautiful yoga studio top floor everything hotel well thought cant faulted thank palm paradise making stay special feel grateful definitely coming back",
                "first hotel stay week trip india perfect place settle relax spending full day transit highly recommended",
                "nice well maintained property service poor indians kept low prioritymostly find russian guests",
                "best place stay qwerim peaceful hotel afar noise everything need rest swimming pool clean one clean rooms new wooden furniture conditioner kettlehairdrier good restaurant inside room service often need hot water time min walk qwerim beach min walk foodshops cafe",
                "must say thoroughly impressed experience start finish staff welcoming accommodating attentive needs room immaculate spacious modern decor amenities needed comfortable stay bed especially comfortable view mesmerizing view greenery balcony one highlights stay breakfast buffet offered impressive spread fresh delicious options suit every taste whether youre foreign tourist indian finally mention location hotel away rush chaos cities like panajim pool clean wellmaintained surrounded beautiful landscaping creates peaceful inviting atmosphere overall would highly recommend palm paradise resort anyone looking topnotch hotel experience staff amenities location exceeded expectations look forward returning future"
            ]
        },
        {
            "name": "Dragonfly Goa",
            "rating": [
                4.6
            ],
            "address": [
                "224 Dragonfly, next to Ganpat Parsekar College, Arambol, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "We booked a private room for a group of 4 friends through AirBnb. On arriving at the God for saken remote place through cab which cost Rs. 2000 and 1.5 hours drive- they offered dormitory instead of private rooms, we agreed, later on seeing our booking through AirBnB they asked for extra money, worst experience they do these booking through AirBnB and then ask for extra money. I have communicated before arriving, think twice before booking through AirBnB because AirBnB also doesn't issue refund without calling the host and the host won't pick up the phone purportedly. And I was stuck without a roof above the head. It charges Rs. 800 for dormitory bedding with one bedding stacked above the other in a small room, a small waiting area & yoga place and a cafe & a shop selling hand made soaps, a overcrowded pool. Not at all worth considering the remoteness of the place. Moreover the behavior & the dealings of the host also matters. (Ultimately I got the refund from AirBnB after a lot of struggle)",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Amazing beautiful place with good caffe and music❤️💚🧡\nStay is good, with amazing people around",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Dragonfly completely changed my stay in Goa.  First, when we arrived  there we were amazed at the beauty of the place , and soon when we met people who were living and working there... we stayed almost 3 months, I think that speaks a lot. In that time, there was amazing vegan restorant Body Green,  and now there is one very popular bar, Garden of Dreams. People who were staying there were totally open minded, creative and in the whole house is huge prodactive/creative energy, which is inspiring. After that amazing experience  there, I feel like I  have a new family. I will recommend everyone this place= it is a heart-opening place to be. Thank you, guys, for everything see you !! Please come to Croatia, I would be happy to be your host (: love you all!!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I stayed here for 3 weeks.\nDuring my stay there were many yoga classes, workshops, concerts, even a festival!\nBodhi Green’s food is amazing!\nWifi connection is good.\nIt’s an amazing place to do workcation.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I was attending Shiva yoga in Dragonfly (each day 9:30 morning) and this is amazing experience. International Community of nice people, you can find friends. Also yoga by Shiva was one of my best experiences, all your body is working! After yoga there is Shavasana with sound healing 😍 you can find Shivayoga.Goa in Instagram.\n\nAlso the place of dragonfly is amazing, so calm, clean and shanti. I loved the pool and yoga space",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked private room group friends airbnb arriving god saken remote place cab cost rs hours drive offered dormitory instead private rooms agreed later seeing booking airbnb asked extra money worst experience booking airbnb ask extra money communicated arriving think twice booking airbnb airbnb also doesnt issue refund without calling host host wont pick phone purportedly stuck without roof head charges rs dormitory bedding one bedding stacked small room small waiting area yoga place cafe shop selling hand made soaps overcrowded pool worth considering remoteness place moreover behavior dealings host also matters ultimately got refund airbnb lot struggle",
                "amazing beautiful place good caffe musicâ\u009d¤ï¸\u008fð\u009f\u0092\u009að\u009f§¡ stay good amazing people around",
                "dragonfly completely changed stay goa first arrived amazed beauty place soon met people living working stayed almost months think speaks lot time amazing vegan restorant body green one popular bar garden dreams people staying totally open minded creative whole house huge prodactivecreative energy inspiring amazing experience feel like new family recommend everyone place heartopening place thank guys everything see please come croatia would happy host love",
                "stayed weeks stay many yoga classes workshops concerts even festival bodhi greenâ\u0080\u0099s food amazing wifi connection good itâ\u0080\u0099s amazing place workcation",
                "attending shiva yoga dragonfly day morning amazing experience international community nice people find friends also yoga shiva one best experiences body working yoga shavasana sound healing ð\u009f\u0098\u008d find shivayogagoa instagram also place dragonfly amazing calm clean shanti loved pool yoga space"
            ]
        },
        {
            "name": "Arambol Paradise Village Resort with Swimming Pool",
            "rating": [
                4.4
            ],
            "address": [
                "Bhatwadi, Arambol, Goa 403512, India"
            ],
            "reviews": [
                {
                    "text": "A perfect spot for short staycation. The location is situated 3kms away from arambol beach. 2 typs of rooms available. ac dulux and wooden cottages. Dulux rooms are spacious whereas wooden cottages are comparatively smaller. Swimming pool water is very clean. Also a special mention and shoutout to the cook/caretaker viru. He can cook delicious food. Highly recommended. And for dog lovers there is this beautiful girl rosy who will be your companion through the whole stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One of the worst experience they deserve 0 star caretaker and owner that not care any thing 0 customer service.\n\nNote care taker found drunk.\n\nyou cannot drink after 10 pm",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One of the best resorts I've been to, The rates are reasonable and services are good, recommended to stay. Bonus tip : It's located around calm and peaceful surroundings.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice and affordable rooms",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Amazing rooms Amazing pool clean",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "perfect spot short staycation location situated kms away arambol beach typs rooms available ac dulux wooden cottages dulux rooms spacious whereas wooden cottages comparatively smaller swimming pool water clean also special mention shoutout cookcaretaker viru cook delicious food highly recommended dog lovers beautiful girl rosy companion whole stay",
                "one worst experience deserve star caretaker owner care thing customer service note care taker found drunk drink pm",
                "one best resorts ive rates reasonable services good recommended stay bonus tip located around calm peaceful surroundings",
                "nice affordable rooms",
                "amazing rooms amazing pool clean"
            ]
        },
        {
            "name": "Dhanashree Riverview Hotel",
            "rating": [
                4.7
            ],
            "address": [
                "Konadi, Korgaon, Pernam Municipal Area, Goa 403512, India"
            ],
            "reviews": [
                {
                    "text": "Good place to stay near airport. Its a small town and close to river. It takes exact 30 min from here to reach at airport. Good place if you dont wanna be in to city before your flight... You will not face any traffic on the way to airport...",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very far from all basic necessity. Its in total jungle.\nNo hot water.\nUnhygienic place with mosquito's.\nOwner only interested in his money. Less co-operation from owner.\nBefore booking please visit and check the place.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I Stayed At this property for 2 days and it was a truly refreshing experience. The staff is immensely hospitable and makes you feel at home. The ambience is soothing and every section of the hotel screams luxury. The Location is great as it is extremely close to Manohar international airport Mopa  Goa and offers great view of the river . will definitely recommend !!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very bad experience.\n\nFamily of 3, me/wife and 7 yr old kid.\nChecked in at 2230 and supposed checkout was at 0400 AM to catch a flight at the Manohar international airport.\n\nI paid 1568 for an \"AC\" room.\n\nDue to rains there was a power cut and the inverter only supports a light in the room. It doesn't support the FAN.\n\nSince it was raining outside and the windows had no mesh, we did not open windows due to mosquitos and other insects coming into the room.\n\nIt got claustrophobic and suffocating. Ultimately we left for the airport around 0130 deciding that the airport is going to be a lot better than this.\n\nI will not be choosing this place again.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best hotel near manohar international airport mopa goa",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay near airport small town close river takes exact min reach airport good place dont wan na city flight face traffic way airport",
                "far basic necessity total jungle hot water unhygienic place mosquitos owner interested money less cooperation owner booking please visit check place",
                "stayed property days truly refreshing experience staff immensely hospitable makes feel home ambience soothing every section hotel screams luxury location great extremely close manohar international airport mopa goa offers great view river definitely recommend",
                "bad experience family mewife yr old kid checked supposed checkout catch flight manohar international airport paid ac room due rains power cut inverter supports light room doesnt support fan since raining outside windows mesh open windows due mosquitos insects coming room got claustrophobic suffocating ultimately left airport around deciding airport going lot better choosing place",
                "best hotel near manohar international airport mopa goa"
            ]
        },
        {
            "name": "Rajgad Resort",
            "rating": [
                4.4
            ],
            "address": [
                "near Heera Jal Factory, Malewad, Maharashtra 416510, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are very spacious which are super clean as well. Good place for families to stay. Room service is above average, fish curry was fabulous. Since we were the only family in resort it was a bit scary experience for us at night. Good numbers of security guards may solve this problem. But overall we had an amazing stay, best part is that it’s very close to our Kuldevata Shri Vetoba temple in Ajagaon.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Overall experience was good. Staff is little bit rude. It is good for arranging functions, I attended engagement ceremony of one of my friends. You won't get any extra-ordinary views from this resort.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "1. Location:- It is convenient to connect to shiroda beach and goa both are 6 km away from this report(I feel this is an excellent place to chill and enjoy your holiday)\n2.Food :- Excellent taste especially fish food\n3.Cleanliness :- It is highly maintained (corridor and resort as well)\n4.Staff :- Very polite and friendly also with quick service\nThey have clean swimming pool you can enjoy whole day, In night you can enjoy your food under stars and it is surrounded by nature\nIf you think this is far from beaches and goa but i would suggest it is better than the hotels available at the beaches",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Great resort Everything is there lot of parking space plus swiming pool and restaurant .Hall is there for Marriages and other functions.Overall good and Staff is also well behaved.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Quite place for Family and Friends to spend time. Neat and clean swimming pool, good Indian and Malvani food served. Spacious family rooms. Staff is nice. Overall a good experience for me.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms spacious super clean well good place families stay room service average fish curry fabulous since family resort bit scary experience us night good numbers security guards may solve problem overall amazing stay best part itâ\u0080\u0099s close kuldevata shri vetoba temple ajagaon",
                "overall experience good staff little bit rude good arranging functions attended engagement ceremony one friends wont get extraordinary views resort",
                "location convenient connect shiroda beach goa km away reporti feel excellent place chill enjoy holiday food excellent taste especially fish food cleanliness highly maintained corridor resort well staff polite friendly also quick service clean swimming pool enjoy whole day night enjoy food stars surrounded nature think far beaches goa would suggest better hotels available beaches",
                "great resort everything lot parking space plus swiming pool restaurant hall marriages functionsoverall good staff also well behaved",
                "quite place family friends spend time neat clean swimming pool good indian malvani food served spacious family rooms staff nice overall good experience"
            ]
        },
        {
            "name": "EISRA Wellness Resort",
            "rating": [
                4.7
            ],
            "address": [
                "PP75+F8V, Unnamed Road, Querim, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "Very good for a digital detox. Beautiful surroundings and very comfy. Great place to have a work-cation.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice cottages made of wooden. Such a pleasant place to relax.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very peaceful and awesome place for stay I recommend to all",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Wonderful Place to relax with nature",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best Resort in Goa",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good digital detox beautiful surroundings comfy great place workcation",
                "nice cottages made wooden pleasant place relax",
                "peaceful awesome place stay recommend",
                "wonderful place relax nature",
                "best resort goa"
            ]
        },
        {
            "name": "Shiva Home Stays",
            "rating": [
                4.8
            ],
            "address": [
                "near Sannas Centre, Querim, Goa 403524, India"
            ],
            "reviews": [
                {
                    "text": "I stayed in one of the rooms for over a month. It's very quiet, the bed is very comfortable, and there's a large refrigerator. Everything is available nearby, within walking distance (beach, supermarket, restaurants, etc.). The owners have always been there to help.\nGood luck with everything, see you next time 👍",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Amazing Place to stay Near The Beach.\nRooms are nice and well maintained.\nAlso Provides a kitchen in our room so you can cook your food also.\nToilets are clean. Whole property is nice. There ia also a terrace.\nMy experience in this property has been very nice.\nRecommend this property to everyone.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The room was clean, the owner is a very generous and honest helper, a room with AC and a refrigerator is a very practical and refreshing thing in Goa, excellent location close to the sea and a cute cafe, I recommend you enjoy",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "What a pleasant stay. Perfect location. The rooms are very clean. Silent surroundings. Owner Mr. Sanjay Kaskar will treat you like a family. He will provide you each and every information so that your stay will be perfect. Will look forward to going there again.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Nice place. Peaceful and tranquil. Approx. 5 mins walking distance to the kerim beach... All amenities available... Budget property. Good for long stay as well... …More\n1",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed one rooms month quiet bed comfortable theres large refrigerator everything available nearby within walking distance beach supermarket restaurants etc owners always help good luck everything see next time ð\u009f\u0091\u008d",
                "amazing place stay near beach rooms nice well maintained also provides kitchen room cook food also toilets clean whole property nice ia also terrace experience property nice recommend property everyone",
                "room clean owner generous honest helper room ac refrigerator practical refreshing thing goa excellent location close sea cute cafe recommend enjoy",
                "pleasant stay perfect location rooms clean silent surroundings owner mr sanjay kaskar treat like family provide every information stay perfect look forward going",
                "nice place peaceful tranquil approx mins walking distance kerim beach amenities available budget property good long stay well â\u0080¦more"
            ]
        }
    ]
}