{
    "places_with_reviews": [
        {
            "name": "Pahang Rest House @ Bera",
            "rating": [
                4.1
            ],
            "address": [
                "Jalan Majlis Kerayong, 28200 Bandar Bera, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Very good accomodation, near with basic facilities, can held any ocassion here like wedding ceremony and others",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place for held a wedding .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "New and quiet place to rest",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place for course",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good accomodation near basic facilities held ocassion like wedding ceremony others",
                "nice place held wedding",
                "nice",
                "new quiet place rest",
                "good place course"
            ]
        },
        {
            "name": "GS BERA HOTEL",
            "rating": [
                3.6
            ],
            "address": [
                "No.9, Jalan Anggerik Indah 1, Taman Anggerik, 28300 Triang, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Stayed there for 2 nights. In the beginning I couldn't find towels, went to the reception and took some, but they were full of stains.\nThere was an awful smell coming from the bathroom. One day we didn't have water at all.\nOnly 2 small bottles of drinking water.\nNo soap or shampoo in the bathroom either.\nThe paint on the walls started to peel off.\nVery noisy in the night. Doors being slammed constantly.\nBad view from the window- trash scattered on the ground.\nGood internet connection.\nOverall, I wouldn't recommend it.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The Malay man staff is not professional in arranged a room, the room with no towels provided, suggests the owner of hotel not simply to take a person as a counter staff,  hv to monitor them. Not recommend this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The condition of the room was terrible. The wallpaper was peeling off, and the ceiling in the bathroom was broken. The bed sheets were stained, and to make matters worse, there were lizard feces on the pillow. When we asked the staff to change the bed sheets, they informed us that the housekeeping staff was not available, leaving us no choice but to sleep with the dirty and stained sheets throughout the night.\n\nIn addition to these issues, the room had extremely thin walls. Every time a car drove by outside, the noise was amplified and made it uncomfortably loud inside the room. We were constantly disturbed by the traffic noise, adding to our already unpleasant experience. Also, there are no hair dryer. The TV channel sometimes work and sometimes not.\n\nWe stayed in that room for three nights, and each day we were disturbed by the adjacent store undergoing renovations, creating an unbearable amount of noise. After a tiring day outside, it was impossible to get any sleep due to the constant noise. Additionally, the room had thin curtains, allowing too much brightness to enter during the day, making it impossible to rest properly regardless of how tired we were. Overall, our experience was extremely unpleasant.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Great staying experience and staff were friendly. Rooms were clean and housekeeping was responsive too. Prices are cheap so definitely recommend for anyone who wants a stay in Bera area!",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Not bad. Pretty clean and the staff are nice. If you need a place to stay in Bera you’d be good to stay here. There is a Chinese style food court just downstairs.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed nights beginning couldnt find towels went reception took full stains awful smell coming bathroom one day didnt water small bottles drinking water soap shampoo bathroom either paint walls started peel noisy night doors slammed constantly bad view window trash scattered ground good internet connection overall wouldnt recommend",
                "malay man staff professional arranged room room towels provided suggests owner hotel simply take person counter staff hv monitor recommend hotel",
                "condition room terrible wallpaper peeling ceiling bathroom broken bed sheets stained make matters worse lizard feces pillow asked staff change bed sheets informed us housekeeping staff available leaving us choice sleep dirty stained sheets throughout night addition issues room extremely thin walls every time car drove outside noise amplified made uncomfortably loud inside room constantly disturbed traffic noise adding already unpleasant experience also hair dryer tv channel sometimes work sometimes stayed room three nights day disturbed adjacent store undergoing renovations creating unbearable amount noise tiring day outside impossible get sleep due constant noise additionally room thin curtains allowing much brightness enter day making impossible rest properly regardless tired overall experience extremely unpleasant",
                "great staying experience staff friendly rooms clean housekeeping responsive prices cheap definitely recommend anyone wants stay bera area",
                "bad pretty clean staff nice need place stay bera youâ\u0080\u0099d good stay chinese style food court downstairs"
            ]
        },
        {
            "name": "Mass Hotel",
            "rating": [
                3.5
            ],
            "address": [
                "Jalan Emas 5, Kampung Baru, 28200 Kampong Kerayong, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "An ok budget hotel.  Even though the room I had was small but it's was clean & comfortable enough. It's also have a small balcony with a good view of the city, depending of the room type . This hotel doesn't have a lift so be mindfull if you want to choose rooms on higher floor. There's  a mamak stall next to the hotel & you can ordered your food & they sent to your room too.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "We (2 adults and 1 9-year-old kid) stayed at the Family Room for 1 night. The room is spacious and clean. Shower is working well with very strong water pressure. Overall is satisfying except the air-condition is not so cool and WiFi connection isn't stable.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Stayed 1 night in family room (1 King bed + 1 single bed).. Rm109 last minute booking. Spacious room/toilet.. Clean..Basic amenities provided. Building is well maintained. Strategic location. There is restaurant available beside the lobby (The best roti canai sardines ever).. Very recommended - Both hotel & restaurant ;)",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The price is very reasonable and worth staying with couples or family. The room was clean and big enough to perform solat conveniencely. The bathroom is big and clean.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Just a stereotype budget hotel. Worse note, there were no lift, and the water pressure was just terrible!",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ok budget hotel even though room small clean comfortable enough also small balcony good view city depending room type hotel doesnt lift mindfull want choose rooms higher floor theres mamak stall next hotel ordered food sent room",
                "adults yearold kid stayed family room night room spacious clean shower working well strong water pressure overall satisfying except aircondition cool wifi connection isnt stable",
                "stayed night family room king bed single bed rm last minute booking spacious roomtoilet cleanbasic amenities provided building well maintained strategic location restaurant available beside lobby best roti canai sardines ever recommended hotel restaurant",
                "price reasonable worth staying couples family room clean big enough perform solat conveniencely bathroom big clean",
                "stereotype budget hotel worse note lift water pressure terrible"
            ]
        },
        {
            "name": "Hotel Sri Bera",
            "rating": [
                3.4
            ],
            "address": [
                "1 & 2, Jalan Berjaya, Taman Muhibbah Batu 2, 28300 Triang, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Affordable price, but not suitable for families and non-smokers. Hot water for baths is not available in raining season.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Nice place and good customer service. Location strategic and nearby Mekdi and KFC",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Good bargains for a budget hotel. We stayed for a night with RM100 for Triple room (1 king bed + 1 single bed) and RM80 for Standard room (1 queen/king bed), can check it out at their website. All provided facilities are working fine, airconditioner, television, iron, bathroom, parking also provided for guests. Staff at front desk is friendly and helpful. Rooms are clean eventhough this hotel was like an old one (compared to few other modern hotels).",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Reasonably clean. The triple bed room is big and spacious. Furniture and fittings are outdated and worn out. However, hotel is located close to fast food joints and local eateries. There is a supermarket nearby too. Friendly receptionist.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Decent clean rooms but no windows and no toilet paper. Water provided is bottled water. TV not working",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "affordable price suitable families nonsmokers hot water baths available raining season",
                "nice place good customer service location strategic nearby mekdi kfc",
                "good bargains budget hotel stayed night rm triple room king bed single bed rm standard room queenking bed check website provided facilities working fine airconditioner television iron bathroom parking also provided guests staff front desk friendly helpful rooms clean eventhough hotel like old one compared modern hotels",
                "reasonably clean triple bed room big spacious furniture fittings outdated worn however hotel located close fast food joints local eateries supermarket nearby friendly receptionist",
                "decent clean rooms windows toilet paper water provided bottled water tv working"
            ]
        },
        {
            "name": "OYO 89436 Sza Inn (Syariah)",
            "rating": [
                3.7
            ],
            "address": [
                "13, Jalan Impian 1, Taman Kerayong Impian, 28200 Bandar Bera, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Visited my relative in Bera during Thaipusam Holiday on 26/2/2024 and stayed at this hotel. Very convenient location, mamak restaurant just next door it is super easy to get our comfort food. Very Good & affordable price for cheap hotel you can find in Bera. Room is super clean. Their staff are very friendly even the owner greet us well upon our arrival. Recommended hotel if you look for cheap and easy access hotel in Bera.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Cheap motel and very clean own by muslim. 2 rooms a single and a double cost rm135 per night",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "A very good and nice place to stay. helpful and friendly stuff. Will visit this hotel again.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Really bad experience. Booked this hotel via oyo website but on the day that I booked, the receptionist said they do not accept any online bookings and my booking was not even in their record. They even told us they have not used OYO for the longest time and now OYO is under scammer? They should have just removed their hotel from the OYO website to avoid this from happening again.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I can't check in this hotel after I make a payment. I feel cheated after arriving at the hotel I've booked. When I contact the OYO customer service its not responsible from OYO",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited relative bera thaipusam holiday stayed hotel convenient location mamak restaurant next door super easy get comfort food good affordable price cheap hotel find bera room super clean staff friendly even owner greet us well upon arrival recommended hotel look cheap easy access hotel bera",
                "cheap motel clean muslim rooms single double cost rm per night",
                "good nice place stay helpful friendly stuff visit hotel",
                "really bad experience booked hotel via oyo website day booked receptionist said accept online bookings booking even record even told us used oyo longest time oyo scammer removed hotel oyo website avoid happening",
                "cant check hotel make payment feel cheated arriving hotel ive booked contact oyo customer service responsible oyo"
            ]
        },
        {
            "name": "D-Cumi Bera Homestay",
            "rating": [
                4.4
            ],
            "address": [
                "3, Jalan Angsana 5, Taman Angsana, Bandar Baru, 28200 Bandar Bera, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Overall, the experience was ok. The homestay is in the heart of Bera.\nWell equipped , all rooms have aircond, except the family hall.  However, the kitchen tools are a bit old and the remotes for aircond sometimes having problem.\nThe owner is friendly and nice.\nPs..nothing much to do in Bera. The nearest town is Triang about 10mins drive.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Bed and Ceiling Fan in 2nd bedroom is broken. Just have only 1 remote aircond and sharing 3 room. Please fix it before let someone check in at the homestay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice location. Friendly host. Clean house.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice place to stay. Comfiest bed.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very clean",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall experience ok homestay heart bera well equipped rooms aircond except family hall however kitchen tools bit old remotes aircond sometimes problem owner friendly nice psnothing much bera nearest town triang mins drive",
                "bed ceiling fan nd bedroom broken remote aircond sharing room please fix let someone check homestay",
                "nice location friendly host clean house",
                "nice place stay comfiest bed",
                "clean"
            ]
        },
        {
            "name": "De Familia Homestay",
            "rating": [
                5
            ],
            "address": [
                "No 11, Jalan Angsana 5, Taman Angsana, 28200 Bandar Bera, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Easy access to the shops n food. Just walking distance",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "The area is spacious...clean and very comfortable...",
                    "languageCode": "en-US",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Ample Parking, Comfortable and Beautiful Homestay",
                    "languageCode": "en-US",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Comfortable",
                    "languageCode": "en-US",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "easy access shops n food walking distance",
                "area spaciousclean comfortable",
                "ample parking comfortable beautiful homestay",
                "comfortable"
            ]
        },
        {
            "name": "Sza Inn",
            "rating": [
                3.5
            ],
            "address": [
                "13, Jalan Impian 1, Taman Kerayong Impian, 28200 Pelabuhan Klang, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Very practical ,neat and tidy if you need a place to stay in Bera . Good working facilities and near restaurants. Recommended for touch & go travellers. They have rooms for family too.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "practical neat tidy need place stay bera good working facilities near restaurants recommended touch go travellers rooms family"
            ]
        },
        {
            "name": "Bera Pentagon Inn",
            "rating": [
                3.1
            ],
            "address": [
                "6289, TAMAN KERAYONG, Kerayong, 28200 BERA, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Service no good. Bank in money and keep say didn't receive and didn't help to reserve the room.",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "Friendly staffs, convinient shop just opposite and got nice tomyam soup at dowbstair restaurant",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "Love this hotel.very nice room.very good staff.",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "come find me if you want",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "I don't want to be ok",
                    "languageCode": "en-US",
                    "rating": [
                        3.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service good bank money keep say didnt receive didnt help reserve room",
                "friendly staffs convinient shop opposite got nice tomyam soup dowbstair restaurant",
                "love hotelvery nice roomvery good staff",
                "come find want",
                "dont want ok"
            ]
        },
        {
            "name": "Triang Ecolodge",
            "rating": [
                4.2
            ],
            "address": [
                "Lot 17516, Jalan Melur Indah 6,, Taman Melur 1, Triang, 28300 Bandar Bera, Pahang, Malaysia"
            ],
            "reviews": [
                {
                    "text": "Very friendly owners, clean and nice room as well as common areas, big fridge, sink and many tables, chairs and utensils  are provided for bbq. Big space for pets to run freely",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Had the one of the best trip this year! It's a small town and everything is accessible within 10mins drive. Host is friendly and helpful. Place is clean and comfortable. Highly recommended! Best part, they are pet friendly! Can't wait to return for a 2nd vacay here.\n\nIG: wong_kopitiam",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A relaxing and beautifully built and run lodge. We really enjoyed this place with our friends and our dogs.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Quiet and peacefull place to be. Most important, it is a pet friendly hotel where your furkids can run around their farm.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Highly recommended for a pet-friendly tranquil environment and convenient location to city.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "friendly owners clean nice room well common areas big fridge sink many tables chairs utensils provided bbq big space pets run freely",
                "one best trip year small town everything accessible within mins drive host friendly helpful place clean comfortable highly recommended best part pet friendly cant wait return nd vacay ig wongkopitiam",
                "relaxing beautifully built run lodge really enjoyed place friends dogs",
                "quiet peacefull place important pet friendly hotel furkids run around farm",
                "highly recommended petfriendly tranquil environment convenient location city"
            ]
        }
    ]
}