{
    "places_with_reviews": [
        {
            "name": "KMVN Manas Hotel, Dharchula",
            "rating": [
                4
            ],
            "address": [
                "1, India - Nepal Rd, Khalanga, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful Manas hotel staff extended all possible help to the tourists. Food and service is too good. Wish to come to this place again in the future .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel on the bank of the river near to Nepal boarder. Entry road is steep, narrow, conjested. It's just beside the police station. Ambience is good followed by food, staffs. Most of the rooms are river facing. No lift facility. Parking for 5-6 cars are available.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Beautiful location....sound and beauty  Kali river with its gentle breeze....makes it more lbeautiful.besic ambience ...but good.clean.quality of food is very good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are average. Riverside view is good. Very well received with hospitality but it's difficult to reach as u have to cross a busy market place with a narrow road. Wonderful staff and experience so I really loved it.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Situated on the banks of Kali river, over looking Nepal border, Kmvn. Manas has a large lobby with comfortable sofas. The spacious rooms are well furnished with a large bathroom and a balcony. It has a good restaurant providing buffet and Al a cart meals to taste.\nAs I was handicapped with severe cold and cough, I had to give up my plans of visiting Narayan ashram and opt out of Adi Kailash and OM parvat yatra and stay here for 10 days, 29/09 to 10/10. The manager Mr. Bishit, counter staff Ramesh Bishit and Manish, Ramesh and lalit and all other staff helped me in all respects and made my stay enjoyable and pleasent. Thank you team Manas",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful manas hotel staff extended possible help tourists food service good wish come place future",
                "hotel bank river near nepal boarder entry road steep narrow conjested beside police station ambience good followed food staffs rooms river facing lift facility parking cars available",
                "beautiful locationsound beauty kali river gentle breezemakes lbeautifulbesic ambience goodcleanquality food good",
                "rooms average riverside view good well received hospitality difficult reach u cross busy market place narrow road wonderful staff experience really loved",
                "situated banks kali river looking nepal border kmvn manas large lobby comfortable sofas spacious rooms well furnished large bathroom balcony good restaurant providing buffet al cart meals taste handicapped severe cold cough give plans visiting narayan ashram opt adi kailash om parvat yatra stay days manager mr bishit counter staff ramesh bishit manish ramesh lalit staff helped respects made stay enjoyable pleasent thank team manas"
            ]
        },
        {
            "name": "AdiKailash Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "Cinema line, near rung museum, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "Pleasent rooms and very kind and welcoming owner",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Thanks from Italy........super clean hotel..nice people......compliment for your job. MARCELLO DARCHULA FELLOW BROTHER",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Rooms are decent..there is no room service or anyone to help you with your luggage. The food is good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel is brand new and the hotel rooms are very clean. The view of the mountain from the room is amazing. The taste of the food is also very good. Security system is very good. Market er ekdom kache.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice hotel service is too good satfe is good room always calen food very good taste mengmant is good",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pleasent rooms kind welcoming owner",
                "thanks italysuper clean hotelnice peoplecompliment job marcello darchula fellow brother",
                "rooms decentthere room service anyone help luggage food good",
                "hotel brand new hotel rooms clean view mountain room amazing taste food also good security system good market er ekdom kache",
                "nice hotel service good satfe good room always calen food good taste mengmant good"
            ]
        },
        {
            "name": "Himtop Hotel Dharchula",
            "rating": [
                4
            ],
            "address": [
                "Hotel Himtop Inn, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "Best and budget Hotel in dharchula, situated at perfect location delicious food provided. From the balcony we can view the City view and india- nepal connecting bridge.  A good place to stay.  You can go nepal by just 10 minutes walk from hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best property and location in Dharchula for a perfect stay ..the owner hem da and staaf is very helpful 😊😊",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hey hotel hilltop please provide your number to reach you for booking",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Just near Main taxi stand, Non veg is always available, But if you think of visiting Dharchula, just prepare yourself for long journey of 12 hrs from Haldwani",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Superb\nExlent\nWow 😳",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best budget hotel dharchula situated perfect location delicious food provided balcony view city view india nepal connecting bridge good place stay go nepal minutes walk hotel",
                "best property location dharchula perfect stay owner hem da staaf helpful ð\u009f\u0098\u008að\u009f\u0098\u008a",
                "hey hotel hilltop please provide number reach booking",
                "near main taxi stand non veg always available think visiting dharchula prepare long journey hrs haldwani",
                "superb exlent wow ð\u009f\u0098³"
            ]
        },
        {
            "name": "Dev Darshan Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "near Hanuman mandir, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "Newly built hotel in Dharchula near KMVN Rest House. Single, Double, Triple bedded rooms with attached bathroom, hot and cold water facility available in very reasonable price. A small restaurant on first floor for in-house guests. Water dispenser for normal cold and hot drinking water free of cost self service facility available. Two single bed, five each double and triple bed rooms are in hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We'd good times at this Dev hotel.very reasonable room charges, very cordial staff. Clean and we'll ventilated rooms. Even Lenen we're room utilities were cleaned up. Quick food and tea service 24/7 was really great surprise. Very near to main market and ,to Kali Ganga River, crossing bridge to Nepal during day time was very near by. I'd always love to make my stay at Dev Hotel, at Dharchula.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best option in Dharchula. Ask for a 3rd floor room - they have bathroom, AC, fridge, TV and nice chairs. Joshi ji gave me a very decent rate (even though I am white). Immediately liked his attitude and mannerisms.\n\nThere is an open air restaurant on the roof, decent enough views. Market is friendly and easily walked.\n\nWill stay here every time I come from now on.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "very good hotel at fare price\nthe owner is so polite\nlovely place",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Average hotel\nNot too many facilities\nLocated in main market\nNear Gandhi chowk",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "newly built hotel dharchula near kmvn rest house single double triple bedded rooms attached bathroom hot cold water facility available reasonable price small restaurant first floor inhouse guests water dispenser normal cold hot drinking water free cost self service facility available two single bed five double triple bed rooms hotel",
                "wed good times dev hotelvery reasonable room charges cordial staff clean well ventilated rooms even lenen room utilities cleaned quick food tea service really great surprise near main market kali ganga river crossing bridge nepal day time near id always love make stay dev hotel dharchula",
                "best option dharchula ask rd floor room bathroom ac fridge tv nice chairs joshi ji gave decent rate even though white immediately liked attitude mannerisms open air restaurant roof decent enough views market friendly easily walked stay every time come",
                "good hotel fare price owner polite lovely place",
                "average hotel many facilities located main market near gandhi chowk"
            ]
        },
        {
            "name": "Gangri Hotel",
            "rating": [
                3.7
            ],
            "address": [
                "Gwalgaun vard, near Gangri Hotel, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "Unfortunately we could not reach Dharchula due to heavy rain (IMD issued a red alert in Kumaon). So we could not stay at this hotel. However, the owner of the hotel refunded 70% of the advance payment and denied full refund in spite of our helpless situation. We shall do our best to stay here on our next opportunity to visit Dharchula. But we shall not make any advance booking here. I recommend this hotel for spot booking only. Dharchula is subject to extreme weather conditions: it suffers from frequent landslides and road blocks. So advance booking may lead to loss of money. There are several hotels and Dharchula is not a popular destination yet. You can easily get a room on arrival.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The owner of the hotel is one of the most beautiful women I have ever met. Always responds with a smiling face and with very positive attitude.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Food quality is good location good service good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good for budget stay. At the beginning of the town.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Average rooms in affordable prices.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "unfortunately could reach dharchula due heavy rain imd issued red alert kumaon could stay hotel however owner hotel refunded advance payment denied full refund spite helpless situation shall best stay next opportunity visit dharchula shall make advance booking recommend hotel spot booking dharchula subject extreme weather conditions suffers frequent landslides road blocks advance booking may lead loss money several hotels dharchula popular destination yet easily get room arrival",
                "owner hotel one beautiful women ever met always responds smiling face positive attitude",
                "food quality good location good service good",
                "good budget stay beginning town",
                "average rooms affordable prices"
            ]
        },
        {
            "name": "HOTEL BHAGWATI INN",
            "rating": [
                4.7
            ],
            "address": [
                "RGH9+92G, Galati, Uttarakhand 10100, India"
            ],
            "reviews": [
                {
                    "text": "Exceptional and Overwhelming Experience..\n\nHotel Bhagwati Inn located at Galati, just 2 km before the main congested Dharchula town.The location of this property is super accessible as it is situated just beside the main road and opposite to petrol pump.One need not  stuck in jam of main Dharchula town and time may also save for searching the proper location of the property.They provide the facilities of both private rooms (AC and Non AC) and super cleaned dormitory with ample parking space.All rooms are very cozy, neat and clean with all the amenities specially clean wash room with 24 hr running hot water.  The rooftop provides awesome view of India, Nepal and Kali River.All staffs are very cooperative, helpful and humble specially Pal ji.\n\nThis place becomes very close to our heart because of the two wonderful people with golden heart i.e the owner Dr. Bangyal and Mrs. Bangyal.Last 12 years I have been traveling so many places in Himalayas but the hospitality and comfort we found there, is quite exceptional and need to be mentioned specially.Dr. Bangyal, professionally a renowned Doctor, besides his busy schedules arranged all our transportation from Lal Kuan - Dharchula - Darma Valley -Narayan Swami Ashram -Dharchula - Vridh Jageshwar to Lal Kuan and also booked a special room at Narayan Swami Ashram for us. All the drivers for our whole trip was too good and knowledgeable.Last but not the least the homemade ,delicious &super tasty light food removed all our fatigue of this hectic journey . Madam Bangyal specially prepared Mutton Curry for Us which was just out of the world.\n\nWe are really lucky to meet these amazing people and recomend everyone to choose these stay for Darma Valley, Adi Kailash and Om Parvat trip.We are egarly waiting to meet you and having loads of fun..",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great Experience.\n\nThe stay was very comfortable with delicious food. The room was spacious, the linens were clean and the mattress was comfortable. As well as private rooms, the property also offers dormitories. You will get here home cooked delicious and healthy food.\n\nThe owner of the property, Dr. Bangyal himself is a very nice and down to earth person. At our request, he also joined us for dinner and morning tea the next day.\n\nI would always prefer to stay here rather than getting stuck in the congested traffic of Dharchula.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We stayed here for 2 days on our way to Adi Kailash and Om Parvat on Oct 2023. It was a pleasant exoerience. Hotel is conveniently located just where Dharchula city starts. One need not to go through the traffic and congestion of Dharchula city and move to yatra road. Rooms are clean. Some works are still going on to further improve the amenities. Dr Bangyal himself is maintaining everything with smiling face even after his busy professional schedule. Food is himemade and delicious and served with home like warmth.\nDr Bangyal also helped us to park our car there during our yatra. We highly recommend Dr Bangyal and his Bhagwati Inn to all the pilgrims going to this yatra.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Fantastic property. Convinient location for all amenities in Darchula. Staff are friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "dharchula’s best hotel for your onway visit to adi kailash , om parwat and darma valley\nowners nature is very welcoming . staff is well baheved . clean rooms and good food availaible",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "exceptional overwhelming experience hotel bhagwati inn located galati km main congested dharchula townthe location property super accessible situated beside main road opposite petrol pumpone need stuck jam main dharchula town time may also save searching proper location propertythey provide facilities private rooms ac non ac super cleaned dormitory ample parking spaceall rooms cozy neat clean amenities specially clean wash room hr running hot water rooftop provides awesome view india nepal kali riverall staffs cooperative helpful humble specially pal ji place becomes close heart two wonderful people golden heart ie owner dr bangyal mrs bangyallast years traveling many places himalayas hospitality comfort found quite exceptional need mentioned speciallydr bangyal professionally renowned doctor besides busy schedules arranged transportation lal kuan dharchula darma valley narayan swami ashram dharchula vridh jageshwar lal kuan also booked special room narayan swami ashram us drivers whole trip good knowledgeablelast least homemade delicious super tasty light food removed fatigue hectic journey madam bangyal specially prepared mutton curry us world really lucky meet amazing people recomend everyone choose stay darma valley adi kailash om parvat tripwe egarly waiting meet loads fun",
                "great experience stay comfortable delicious food room spacious linens clean mattress comfortable well private rooms property also offers dormitories get home cooked delicious healthy food owner property dr bangyal nice earth person request also joined us dinner morning tea next day would always prefer stay rather getting stuck congested traffic dharchula",
                "stayed days way adi kailash om parvat oct pleasant exoerience hotel conveniently located dharchula city starts one need go traffic congestion dharchula city move yatra road rooms clean works still going improve amenities dr bangyal maintaining everything smiling face even busy professional schedule food himemade delicious served home like warmth dr bangyal also helped us park car yatra highly recommend dr bangyal bhagwati inn pilgrims going yatra",
                "fantastic property convinient location amenities darchula staff friendly",
                "dharchulaâ\u0080\u0099s best hotel onway visit adi kailash om parwat darma valley owners nature welcoming staff well baheved clean rooms good food availaible"
            ]
        },
        {
            "name": "Hotel new yash dharchula",
            "rating": [
                3.8
            ],
            "address": [
                "Unnamed Road Khalanga, RGXR+HHV, Suwa, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "There were quite a things which I didn't like about the hotel. The bed was of cheap quality and broke just because of too many people sitting on it. They fixed it by supporting it through some bricks underneath. The staff was not polite. The geyser in the bathroom was also not working.\nThings that I liked about the hotel was that the location was good and almost everything was within a radius of 1 km. The cleanliness of the toilet was also good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Everything was great with fast and delecious food deleveries and nice staff but it sure is down the street",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice staff.. guddu is the person with good knowledge. He can be your friend as well as a one stop shop for all your needs.. he is a good guide too.. will contact him every time I am in Dharchula",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Excellent service n hospitality",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The stay was really great and the rooms are no less than heavenly after we returned back from Darma... The people and staff were very attentive and helpfull too !",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "quite things didnt like hotel bed cheap quality broke many people sitting fixed supporting bricks underneath staff polite geyser bathroom also working things liked hotel location good almost everything within radius km cleanliness toilet also good",
                "everything great fast delecious food deleveries nice staff sure street",
                "nice staff guddu person good knowledge friend well one stop shop needs good guide contact every time dharchula",
                "excellent service n hospitality",
                "stay really great rooms less heavenly returned back darma people staff attentive helpfull"
            ]
        },
        {
            "name": "Dharchula ( shivam Rajput )",
            "rating": [
                "Unknown"
            ],
            "address": [
                "RGXR+FJ2, Dharchula, Uttarakhand 10100, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Hotel Moon",
            "rating": [
                4.6
            ],
            "address": [
                "near government hospital, Dharchula, Uttarakhand 262545, India"
            ],
            "reviews": [
                {
                    "text": "This is one of the best located property in the downtown for a nice warm stay at Dharchula for people, who are visiting for onward journey to Adi Kailesh temple or Om Parvat at China border. Property is newly constructed/renovated and food served is of great taste as well, you dont need to find a second spot for your food needs while your stay.\nRooms: 3\nService: 4\nLocation: 4",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best rooms available in hotel moon 🥰",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Spacious rooms , quality food 🍚\nCooperative staff  😊\nSpacious n clean rooms 🫧..\nN the hospital is also near so u can get your medical done in no time  ....\nMedical before yatra ⛺🧳",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Rooms are spacious and clean, staff is also cooperative and a food is of good quality and the hospital is also nearby for medical checkup . 😊",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best hotel in dharchula and staff service is also good",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best located property downtown nice warm stay dharchula people visiting onward journey adi kailesh temple om parvat china border property newly constructedrenovated food served great taste well dont need find second spot food needs stay rooms service location",
                "best rooms available hotel moon ð\u009f¥°",
                "spacious rooms quality food ð\u009f\u008d\u009a cooperative staff ð\u009f\u0098\u008a spacious n clean rooms ð\u009f « § n hospital also near u get medical done time medical yatra â\u009bºð\u009f§³",
                "rooms spacious clean staff also cooperative food good quality hospital also nearby medical checkup ð\u009f\u0098\u008a",
                "best hotel dharchula staff service also good"
            ]
        },
        {
            "name": "Hotel Bhawana",
            "rating": [
                3.7
            ],
            "address": [
                "RGVQ+949, Kailash Mansarovar Road, अपी 10100, Nepal"
            ],
            "reviews": [
                {
                    "text": "Food ,room and also a Mart shopping a mini complex everything was good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hotel in darchula",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hospitality",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food room also mart shopping mini complex everything good",
                "good hotel darchula",
                "good hospitality"
            ]
        }
    ]
}