{
    "places_with_reviews": [
        {
            "name": "Anandvan Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Ghatghar Road, Bhandardara, Shendi, Shendi Bhandardhara, Maharashtra 414601, India"
            ],
            "reviews": [
                {
                    "text": "One of the most beautiful resorts I have visited, if you are a nature lover and want some peaceful time you must visit this place.\nI went there for my husband's birthday .They have helped me to plan the surprise for him, special thanks to Nisha.\nThe rooms were very nice, we booked a tree top nest for 2 days, it was wonderful.\nThe staff is very kind and helpful, you may find locals from nearby towns as a staff working on campus (very sweet people).\nFood is a little expensive but worth a single penny. The chef comes personally to all the tables for the feedback.\nTheir bakery products are also delicious.\n\nThe only things that I missed during my 2 day stay are Spa and Bathtub. They should have it.\n\nCons:\nNot ideal for elderly. It has many steps to reach some of the rooms.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Wonderful experience and great hospitality!!!\nWe stayed in a garden studio to celebrate birthday.\nThe rooms were clean and well maintained. The location is just awesome surrounded with lot of greenery.\nThe staff is very polite and helpful. They went out of the way to plan and execute lot of surprises on my birthday. A big thank you to Nishi at the reception.\nThe food is great but a tad expensive. The chef personally ensures that all your food cravings are met.\nAll in all we really enjoyed our stay.\nIt is pet friendly too!\nThere's only one negative point about the resort - they don't have a good swimming pool!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Amazing place and experience! The resort is calm and beautiful. The rooms are cozy and the view is surreal from the tree house room. The food is great! A wide variety.\nSpecial thanks to Chef Arun who made it even better with extraordinary culinary skills.\n\nA must place to try!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great place to enjoy vacation. Beautiful garden with views. Both sunrise and sunset could be enjoyed from resort itself. Dining experience of amazing. Loved it absolutely. Must go with family.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's one of those offbeat quiet resorts where you can go to when you want to disconnect from the outer world. Great food, though a little pricey, but the location is beautiful. They have limited menu for now but considering it's a recent opening from the group, they're working on including more amenities and food options. The staff is very helpful and assists you with all your requirements. You can walk across the property, which is lush green and also can walk down to the dam, on banks of which this is located. All in all, a good place for a weekend getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one beautiful resorts visited nature lover want peaceful time must visit place went husbands birthday helped plan surprise special thanks nisha rooms nice booked tree top nest days wonderful staff kind helpful may find locals nearby towns staff working campus sweet people food little expensive worth single penny chef comes personally tables feedback bakery products also delicious things missed day stay spa bathtub cons ideal elderly many steps reach rooms",
                "wonderful experience great hospitality stayed garden studio celebrate birthday rooms clean well maintained location awesome surrounded lot greenery staff polite helpful went way plan execute lot surprises birthday big thank nishi reception food great tad expensive chef personally ensures food cravings met really enjoyed stay pet friendly theres one negative point resort dont good swimming pool",
                "amazing place experience resort calm beautiful rooms cozy view surreal tree house room food great wide variety special thanks chef arun made even better extraordinary culinary skills must place try",
                "great place enjoy vacation beautiful garden views sunrise sunset could enjoyed resort dining experience amazing loved absolutely must go family",
                "one offbeat quiet resorts go want disconnect outer world great food though little pricey location beautiful limited menu considering recent opening group theyre working including amenities food options staff helpful assists requirements walk across property lush green also walk dam banks located good place weekend getaway"
            ]
        },
        {
            "name": "Wildroots Bhandardara",
            "rating": [
                4.4
            ],
            "address": [
                "HQ2C+R9, Shendi, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "We went with parents and it was good experience. The rooms were decent and the resort was good. Hospitality was also good. The river was dry due to summer and I am sure it would be worth visiting again during or after monsoon.\nThe weather is hot right now and hence can't be out during noon.\nWe also went for boating in the nearby lake.\nFood was good but found it costly. Breakfast was only included in our package.\nOverall staff was very nice and accomodating.\nWould recommend if you want to chill for a day or two.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Wildroots exceeded my expectations! Arrived on a bike ride and was greeted with refreshing kokam juice, setting the tone for a fantastic experience. Rooms were sparkling clean, the food was to die for - kudos to the chef for their culinary skills! The riverside seating provided a soothing ambiance. Overall, a superb experience that left me longing to return!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The resort has a perfect calming feel to it. Service and attention by the staff was very comforting. Especial mention to Mr. Yash Trivedi who can be seen interacting with every guest personally and ensuring they are comfortable and having a good time.\nRooms are good and clean but rated 4 only because they are best for a couple due to size plus they occasionally are troubled by electricity issues which I believe the management is trying to resolve permanently.\n\nFood is good especially the local cuisine. We did not get a lot of chance to taste more dishes by the chef this time so will return for more during monsoon when the place will be at its full glory.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Wildroots, what an experience. Calm, peace and serenity. Bestest staff. Beautiful rooms, well maintained garden and finger licking food. If anyone is looking for a place to get away from the usual hectic schedule and wanna be close to nature, this is the place. Cool Breeze from the river is an icing specially in this summer. Best part of all is that it is a pet friendly resort. What more can we ask for. My dog, Myra had her best time in Wildroots. Thanks to Yash and the whole team of Wildroots for making our stay a memorable one. Looking forward to going there again.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It was amazing experience, value for money place and meals. The staff is quiet helpful and friendly. Rooms very clean. Great place to stay for one night for a calm and peaceful vacation. Everything was top notch like rooms, service and meals. Would surely recommend others as well to visit if looking for a relaxing place.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "went parents good experience rooms decent resort good hospitality also good river dry due summer sure would worth visiting monsoon weather hot right hence cant noon also went boating nearby lake food good found costly breakfast included package overall staff nice accomodating would recommend want chill day two",
                "wildroots exceeded expectations arrived bike ride greeted refreshing kokam juice setting tone fantastic experience rooms sparkling clean food die kudos chef culinary skills riverside seating provided soothing ambiance overall superb experience left longing return",
                "resort perfect calming feel service attention staff comforting especial mention mr yash trivedi seen interacting every guest personally ensuring comfortable good time rooms good clean rated best couple due size plus occasionally troubled electricity issues believe management trying resolve permanently food good especially local cuisine get lot chance taste dishes chef time return monsoon place full glory",
                "wildroots experience calm peace serenity bestest staff beautiful rooms well maintained garden finger licking food anyone looking place get away usual hectic schedule wan na close nature place cool breeze river icing specially summer best part pet friendly resort ask dog myra best time wildroots thanks yash whole team wildroots making stay memorable one looking forward going",
                "amazing experience value money place meals staff quiet helpful friendly rooms clean great place stay one night calm peaceful vacation everything top notch like rooms service meals would surely recommend others well visit looking relaxing place"
            ]
        },
        {
            "name": "MTDC Bhandardhara",
            "rating": [
                4.4
            ],
            "address": [
                "Shendi, Bhandardara, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "We had booked the premium Lake view suites.\nVery spacious rooms.\nThe rooms are not as luxurious as a regular 5 star hotel, however they are very well maintained.\nThe staff was helpful and had a very nice attitude.\nFood was surprisingly good.\nWe used to order lunch sand dinner in the room and would enjoy the food at our dining table in the room, all the whole looking at the lake.\nThe view was awesome. One can sit on the bed and gaze at the lake for the full day.\nThe view is the best part about this place.\nUltimately it is an MTDC experience that you will get here.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Awesome place to stay here. Very much peace.\nRestaurant food delicious, tea was great. Very polite and good staff.\n\nI would be more happy if you remove that 10% extra charges for room service.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Great place for leisure trips. This place is well maintained by MTDC. Spacious rooms, good food and good ambiance around even in winter seasons. Only one and main thing missing is the swimming pool..",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We were here for breakfast ride. The location is really beautiful with a good lake view and food was okay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It was comfy stay for 2 nights. We had opted for Lakview Spl Room Non AC which had a fantastic view of the Arthur Lake. Kettle wire was broken, washroom door lock was not functioning, thankfully had a latch.\n\nFood was decent nothing wow as such, don't have high expectations. Also, there aren't much options of restaurants.\n\nGoogle map location isn't accurate, so pls ask for directions as you reach closer.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked premium lake view suites spacious rooms rooms luxurious regular star hotel however well maintained staff helpful nice attitude food surprisingly good used order lunch sand dinner room would enjoy food dining table room whole looking lake view awesome one sit bed gaze lake full day view best part place ultimately mtdc experience get",
                "awesome place stay much peace restaurant food delicious tea great polite good staff would happy remove extra charges room service",
                "great place leisure trips place well maintained mtdc spacious rooms good food good ambiance around even winter seasons one main thing missing swimming pool",
                "breakfast ride location really beautiful good lake view food okay",
                "comfy stay nights opted lakview spl room non ac fantastic view arthur lake kettle wire broken washroom door lock functioning thankfully latch food decent nothing wow dont high expectations also arent much options restaurants google map location isnt accurate pls ask directions reach closer"
            ]
        },
        {
            "name": "The Yash Resort | By Cotton Stays",
            "rating": [
                4.3
            ],
            "address": [
                "Akole Taluk, Bhandardara, Shendi Bhandardhara, Maharashtra 414604, India"
            ],
            "reviews": [
                {
                    "text": "They don't know the rates of their own packages! There are two contact numbers provided. One person had confirmed a room will cost 5k for 2 nights inclusive of all meals. I had confirmed the rate atleast twice on call. When I contacted the other number for final confirmation before booking, they mentioned it's 5k per night. Absolutely pathetic.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It was a very great experience but it had just one problem which was the hot water shower in the room.When ever I used to turn on the shower it gave either very hot water or very cold and if I turn on the both water options it still used to give me ice cold water. But still the service and location were great and I loved the experience. In which the pool was the greatest experience in the resort. I would suggest you to go if you want some rest from all the stress and work as it is on the outskirts of the city.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Yash resort is one of the best resort that I have visited.. Rooms are spacious & clean, Ambiance is cozy, safe & peaceful, Food is good in taste, they serve buffet for breakfast, lunch & dinner with amazing varieties in veg & non-veg. Lots of indoor & outdoor games options are available. And the most wonderful thing about the resort was its staff & service. All of them were very generous & supportive. My entire family of 8 members had a great & refreshing time. We went there on 24th.. as it was Christmas they also arranged DJ.. it was a Fab night.. If anyone is planning to visit Bhandardara I would definitely recommend Yash resort for a comfortable & safe stay",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Place is nice & quiet. Room are spacious and clean, staff is very friendly & welcoming. Cost is economical.\n\nProperty is green & have swimming pool.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I stayed here with family & my dog booked by paw adventure company, everything was fine.. food was good service was good, room was neat & clean but only thing which was Disappointing was OVERPRICED FOOD, ALCOHOL & WATER THE BASIC NEED is unreasonably OVER PRICED.. Water bottle is Rs 50/-\nBasic Al-carta lunch for will cost u Rs 1000/- per person, I don't understand why water bottle is sold above MRP ? Plz make sure that u get everything from outside & don't buy anything from this Resort",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dont know rates packages two contact numbers provided one person confirmed room cost k nights inclusive meals confirmed rate atleast twice call contacted number final confirmation booking mentioned k per night absolutely pathetic",
                "great experience one problem hot water shower roomwhen ever used turn shower gave either hot water cold turn water options still used give ice cold water still service location great loved experience pool greatest experience resort would suggest go want rest stress work outskirts city",
                "yash resort one best resort visited rooms spacious clean ambiance cozy safe peaceful food good taste serve buffet breakfast lunch dinner amazing varieties veg nonveg lots indoor outdoor games options available wonderful thing resort staff service generous supportive entire family members great refreshing time went th christmas also arranged dj fab night anyone planning visit bhandardara would definitely recommend yash resort comfortable safe stay",
                "place nice quiet room spacious clean staff friendly welcoming cost economical property green swimming pool",
                "stayed family dog booked paw adventure company everything fine food good service good room neat clean thing disappointing overpriced food alcohol water basic need unreasonably priced water bottle rs basic alcarta lunch cost u rs per person dont understand water bottle sold mrp plz make sure u get everything outside dont buy anything resort"
            ]
        },
        {
            "name": "Anand Sarovar Bhandardara",
            "rating": [
                4.5
            ],
            "address": [
                "241, Golwad Vasti Road, Murshet, Akole, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "We visited this in April 2024.\nLocation is awesome.\nRooms are good, with huge balcony.\nFood is good at anandsarovar but can be improved. Anandvan had really good food in 2019, not sure about recent times.\nStaff and services are great, no issues at all.\nI found this place kids and old friendly.\n\nIf you want to visit this property, visit it for its location and ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "14-17 Dec 2023 . Just back from a very relaxing and invigorating stay at Anand Sarovar Resort . Excellent location with excellent service. Spacious rooms , Top notch cleanliness all around within the resort. Very helpful staff , taking good care of we senior citizens. The food was all freshly prepared and all meals were delicious and had many choices.\nA special thanks to the Chef who catered to our taste in a very personal manner.\nOne star I’m giving less now is to just convey my message that the resort has to be made senior citizen friendly with railings near steps and towards the boat ride.Though the staff was ever ready to give a helping hand.Loved the karaoke and singing nights by Yash . Everything added to the ambience of subtle luxury and celebrations.Thank you once again , will surely come back.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I had a fantastic two-day stay at Hotel Anand Sarovar in Bhandardara. The resort is impressive with fabulous rooms offering stunning lake views. The food was delicious, and the well-maintained lawn added to the overall charm. The inclusion of a smart TV in the room was a great touch. The staff was not only friendly but also took excellent care of us throughout our stay. Highly recommend this wonderful experience!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Launched only in Oct'23, Anand Sarovar is a front view lakeside resort with the backdrop of a small hill. If you plan to travel from Pune, get off the highway only in Sangamner otherwise the poor condition of the roads will spoil your journey.\n\nWelcome drinks were served when we reached around noon. Rooms are medium sized, a big balcony with a couple chairs. Rooms were clean and ready to move in; a distinct aroma in the room elevated out spirits. Scenic view of the lake from our room was blissful. This was only meliorated by the Natural Auroras at dawn and dusk.\n\nLakeside lunch galvanized with quick service and tasty food was a treat for our taste buds.\n\nSome board games helped us rekindle the child within us.\n\nAs the evening grew upon us, the Karaoke session by a bonfire allowed us to stretch our legs and music was symphony to our ears.\n\nThe temperature dropped as dinner time approached so we decided to have dinner in our Balcony. The room service was quick to respond to our calls.\n\nIt was a wonderful experience and would've love to stay another night.\n\nThere should've been a fridge to store leftover food. Having said that, I'd discount this as the resort is only a few months into operation.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "An excellent place with picturesque beauty, divine serenity in terms of natural lake view and Sunrise makes oneself feel highly rejuvenating. An ideal place to stay with nature which is refreshing having beautiful rooms, delicious food, warm hospitality and services and entertainment resources that every member of family enjoys.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited april location awesome rooms good huge balcony food good anandsarovar improved anandvan really good food sure recent times staff services great issues found place kids old friendly want visit property visit location ambience",
                "dec back relaxing invigorating stay anand sarovar resort excellent location excellent service spacious rooms top notch cleanliness around within resort helpful staff taking good care senior citizens food freshly prepared meals delicious many choices special thanks chef catered taste personal manner one star iâ\u0080\u0099m giving less convey message resort made senior citizen friendly railings near steps towards boat ridethough staff ever ready give helping handloved karaoke singing nights yash everything added ambience subtle luxury celebrationsthank surely come back",
                "fantastic twoday stay hotel anand sarovar bhandardara resort impressive fabulous rooms offering stunning lake views food delicious wellmaintained lawn added overall charm inclusion smart tv room great touch staff friendly also took excellent care us throughout stay highly recommend wonderful experience",
                "launched oct anand sarovar front view lakeside resort backdrop small hill plan travel pune get highway sangamner otherwise poor condition roads spoil journey welcome drinks served reached around noon rooms medium sized big balcony couple chairs rooms clean ready move distinct aroma room elevated spirits scenic view lake room blissful meliorated natural auroras dawn dusk lakeside lunch galvanized quick service tasty food treat taste buds board games helped us rekindle child within us evening grew upon us karaoke session bonfire allowed us stretch legs music symphony ears temperature dropped dinner time approached decided dinner balcony room service quick respond calls wonderful experience wouldve love stay another night shouldve fridge store leftover food said id discount resort months operation",
                "excellent place picturesque beauty divine serenity terms natural lake view sunrise makes oneself feel highly rejuvenating ideal place stay nature refreshing beautiful rooms delicious food warm hospitality services entertainment resources every member family enjoys"
            ]
        },
        {
            "name": "Wanderlust Resort bhandardara",
            "rating": [
                3.6
            ],
            "address": [
                "Ghoti Rajur Road, near Waaki Bunglow, Bhandardara, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "I'm so amazed by the top notch service provided at Wanderlust Resort. The food is amazing! The rooms are decent and very clean having mesmerizing view. We thoroughly enjoyed our stay.Everything was up-to the required standard and quite ambient.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I'm so amazed by the top notch service provided at  Wanderlust Resort. The food  is Wow! The rooms are decent and very clean having mesmerizing view. We thoroughly enjoyed our stay.Everything was up-to  the required standard. All thanks to the owner Mr Sourabh Singh and his team for that amazing generosity,you made us feel welcome from the moment we walked through your door till the last day of our stay.I must say if you are  planning to book a stay here, then directly contact the hotel reception for hassle free experience and they will be glad to assist you in every possible way.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I along with my entire family spent New Year at Bhandardara to celebrate the holiday. There I booked in Wanderlust Resort. Stayed for 3 days. Enjoyed a lot. New Year Party, DJ Night, Gala Dinner was everything. I heartily thank the team of Wanderlust.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Visited wanderlust resort really enjoyed their services . Wonderful experience it was !!! Will visit again in monsoon .Good ambience and environment. my stay was of 2 days but really enjoyed it ❤️❤️❤️",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "When I was booking this hotel, first of all I looked at the reviews of the hotel. Many of the reviews were good but many of the reviews were also bad, so I called the hotel reception and inquired from there that I came to know that during the time of Covid. Wanderlust had given its management to someone else to run it, due to which many reviews were bad, that is why Wanderlust has taken over the management again, so now there is no problem and we are making many things better. The management has changed in December 2023, so that's why I started booking. I actually went there and experienced it myself. The staff is so good, the food is so amazing and the location is also close to Kalsubai Peak, you can even say close to Randawaterfall In the middle, we stayed there with the whole family. Had a lot of fun together and we thank the team at Wanderlust. Thanks to their hospitality and tell everyone that yes, don't go to the reviews and experience it yourself, Wanderlust has very good management.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "im amazed top notch service provided wanderlust resort food amazing rooms decent clean mesmerizing view thoroughly enjoyed stayeverything upto required standard quite ambient",
                "im amazed top notch service provided wanderlust resort food wow rooms decent clean mesmerizing view thoroughly enjoyed stayeverything upto required standard thanks owner mr sourabh singh team amazing generosityyou made us feel welcome moment walked door till last day stayi must say planning book stay directly contact hotel reception hassle free experience glad assist every possible way",
                "along entire family spent new year bhandardara celebrate holiday booked wanderlust resort stayed days enjoyed lot new year party dj night gala dinner everything heartily thank team wanderlust",
                "visited wanderlust resort really enjoyed services wonderful experience visit monsoon good ambience environment stay days really enjoyed â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
                "booking hotel first looked reviews hotel many reviews good many reviews also bad called hotel reception inquired came know time covid wanderlust given management someone else run due many reviews bad wanderlust taken management problem making many things better management changed december thats started booking actually went experienced staff good food amazing location also close kalsubai peak even say close randawaterfall middle stayed whole family lot fun together thank team wanderlust thanks hospitality tell everyone yes dont go reviews experience wanderlust good management"
            ]
        },
        {
            "name": "Hotel New Samadhan",
            "rating": [
                4.2
            ],
            "address": [
                "At/Po:- Shendi Bhandardara, Bhandardara, Shendi, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "I recently had the pleasure of staying at Hotel New Samadhan , and it was an excellent experience from start to finish.\nHospitality is at its highest level! The atmosphere, vibes and energy are calm, relaxing. A great mood is created by the aura. Very delightful, a grateful experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We stayed here for lunch but it was quite a great place ,rooms were cool and food was great",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best places to dine. The waiters Are very humble and friendly and serve you with all their heart. We had lunch and chilled out in the garden area in a swing tied to the trees. It was a peaceful experience. The hotel is little tough to find as it is located in a secluded location on a hilltop.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Ordered veg thali and special veg thali in their restaurant. Both were good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Food quality & Quantity was okay. But the washroom is pathetic means you may can not even think to use it, there is no lock for door of washroom & door was broken, inside wash room lots of tobaco pan masala spilt marks, lot of mud inside.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently pleasure staying hotel new samadhan excellent experience start finish hospitality highest level atmosphere vibes energy calm relaxing great mood created aura delightful grateful experience",
                "stayed lunch quite great place rooms cool food great",
                "one best places dine waiters humble friendly serve heart lunch chilled garden area swing tied trees peaceful experience hotel little tough find located secluded location hilltop",
                "ordered veg thali special veg thali restaurant good",
                "food quality quantity okay washroom pathetic means may even think use lock door washroom door broken inside wash room lots tobaco pan masala spilt marks lot mud inside"
            ]
        },
        {
            "name": "Bhandardara camping",
            "rating": [
                4.4
            ],
            "address": [
                "MH SH 44, Bhandardara, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "Food quality and quantity both are awesome.\nRooms were very clean and well maintained.\nCamp site was very good, it was more then what we expected.\nPeople were very polite and humble to the visitors.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Embark on a journey to the Bhandardara Lakeside Camping and spot various stars and galaxies at night\n\nStay in well maintained tents with mattresses, pillows, and blankets to keep you warm\n\nEnjoy a calm boating ride to take in the serenity of the setting and to see the panoramic views of the lake\n\nSit around a bonfire, listen to live music, eat tasty snacks and have a wonderful evening",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "If you want to have a good camping experience with your family and loved ones then this is a perfect campsite. The place is peaceful and lovely.\n\nService provided by the coordinators is also very good. So far one of the best experience than any other campsites.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Best camping site had great experience and great service",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I owe this wonderful man Keshav & his family a review with thanks.\nTheir hospitality is zenith and their kitchen is Akshayapatra, you ask something and they have a way of getting it. Veg and non-Veg and any customisation is possible. Very polite and hardworking family.\n\nThe rooms are well maintained and the view is scenic. You can feel the distant waterfalls around you.\nWe were 5 families and it was last mansoon season we visited from Hyderabad.\nCouldn't enjoy night stay in tents due to rain yet the room stay turned out to be awesome and romantic. Our kids loved every moment of the whole trip.\nLast but not the least, this village is full of water falls of all sizes.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food quality quantity awesome rooms clean well maintained camp site good expected people polite humble visitors",
                "embark journey bhandardara lakeside camping spot various stars galaxies night stay well maintained tents mattresses pillows blankets keep warm enjoy calm boating ride take serenity setting see panoramic views lake sit around bonfire listen live music eat tasty snacks wonderful evening",
                "want good camping experience family loved ones perfect campsite place peaceful lovely service provided coordinators also good far one best experience campsites",
                "best camping site great experience great service",
                "owe wonderful man keshav family review thanks hospitality zenith kitchen akshayapatra ask something way getting veg nonveg customisation possible polite hardworking family rooms well maintained view scenic feel distant waterfalls around families last mansoon season visited hyderabad couldnt enjoy night stay tents due rain yet room stay turned awesome romantic kids loved every moment whole trip last least village full water falls sizes"
            ]
        },
        {
            "name": "Hotel Amruteshwar",
            "rating": [
                3.8
            ],
            "address": [
                "Maharashtra State Highway 44, Shendi Bhandardhara, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "Nice hotel for enjoying with good food and good lake side place also they have garden seating area,there room are also awesome this is my third time I’m visiting do visit with your friends……",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Awesome food and affordable rates. Must try Dal-fry, Baingan masala and Chhans..They do not serve already pre-cooked food. They take order and then serve you fresh food. Everything was tasty and delicious. Ample parking. Service is good and not greedy.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Reasonable rate, clean rooms, fresh and delicious food both veg and non veg.staff was helpful and polite.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Location is Good,food quality was awesome and they also have lake side camping do visit your friend.......",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The place is just awesome ... with aome amazing food and VIEW...\n\nLOVELY PLACE FOR A NICE WEEKEND",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice hotel enjoying good food good lake side place also garden seating areathere room also awesome third time iâ\u0080\u0099m visiting visit friendsâ\u0080¦â\u0080¦",
                "awesome food affordable rates must try dalfry baingan masala chhansthey serve already precooked food take order serve fresh food everything tasty delicious ample parking service good greedy",
                "reasonable rate clean rooms fresh delicious food veg non vegstaff helpful polite",
                "location goodfood quality awesome also lake side camping visit friend",
                "place awesome aome amazing food view lovely place nice weekend"
            ]
        },
        {
            "name": "Surya Resort",
            "rating": [
                4
            ],
            "address": [
                "HQ84+FR9, Bhandardara - Ghoti Rd, Chichondi, Maharashtra 422604, India"
            ],
            "reviews": [
                {
                    "text": "Great food , nice location and amazing view. The food is lip smacking and location is easily accessible. 5/5 for the hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The location of the resort is the best as it’s situated near the mountains and the green farms! Even the food is really tasty and authentic here plus the staff is very warm and welcoming.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We just went there for lunch. The service is horrible as well as the food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The taste was good. Service was quick. Jice location.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The resort is very nice, the management of the resort is very nice, the food in the resort is delicious. It is a very nice place to stay for family. The cleanliness of the resort is very good, definitely visit it once. In the resort Mr.Ganesh ji is very great and helping person.he is helping to all customers.because my car is fall down near kalsubai treak Mr Ganesh sir arreging another car for my family..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great food nice location amazing view food lip smacking location easily accessible hospitality",
                "location resort best itâ\u0080\u0099s situated near mountains green farms even food really tasty authentic plus staff warm welcoming",
                "went lunch service horrible well food",
                "taste good service quick jice location",
                "resort nice management resort nice food resort delicious nice place stay family cleanliness resort good definitely visit resort mrganesh ji great helping personhe helping customersbecause car fall near kalsubai treak mr ganesh sir arreging another car family"
            ]
        }
    ]
}