{
    "places_with_reviews": [
        {
            "name": "Mithila Nature Stay - Agumbe Homestay",
            "rating": [
                4.7
            ],
            "address": [
                "G35W+4VX, Car St, Agumbe, Karnataka 577411, India"
            ],
            "reviews": [
                {
                    "text": "Stayed for one night. Beautiful place. Service of Mr Bashkar and Mr Rakshith was excellent. Both served well even though we reached there in night. Provided tent facility for us.\n\nOwner of the property very nice gentleman. Food was very very good. Worth for our money.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Absolutely loved the stay n the hospitality..\nClean rooms n peaceful stay.\nStaff n owner so humble n friendly I would like to visit again..\nAnd also small water stream runs inside the property it's beautiful",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Hi, I was here been 3 days, the place was very beautiful to stay here, the person who is the care taker Mr rakshit was very good person and took care of us and guided about the nearby locations and the room was very neat and clean and very hygiene TQ for taking care and guiding us for everything, wanted to visit next time.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It was really good for trips we went with 4 other  people only thing is it doesn't have a ac that's it rest everything is great",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great location and service!!!\n\nMithila nature stay in Agumbe is located at a scenic location right inside an areca nut farm and very close to Agumbe town center. A stream runs inside the property where kids had a great time playing. The caretakers Rakshit and another person (don't remember the name) took great care and helped us in booking vehicle for local sight seeing visit. Rooms were quite spacious.\n\nOverall it was an amazing and memorable stay. Would like to visit again and I recommend this homestay to anyone looking for a great stay at Agumbe",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed one night beautiful place service mr bashkar mr rakshith excellent served well even though reached night provided tent facility us owner property nice gentleman food good worth money",
                "absolutely loved stay n hospitality clean rooms n peaceful stay staff n owner humble n friendly would like visit also small water stream runs inside property beautiful",
                "hi days place beautiful stay person care taker mr rakshit good person took care us guided nearby locations room neat clean hygiene tq taking care guiding us everything wanted visit next time",
                "really good trips went people thing doesnt ac thats rest everything great",
                "great location service mithila nature stay agumbe located scenic location right inside areca nut farm close agumbe town center stream runs inside property kids great time playing caretakers rakshit another person dont remember name took great care helped us booking vehicle local sight seeing visit rooms quite spacious overall amazing memorable stay would like visit recommend homestay anyone looking great stay agumbe"
            ]
        },
        {
            "name": "Nrupatunga family garden restaurant and home stay",
            "rating": [
                4.1
            ],
            "address": [
                "Sringeri, road, Agumbe, Karnataka 577411, India"
            ],
            "reviews": [
                {
                    "text": "Nice view point and nice fog in morning low cost 500 room and food is lower costs below 220,80 rupees and excellent service hot water and restaurant",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food was good but atmosphere was below average and cleanliness and hygiene not maintained...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best for a budget stay. I stayed for one night and it was 600 rs for a single room. Not too spacious. No internet that's something you should watch out for. There was no electricity at night but loved the vibe of sleeping listening to the rain sound and the cold weather.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "On the way to Udupi, we wanted to halt here for food. The food was awesome and the hospitality they showed was great which made us to stay there and we thoroughly enjoyed good food and rooms.  In my whole Karnataka tour this was the tastiest good I tasted. The owner is an Ex service man. He is nice and talks to you like a friend. Overall we have a pleasant stay and food",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice hospitality, tasty foods, gud ambience",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice view point nice fog morning low cost room food lower costs rupees excellent service hot water restaurant",
                "food good atmosphere average cleanliness hygiene maintained",
                "best budget stay stayed one night rs single room spacious internet thats something watch electricity night loved vibe sleeping listening rain sound cold weather",
                "way udupi wanted halt food food awesome hospitality showed great made us stay thoroughly enjoyed good food rooms whole karnataka tour tastiest good tasted owner ex service man nice talks like friend overall pleasant stay food",
                "nice hospitality tasty foods gud ambience"
            ]
        },
        {
            "name": "Mallya Residency",
            "rating": [
                3.9
            ],
            "address": [
                "bus Stop, 12, Agumbe - Thirthahalli Rd, opp. Agumbe, Agumbe, Karnataka 577411, India"
            ],
            "reviews": [
                {
                    "text": "It's a clean place to stay. The only reason I am giving 3 star is because they did not mention about power cuts. We took AC room and we only used AC for 10 hrs. If they has mentioned about power cuts we could have made other arrangements for that time. Prior intimation to customers when buying premium rooms shows how much they care about customer service",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good lodge. Owner sudheendra malya good adminstror. But only draw back is they have not provided towels. Fan and ait conditioner were not working properly. When contacted the manager or night duty care taker did not respond properly.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good place to stay and reasonable price.  Owner is very approachable",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "With lot of bugs and cocroachs. Not clean but location of the hotel is good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very nice stay and hospitality. Good restaurent down. Good food.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean place stay reason giving star mention power cuts took ac room used ac hrs mentioned power cuts could made arrangements time prior intimation customers buying premium rooms shows much care customer service",
                "good lodge owner sudheendra malya good adminstror draw back provided towels fan ait conditioner working properly contacted manager night duty care taker respond properly",
                "good place stay reasonable price owner approachable",
                "lot bugs cocroachs clean location hotel good",
                "nice stay hospitality good restaurent good food"
            ]
        },
        {
            "name": "Brundavana Garden Restaurant and Homestay",
            "rating": [
                4.7
            ],
            "address": [
                "Agasarakone, Agumbe, Karnataka 577411, India"
            ],
            "reviews": [
                {
                    "text": "Nice peaceful spot 3km from Agumbe crossroads. The manager is super helpful and kind! I stayed 2 nights and did several walks around the area! Nice birdwatching at the back of the hotel!\nClean safe inexpensive.\nPaul , Ireland.\nThank you Raghevendra!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This is hidden gem for a small group of friends, family and couple. Here you can have a humble and polite, silent stay in Agumbe!\n\nLooking forward to come back! Cheers 😊👍🏽",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best Place to relax. I want to take time to thank owner for providing excellent service for complete stay from food to everything.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very good hospitality..owner was really nice...it was a homely guesture...\nHomely food, customised as per your requirement....",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It's a great place to stay on vacation,  there is parking space and food is available as well.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice peaceful spot km agumbe crossroads manager super helpful kind stayed nights several walks around area nice birdwatching back hotel clean safe inexpensive paul ireland thank raghevendra",
                "hidden gem small group friends family couple humble polite silent stay agumbe looking forward come back cheers ð\u009f\u0098\u008að\u009f\u0091\u008dð\u009f\u008f½",
                "best place relax want take time thank owner providing excellent service complete stay food everything",
                "good hospitalityowner really niceit homely guesture homely food customised per requirement",
                "great place stay vacation parking space food available well"
            ]
        }
    ]
}