{
    "places_with_reviews": [
        {
            "name": "TATVARAJ FARMS, tambadi,Kolad",
            "rating": [
                4.7
            ],
            "address": [
                "TatvaRaj Farm, Roha Gohsale Road , near Krishna Hotel Tambadi , tal, Dist, Roha, Tambadiwadi, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "Super service n food with all jain option. .\nGood ambiance and support form team and owner very down to earth and specially kitchen staff super friendly and always smile on the face .\n\nKeep doing better must visit",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Well to start, our experience at Tatvaraj Farms was extremely blissful and satisfying. Everything from rooms, amenities to food and staff was sheer perfection.\nRooms were extremely spacious and clean with a beautiful view of nature.\nPlay area and swimming pool were again extremely well maintained.\nThe food is super delicious and the staff is extremely courteous and friendly, you will feel like you're having food at your home.\nThe staff was so helpful that they never said 'no' for anything.\nThey give you a feeling as if one big family of staff is pampering you on your holiday.\nThe resort is situated in them middle of nature and the rooms are surrounded by beautiful trees and flowers.\n\nIts too good to be true types!\nspecial Mention of Mr. Mahavir who took care of everything very nicely.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent place! Vibe is good! Staff is very co operative ! Food is great ! Must visit place !\n1)They serve completely veg food and make extra efforts for kids food as well.\n\n2)The owner herself is active and kind.\nShe makes sure her guests are treated well by their needs.\n\n3)Do visit this place and cherish the family times !",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Honest Review!\n\nOverall the property is descent. Room size are big and offer good view. Food quality is good with limited options for each meal, btw this is pure veg restaurant . It also serves limited Jain food. Good swimming pool with descent music. Good amenities and play area where you can enjoy all the internal games like pool, TT, carom and also has Karaoke setup.\n\nThe day we visited, there was a day school picnic arranged with some 40-50 kids which were using all the amenities.\n\nThe property internal area is too small and feels as if you are exploring a bungalow property. With the amount they are charging the property is not that giant or big to explore.\n\nNeeds improvement in below area :\n\n1. Food or cuisine spread should be more like some fruits or salad spread should be added . Very limited options in breakfast, any additional food  you will have to pay extra.\n2. Property area is too small and the arrangements which they have managed to accommodate in this area make very lesser space to have privacy and some breathing room.\n3.School picnic should be avoided or made available during the odd days when you don't have any room booking.\n\nThanks Mahavir for the support during the stay!\n\nOverall descent property and I would rate 3.5/5 based on my experience!\n\nThanks!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "\"Immaculate pool facility offering a tranquil escape with crystal-clear waters, spacious surroundings, attentive lifeguards, and a serene atmosphere perfect for relaxation and enjoyment for visitors of all ages. Highly recommended for a refreshing aquatic experience.\"",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "super service n food jain option good ambiance support form team owner earth specially kitchen staff super friendly always smile face keep better must visit",
                "well start experience tatvaraj farms extremely blissful satisfying everything rooms amenities food staff sheer perfection rooms extremely spacious clean beautiful view nature play area swimming pool extremely well maintained food super delicious staff extremely courteous friendly feel like youre food home staff helpful never said anything give feeling one big family staff pampering holiday resort situated middle nature rooms surrounded beautiful trees flowers good true types special mention mr mahavir took care everything nicely",
                "excellent place vibe good staff co operative food great must visit place serve completely veg food make extra efforts kids food well owner active kind makes sure guests treated well needs visit place cherish family times",
                "honest review overall property descent room size big offer good view food quality good limited options meal btw pure veg restaurant also serves limited jain food good swimming pool descent music good amenities play area enjoy internal games like pool tt carom also karaoke setup day visited day school picnic arranged kids using amenities property internal area small feels exploring bungalow property amount charging property giant big explore needs improvement area food cuisine spread like fruits salad spread added limited options breakfast additional food pay extra property area small arrangements managed accommodate area make lesser space privacy breathing room school picnic avoided made available odd days dont room booking thanks mahavir support stay overall descent property would rate based experience thanks",
                "immaculate pool facility offering tranquil escape crystalclear waters spacious surroundings attentive lifeguards serene atmosphere perfect relaxation enjoyment visitors ages highly recommended refreshing aquatic experience"
            ]
        },
        {
            "name": "Hotel Roha Pride",
            "rating": [
                3.7
            ],
            "address": [
                "Roha-Ashtami Bridge, Near Dabir Complex, Near Kundalika River, Dabir Complex, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "One of the budget hotels in Roha. Overall neat and clean. Don't expect high class services and facilities but good basic facilities.\nIn house food quality is also good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Service was superb the people working there and the owners are very friendly and loving. Food option is just for vegetarians but the rooms are clean and good 👍\nOverall experience staying there was good.. a place to recommend for a hygienic stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very well located, bus station is close. Right on the bank of the river.. Delicious food with excellent service. Highly Recommended 👍",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good location for business work in Roha.  Though traffic noise is disturbing,  it can be accepted the way it is.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This is a wonderful place to stay with family, full value for money and great hospitality.\nThe hotel is at strategic location and easily accessible by railway station. The Best part is Four wheeler parking available...\nThe room is fresh, specious, clean, nicely decorated and well furnished. Each rooms in the hotel are given with a flat-screen TV.\nPure vegetarian restaurant available inside. The food is nice, room service is fast and the rates are reasonable.\nOne more good part was the convenience of check- in and check- out timing with a prior discussion…Overall, Staying in this hotel will be a memorable experience. Highly Recommended.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one budget hotels roha overall neat clean dont expect high class services facilities good basic facilities house food quality also good",
                "service superb people working owners friendly loving food option vegetarians rooms clean good ð\u009f\u0091\u008d overall experience staying good place recommend hygienic stay",
                "well located bus station close right bank river delicious food excellent service highly recommended ð\u009f\u0091\u008d",
                "good location business work roha though traffic noise disturbing accepted way",
                "wonderful place stay family full value money great hospitality hotel strategic location easily accessible railway station best part four wheeler parking available room fresh specious clean nicely decorated well furnished rooms hotel given flatscreen tv pure vegetarian restaurant available inside food nice room service fast rates reasonable one good part convenience check check timing prior discussionâ\u0080¦overall staying hotel memorable experience highly recommended"
            ]
        },
        {
            "name": "Akshay Lawns",
            "rating": [
                4.5
            ],
            "address": [
                "Nivi Rd, Wali, Bhuwaneshwar, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "Amazing Property with great ambiance. Preferable for group tour. Property Staff is very much coordinative and beautiful Management. Perfect for weekends holidays.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice place. Best for wedding, birthday party, get together.\nBig area and big parking.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Amazing Hospitality, Nice ambience feels very peaceful to be,would love to visit again n again",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Overall Good Lawns for family function and other activities.\nPlace was too good l..here swimming pool is also available so u can enjoy with your friends.\nFor stay AC Non Ac rooms are alos available here.\nThis place was natural surrounded.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very hygienic and a worth place to visit",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing property great ambiance preferable group tour property staff much coordinative beautiful management perfect weekends holidays",
                "nice place best wedding birthday party get together big area big parking",
                "amazing hospitality nice ambience feels peaceful bewould love visit n",
                "overall good lawns family function activities place good lhere swimming pool also available u enjoy friends stay ac non ac rooms alos available place natural surrounded",
                "hygienic worth place visit"
            ]
        },
        {
            "name": "Hotel Mirage",
            "rating": [
                3.8
            ],
            "address": [
                "Hotel Mirage,Roha Kolad Road, opposite to Raikar Park suhas apts, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "I happened to visit this restaurant on my trip. the food was amazing but was something different than my expectation. Also I found the service slow. Overall a great ambience.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Well as a local resident of roha town , its one of the best hotel for non veg lovers ... people just dive into the Taste of  The Mirage",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Loved their chicken biryani. Best restaurant. Highly recommend.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food quality is good, however the response time is too slow. Need to improve the same to improve customer repo",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room condition is very bad.... Many time power cut....",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "happened visit restaurant trip food amazing something different expectation also found service slow overall great ambience",
                "well local resident roha town one best hotel non veg lovers people dive taste mirage",
                "loved chicken biryani best restaurant highly recommend",
                "food quality good however response time slow need improve improve customer repo",
                "room condition bad many time power cut"
            ]
        },
        {
            "name": "R26 Restaurant and Resort",
            "rating": [
                4.2
            ],
            "address": [
                "restaurantsand resort, R26, near Roha, Khargaon, Roha, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "This was my favourite restaurant as my relatives live nearby. Before 8-9months it served delicious food and taste was amazing but recently it has been degraded. Hopefully they improve the taste rest all is superb.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Management should focus on quality of food . Mutton lapeta was very horrible , mutton was like rubber . Chicken was having smell . Shall never recommend anyone for main course.\nStarters are ok .\nOnly good is ambiance …. Food quality is very poor .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst ever hotel dined in. Paneer used was bad. Was not able to cut into two.\nUnimaginable wait time. Food served was ice cold. When asked for replacement waiter was hesitating to get it done. No one was attending even after repeatedly asking for. NAM BADA DARSHAN CHOTE.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Finest restaurant in Roha near hills and riverbeds. Good ambiance and great food. Serves vegetarian and non-vegetarian delicious food. Enjoy lovely nature with open space outside the restaurant. AC and non AC restaurant sitting are also available. Only server lunch and dinner. Good food at a great location. A good family restaurant also under construction rooms and a small swimming pool\nHappy to be at R26 restaurant at Roha",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst Place to go. Owner is not interested in customers he just want money for everything. We wasted our vacation. Choose any other place.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "favourite restaurant relatives live nearby months served delicious food taste amazing recently degraded hopefully improve taste rest superb",
                "management focus quality food mutton lapeta horrible mutton like rubber chicken smell shall never recommend anyone main course starters ok good ambiance â\u0080¦ food quality poor",
                "worst ever hotel dined paneer used bad able cut two unimaginable wait time food served ice cold asked replacement waiter hesitating get done one attending even repeatedly asking nam bada darshan chote",
                "finest restaurant roha near hills riverbeds good ambiance great food serves vegetarian nonvegetarian delicious food enjoy lovely nature open space outside restaurant ac non ac restaurant sitting also available server lunch dinner good food great location good family restaurant also construction rooms small swimming pool happy r restaurant roha",
                "worst place go owner interested customers want money everything wasted vacation choose place"
            ]
        },
        {
            "name": "Nakshatra Farms",
            "rating": [
                4.9
            ],
            "address": [
                "Barshet, Road, Tamdi Budruk, Roha, Tambadi, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "Nice calm and cool place. Staff and owner are very Co-Operative. Respond to your suggestions immediately. Food is very tasty. They prepare it to your choice, taste and variety. Nice place for camping.\nI have gone there in August 23   and again in February 24.\nRates also are reasonable..",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very good place to spend time with your friends and family. It is well maintained and the people working there are very friendly. Must visit!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "An awesome facility for family as well as corporate outing. Superb food and a beautiful nature.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "It's best place to visit with your family and friends. All staff members are polite and respectful. Food quality and other services are top notch. Pool is well maintained. Every room have AC. Must visit this place.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Had a great fun...Enjoyed lot in swimming pool. Food was excellent",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice calm cool place staff owner cooperative respond suggestions immediately food tasty prepare choice taste variety nice place camping gone august february rates also reasonable",
                "good place spend time friends family well maintained people working friendly must visit",
                "awesome facility family well corporate outing superb food beautiful nature",
                "best place visit family friends staff members polite respectful food quality services top notch pool well maintained every room ac must visit place",
                "great funenjoyed lot swimming pool food excellent"
            ]
        },
        {
            "name": "JenJon Wood County Phansad Alibaug",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Revdanda - Murud Road Kharkhardi, Roha, C4P8+4PH, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Annapurna Guest House (MTDC)",
            "rating": [
                4
            ],
            "address": [
                "C4Q9+9P9, Veer V D Savarkar Rd, Roha Nagar, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "Location provided by owner is not accurate. Its is located behind st bus depo near ram mandir. They charged me 400 for attached room. Room was nice but rate is slightly high .There may be room below 400 I don't know about that.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Not Having good experience.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location provided owner accurate located behind st bus depo near ram mandir charged attached room room nice rate slightly high may room dont know",
                "good experience",
                "nice"
            ]
        },
        {
            "name": "Maratha Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "Maruti chok. tal Roha. dist, C4Q9+569, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel with affordable prices.\nLocation is good and near to Roha Bus Stand.\nThey serve variety of food including chinese.\nService offer is good and good place for party.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very good budget restaurant for delicious vegetarian and non veg dishes dishes. Good staff and management.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Tasty and wow food\nlike homemade",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Testy food , good service, visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The food is best in the world",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel affordable prices location good near roha bus stand serve variety food including chinese service offer good good place party",
                "good budget restaurant delicious vegetarian non veg dishes dishes good staff management",
                "tasty wow food like homemade",
                "testy food good service visit",
                "food best world"
            ]
        },
        {
            "name": "Monika Hotel And Lodging",
            "rating": [
                "Unknown"
            ],
            "address": [
                "near by Hanuman temple, At= Khari , post = Khargaon, taluka = Roha, Dis. =, C4Q8+HPJ, Wali, Roha, Maharashtra 402109, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}