{
    "places_with_reviews": [
        {
            "name": "Premdan Hotel",
            "rating": [
                3.7
            ],
            "address": [
                "4P9H+8V6, Savedi Rd, Near Premdan Chowk, Savedi, Ahmednagar, Maharashtra 414003, India"
            ],
            "reviews": [
                {
                    "text": "It's a famous landmark in ahmednagar almost all good places are near this location ,even a person new to this city ,in two days time knows minimum two location one is Delhi gate and next us sweethome or premdan chowk",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "A fine and safe to stay hotel,with family.\nGood staff and hospitality.\nI enjoyed my stay at Preman",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Hotel was Good, But not  up to date.\nAvarage hotel and Ambiance.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "there is electricity everywhere but not in this property around 3-5 am, and no way to contact to reception desk, no one response to you once payment is done, bad experience, rood side and no sound proof windows car noise all night",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We booked one room for a group of 6 people. Two bedrooms each with 3 beds made up of iron frame with sharp edges and half foot space between the beds. The wardrobe was pathetic. Far away from the station.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "famous landmark ahmednagar almost good places near location even person new city two days time knows minimum two location one delhi gate next us sweethome premdan chowk",
                "fine safe stay hotelwith family good staff hospitality enjoyed stay preman",
                "hotel good date avarage hotel ambiance",
                "electricity everywhere property around way contact reception desk one response payment done bad experience rood side sound proof windows car noise night",
                "booked one room group people two bedrooms beds made iron frame sharp edges half foot space beds wardrobe pathetic far away station"
            ]
        },
        {
            "name": "Iris Premiere",
            "rating": [
                4.3
            ],
            "address": [
                "3PJM+F5M, Kothi - Yash Palace Rd, Opp Anand Rishiji Hospital, Maniknagar, Ahmednagar, Maharashtra 414001, India"
            ],
            "reviews": [
                {
                    "text": "Very Bad experience,\nProviding an initial review within the first hour of check-in. Will update post-checkout after experiencing the stay.\n\nCheck-in process delayed.\nRoom size extremely compact.\nTelephone non-functional, hindering communication with reception or room service.\nHotel conveniently located near the station (within 2 km), but lacks pick-up and drop-off services.\nLack of metered autos raises concerns about potential overcharging.\n\nWould not recommend staying here. Thank you.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I stayed here with my family. It is a nice hotel with clean and well maintained rooms. Food in their restaurant is excellent and their complementary breakfast is very good. We had a great time here.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is a superb hotel to stay in Ahmednagar. The rooms and bathrooms are clean and spacious. The restaurant is worth checking out and the pizza and paneer dishes were really good. Staff is friendly and courteous. The location is central and there is enough parking. I went there on a family trip to visit Meher Baba's ashram and it was about 5 km from this hotel in downtown Ahmednagar. For those who have not been to Ahmednagar recently, it is growing really nicely without giving up its comfortable small town laid back feel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel was clean, stylish, and roomy. The food was good and the service was attentive and efficient. The room was comfortable and well equipped.\nThe hotel had 24/7 room service, easy parking, and lovely staff",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The worst !! Please dont go.\nAlmost all the washrooms are clogged in this so called 5 star property. I still remember we had a wedding to attend next day and the room service guy was fixing the flush at 1am. Plus they directly go into your room for cleaning without informing you even if DND mode is active. PATHETIC HOTEL !!!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience providing initial review within first hour checkin update postcheckout experiencing stay checkin process delayed room size extremely compact telephone nonfunctional hindering communication reception room service hotel conveniently located near station within km lacks pickup dropoff services lack metered autos raises concerns potential overcharging would recommend staying thank",
                "stayed family nice hotel clean well maintained rooms food restaurant excellent complementary breakfast good great time",
                "superb hotel stay ahmednagar rooms bathrooms clean spacious restaurant worth checking pizza paneer dishes really good staff friendly courteous location central enough parking went family trip visit meher babas ashram km hotel downtown ahmednagar ahmednagar recently growing really nicely without giving comfortable small town laid back feel",
                "hotel clean stylish roomy food good service attentive efficient room comfortable well equipped hotel room service easy parking lovely staff",
                "worst please dont go almost washrooms clogged called star property still remember wedding attend next day room service guy fixing flush plus directly go room cleaning without informing even dnd mode active pathetic hotel"
            ]
        },
        {
            "name": "SANJOG LAWNS",
            "rating": [
                4.1
            ],
            "address": [
                "cottage corner, Don Bosco Area, Ahmednagar, Maharashtra 414003, India"
            ],
            "reviews": [
                {
                    "text": "Suitable Place for Organising events like Birthday's Parties, Anniversary's, Marraige Function with a min. Croud of 100 to Max 1000 pepoles.\nAlong with it also provides a Decent quality of Food. Great Ambilence. Quality of service needs to be improved. Overall 7 on 10.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food quality varieties of food nice\nParking areas are good\nLocation is also good on the\nHighway .\nVery important any time we will enjoy parties along with family members",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good food prompt service everything clean, drink bar,ok",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "One of the best places to dine and for conducting large functions. Food is great and staff is courteous",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Awesome venue for Grand party. Delicious food options. Great Hospitality people. Above expectations experience",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "suitable place organising events like birthdays parties anniversarys marraige function min croud max pepoles along also provides decent quality food great ambilence quality service needs improved overall",
                "food quality varieties food nice parking areas good location also good highway important time enjoy parties along family members",
                "good food prompt service everything clean drink barok",
                "one best places dine conducting large functions food great staff courteous",
                "awesome venue grand party delicious food options great hospitality people expectations experience"
            ]
        },
        {
            "name": "Hotel Yash Grand",
            "rating": [
                4.1
            ],
            "address": [
                "Anand Nagar, Ahmednagar, Maharashtra 414005, India"
            ],
            "reviews": [
                {
                    "text": "There is something about this hotel\nIts old yet grand\nGrand sized rooms makes it comfortable and luxurious to stay. Clean bed sheets huge window nice curtains  with sheer for the light to peep in.\nGood breakfast spread\nLocated well withing the city Nagar.\nStaff well mannered trained cooperative .\nAmple parking space.\nWell within budget for the size of rooms and lobby.\nIts a feel good hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A very basic hotel with not so clean rooms. The staff is a bit arrogant. If you order something in the room make sure you are ready with the money to pay them immediately. They do not wait to clear the bill and sit on your head until you clear the same. The staff directly gets into your room if you order something. Overall I didn't have a very good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is a good hotel to stay for official visits, rooms are clean and very spacious . Staff is highly friendly. Very good part is food , tasty and well made. Breakfast is only not so good part..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Friendly staff, excellent service, extremely clean, great ambiance and luxurious rooms.\nThe hospitality deserves appreciation.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good Hotel rooms with bathtub, TV, Wi-Fi and others A1 service with budget main things is Hotel is near the market and Station so it’s very helpful for tourists",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "something hotel old yet grand grand sized rooms makes comfortable luxurious stay clean bed sheets huge window nice curtains sheer light peep good breakfast spread located well withing city nagar staff well mannered trained cooperative ample parking space well within budget size rooms lobby feel good hotel",
                "basic hotel clean rooms staff bit arrogant order something room make sure ready money pay immediately wait clear bill sit head clear staff directly gets room order something overall didnt good experience",
                "good hotel stay official visits rooms clean spacious staff highly friendly good part food tasty well made breakfast good part",
                "friendly staff excellent service extremely clean great ambiance luxurious rooms hospitality deserves appreciation",
                "good hotel rooms bathtub tv wifi others service budget main things hotel near market station itâ\u0080\u0099s helpful tourists"
            ]
        },
        {
            "name": "Hotel Paradise",
            "rating": [
                4.1
            ],
            "address": [
                "3PMJ+582, New Tilak Rd, near Sarkar Chowk, Maliwada, Ahmednagar, Maharashtra 414001, India"
            ],
            "reviews": [
                {
                    "text": "Excellent Location. Very near to Ahmednagar Bus Stop (within a Km ). Though the area wad busy and noisy, Hotel is situated inside. So no disturbance at all.\nRooms are Nice. AC, Geyser, TV etc were working nicely. Complementary Water Bottles were provided.\nBed and Linen provided were good. Toiletries were provided. Restaurant was very good.\nWe have enjoyed our Stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The hotel staff is pathetic, when we ask for water they will give you tap filled open sealed bottle, the hotel has only one iron press and they will call you every 5 mins to return it as apparently the hotel doesnt keep extra iron press.\n\nI needed glue stick and they were so hesitant to give it and said the manager has said not to give simple glue sticks to the customers.\n\nThe rooms are okay but the hotel services are terrible\n\nWould not recommend 👎👎",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The new rooms are specious and well designed, few small things are taken care of to make a luxurious experience for guests..like cleanliness, hand towel in bathroom etc. Good variety in buffet breakfast. No proper space for driver stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good staff, Good service, food Quality and taste is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is very good hotel as far as location is concerned all the things are awesome and the Paisa starts from 1500 . For more details you must login to my YouTube channel y",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent location near ahmednagar bus stop within km though area wad busy noisy hotel situated inside disturbance rooms nice ac geyser tv etc working nicely complementary water bottles provided bed linen provided good toiletries provided restaurant good enjoyed stay",
                "hotel staff pathetic ask water give tap filled open sealed bottle hotel one iron press call every mins return apparently hotel doesnt keep extra iron press needed glue stick hesitant give said manager said give simple glue sticks customers rooms okay hotel services terrible would recommend ð\u009f\u0091\u008eð\u009f\u0091\u008e",
                "new rooms specious well designed small things taken care make luxurious experience guestslike cleanliness hand towel bathroom etc good variety buffet breakfast proper space driver stay",
                "good staff good service food quality taste also good",
                "good hotel far location concerned things awesome paisa starts details must login youtube channel"
            ]
        },
        {
            "name": "Hotel Radiance",
            "rating": [
                4
            ],
            "address": [
                "Station Rd, near Swastik Chowk, Maniknagar, Ahmednagar, Maharashtra 414001, India"
            ],
            "reviews": [
                {
                    "text": "We had dinner at a party and the food was simply not worth eating . Their mix veg was in liquid which means you can't even eat and paneer veg had a few tiny pieces not more than two or three in a full of service Donga . It's really a waste of money. But starters and soups were good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Property is newly built hence it looks good. However hospitality can be improved. The kind of toiletries provided were minimal. The room service was sub-par. They took a lot of time to serve the tea and sandwiches. The sandwich served were cold",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "No parking ,rooms are ok but bedsheet blanket towel are old and worst",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are excellent,  service needs to be improved",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Overall hotel stay is good experience with the room services and hygienic aspects. The owners were taking keen interest in cleaning with utmost care. They really need to work their food quality, it is too poor and doesn't reflect the standards as per the stay quality, as time will pass merely because of food quality they might lose their potential future business.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dinner party food simply worth eating mix veg liquid means cant even eat paneer veg tiny pieces two three full service donga really waste money starters soups good",
                "property newly built hence looks good however hospitality improved kind toiletries provided minimal room service subpar took lot time serve tea sandwiches sandwich served cold",
                "parking rooms ok bedsheet blanket towel old worst",
                "rooms excellent service needs improved",
                "overall hotel stay good experience room services hygienic aspects owners taking keen interest cleaning utmost care really need work food quality poor doesnt reflect standards per stay quality time pass merely food quality might lose potential future business"
            ]
        },
        {
            "name": "HOTEL GULMOHAR PRIDE",
            "rating": [
                4
            ],
            "address": [
                "plot no 231, Gulmohar Rd, near aurangabad highway, Urban Bank Colony, Savedi, Ahmednagar, Maharashtra 414003, India"
            ],
            "reviews": [
                {
                    "text": "Worst hotel for stay. Rooms full of pests .\nStaff doesnt care when informed that pests in my room.\nNeed medical attention when you go to this hotel",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The breakfast was promised at 7-7:30am but it was delayed and got our order at 8:15am. The delay has cost me dearly in the subsequent plans. No service ethics.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Such a best hotel to stay in Ahmednagar City.clean and hygienic rooms and bathroom. Humble staff as well owner.very reasonable prices.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Overall a good experience only, but due to laundry towels and other bedding are in pretty bad condition.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Bathroom was too bad  and service was  too slow and worst  and the food was also very bad",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst hotel stay rooms full pests staff doesnt care informed pests room need medical attention go hotel",
                "breakfast promised delayed got order delay cost dearly subsequent plans service ethics",
                "best hotel stay ahmednagar cityclean hygienic rooms bathroom humble staff well ownervery reasonable prices",
                "overall good experience due laundry towels bedding pretty bad condition",
                "bathroom bad service slow worst food also bad"
            ]
        },
        {
            "name": "Hotel Nishant Zopadi",
            "rating": [
                3.8
            ],
            "address": [
                "Hotel Nishant Zopadi, Savedi Rd, Mahavir Nagar, Ahmednagar, Maharashtra 414003, India"
            ],
            "reviews": [
                {
                    "text": "Very poor service and worst experience, ordered veg thali found hair in it, while complaining to the owner he took it casually, curd milk - taak was too salty, only ambiance good not recommended this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good lunch but not taste as like",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The service is quite slow and the place has also been changed so for new business.\nQuality is like old one same no taste but ok ok not a parking structure still it can be done better\nAnd should check out menu card in English",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I have ordered butterscotch milk shake but it is not upto the mark as I have paid for it",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "WORST HOTEL , BAD QUALITY FOOD NO CLEANLINESS. THERE ARE COCKROACHES IN FOOD.I ORDERED SABUDANA KHICHADI THERE WAS COCKROACH IN FOOD.\nWORST FOOD EXPERIENCE, FOUND WHOLE COCKROACH IN FOOD.\nDO NOT EVER ORDER FOOD FROM HERE KITCHEN MUST BE INFECTED WITH COCKROACHES.\nNOT CAPABLE OF RATING 1 ALSO😡😡😡😡",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "poor service worst experience ordered veg thali found hair complaining owner took casually curd milk taak salty ambiance good recommended hotel",
                "good lunch taste like",
                "service quite slow place also changed new business quality like old one taste ok ok parking structure still done better check menu card english",
                "ordered butterscotch milk shake upto mark paid",
                "worst hotel bad quality food cleanliness cockroaches foodi ordered sabudana khichadi cockroach food worst food experience found whole cockroach food ever order food kitchen must infected cockroaches capable rating alsoð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡"
            ]
        },
        {
            "name": "Capital O V Star",
            "rating": [
                4.1
            ],
            "address": [
                "Bus Stand, Savedi Rd, Near, Tarakpur, Ahmednagar, Maharashtra 414001, India"
            ],
            "reviews": [
                {
                    "text": "Good atmosphere and a unique place for small functions like engagement or similar functions of two to three hours. The service is good. The food quality is required to be improved as the owners are in the hotel industry since last so many years.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "These people are good and cooperative.\nI booked a suite got room service well mannered.\nOn morning time they didn't informed about the complementary breakfast.\nWorst thing I had ever experienced.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent hospitality. Decent rooms and wonderful food. Friendly crew. VFM. Hotel is dog friendly and was kind enough to accommodate my large dog. Felt at home👍",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice hotel. Some minor things were not working and those were small irritants. Breakfast is vegetarian and ok. Staff very friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A luxurious yet affordable property situated in a perfect place for people travelling pune or Aurangabad offering wide variety of food ( veg and non veg ) cooked in high quality ingredients. Staff is good for both dine in and room service. Rooms are clean and spacious.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good atmosphere unique place small functions like engagement similar functions two three hours service good food quality required improved owners hotel industry since last many years",
                "people good cooperative booked suite got room service well mannered morning time didnt informed complementary breakfast worst thing ever experienced",
                "excellent hospitality decent rooms wonderful food friendly crew vfm hotel dog friendly kind enough accommodate large dog felt homeð\u009f\u0091\u008d",
                "nice hotel minor things working small irritants breakfast vegetarian ok staff friendly",
                "luxurious yet affordable property situated perfect place people travelling pune aurangabad offering wide variety food veg non veg cooked high quality ingredients staff good dine room service rooms clean spacious"
            ]
        },
        {
            "name": "Vanrai Village Resort",
            "rating": [
                4
            ],
            "address": [
                "MIDC-Shendi bypass, near Datta mandir, Vilad Ghat, Wadgaon Gupta, Pimpalgaon Malvi, Maharashtra 414111, India"
            ],
            "reviews": [
                {
                    "text": "Very nice place for friends and family get together also.... All services are very nice.... Waterpark, rides, rooms, food, lawn and all over premises are very good .... Surely visit the place with blind eye....",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Had a very wonderful experience with all friends at Vanrai. A must visit place for all family and friends Get together. The food was awesome and the aura and atmosphere is beautiful.Had a blast.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very very good experience. Water park is amazing. Delicious food. Juices and icecream very good. Staff service is very good. Location is very best and safe for ladies. Rooms are cleaned.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The best resort in Ahmednagar !\nWe celebrated my parents 25th anniversary here . Mr Mhaske the owner , was professional , punctual and made extra efforts so that our event was perfect . The food , ambience and specially the water park was praised by our guests .The contacts suggested by him for decoration , photographer, projector were professional and did their job exceptionally well .\nWe the organisers are grateful for his support throughout and looking forward for hosting another programme here .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We have arranged a get together of whole day for 70 people, they have given excellent veg and non veg food and whole day service to us",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place friends family get together also services nice waterpark rides rooms food lawn premises good surely visit place blind eye",
                "wonderful experience friends vanrai must visit place family friends get together food awesome aura atmosphere beautifulhad blast",
                "good experience water park amazing delicious food juices icecream good staff service good location best safe ladies rooms cleaned",
                "best resort ahmednagar celebrated parents th anniversary mr mhaske owner professional punctual made extra efforts event perfect food ambience specially water park praised guests contacts suggested decoration photographer projector professional job exceptionally well organisers grateful support throughout looking forward hosting another programme",
                "arranged get together whole day people given excellent veg non veg food whole day service us"
            ]
        }
    ]
}