{
    "places_with_reviews": [
        {
            "name": "Bandipur Safari Lodge, By Junglelodges.",
            "rating": [
                4.4
            ],
            "address": [
                "Angala Post, Gundlupet Taluk Chamarajanagar District, Melukamanahalli, Mysuru - Ooty Rd, Gundlepete, Mel Kamanahalli, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "Do you like the forest? Want to go deep into the forest to see animals and birds and enjoy the wildness of the forest? Then you can book here.\n\nYou can travel twice to the forest in your one-day stay. We mostly got to see elephants; how fun it was to see the cubs feeding with their mother; several species of monkeys, peacocks, deer, bison, wildebeests, and wild chickens; and if we were lucky, we got to see tigers. Unfortunately, we didn't get to see the tigers, but another group that was with us got to see the tigers. The stay here is also very enjoyable.\n\nAll the packages include three meals, and the food was very tasty, including both vegetarian and non-vegetarian. The staff are very friendly and helpful; at any time for anything, we call them, and within moments they will come to us🥰\n\nOverall, we had a very enjoyable stay at the Jungle lodges and Resort ♥️",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "My experience at Jungle Lodges in Bandipur was truly memorable. From the moment I arrived, the hospitality was exceptional. The full package they offer, including meals from breakfast to dinner, snacks, and a thrilling safari through the forest, made it a comprehensive and exciting stay.\n\nThe food surpassed my expectations, reminiscent of home-cooked meals that were both delicious and comforting. While the rooms weren't luxurious, they were clean and provided a cozy retreat after a day of adventure.\n\nWhat truly stood out was the staff's friendliness and helpfulness. They went above and beyond to ensure a pleasant stay, always ready with a smile and assistance whenever needed.\n\nThe ambience of the lodge was charming, blending seamlessly with the natural beauty of the surrounding forest. Overall, Jungle Lodges at Bandipur offers a delightful blend of adventure, comfort, and warm hospitality, making it an ideal choice for nature enthusiasts seeking an authentic wildlife experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One of the most memorable trips. We enjoyed the stay, food and safari. The rooms are spacious and clean. They took us for two safaris, one in the evening and another one in the morning. We spotted numerous spotted deer, many peacocks, monkeys, langur, Indian gaur, sloth bear, elephants, many kind of birds, mongoose, one leopard and one tiger. The guide was really good and explained us everything. The food was proper kannada style and tasted good. Will definitely recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Awesome stay. Service is exceptionally amazing. Rooms were cozy and clean, food is delicious all the times and menu is not repetitive in a day. They maintained the schedule as per they mentioned. Safari was also quite interesting yet its all luck in terms of sighting.overall amazing experience and worth every penny. I would hughly recommend to stay and experience their services.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The stay and ambience is amazing!\nThe climb to the hotel is via car/Jeep and that's really fun as it's literally trail climb. The food is really good and you can explore the mountain for 2 days within itself.\nYou get frequent monkeys visiting you and some good view with exotic birds.\nThe management is very helpful and arranges a good vibe-like ambience.\nThere are cute cats in the venue and also Max (old beagle) who are loving and funny.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "like forest want go deep forest see animals birds enjoy wildness forest book travel twice forest oneday stay mostly got see elephants fun see cubs feeding mother several species monkeys peacocks deer bison wildebeests wild chickens lucky got see tigers unfortunately didnt get see tigers another group us got see tigers stay also enjoyable packages include three meals food tasty including vegetarian nonvegetarian staff friendly helpful time anything call within moments come usð\u009f¥° overall enjoyable stay jungle lodges resort â\u0099¥ï¸\u008f",
                "experience jungle lodges bandipur truly memorable moment arrived hospitality exceptional full package offer including meals breakfast dinner snacks thrilling safari forest made comprehensive exciting stay food surpassed expectations reminiscent homecooked meals delicious comforting rooms werent luxurious clean provided cozy retreat day adventure truly stood staffs friendliness helpfulness went beyond ensure pleasant stay always ready smile assistance whenever needed ambience lodge charming blending seamlessly natural beauty surrounding forest overall jungle lodges bandipur offers delightful blend adventure comfort warm hospitality making ideal choice nature enthusiasts seeking authentic wildlife experience",
                "one memorable trips enjoyed stay food safari rooms spacious clean took us two safaris one evening another one morning spotted numerous spotted deer many peacocks monkeys langur indian gaur sloth bear elephants many kind birds mongoose one leopard one tiger guide really good explained us everything food proper kannada style tasted good definitely recommend place",
                "awesome stay service exceptionally amazing rooms cozy clean food delicious times menu repetitive day maintained schedule per mentioned safari also quite interesting yet luck terms sightingoverall amazing experience worth every penny would hughly recommend stay experience services",
                "stay ambience amazing climb hotel via carjeep thats really fun literally trail climb food really good explore mountain days within get frequent monkeys visiting good view exotic birds management helpful arranges good vibelike ambience cute cats venue also max old beagle loving funny"
            ]
        },
        {
            "name": "Country Club Wildlife Resort Bandipur",
            "rating": [
                3.9
            ],
            "address": [
                "Mangala Village, Gundul Pet Taluk, Bandipur, Guruvegowdanhundi, Karnataka 571318, India"
            ],
            "reviews": [
                {
                    "text": "We stayed in elephant bungalow and they were huge, clean and well maintained. The staff is friendly and cooperative. You can see deer and monkey right from your room window. The property is worth the penny. The food is decent. Only drawback is that the pool has no rules, people dive in wearing anything material cloth and the changing room is a disaster.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I stayed at CC Resort from 11-13 April 2024. This resort is a good option if you want to have a quality family time amidst the jungles. The location is remote so you get the full jungle vibe. Deers and Monkeys and swans are in abundance all around. Its an eco resort so the decor is earthy, mobile network is restricted and no AC. This resort might be not a very good option in the summers. With lots of indoors game, a huge pool, a bar and a restaurant its otherwise comfortable. Food just meets the required standard. Staff is not very friendly either.\n\nBut if you are looking for a good jungle safari experience, this resort does not do even the bare minimum.\n\n1. They just stuff you with other tourists, in whatever space available. We were 4 adults and 2 kids, sitting somehow at the last seat of the safari bus.\n\n2. No pick up drop facility from the hotel to the check post is provided. We had to take our car and reach the post. And even there, no parking spot was provided for our car. We had to park it 500 metres away from the Safari Point.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Absolutely dreadful experience! This resort is nothing short of a robbery disguised as a vacation destination. From unwarranted charges to appalling service, they excel in disappointing their guests. Don't make the mistake we did. Avoid at all costs!\n\nThere are lots of good resorts nearby in the main road only, don't make mistakes visiting here like we did.👎👎👎👎",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good location for jungle safari and unique experience.  Away from all pollution and noisy places. Very peaceful and chilling vacation stay. Cab is quite expensive fr hotel.  Suggested to hire personal cab from outside itself. Food is okay in the hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Pros:\nThe resort is in the middle of the reservation. You’ll get to see animals grazing on the property and there are a lot of activities.\n\nCons:\nThe food is sub-par. There’s no AC in any of the rooms on the property as of yet (April 2024).  The rooms have no proper ventilation and they couldn’t provide us with extra pedestal fans. Wouldn’t recommend this property during the summers. The walls of the rooms are cracked due to poor maintenance. Extremely limited channels (only Kannada ones) available on OTT. Room service is not available. WiFi is only available in the reception area.\n\nDefinitely not worth the price being charged.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed elephant bungalow huge clean well maintained staff friendly cooperative see deer monkey right room window property worth penny food decent drawback pool rules people dive wearing anything material cloth changing room disaster",
                "stayed cc resort april resort good option want quality family time amidst jungles location remote get full jungle vibe deers monkeys swans abundance around eco resort decor earthy mobile network restricted ac resort might good option summers lots indoors game huge pool bar restaurant otherwise comfortable food meets required standard staff friendly either looking good jungle safari experience resort even bare minimum stuff tourists whatever space available adults kids sitting somehow last seat safari bus pick drop facility hotel check post provided take car reach post even parking spot provided car park metres away safari point",
                "absolutely dreadful experience resort nothing short robbery disguised vacation destination unwarranted charges appalling service excel disappointing guests dont make mistake avoid costs lots good resorts nearby main road dont make mistakes visiting like didð\u009f\u0091\u008eð\u009f\u0091\u008eð\u009f\u0091\u008eð\u009f\u0091\u008e",
                "good location jungle safari unique experience away pollution noisy places peaceful chilling vacation stay cab quite expensive fr hotel suggested hire personal cab outside food okay hotel",
                "pros resort middle reservation youâ\u0080\u0099ll get see animals grazing property lot activities cons food subpar thereâ\u0080\u0099s ac rooms property yet april rooms proper ventilation couldnâ\u0080\u0099t provide us extra pedestal fans wouldnâ\u0080\u0099t recommend property summers walls rooms cracked due poor maintenance extremely limited channels kannada ones available ott room service available wifi available reception area definitely worth price charged"
            ]
        },
        {
            "name": "The Windflower Tusker Trails",
            "rating": [
                4.2
            ],
            "address": [
                "Mangala Village, Gundalpet, Taluk, Bandipur, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful property in the middle of the jungle. Food is decent taste and they offer a good spread variety wise, the fish fry was good but chicken was just average. Same for Vegetarian food, not much taste. Amenities like swimming pool, some darts, basketball etc. are decent for a one night stay but nothing much to do otherwise. Average value for money considering the charges at 11K a night. Bandipur safari is about 11 KM from here but the animal sightings are usually rare here.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Beautiful resort to give you a true jungle experience, for starters you'll have deers right outside your rooms and the staffs are local people from nearby village, they are very kind hearted and really good in what they do. I had a AC issue at night 12 and I was like no problem sort it out in the morning they were like no sir we'll repair now itself and took 30 minutes at midnight to solve the problem and meanwhile was telling interesting forest stories. The food is decent don't expect something really great, but their service is top class. The amenities like pool and club house was a good timepass. We stayed in Jungle cottage rooms were spacious and open roof bathroom was cool",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "rooms were comfortable,i felt the washroom needs maintenance…it had cob webs and lacked ventilation.\ni paid huge price for the room and\nexpected best but it was lacking in maintenance.\n\nfood spread is limited and tasted ok…breakfast live counter is good\n\nstaff is friendly and provides good service.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This place is inside the Bandipur forest trails. Last 3km of approach road is not good but everything else about this place is just awesome.\n\nThey have an electric vehicle charging option as well. The staff is super sweet and helpful, they ensure that you are having a great time at the resort. Special thanks to Mr. Kartik for assisting and coordinating with the Revolt car charging setup.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's a beautiful property in the middle of the jungle. Quite remote yet connected to nearby attractions. The food was excellent with such a spread & live counters along with dessert options. I loved the Mutton rogan josh & mutton Biriyani the other day. It's a great place to go with your family or group of friends.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful property middle jungle food decent taste offer good spread variety wise fish fry good chicken average vegetarian food much taste amenities like swimming pool darts basketball etc decent one night stay nothing much otherwise average value money considering charges k night bandipur safari km animal sightings usually rare",
                "beautiful resort give true jungle experience starters youll deers right outside rooms staffs local people nearby village kind hearted really good ac issue night like problem sort morning like sir well repair took minutes midnight solve problem meanwhile telling interesting forest stories food decent dont expect something really great service top class amenities like pool club house good timepass stayed jungle cottage rooms spacious open roof bathroom cool",
                "rooms comfortablei felt washroom needs maintenanceâ\u0080¦it cob webs lacked ventilation paid huge price room expected best lacking maintenance food spread limited tasted okâ\u0080¦breakfast live counter good staff friendly provides good service",
                "place inside bandipur forest trails last km approach road good everything else place awesome electric vehicle charging option well staff super sweet helpful ensure great time resort special thanks mr kartik assisting coordinating revolt car charging setup",
                "beautiful property middle jungle quite remote yet connected nearby attractions food excellent spread live counters along dessert options loved mutton rogan josh mutton biriyani day great place go family group friends"
            ]
        },
        {
            "name": "Khans Gufa Resort",
            "rating": [
                3.5
            ],
            "address": [
                "Ooty Road Near Bandipur National Park, NH181, Gundlupete, Mel Kamanahalli, Karnataka 571111, India"
            ],
            "reviews": [
                {
                    "text": "Let me start with the location, this is very near to the place where safari starts so this is the reason this place is so over priced, but there is nothing here, rooms are very small and dirty with full insects, there is no proper service, food is over priced, and complimentary breakfast just sucks. I never ever recommend anyone to visit this place for a joke also.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Very nice place from service and location point of view. The staff is very helpful and the landscape is great. Just a little improvement in maintaining the cleanliness of rooms. Other than that everything is great including food in restaurant.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "I had lunch there and food was decent, not so great. Service was ok. Ambiance was attractive and so is location. It’s very spacious and so have lot of parking space & space for any small activities. I had paneer butter masala with rotis & Gulab Jamun for dessert.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Good food and service.  It's definitely better than the other nearby restaurants in this area. Staff members are courteous and helpful. Food quantities could be better, but the taste of dishes is good. You can also get a parcel and have it at your convenience.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Many rooms are under renovation. Had booked a cottage, did not like the first room asked the reception and they changed to a slightly more renovated room. The room was smelling due to smoking inside the room, they got room freshener and it was ok. Pretty large bathroom it had, but taps were old age.\n\nThey have some birds and a couple of rabbits ... Kids will enjoy this piece.\n\nThere are no indoor games as of now. For kids - a swing is the only option ..others are not working.\n\nThe best part is the swimming pool which is very new and very good and the place is very near to the safari point and on the main road.\n\nBreakfast was only 3 types of dosas.\n\nAla carte food was good and reasonably priced. However for breakfast and ala carte food oil was too much.\n\nTea was prepared fresh and quite good.\n\nOverall seemed a bit costly for the price paid.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "let start location near place safari starts reason place priced nothing rooms small dirty full insects proper service food priced complimentary breakfast sucks never ever recommend anyone visit place joke also",
                "nice place service location point view staff helpful landscape great little improvement maintaining cleanliness rooms everything great including food restaurant",
                "lunch food decent great service ok ambiance attractive location itâ\u0080\u0099s spacious lot parking space space small activities paneer butter masala rotis gulab jamun dessert",
                "good food service definitely better nearby restaurants area staff members courteous helpful food quantities could better taste dishes good also get parcel convenience",
                "many rooms renovation booked cottage like first room asked reception changed slightly renovated room room smelling due smoking inside room got room freshener ok pretty large bathroom taps old age birds couple rabbits kids enjoy piece indoor games kids swing option others working best part swimming pool new good place near safari point main road breakfast types dosas ala carte food good reasonably priced however breakfast ala carte food oil much tea prepared fresh quite good overall seemed bit costly price paid"
            ]
        },
        {
            "name": "MC Resort Bandipura",
            "rating": [
                3.9
            ],
            "address": [
                "Bangalore-Ooty Road, Melukamanahally, Bandipur National Park, Gundlupete, Mel Kamanahalli, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "A great resort to go to. The kind of service you get from staff fulfill all your requirements is good.  The best place for wildlife enthusiastic and family.\nResort is clean and maintained very well. Inside the resort we can see deer, peacock, wild boar, ... varities of birds.\nBandipur National Park is the best Tiger Reserve in India is located here. It's around 880 Sq. Km forested area.  Chances of animal sighting is quite high here, again depending on season.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The location and the surrounding area of the resort is good. Not far from the safari point. Service is laid back in the restaurant. Not many options for meals. Room was average. Seems like the new rooms are better.  Swimming pool is good. Nice place for a morning or evening stroll.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "M C resort is very conveniently located close to the Bandipur Safari gate.\nOverall ambience of the hotel was great and has a positive vibe however the Deluxe rooms are in a very shabby condition, it is worse than a lodge especially the washrooms.\nFood was excellent and enjoyed by all my family members\nTheir staff is very hospitable.\nI also could not understand the insane pricing for Safari (even for small kids). No guide was provided for the Safari and we felt bored after a while.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very poorly maintained and dirty resort\nEven basic things like spoons and glasses were unwashed\nFood was good\nBut everything else including swimming pool was dirty\nThis place is suitable only for bachelors and drunkards.\nThis place is at border of Bandipur national park, but doesn't even have fencing or guard dogs.\nDon't step out of your rooms at night because you are near forest.\nNot at all recommended for family outing",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It was an amazing place to stay in. The dears, monkeys almost get inside the boundary of the hotel. It feels like you are staying inside a forest.\n\nThe food is good and comes complementary with the rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great resort go kind service get staff fulfill requirements good best place wildlife enthusiastic family resort clean maintained well inside resort see deer peacock wild boar varities birds bandipur national park best tiger reserve india located around sq km forested area chances animal sighting quite high depending season",
                "location surrounding area resort good far safari point service laid back restaurant many options meals room average seems like new rooms better swimming pool good nice place morning evening stroll",
                "c resort conveniently located close bandipur safari gate overall ambience hotel great positive vibe however deluxe rooms shabby condition worse lodge especially washrooms food excellent enjoyed family members staff hospitable also could understand insane pricing safari even small kids guide provided safari felt bored",
                "poorly maintained dirty resort even basic things like spoons glasses unwashed food good everything else including swimming pool dirty place suitable bachelors drunkards place border bandipur national park doesnt even fencing guard dogs dont step rooms night near forest recommended family outing",
                "amazing place stay dears monkeys almost get inside boundary hotel feels like staying inside forest food good comes complementary rooms"
            ]
        },
        {
            "name": "Vana Vihar",
            "rating": [
                3.3
            ],
            "address": [
                "Coimbatore - Ooty - Gundlupet Highway, Mel Kamanahalli, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "Not recommended for family. Very bad experience while staying there. They will say you one amount and while you confirm it then they will increase the amount. If you are going there by mid night they will screw you with high prices even for water. They don’t even provide drinking water in the room where all the local hotels give that facilities.\nThe service is also very bad.\nIf you need good food just try to get it from outside there it will be expensive and taste less.\nTry to find another place to stay.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Recent experience was not good with this hotel.\n\nOnly one good things is it very close to bandipur safari point.\n\n1. Rooms are  not cleaned\n2. Restrooms are not maintained and doors didn't closed.\n3. Property not cleaned and waste are dumped infront of the rooms.\n4. Kids Play area was their which is unfit for usage.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Location is good..\nBut room and all very pathetic condition..\nNot at all recomentable..\nNot good for family's.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Location is right next to the safari starting point, especially if you have an early morning booking.\nThe 'resort' looks abandoned, the caretaker didn't really care to have guests. Provided toiletries and switched on the generator for hot water only when insisted. Paid ₹2.2k for the cottage room although they had no other guests when I stayed over a weekend. Would not recommend unless you really don't want to make the 15-min journey to better hotels.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Good for quick stay close to  the high way. Poori an dosa in morning is good.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recommended family bad experience staying say one amount confirm increase amount going mid night screw high prices even water donâ\u0080\u0099t even provide drinking water room local hotels give facilities service also bad need good food try get outside expensive taste less try find another place stay",
                "recent experience good hotel one good things close bandipur safari point rooms cleaned restrooms maintained doors didnt closed property cleaned waste dumped infront rooms kids play area unfit usage",
                "location good room pathetic condition recomentable good familys",
                "location right next safari starting point especially early morning booking resort looks abandoned caretaker didnt really care guests provided toiletries switched generator hot water insisted paid â\u0082¹k cottage room although guests stayed weekend would recommend unless really dont want make min journey better hotels",
                "good quick stay close high way poori dosa morning good"
            ]
        },
        {
            "name": "Bandipur Jaguar Homestay",
            "rating": [
                4.9
            ],
            "address": [
                "Bandipur National Park Game Track, Bandipur, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "Great location, great value for money but not clean. Not suitable for families since beer bottles were lying all around. They gave us a big room but there were at least 10-15 spiders in our bathroom and the main door was not lockable. They did clean the spiders after we requested. The bed sheets had so much of dust and lizard poop. The food was good and the host was very helpful. They also need to dispose their waste properly since they are inside the forest.  We could see deers and mongoose eating the plastic and other waste. If they keep the property clean, it would be one of best in bandipur.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The place is in the midst of bandipur tiger reserve with a friendly staff and even owners will be there to assist you all time. The place is silent and there is a lucky chance of animal sightings anytime day or night. The place has spacious rooms with tv and wifi and an attached bathroom with hot water. The place can accommodate big families and small families and depends on availability. Do contact and confirm the status availability of rooms in advance. They serve veg and non-veg dishes included in the stay and any additional dishes will be charged upon availability.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best place to stay in bandipur. Food is amazing . Better than home food. Great people and service",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We group of 10 visited. Fou couples plus son n daughter of one friend. Excellent place. Excellent food, nice climate, safety also. Mr Sharma arranged nice food,\nchiken,pakoda,rice,chapati. Nothing was wrong in picnic.. We will visit once again. Thanks Mr  Vynktesh sharmaji. He arranged jungle safari also. Nice experience. Great salute from us.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best gateway from the city  , This is a great place to relax in the midst of forest 👌",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great location great value money clean suitable families since beer bottles lying around gave us big room least spiders bathroom main door lockable clean spiders requested bed sheets much dust lizard poop food good host helpful also need dispose waste properly since inside forest could see deers mongoose eating plastic waste keep property clean would one best bandipur",
                "place midst bandipur tiger reserve friendly staff even owners assist time place silent lucky chance animal sightings anytime day night place spacious rooms tv wifi attached bathroom hot water place accommodate big families small families depends availability contact confirm status availability rooms advance serve veg nonveg dishes included stay additional dishes charged upon availability",
                "best place stay bandipur food amazing better home food great people service",
                "group visited fou couples plus son n daughter one friend excellent place excellent food nice climate safety also mr sharma arranged nice food chikenpakodaricechapati nothing wrong picnic visit thanks mr vynktesh sharmaji arranged jungle safari also nice experience great salute us",
                "best gateway city great place relax midst forest ð\u009f\u0091\u008c"
            ]
        },
        {
            "name": "Sampala Resort Masinagudi",
            "rating": [
                4.5
            ],
            "address": [
                "Masinagudi Road, Near Basketball Ground, Mavenalla, JJP9+MXH, Karnataka 643223, India"
            ],
            "reviews": [
                {
                    "text": "I have Stayed with my friends at this resort for two days. Since there are 4 Rooms in this resort all are clean and tidy.Swimming pool was good. Staffs are very friendly & they served well for us. Really enjoyed my holidays. Food will be provided  both veg & non-veg with   good taste. Overall had a wonderful stay.\nActivities were Cricket , Volley ball , Safari and Fire Camp",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I had been here along with my team from office two days back and was delighted with the experience ....\n\nRooms are clean and well maintained, the place pretty big and has a lovely view of the mountain ranges.\n\nThe small pool to play amidst nature adds to the experience! And the campfire ... Music with lovely view of the hills covered by hills\n\nBest thing was the amazing customer service provided by them and especially by Prabhakar who was our caretaker !\n\nIt was worth the money paid for sure ...Which was quite economical ...",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We had a pleasant stay at Sampala Resort at the end of May 2018. It was an excellent place with Scenic View. Room was neat and comfortable. Mini swimming pool is an added jewel. Mr.Calvin who is a caretaker guided us and helped us during our entire stay. Food was fabulous and had a homely touch. Thanks to Mrs. Calvin. On the whole our trip and stay at Sampala was memorable. Many Thanks to the owner Mr.Arun.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It was really a pleasant stay. Prabhakar(One of staff who maintains resort) was really friendly and nice. On top of everything was the food he prepared was just awesome. Food is really delicious(Veg and Non veg both). Since Swimming Pool was under maintenance, couldn't enter into it. Very less activities inside resort, nevertheless, you would never want to stay and start playing games, its definitely a place to feel the nature and breeze and greenery under your feet. I would strongly suggest for Nature lovers. Had fun.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Went there last Thursday with my family. The atmosphere is so pleasant. Recommended for people who likes silence and nature since it's so greenish. The food is the best. No regrets in paying for the stay. They have a pool too. I appreciate the fact that they cleaned and maintained it very well",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed friends resort two days since rooms resort clean tidyswimming pool good staffs friendly served well us really enjoyed holidays food provided veg nonveg good taste overall wonderful stay activities cricket volley ball safari fire camp",
                "along team office two days back delighted experience rooms clean well maintained place pretty big lovely view mountain ranges small pool play amidst nature adds experience campfire music lovely view hills covered hills best thing amazing customer service provided especially prabhakar caretaker worth money paid sure quite economical",
                "pleasant stay sampala resort end may excellent place scenic view room neat comfortable mini swimming pool added jewel mrcalvin caretaker guided us helped us entire stay food fabulous homely touch thanks mrs calvin whole trip stay sampala memorable many thanks owner mrarun",
                "really pleasant stay prabhakarone staff maintains resort really friendly nice top everything food prepared awesome food really deliciousveg non veg since swimming pool maintenance couldnt enter less activities inside resort nevertheless would never want stay start playing games definitely place feel nature breeze greenery feet would strongly suggest nature lovers fun",
                "went last thursday family atmosphere pleasant recommended people likes silence nature since greenish food best regrets paying stay pool appreciate fact cleaned maintained well"
            ]
        },
        {
            "name": "The Bandipur Cottage",
            "rating": [
                4.5
            ],
            "address": [
                "JMX5+J8H, Guruvegowdanhundi, Karnataka 571126, India"
            ],
            "reviews": [
                {
                    "text": "It's quite an old property of famous wildlife photographer Shahzung's. Host is very cooperative and hospitality is very good! Location is very close to Bandipur forest. Need to work on the rooms maintenance. Especially when you have a renowned resort in Kabini \"The Bison\", you should match the reputation for \"The bandipur cottage\" as well. All the taps are so old that water doesn't flow properly. Washroom tub needs to be cleaned properly. If you can take care of these small things I guess it's one of the best property in Bandipur 😊",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "But for the service, I would have rated lower. Please read on for details.\n\nWhat's good:\n* Service: The staff at the cottage is excellent. They are always willing to go an extra mile to arrange something you ask for.\n* Food: Food was tasty. The proposed menu for the next meal was told to us in advance and we could ask for customization. The spice level was exactly as we asked for.\n* Safety: Given the cottage is in the middle of forest, the attention to safety is comforting. For example, they took a cat and dog to the picnic lunch site for inspection before taking us there.\n\nWhat needs attention:\n* Maintenance: The cottage needs a lot of attention to maintenance. For example, the legs of the dinning chairs were dangling and could cause accident any time. One of the cupboard shutters fell on my daughter (thankfully didn't cause injury). The bed in one of the rooms makes a lot of noise even if you turn a little. Door latches are difficult to use. And the list can go on. Old houses can be charming if maintained well - need a lot of attention to turn this cottage from dilapidated to charming.\n* Cleanliness: General cleanliness of the rooms need large improvement. The bed covers (not the sheets) were very dusty. Cobwebs and spiders keep falling on the bed from the unclean roof. It was my constant job to keep cleaning those.\n* Accessibility: There are steps at odd places making it very hard to move around. One of the kids with us fell and bruised his chin right on entry. The bathing area in the bathrooms is around two feet below the rest of the floor level and is very difficult to get in and out even for young people. The dinning area is at a mezzanine level and steps leading to it are steep without any hand rails. Elderly people may find it hard to move around.\n* Booking process: The booking process was not transparent. We were told that we have the entire cottage to ourselves, but later found in fine print after the booking that we would not have access to the master bedroom. Needed multiple days of back and forth communication to finally get the master bedroom allocated to us as well.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice place to stay away from city\nHospitality at its best\nNice staff, well prepared food.\nBest for nature lovers, who want to see animals in their own habitat",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "You wake up with the sound of deers or monkeys at your backyard. Take a relaxing walk in the bushes or the hills outskirt. Enjoy afternoon reading your favourite book... Fantastic hospitality, great food. Highly recommended for a 3-4 day extended weekend holiday.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It’s a beautiful chalet hidden in the midst of the jungle perfect for a relaxed getaway for the weekend with friends or family. The staff of the cottage are extremely helpful and are at your service at any time. Literally even at 3am! I would highly recommend this place to anyone looking to just lay back and relax.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "quite old property famous wildlife photographer shahzungs host cooperative hospitality good location close bandipur forest need work rooms maintenance especially renowned resort kabini bison match reputation bandipur cottage well taps old water doesnt flow properly washroom tub needs cleaned properly take care small things guess one best property bandipur ð\u009f\u0098\u008a",
                "service would rated lower please read details whats good service staff cottage excellent always willing go extra mile arrange something ask food food tasty proposed menu next meal told us advance could ask customization spice level exactly asked safety given cottage middle forest attention safety comforting example took cat dog picnic lunch site inspection taking us needs attention maintenance cottage needs lot attention maintenance example legs dinning chairs dangling could cause accident time one cupboard shutters fell daughter thankfully didnt cause injury bed one rooms makes lot noise even turn little door latches difficult use list go old houses charming maintained well need lot attention turn cottage dilapidated charming cleanliness general cleanliness rooms need large improvement bed covers sheets dusty cobwebs spiders keep falling bed unclean roof constant job keep cleaning accessibility steps odd places making hard move around one kids us fell bruised chin right entry bathing area bathrooms around two feet rest floor level difficult get even young people dinning area mezzanine level steps leading steep without hand rails elderly people may find hard move around booking process booking process transparent told entire cottage later found fine print booking would access master bedroom needed multiple days back forth communication finally get master bedroom allocated us well",
                "nice place stay away city hospitality best nice staff well prepared food best nature lovers want see animals habitat",
                "wake sound deers monkeys backyard take relaxing walk bushes hills outskirt enjoy afternoon reading favourite book fantastic hospitality great food highly recommended day extended weekend holiday",
                "itâ\u0080\u0099s beautiful chalet hidden midst jungle perfect relaxed getaway weekend friends family staff cottage extremely helpful service time literally even would highly recommend place anyone looking lay back relax"
            ]
        },
        {
            "name": "Sunbreez Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Mel Kamanahalli, Karnataka 571111, India"
            ],
            "reviews": [
                {
                    "text": "We had stayed for a night in the cottage and it was a great experience. Ajith was the caretaker and he was available with each and every need. We were allowed to cook in the kitchen which was icing on top. They provided a to and fro commute for Bandipur safari gate at morning 6 AM which was very helpful. Really nice stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It has been an amazing experience to be at this resort!\nYou will find Turkeys and Emus, thts so fascinating!\nFrom animals to rare plantations of different species, it's a must place to visit with family and friends!\nIt has to be the most fun and jolly time with your loved ones!\nFood is good but the environment is more better.\nDo visit here!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Wonderful stay at this resort. A good experience to stay near the Bandipur forest and safari ride inside the deep forest. Staffs are friendly and we enjoyed the homely atmosphere.\n\nFood was really tasty and the cooking staff cooked what we asked for..I got my favorite raagi muddey and village style chicken curry.\n\nMust visit the resort. Thank you team Sunbreez.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A beautiful place with nature Vibe and  happy environment with great hospitality and service",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is good resort connecting Bandipur forests. Food is not so great especially for Vegetarians as no hygiene is maintained between veg and non-veg.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed night cottage great experience ajith caretaker available every need allowed cook kitchen icing top provided fro commute bandipur safari gate morning helpful really nice stay",
                "amazing experience resort find turkeys emus thts fascinating animals rare plantations different species must place visit family friends fun jolly time loved ones food good environment better visit",
                "wonderful stay resort good experience stay near bandipur forest safari ride inside deep forest staffs friendly enjoyed homely atmosphere food really tasty cooking staff cooked asked fori got favorite raagi muddey village style chicken curry must visit resort thank team sunbreez",
                "beautiful place nature vibe happy environment great hospitality service",
                "good resort connecting bandipur forests food great especially vegetarians hygiene maintained veg nonveg"
            ]
        }
    ]
}