{
    "places_with_reviews": [
        {
            "name": "Hotel Serena",
            "rating": [
                4.1
            ],
            "address": [
                "Raghunathpur, Near B.M High School, B.T Park, Balurghat Dakshin Dinajpur, West Dinajpur, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "It is a very cozy hotel. The staff are very polite and helpful. Breakfast is complimentary.  The food is absolutely light and delicious,  they seem to have everything on menu and not once were my sister and me told that something on menu isn't available.  The geyser is always available. The room had a.c as well as safe fans with lights. Clean and quiet rooms made our work week pleasant as well as relaxed.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Built outside of the town but experince was good. They have good rooms, staffs are well behaved. And even though located in a small place they have included breakfast service with room. Rooms are good and well maintained.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The place needs to be renovated because it clearly had everything but has not been taken care of properly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is at best.\nLuxury Rooms at reasonable Prices and Great Services.\nStaffs are so helpful and well trained and gives you great service.\n\nOverall Value for money and it's worth it.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This hotel is very well, the staff and facilities are well at a  reasonable price.  Restaurant also available, complimentary services available here.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "cozy hotel staff polite helpful breakfast complimentary food absolutely light delicious seem everything menu sister told something menu isnt available geyser always available room ac well safe fans lights clean quiet rooms made work week pleasant well relaxed",
                "built outside town experince good good rooms staffs well behaved even though located small place included breakfast service room rooms good well maintained",
                "place needs renovated clearly everything taken care properly",
                "location best luxury rooms reasonable prices great services staffs helpful well trained gives great service overall value money worth",
                "hotel well staff facilities well reasonable price restaurant also available complimentary services available"
            ]
        },
        {
            "name": "Balurghat Hotel KOKORO Farmhouse",
            "rating": [
                4.8
            ],
            "address": [
                "Dakbanglo Para, near Natyamandir, Chakbhabani, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Nestled amidst the serene countryside, KOKORO Hotel offers a sublime retreat that seamlessly blends the charm of a farmhouse with the comforts of a luxury hotel. From the moment you arrive, you're enveloped in a sense of tranquility and warmth that sets the tone for a truly rejuvenating stay.The rustic yet elegant ambiance of KOKORO Hotel evokes a feeling of being far removed from the hustle and bustle of everyday life. The lush green surroundings, fragrant gardens, and picturesque views create a peaceful sanctuary that invites guests to unwind and reconnect with nature.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I was in Balurghat for work, and I never expected to find such a good hotel in the middle of the city. I am very much impressed by the greenery and the beautiful flower garden here! More importantly, it is inexpensive, and every important office is within walking distance.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "In comparison with any other hotel in Balurghat, I think this hotel has the best location, the best ambiance, and the best services. It caters to the individual needs and requirements of each guest. They provide services designed to meet the needs of all types of guests. As a guest, I enjoyed the hotel's personal touches, such as cooking whatever I wanted. They offered me very home-like meals to me. The rooms were very clean and the beds were very comfortable. It was nice to see decorations in the rooms. KOKORO hotel offered me WiFi, hot water, housekeeping services, and a bicycle for transportation. Located in the city center, the hotel is within walking distance of all educational institutions.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Having stayed at Kokoro Farmhouse, I am confident its ambiance will make you happy. The place is amazing.Here you can heal your mind, especially if you work in a private company. There is a large garden at Kokoro farmhouse with tropical plants, exotic birds, a miniature pond and colorful aquarium fish. For me, this garden is the most attractive place. There isn't much to see or do in Balurghat after work. The purpose of my visit to Balurghat is to monitor the office systems. In general, we are done with our work by 6 p.m. I spent my free time in the Garden of Kokoro Farmhouse after work instead of going anywhere else in Balurghat. The caretaker didi was very nice . As often as I wanted, she served me milk tea. Just sitting in the garden and spending time there made me feel so relaxed. There is no alternative accommodation like this in Balurghat. I have visited this place more than 5 times. Staying at Kokoro Farmhouse will heal your mind and soul. I would recommend this hotel to all business travelers in Balurghat.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very good hotel. Very beautiful , clean and spacious . you can feel home like environment here . The food quality is very good and very hygienic. Wherever I come to Balurghat  for my job I stay at Kokoro farmhouse. I have not found any other hotel like Kokoro farmhouse in Balurghat . You can close your eyes and stay here . You will love the Kokoro farmhouse, I bet .",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nestled amidst serene countryside kokoro hotel offers sublime retreat seamlessly blends charm farmhouse comforts luxury hotel moment arrive youre enveloped sense tranquility warmth sets tone truly rejuvenating staythe rustic yet elegant ambiance kokoro hotel evokes feeling far removed hustle bustle everyday life lush green surroundings fragrant gardens picturesque views create peaceful sanctuary invites guests unwind reconnect nature",
                "balurghat work never expected find good hotel middle city much impressed greenery beautiful flower garden importantly inexpensive every important office within walking distance",
                "comparison hotel balurghat think hotel best location best ambiance best services caters individual needs requirements guest provide services designed meet needs types guests guest enjoyed hotels personal touches cooking whatever wanted offered homelike meals rooms clean beds comfortable nice see decorations rooms kokoro hotel offered wifi hot water housekeeping services bicycle transportation located city center hotel within walking distance educational institutions",
                "stayed kokoro farmhouse confident ambiance make happy place amazinghere heal mind especially work private company large garden kokoro farmhouse tropical plants exotic birds miniature pond colorful aquarium fish garden attractive place isnt much see balurghat work purpose visit balurghat monitor office systems general done work pm spent free time garden kokoro farmhouse work instead going anywhere else balurghat caretaker didi nice often wanted served milk tea sitting garden spending time made feel relaxed alternative accommodation like balurghat visited place times staying kokoro farmhouse heal mind soul would recommend hotel business travelers balurghat",
                "good hotel beautiful clean spacious feel home like environment food quality good hygienic wherever come balurghat job stay kokoro farmhouse found hotel like kokoro farmhouse balurghat close eyes stay love kokoro farmhouse bet"
            ]
        },
        {
            "name": "Jogendra Lodge",
            "rating": [
                3.5
            ],
            "address": [
                "Bus Stand, near Kajal Hotel, Khadimpur, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Palce are good..and all tipe of comunication avilable any time..",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Very nice for rent and longer stay",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Slight inside, not too big",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Bad experience",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "palce goodand tipe comunication avilable time",
                "nice rent longer stay",
                "slight inside big",
                "bad experience",
                "nice"
            ]
        },
        {
            "name": "Lodge Lila",
            "rating": [
                3.9
            ],
            "address": [
                "Kamarpara - Balurghat Rd, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "I stayed here almost about 15 days... service is too good...but food is not up to the mark...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel have good potential but the rooms are small and not complementary breakfast. Need little professionalism to run hotel business. Otherwise staffs are good and decent.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Day to day service drastically changed\nInside room all plug charges are broken even after request no improvement or change.\n\nSome basic features or facilities also not available like fan, Maintenance AC or geyser .\n\nSome time hot water is also not available.\n\nAlways ask full payment before check out where ever 2 days or 3 days.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Choose this hotel for most WORST experience of your life,  The Owner & his staff's are extra ordinary stupid and they running a hotel with fake commitments.\nAC , TV , Charging Points, they all reject your request while you try to switch on them all.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice hotel to stay & one of the best in Balurghat.\nVery nice location.\nNear to both Public & State bus stand.\nCaring staffs & very punctual in service",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed almost days service goodbut food mark",
                "hotel good potential rooms small complementary breakfast need little professionalism run hotel business otherwise staffs good decent",
                "day day service drastically changed inside room plug charges broken even request improvement change basic features facilities also available like fan maintenance ac geyser time hot water also available always ask full payment check ever days days",
                "choose hotel worst experience life owner staffs extra ordinary stupid running hotel fake commitments ac tv charging points reject request try switch",
                "nice hotel stay one best balurghat nice location near public state bus stand caring staffs punctual service"
            ]
        },
        {
            "name": "OYO Hotel Jogindra Lodge",
            "rating": [
                3
            ],
            "address": [
                "Plot - 1A, Block- Balurghat, Street name, College Para Area, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "New Day Night Lodge",
            "rating": [
                3.7
            ],
            "address": [
                "Yubashree More, Kamarpara - Balurghat Rd, near Bus Stand, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Very much lovely atmosphere in all respects",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "To get best affordable room in balurghat you should check this lodge once for sure. Owners of the Lodge are very much cooperative and open to help you out. Always take care of the customers need. I hardly have seen such aggressive, free of cost cooperation from a hotel owner. They win the trust of guest by their behaviour.\n\nThe reason of not giving full point is, the lodge is bit old. And the culture of keeping bust-bin out of the room, creates a messy look outside at evening and stays whole night.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice hotel in balurghat. Among others this is the best hotel as per my experience. Services are good and rooms are very nice with reasonable price.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good location but AC on off rules are very pathetic",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location, low room rent , water suply ,stuff behavior,electric service, room quality is good .\nI have been happy with this all day(19-29 July 2021).\nUltimatly all facility is best.💐💐💐💐👍👍👍👍👍👍",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "much lovely atmosphere respects",
                "get best affordable room balurghat check lodge sure owners lodge much cooperative open help always take care customers need hardly seen aggressive free cost cooperation hotel owner win trust guest behaviour reason giving full point lodge bit old culture keeping bustbin room creates messy look outside evening stays whole night",
                "nice hotel balurghat among others best hotel per experience services good rooms nice reasonable price",
                "good location ac rules pathetic",
                "location low room rent water suply stuff behaviorelectric service room quality good happy day july ultimatly facility bestð\u009f\u0092\u0090ð\u009f\u0092\u0090ð\u009f\u0092\u0090ð\u009f\u0092\u0090ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Atreyee Lodge & Hotel",
            "rating": [
                4
            ],
            "address": [
                "6QHG+9F6, near Railway Reservation counter, Chakbhabani, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "I have no experience to stay here, but as I informed by others and knowing it's location personally I , giving you some information . It's location is very very convenient for whom those who come to Balurghat for official visit . Administrative H.Q. , Police H.Q . District court, SDO office, SBI and other Banks and financial office, College , School ,  Museum, Market all are in walking distance . It is located adjacent to Balurghat Police Station. The Railway station is about 2 K.M. from hear.   You can avail good transport facility from this point .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Zero star stay. Small room without windows. Lots of mosquitoes. Low quality beds and bathroom.  Bedsheets are Not clean at all. Wifi also not free. Don't stay here",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Location is good but Very bad experience.  We checked in at the hotel and entered the room no. 106, but could not find the room clean. They did not provide us soap shampoo, although they promised.  Their service was too bad, number of staff was very low, no one could be found half of the time.  Even the AC remote, dustbin and towel had to be brought from the reception by self. Even  1 day out of 3 days, they did not clean the room, did not empty the dustbin. The flush of the commode did not work properly, sometimes the water did not come and sometimes it did not stop.  There was no latch on the main door of the room, either it had to be kept open or it had to be locked, lock was also a problem.  If you locked it from inside the room, it would not be open, the key would be stuck.  Even the bell switch to call someone for help from the room was damaged or the line was cut.  The night bulb was also damaged. They did not change it even after telling them.  The bathroom was very small, standing inside was difficult to open the door.  And the worst thing was the bed, even if I sat on the bed for a while, it seemed as if it would break immediately and at the same time there are always ugly and annoying sounds.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good Spacious And Cheap Rooms Available here . Quality of food is also up to the standard. Located on a prime spot and services rendered are as good as expectations.\nRecommended for room , food and important location.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good rooms, affordable price, Working AC, Need some maintenance in Bathroom. Overall, Good for family and friends.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience stay informed others knowing location personally giving information location convenient come balurghat official visit administrative hq police hq district court sdo office sbi banks financial office college school museum market walking distance located adjacent balurghat police station railway station km hear avail good transport facility point",
                "zero star stay small room without windows lots mosquitoes low quality beds bathroom bedsheets clean wifi also free dont stay",
                "location good bad experience checked hotel entered room could find room clean provide us soap shampoo although promised service bad number staff low one could found half time even ac remote dustbin towel brought reception self even day days clean room empty dustbin flush commode work properly sometimes water come sometimes stop latch main door room either kept open locked lock also problem locked inside room would open key would stuck even bell switch call someone help room damaged line cut night bulb also damaged change even telling bathroom small standing inside difficult open door worst thing bed even sat bed seemed would break immediately time always ugly annoying sounds",
                "good spacious cheap rooms available quality food also standard located prime spot services rendered good expectations recommended room food important location",
                "good rooms affordable price working ac need maintenance bathroom overall good family friends"
            ]
        },
        {
            "name": "Hotel Horn Bill",
            "rating": [
                3.8
            ],
            "address": [
                "Nepali para, Balurghat Rd, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Nice friendly environment, with big and neat at clean room at affordable rate",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Renovated brand new rooms, new owner, best service in Balurghat",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had a very bad experience staying in this hotel and I must say this is the worst hotel in terms of  cleanliness and hignic,  rats and cockroach you can easily find roming around. And above all, all wash rooms are very very dirty. Don't be surprised if ttey ask you to use bucket 🪣 instead of flush in comode.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Quite place near bus stand, service ok, good rooms at this tariff range, ideal for travelling sales people, food costly though.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Situated at the heart 9f the town\nVery close to the bus stand\nOut side pood ls allowed\nVery cheap starts from a room of Rs 350\n\nLess hygienic\nToilets are not that much clear\nNo wifi",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice friendly environment big neat clean room affordable rate",
                "renovated brand new rooms new owner best service balurghat",
                "bad experience staying hotel must say worst hotel terms cleanliness hignic rats cockroach easily find roming around wash rooms dirty dont surprised ttey ask use bucket ð\u009fª£ instead flush comode",
                "quite place near bus stand service ok good rooms tariff range ideal travelling sales people food costly though",
                "situated heart f town close bus stand side pood ls allowed cheap starts room rs less hygienic toilets much clear wifi"
            ]
        },
        {
            "name": "Hotel Jesmine",
            "rating": [
                3.6
            ],
            "address": [
                "Shuvam Rd, near NBSTC, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Had a very bad experience over there. Staffs were good but the owner need to correct there behaviour. They just didn't provide basic facilities like blanket geyser.. I had to suffer for 2 days without proper water supply in the bathroom that too having a 1 year baby along with me.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "In Balurghat you can't expect a very hi fi Hotel with a very luxurious room and facilities.\nIf we ignore those facilities then it is quite OK to stay.\nQuite a value for Money.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Decent experience...! Not excellent...! But due to the  good behaviour of the staff I liked it!",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very good behaviour of the owner..rooms were good. Water was available. Recommended.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Hotel condition is best. But for order any food like breakfast, dinner is very critical becz they have not any calling bell or calling facility",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience staffs good owner need correct behaviour didnt provide basic facilities like blanket geyser suffer days without proper water supply bathroom year baby along",
                "balurghat cant expect hi fi hotel luxurious room facilities ignore facilities quite ok stay quite value money",
                "decent experience excellent due good behaviour staff liked",
                "good behaviour ownerrooms good water available recommended",
                "hotel condition best order food like breakfast dinner critical becz calling bell calling facility"
            ]
        },
        {
            "name": "Bjp More",
            "rating": [
                3.8
            ],
            "address": [
                "Hili Balurghat Hwy, Mangalpur, Balurghat, West Bengal 733101, India"
            ],
            "reviews": [
                {
                    "text": "Mostly popular place for hangout during evening time and also popular for commercial involvments like Hyndai & Tata showrooms, Auto Garrages and most importantly OFF SHOP is also available there along with some snack/food stalls around..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Swimming pool of balurghat municipality",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Its a very old more of balurghat and as there is an Old BJP office from very beginning so the more is known as BJP more.it is thinly crowded nearby many garages are present.Near to TECHNO INDIA school and THE DAV ATREYEE ENGLISH MEDIUM SCHOOL.its a very proper stop at mongalpur balurghat and is on the way to Balurghat HILI road.the Bangladesh border.......\n\nIts a very old more of balurghat and as there is an Old BJP office from very beginning so the more is known as BJP more.it is thinly crowded nearby many garages are present.Near to TECHNO INDIA school and THE DAV ATREYEE ENGLISH MEDIUM SCHOOL.its a very proper stop at mongalpur balurghat and is on the way to Balurghat HILI road.the Bangladesh border.......",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The name BJP More is a bit misleading. It has no truck with the political party by the same name. At least not any more. It's a non descript place that has a petrol pump, apartments, regular shops, motor garages, and a few schools along the State Highway. Most political parties choose this More (pronounced मोड़ in Hindi. English pronunciation of more is a little awkward though and comes closer to \"garh\" as in Ramgarh, so \"morh\" may be a better option for those foreign to Bengali or Hindi pronunciation of Bengali \"more\") to initiate their processions. This place can be accessed from Hili More as well as Subhas Corner,from North and East respectively.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good oil is given .but its better if they had the premium petrol.place is nice for food and marketing.many shop are  available for marketing here.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mostly popular place hangout evening time also popular commercial involvments like hyndai tata showrooms auto garrages importantly shop also available along snackfood stalls around",
                "swimming pool balurghat municipality",
                "old balurghat old bjp office beginning known bjp moreit thinly crowded nearby many garages presentnear techno india school dav atreyee english medium schoolits proper stop mongalpur balurghat way balurghat hili roadthe bangladesh border old balurghat old bjp office beginning known bjp moreit thinly crowded nearby many garages presentnear techno india school dav atreyee english medium schoolits proper stop mongalpur balurghat way balurghat hili roadthe bangladesh border",
                "name bjp bit misleading truck political party name least non descript place petrol pump apartments regular shops motor garages schools along state highway political parties choose pronounced à¤®à¥\u008bà¤¡à¤¼ hindi english pronunciation little awkward though comes closer garh ramgarh morh may better option foreign bengali hindi pronunciation bengali initiate processions place accessed hili well subhas cornerfrom north east respectively",
                "good oil given better premium petrolplace nice food marketingmany shop available marketing"
            ]
        }
    ]
}