{
    "places_with_reviews": [
        {
            "name": "RG Exclusive Stay & Fine Dine",
            "rating": [
                4.2
            ],
            "address": [
                "Murtizapur Rd, near RAM LATA BUSINESS CENTER, Kirti Nagar, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are very Small.. service is not upto mark..Food is Good .. avoid staying as you will not find value for money",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I came to Akola to celebrate Diwali. I was amazed by the staff's friendliness and smile.\nI felt welcome and the hotel is just perfect. My room was comfortable and clean. Thanks for everything! I will definitely come back soon here!\nDefinitely 5 stars!!!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "\"I regret to say that my recent dining experience at your establishment fell short of expectations. The onion salad tasted that had been stored in a refrigerator for an extended period, and the Pinacolada was surprisingly bitter. The tandoori roti lacked the freshness one would expect, being neither adequately heated nor up to standard.\n\nThe pricing appeared disproportionate to the quality of the dishes served. I believe it's crucial to address these issues promptly to maintain the trust of discerning customers. Constructive feedback is essential for improvement, and I hope my observations contribute to enhancing the overall dining experience for all patrons.\"\nWorst experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Located on Nagpur highway. Easily accessible. Rooms are clean has inhouse restaurant but no bar. Though you can find the bar just 20 steps away (But that's not good one) better to carry your liquor in the room and enjoy with hotel food (which is very delicious)",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's really nice hotel. Neat clean.\nStaff is very cooperative.\nI am always worried for Tarrif.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms small service upto markfood good avoid staying find value money",
                "came akola celebrate diwali amazed staffs friendliness smile felt welcome hotel perfect room comfortable clean thanks everything definitely come back soon definitely stars",
                "regret say recent dining experience establishment fell short expectations onion salad tasted stored refrigerator extended period pinacolada surprisingly bitter tandoori roti lacked freshness one would expect neither adequately heated standard pricing appeared disproportionate quality dishes served believe crucial address issues promptly maintain trust discerning customers constructive feedback essential improvement hope observations contribute enhancing overall dining experience patrons worst experience",
                "located nagpur highway easily accessible rooms clean inhouse restaurant bar though find bar steps away thats good one better carry liquor room enjoy hotel food delicious",
                "really nice hotel neat clean staff cooperative always worried tarrif"
            ]
        },
        {
            "name": "Hotel Shagun",
            "rating": [
                3.7
            ],
            "address": [
                "Jatharpeth Road, near Brahmin Sabha, Jatharpeth, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic experience. Rooms are not at all clean. Stain everywhere in the bathroom, bedsheet, pillows, bed. Rooms are big but bathrooms are not maintained well. Will not recommend this as a hotel stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It's very good hotel to stay with family. It's besically function hall on ground floor and rooms on 2nd floor. Rooms are very spacious and well maintained. They don't have own kitchen but on walking distance u will find lots of restaurants. Very near from bus stand and railway station",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Ok ok service... And room\nIt is not a reshtarant. Its a marriage hall and rooms\nRooms are cleaned and neat",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice hotel but location is not quite suitable",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very comfortable stay big rooms avg price",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic experience rooms clean stain everywhere bathroom bedsheet pillows bed rooms big bathrooms maintained well recommend hotel stay",
                "good hotel stay family besically function hall ground floor rooms nd floor rooms spacious well maintained dont kitchen walking distance u find lots restaurants near bus stand railway station",
                "ok ok service room reshtarant marriage hall rooms rooms cleaned neat",
                "nice hotel location quite suitable",
                "comfortable stay big rooms avg price"
            ]
        },
        {
            "name": "R.S. Exclusive Stay & Fine Dine",
            "rating": [
                4.1
            ],
            "address": [
                "Railway Station Rd, near Shah Hospital, Ramdaspeth, Akola, Maharashtra 444003, India"
            ],
            "reviews": [
                {
                    "text": "Excellent place for business and personal stays! Nice, clean and quite room, good food and comfortable stay, with easily accessible commute places. Loved staying here recently.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Service is too good. Staffs are very gentle and helpful. Atmosphere is too good . Facilities are first class.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Clean hotel with reasonable pricing. Rooms and bathrooms  are well maintained. In room large screen tv with an effecient ac  and staff. They have an in-house restaurant that serves good food and a small bar which is adequate . Honestly did not expect this quality in Akola . I hope they maintain the standards",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Rooms are very neat and good. And the prices are also very affordable",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Bad service experience food come 2 hours later after you order foods bad experience . hotel prices are high not services don't go if you can't wait for 3 to 4 hours for your order.staff is not co-operative wasted of money and time bad experience",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place business personal stays nice clean quite room good food comfortable stay easily accessible commute places loved staying recently",
                "service good staffs gentle helpful atmosphere good facilities first class",
                "clean hotel reasonable pricing rooms bathrooms well maintained room large screen tv effecient ac staff inhouse restaurant serves good food small bar adequate honestly expect quality akola hope maintain standards",
                "rooms neat good prices also affordable",
                "bad service experience food come hours later order foods bad experience hotel prices high services dont go cant wait hours orderstaff cooperative wasted money time bad experience"
            ]
        },
        {
            "name": "VS Imperial",
            "rating": [
                4.3
            ],
            "address": [
                "Old Balapur Rd, Ayodhya Nagar, Akola, Sukapur, Maharashtra 444002, India"
            ],
            "reviews": [
                {
                    "text": "Excellent place to visit. Best suitable for wedding family function. Management is good staff cooperative ambience nice.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Newly built property for funtions like engagement wedding parties and other events in the akola city connected to highway easy to travel and have ample of parking 🅿️",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It is a very lavish banquet hall located at old balapur road near akola.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "There may be many fake reviews here.\nBut honest one i will tell.\nHotel is good.\nService is fine even after pressurising.\nFor small event they charge you very high amount.\nThen after the event they will give you random charges even after quoting the final prices.\nManager behaviour is worst, seen many international hotels but never seen such behaviour.\nCleaning is also not up to mark",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Had booked this place for our wedding. The hotel is very very good newly built gives very posh look when you enter the lobby . The rooms and very spacious can fit 4 people easily. The halls are huge for hosting function of 200 people on floating basis . It also has a lawn outside for performing functions . Overall good hotel for performing wedding ceremony.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place visit best suitable wedding family function management good staff cooperative ambience nice",
                "newly built property funtions like engagement wedding parties events akola city connected highway easy travel ample parking ð\u009f ¿ï¸\u008f",
                "lavish banquet hall located old balapur road near akola",
                "may many fake reviews honest one tell hotel good service fine even pressurising small event charge high amount event give random charges even quoting final prices manager behaviour worst seen many international hotels never seen behaviour cleaning also mark",
                "booked place wedding hotel good newly built gives posh look enter lobby rooms spacious fit people easily halls huge hosting function people floating basis also lawn outside performing functions overall good hotel performing wedding ceremony"
            ]
        },
        {
            "name": "Hotel Center Plaza",
            "rating": [
                3.8
            ],
            "address": [
                "Hotel Center Plaza, Kedia Plot, Holly Cross Convent Road, Ranpise Nagar, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Build in well location but looking to function halls it is sufficient for Birthday parties,  reception and any other function which is for one day.  Now go to the menu it's all over good but somewhere some people feel it tasty some people expectation will not come too much, it all matter to taste everyone has its own expectation about it. Well consider to hall's they are not too much spacious but function like Birthdays, reception and small function is good for it.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "GREAT PLACE WITH GREAT FACILITIES LIKE BANQUET HALL, CONFERENCE ROOMS, PARTY HALL AND, COZY ROOMS , OPEN AIR LOUNGE , WITH ADDED ADVANTAGE OF BEING AT HEART OF CITY!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice food, service and hospitality\nGood place to visit and stay",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good banqet hall, nice catering service.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Reception people not good...room service not good... Over all very pathetic services",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "build well location looking function halls sufficient birthday parties reception function one day go menu good somewhere people feel tasty people expectation come much matter taste everyone expectation well consider halls much spacious function like birthdays reception small function good",
                "great place great facilities like banquet hall conference rooms party hall cozy rooms open air lounge added advantage heart city",
                "nice food service hospitality good place visit stay",
                "good banqet hall nice catering service",
                "reception people goodroom service good pathetic services"
            ]
        },
        {
            "name": "Hotel Jasnagra",
            "rating": [
                3.8
            ],
            "address": [
                "Gaddam Plot Rd, Ramdaspeth, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Food is good, but In akola people are not professional. Everyone was pretending like, that's my city and your outsider. It means when you get this kind of feelings so you won't come next time. Our mumbai is best. Feel comfortable and relax.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel is good but costly. Food is very high rated. Staff is good. Quit place. Professional hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good location. Good service and good food. Friendly staff.\nThat said, ancient noisy lift needs replacement.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good rooms in Akola. Food is good but on the expensive side. Service is also good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Owner of the hotel is very friendly and courteous.That is really great experience",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food good akola people professional everyone pretending like thats city outsider means get kind feelings wont come next time mumbai best feel comfortable relax",
                "hotel good costly food high rated staff good quit place professional hotel",
                "good location good service good food friendly staff said ancient noisy lift needs replacement",
                "good rooms akola food good expensive side service also good",
                "owner hotel friendly courteousthat really great experience"
            ]
        },
        {
            "name": "Ranjeet Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "Station Road, behind New Bus Stand, New Radhakisan Plots, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Had a bad experience, was asked to shift the room to other one in afternoon due to some plumbing work. There was lot of noice due to renovation work in hotel.\nRenovation cannot be done at the cost of guest's comfort. Better not to take booking during renovation.\nRest waiters and service staff were very good and cooperative",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was a good experience  , actually .  It's like an out of city hotel 🏨 and staff  are  well behaved , and. The rooms were good ,but   that hall  wasn't good enough 😕.   But 4 out of 5 stars coz of other facilities and staff members.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good Breakfast....Lovely Ambeiance....Grt Food...Quality and Quantity ..both are good",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We were here for dinner ... Food was good ambience is cozy and a small set up but quiet\nNaan were small compared but sabzi are tasty",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food was delicious.... Comfortable seating area.. Must visit and try veg maratha sabji there 😋",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience asked shift room one afternoon due plumbing work lot noice due renovation work hotel renovation done cost guests comfort better take booking renovation rest waiters service staff good cooperative",
                "good experience actually like city hotel ð\u009f\u008f¨ staff well behaved rooms good hall wasnt good enough ð\u009f\u0098\u0095 stars coz facilities staff members",
                "good breakfastlovely ambeiancegrt foodquality quantity good",
                "dinner food good ambience cozy small set quiet naan small compared sabzi tasty",
                "food delicious comfortable seating area must visit try veg maratha sabji ð\u009f\u0098\u008b"
            ]
        },
        {
            "name": "Hotel Vaibhav",
            "rating": [
                3.7
            ],
            "address": [
                "Gorakshan Rd, Near Old Income Tax Sqaure, Aadarsh Colony, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "They have improved and evolved themselves with the time with great taste. Best sweets in Town ... Kaju katli and Rasmalai will never disappoint you",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I had an excellent experience hearing about that school, in future I will be taking admission of my daughter in that......",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Basically this place is ancient and has always been hotspot. Also they have recently developed few more floors. Speaking about food, they are everyone favourite in area for fresh and spicy. And for Sweets they have decent number of fresh milk sweets.i would  Definitely recommend this place for snacks. Also they have recently opened Sandwich stall which is really Awesome (bit expensive as compared to local) but seems worth it.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good place for sweets and snacks",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "One of the leading breakfast food production in akola,  shegaon kachori is very tasty and cheap",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "improved evolved time great taste best sweets town kaju katli rasmalai never disappoint",
                "excellent experience hearing school future taking admission daughter",
                "basically place ancient always hotspot also recently developed floors speaking food everyone favourite area fresh spicy sweets decent number fresh milk sweetsi would definitely recommend place snacks also recently opened sandwich stall really awesome bit expensive compared local seems worth",
                "good place sweets snacks",
                "one leading breakfast food production akola shegaon kachori tasty cheap"
            ]
        },
        {
            "name": "Hotel Greenland Cottages",
            "rating": [
                3.9
            ],
            "address": [
                "Vidya Nagar, Behind Big Cinemas, Murtizapur Road, NH6, Kirti Nagar, Akola, Maharashtra 444004, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful place at nice location.warm welcome by all staff.delicious food ,grt hospitality.kindly take care of all kind of people....in all experience is good .",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It was really wonderful experience, food and arrangement were superb and everything was well managed for our event...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Thanks Vintage Vibes and pankaj sir & muzzamal sir great experience on the occasion of our marriage anniversary",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good rooms, very spacious\nRoom service can improve",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It was really amazing to share 5 days with the green land cottage management specially the owner of this beautiful and huge hotel Mr maadhur Bhai Alimchandani.\nThis hotel has its own beauty,it is constructed with the old mindset of cottages,attached with the 4 floor hotel building.\nA fantastic place in between for open sitting dine with the bar attached named Alco.\nStaffs are very supportive and quick in their service's,we even had our program of jewellers meet with 100 people's from Akola in their HEART MEETING HALL which is a big A/c hall a part of green land cottage for engagements, get-together,marriages, birthday party's etc with extra buffet area.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful place nice locationwarm welcome staffdelicious food grt hospitalitykindly take care kind peoplein experience good",
                "really wonderful experience food arrangement superb everything well managed event",
                "thanks vintage vibes pankaj sir muzzamal sir great experience occasion marriage anniversary",
                "good rooms spacious room service improve",
                "really amazing share days green land cottage management specially owner beautiful huge hotel mr maadhur bhai alimchandani hotel beautyit constructed old mindset cottagesattached floor hotel building fantastic place open sitting dine bar attached named alco staffs supportive quick serviceswe even program jewellers meet peoples akola heart meeting hall big ac hall part green land cottage engagements gettogethermarriages birthday partys etc extra buffet area"
            ]
        },
        {
            "name": "Hotel Venus International",
            "rating": [
                3.7
            ],
            "address": [
                "Rukmani Nagar, near Bus Stand, New Radhakisan Plots, Akola, Maharashtra 444001, India"
            ],
            "reviews": [
                {
                    "text": "Not suitable at all for families. The beds were not clean, toilets were horribly unclean. I wonder how makemytrip lists this hotel. The hot water is only supplied between 6am - 11am. Wouldn’t recommended to anyone",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Horrible place. Staff is willing to serve but management is not supportive. Excess price for horrible rooms. Lift stinking,Gutka spits all around. Bed linen dirty. Stained pillows. Peeling paint. Worst bathroom. Overall greedy owner looting ignorant by posting nice photos and claiming 3:star self rating.no hot water in bathroom,no drinking water in rooms,no tea kit or electric kettle.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Extremely bad service, waited an hour before got served anything and the taste was ridiculous. Veg crispy was just bhajiya full of ajwain. They cannot manage a restaurant, the waiters are also very laid back about everything and forget to bring stuff. Do not recommend at all.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Worst hotel ever checked in ........ They don't give room service  ... I ask for bottel 3 time then they delivered ask for tea 3 time they not even served worst hotel worst service",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The term international is probably because there are no water spray in bathrooms.no paper either. Rooms are poorly maintained.\nBroken latch in bathroom. Stains on wall and bed. Spider webs behind furniture, window glasses not cleaned in a while. Loud music from party plot behind.Bedsheet did not cover complete matress. Suspicious behaviour from staff not welcoming at all.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "suitable families beds clean toilets horribly unclean wonder makemytrip lists hotel hot water supplied wouldnâ\u0080\u0099t recommended anyone",
                "horrible place staff willing serve management supportive excess price horrible rooms lift stinkinggutka spits around bed linen dirty stained pillows peeling paint worst bathroom overall greedy owner looting ignorant posting nice photos claiming star self ratingno hot water bathroomno drinking water roomsno tea kit electric kettle",
                "extremely bad service waited hour got served anything taste ridiculous veg crispy bhajiya full ajwain manage restaurant waiters also laid back everything forget bring stuff recommend",
                "worst hotel ever checked dont give room service ask bottel time delivered ask tea time even served worst hotel worst service",
                "term international probably water spray bathroomsno paper either rooms poorly maintained broken latch bathroom stains wall bed spider webs behind furniture window glasses cleaned loud music party plot behindbedsheet cover complete matress suspicious behaviour staff welcoming"
            ]
        }
    ]
}