{
    "places_with_reviews": [
        {
            "name": "Emerald Isle | Heritage Resort/ Alleppey",
            "rating": [
                4.7
            ],
            "address": [
                "Kanjooparambil-Manimalathara, Chathurthyakary Post, near Nedumudy, Alappuzha, Kuttanad Taluk, Kerala 688502, India"
            ],
            "reviews": [
                {
                    "text": "This small hotel with 150 years of history really is a special place. The house is beautiful and has that certain something, there is a lot to see in the garden, we had an interesting tour and the location between the canal and the rice fields is ideal. The food was the best we have eaten in Kerala, fresh, flavoursome, with the spiciness tailored to the needs of the guests, really delicious. As there are only 7 rooms, the interaction with the guests is much more personal, extremely attentive and friendly. We also found the interaction with the other guests to be pleasant and enriching. Really a pitty that we were only there for one night!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I had the best days of my vacation in this homestay. The property is so beautiful, clean and well maintained. The surroundings are peaceful and stunning. Don't miss to cycle around, meet friendly people and see how the locals live. The staff goes above and beyond to make your stay feel special and meet your needs, they are lovely people. Also great massages and backwater tours are organized. Last but not least, the food is fresh and delicious. Don't think twice, do yourself a favor and go there!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Fantastic experience here. U absolutely loved the ambience here. The manner in which the place brings out the culture and tradition of Kerala is worth commenting. It is subtle but brilliantly designed. The rooms the furniture and the house itself is truly reminiscent of the history and culture of Kerala. You have access to this homestay both by water and road. The view from here is breathtaking and an absolute must visit   the service of the staff is also good. It is a very calm and serene place",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Genuinely, without exaggerating - this is one of the most wonderful hosting experience I have had in my life. I fell badly sick during my trip here - but Vijo, the owner/manager walked more than a mile to make sure that I was taken care of- from getting me meds to booking doctor appointments etc and all with a smile on his face. Warm and considerate people. Refreshing, really.\n\nThe property, in itself is beautiful. Lush green with fishing ponds with an amazing view of the backwaters.\n\nAccessibility isn't an issue as they provide a cab service for a reasonable price as well.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Beautiful converted farmhouse with a lovely family history which is explained on arrival by the friendly and helpful host alongside a refreshing welcome drink of passion fruit !\n\nThe room was big and spotless with a wonderful bathroom comprising of an inside and outside shower !\nThey had a kettle and clean drinking water available for the length of our stay.\nThe beds were very comfortable and the aircon and fan kept us nice and cool !\n\nThe food as plentiful and delicious. With fruit and traditional Indian style breakfast available and more European omelettes/ toast. Lunch was also brilliant, with local fish being served along side 3 different curries, rice, poppadoms and dessert !\n\nThe activities really stood out with everything from massages to bike tours on offer.\nThe evening tour, along the canals to the rice paddies to watch the sunset was a real highlight as well as a 3h boat tour. But makes sure you find time to explore the beautiful surroundings of the property itself !!\n\nThe host was so kind and really helped us make the most of our stay. Communicating with us clearly on WhatsApp, helping us organise activities and our taxi onwards.\n\nWould highly recommend !",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "small hotel years history really special place house beautiful certain something lot see garden interesting tour location canal rice fields ideal food best eaten kerala fresh flavoursome spiciness tailored needs guests really delicious rooms interaction guests much personal extremely attentive friendly also found interaction guests pleasant enriching really pitty one night",
                "best days vacation homestay property beautiful clean well maintained surroundings peaceful stunning dont miss cycle around meet friendly people see locals live staff goes beyond make stay feel special meet needs lovely people also great massages backwater tours organized last least food fresh delicious dont think twice favor go",
                "fantastic experience u absolutely loved ambience manner place brings culture tradition kerala worth commenting subtle brilliantly designed rooms furniture house truly reminiscent history culture kerala access homestay water road view breathtaking absolute must visit service staff also good calm serene place",
                "genuinely without exaggerating one wonderful hosting experience life fell badly sick trip vijo ownermanager walked mile make sure taken care getting meds booking doctor appointments etc smile face warm considerate people refreshing really property beautiful lush green fishing ponds amazing view backwaters accessibility isnt issue provide cab service reasonable price well",
                "beautiful converted farmhouse lovely family history explained arrival friendly helpful host alongside refreshing welcome drink passion fruit room big spotless wonderful bathroom comprising inside outside shower kettle clean drinking water available length stay beds comfortable aircon fan kept us nice cool food plentiful delicious fruit traditional indian style breakfast available european omelettes toast lunch also brilliant local fish served along side different curries rice poppadoms dessert activities really stood everything massages bike tours offer evening tour along canals rice paddies watch sunset real highlight well h boat tour makes sure find time explore beautiful surroundings property host kind really helped us make stay communicating us clearly whatsapp helping us organise activities taxi onwards would highly recommend"
            ]
        },
        {
            "name": "THE PAMBA HERITAGE VILLA",
            "rating": [
                4.5
            ],
            "address": [
                "Kanjooparambil Umbukadu, Nedumudy, Kerala 688502, India"
            ],
            "reviews": [
                {
                    "text": "We booked a room at the Pamba Heritage Villa for 2 of my friends. From giving good food to arranging cab for my friends to go around Mr. Rajeev was very efficient and helpful. In addition, we had also booked a houseboating at the same time for the 8 of us, which also included foreign nationals, and it was a wonderful experience. Rajeev was very professional and courteous.\nToday, I have made my second booking at the Pamba Heritage Villa, a room for my Dutch friends and a houseboating trip. I would definitely recommend this place as the experience and the service are worth every penny.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Peaceful, well maintained heritage house. The host and staff are very friendly and helpful. The day we arrived we had one of the best sunsets (attached video). The cooked good home food, they also arranged for a shikara ride.\nI would highly recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Location is little away from the main road, last 0.5 kms not so wide road to reach the property. Other than this, everything was excellent, resort ambience, nice AC well maintained rooms, food, service and stay. You have the beautiful view of the backwaters from the property, it flows right by the side of this resort",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Our stay was superb....we had 4 families together with children. The host Rajeev was so friendly and generous with his time. Nothing was too hard to organise given his local knowledge and contacts. The house keeping staff were so friendly and the food was absolutely delicious. Having the river in front was a beautiful experience and even though it was monsoon season it was never an inconvenience for us. We did a boat trip organised by Rajeev which was great. Although it did break down in between which added to the excitement!  The approach road is a bit narrow but can be negotiated by good drivers. Our Tempo van had to.stop about 100.meters before but Rajeev organised a vehicle to help those unable to walk that distance and even had the house keeping staff transport our luggage. On the whole a great experience and would highly recommend this for families wanting to spend quality time together",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Amazing experience.  It was time well spent   by the river.\n\nCouldn't ask for a better way to meet an old friend.. Rajeev. Thank you for hosting us and taking care of our every requirement.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked room pamba heritage villa friends giving good food arranging cab friends go around mr rajeev efficient helpful addition also booked houseboating time us also included foreign nationals wonderful experience rajeev professional courteous today made second booking pamba heritage villa room dutch friends houseboating trip would definitely recommend place experience service worth every penny",
                "peaceful well maintained heritage house host staff friendly helpful day arrived one best sunsets attached video cooked good home food also arranged shikara ride would highly recommend",
                "location little away main road last kms wide road reach property everything excellent resort ambience nice ac well maintained rooms food service stay beautiful view backwaters property flows right side resort",
                "stay superbwe families together children host rajeev friendly generous time nothing hard organise given local knowledge contacts house keeping staff friendly food absolutely delicious river front beautiful experience even though monsoon season never inconvenience us boat trip organised rajeev great although break added excitement approach road bit narrow negotiated good drivers tempo van tostop meters rajeev organised vehicle help unable walk distance even house keeping staff transport luggage whole great experience would highly recommend families wanting spend quality time together",
                "amazing experience time well spent river couldnt ask better way meet old friend rajeev thank hosting us taking care every requirement"
            ]
        },
        {
            "name": "Avees River Gardens",
            "rating": [
                4
            ],
            "address": [
                "Punnakkunnam-Pulincunnoo Road, Alappuzha, Kuttanad Taluk, Kerala 688504, India"
            ],
            "reviews": [
                {
                    "text": "An excellent place to relax. Hand drawn winch over the river is an experience by itself. The service was excellent. Time can be spent just sitting by the river ....",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I feel the place is little bit costly.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice location. A bit more parking space would have been ideal",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Calm serene resort with lake view to one of its side and paddy fields to another .ponds with fishes are anothet attraction to the site. Courteous staff and great food made our stay worth memorable. Thanks to management team there for the best of class services",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great location..  boatway water channel on one side and  overlooking water logged fields on the other side filled with lotus and lilly plants.. absolutely fantastic local food made to order.. decent sized room with heritage rooms giving one a feel of traditional Kerala.. value for money..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place relax hand drawn winch river experience service excellent time spent sitting river",
                "feel place little bit costly",
                "nice location bit parking space would ideal",
                "calm serene resort lake view one side paddy fields another ponds fishes anothet attraction site courteous staff great food made stay worth memorable thanks management team best class services",
                "great location boatway water channel one side overlooking water logged fields side filled lotus lilly plants absolutely fantastic local food made order decent sized room heritage rooms giving one feel traditional kerala value money"
            ]
        },
        {
            "name": "Waters Edge Villas Kerala",
            "rating": [
                4.4
            ],
            "address": [
                "P.O I-235 B, Ponga, Nedumudy, Kerala 688503, India"
            ],
            "reviews": [
                {
                    "text": "Our family stayed here for 2 weeks in March / April and had nothing but a phenomenal time. Booked with Manoj and he connected me with his uncle Ramachandran Nair. Uncle went above and beyond to make sure we had a great stay. The Chef made us amazing food each day, catered to each of our requests and done it without any hesitation. He was so good with our kids and made them Poori and Chicken curry each time our lil one requested it. Mini chechi was the sweetest person to take care of our Villa, do our laundry and took care of all of our requests. Manoj's mom even took the time to come out and spend time there to ensure all of our needs were met. They've arranged a houseboat for us which picked us up right from the resort and had a great time on there as well. On our last day the family made a traditional Kerala meal for us and served on Banana Leaf! We couldn't be happier with their service, gesture and care. I'd strongly recommend Water's Edge Villa!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The stay there was soo excellent... The pool is well maintained. Better to take the villa with 5 bedrooms, all together for a family get-together. The food was awesome, the hospitality was awesome and the location is also awesome.... Only problem was that the pool is overdosed with chlorine, better not to wear dark shade dresses, it will be faded",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "As the name suggests the Villa is on the edge of back waters. Scenic and Spacious.  I stayed in this property for 5 days & 4 nights in October 2022 with my Wife & 2 Children (aged 7 yrs & 4 yrs). Mr. Nair the key care taker of the property takes charge of the guest and ensures that all needs of the guests are taken care. The food is catered in house and is made to taste. If you love Kerala food then you will relish the food served. The view from the resort is breathtaking. You will witness houseboats moving around the adjacent river 24x7.  Kids thoroughly enjoyed the swimming pool.\n\nPoints to consider while staying at this property:\n\n- Being close to the Boat Jetty it gets a bit noisy with motor boats running round the clock.\n- Parking is in a private property and on the other side of the river.\n- One needs to cross a walking bridge to get to the resort. About 150-300 meters from parking.\n\nOverall a beautiful and enjoyable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good place for having a mini get-together. Has around 11 rooms distributed in 3 villas, has a pool and nice ambience. The kayal is by the side of the location & there is a house boat pickup spot interior to the premises where they can pick up if u confirm the same prior. They will arrange all nicely cooked foods at prior confirmations. The only thing u find difficult is heavy chlorine content in the pool water which causes heavy irritation for eyes. Do carry the swim goggles to avoid the same. Rooms are quite ok too. Staff are cordial & will help u with ur requirements. Good and recommended place.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good place and very polite and helpful staff. Only problem was the pool tiles broke off the night before we checked in. So couldn't use the pool. Breakfast and dinner which was provided was also very good. But currently the roads are under construction, so we were deviated through small narrow roads. Cars with low ground clearance will have issues.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "family stayed weeks march april nothing phenomenal time booked manoj connected uncle ramachandran nair uncle went beyond make sure great stay chef made us amazing food day catered requests done without hesitation good kids made poori chicken curry time lil one requested mini chechi sweetest person take care villa laundry took care requests manojs mom even took time come spend time ensure needs met theyve arranged houseboat us picked us right resort great time well last day family made traditional kerala meal us served banana leaf couldnt happier service gesture care id strongly recommend waters edge villa",
                "stay soo excellent pool well maintained better take villa bedrooms together family gettogether food awesome hospitality awesome location also awesome problem pool overdosed chlorine better wear dark shade dresses faded",
                "name suggests villa edge back waters scenic spacious stayed property days nights october wife children aged yrs yrs mr nair key care taker property takes charge guest ensures needs guests taken care food catered house made taste love kerala food relish food served view resort breathtaking witness houseboats moving around adjacent river x kids thoroughly enjoyed swimming pool points consider staying property close boat jetty gets bit noisy motor boats running round clock parking private property side river one needs cross walking bridge get resort meters parking overall beautiful enjoyable stay",
                "good place mini gettogether around rooms distributed villas pool nice ambience kayal side location house boat pickup spot interior premises pick u confirm prior arrange nicely cooked foods prior confirmations thing u find difficult heavy chlorine content pool water causes heavy irritation eyes carry swim goggles avoid rooms quite ok staff cordial help u ur requirements good recommended place",
                "good place polite helpful staff problem pool tiles broke night checked couldnt use pool breakfast dinner provided also good currently roads construction deviated small narrow roads cars low ground clearance issues"
            ]
        },
        {
            "name": "Backwater resort",
            "rating": [
                4.4
            ],
            "address": [
                "Champakulam ,Chennamkary, F95W+HWP, Alappuzha, Kainakary South, Kerala 688501, India"
            ],
            "reviews": [
                {
                    "text": "Super Great Accommodation from check in to check out everything was great they were above and beyond keep it up I highly recommended if you travel on this side choose this place please",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The resort is very good and traditional,their hospitality is very good.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Frankly speaking, this was the worst home stay i ever had in my life. The food was so horrible. The most important thing to please a human is his food and in this place it was so pathetic.Some of the food tasted as if they brought it from some other hotels or some wear else.And also the roofing was leaky in most of the places and even in the bedroom.We had a rainy night and this happened.There was no inverter support and we slept without fan or A/C.Will never ever visit this place in my life again.Service is good.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Beautiful but deadly setting where one risks death by drowning especially when trying to alight from unsecured & dark houseboats!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Peaceful environment in the lap of nature.\nIt was a wonderful experience as the ambience, service , cuisine and ESPECIALLY staff all were excellent. Felt relaxed and happy during the entire stay.\nNice place to have a relaxed holiday. Close to Alappuzha town centre and to the market, at the same time away from all the hustles and bustles as the property is located at the river bank. The food is also good. Affordable .We all are really Enjoyed a lot ...... Great moments ever met together. SUPERB AROGYA INTERNATIONAL.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "super great accommodation check check everything great beyond keep highly recommended travel side choose place please",
                "resort good traditionaltheir hospitality good",
                "frankly speaking worst home stay ever life food horrible important thing please human food place patheticsome food tasted brought hotels wear elseand also roofing leaky places even bedroomwe rainy night happenedthere inverter support slept without fan acwill never ever visit place life againservice good",
                "beautiful deadly setting one risks death drowning especially trying alight unsecured dark houseboats",
                "peaceful environment lap nature wonderful experience ambience service cuisine especially staff excellent felt relaxed happy entire stay nice place relaxed holiday close alappuzha town centre market time away hustles bustles property located river bank food also good affordable really enjoyed lot great moments ever met together superb arogya international"
            ]
        },
        {
            "name": "Akkarakalam Memoirs",
            "rating": [
                4.1
            ],
            "address": [
                "Akkarakalam, Chennamkary Post Office, Pallathuruthy, Ponga, Alappuzha, Kainakary South, Kerala 688501, India"
            ],
            "reviews": [
                {
                    "text": "Great luxury houseboat experience. Highly recommend!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A nice enough location (right on the waterfront), but the place needs some investment.  The period architecture and fittings are potentially lovely but the old wooden doors don't close properly in some rooms and there's a general need for proper renovations.  The staff are friendly and accommodating.  Food; average.  Given the location you would expect mosquitoes to be a problem, and they were.  Some rooms have wonderful outside showers; just be wary of when the mossies might be out and about though.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Beautiful heritage property by one of the many canals of the Alleppey backwaters, far away from the hustle and bustle of Alleppey town. Accomodating, friendly and helpful manager and staff. They offered a complimentary boat ride and were very gracious about us changing our timings around a few times. Delicious homecooked food served in very generous portions.\n\nHowever, the reason i'm giving only 3 stars is because there is still plenty of room for improvement - there was no hot water in our bathroom, no biscuits served with tea (a tiny but required creature comfort for elderly guests like my parents), dinner cannot be ordered after 8 pm as the cooks leave (they need to mention this in their details so that guests can come prepared) and there are no decent alternatives around, there are not enough side tables in the balcony.\n\nThere was a very noisy temple festival on next doors. This seems to be a yearly ritual. The property needs to let guests know about things like this so that they can make informed decisions about staying here.\n\nAnother peeve was the decor. It is a grand house with beautiful period furniture, so it's a shame that the upholstery, curtains, serveware and other decor items are so tacky. It would be lovely if they could accessorize the place with traditional and local textiles and crafts (it is an extremely rich region in that respect).",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We came with cousins of ours for a daytime houseboat ride. It was a wonderful experience. The staff was courteous. The Kerala lunch was a delight and all of us (including the kids) were delighted by the experience. We would like to come back again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Sadly the guesthouse no longer exists. It is now the hub for Spice Routes houseboats. The building has been refurbished and restored. It is still one of my favourite buildings as it still retains the original charm of Kuttanad!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great luxury houseboat experience highly recommend",
                "nice enough location right waterfront place needs investment period architecture fittings potentially lovely old wooden doors dont close properly rooms theres general need proper renovations staff friendly accommodating food average given location would expect mosquitoes problem rooms wonderful outside showers wary mossies might though",
                "beautiful heritage property one many canals alleppey backwaters far away hustle bustle alleppey town accomodating friendly helpful manager staff offered complimentary boat ride gracious us changing timings around times delicious homecooked food served generous portions however reason im giving stars still plenty room improvement hot water bathroom biscuits served tea tiny required creature comfort elderly guests like parents dinner ordered pm cooks leave need mention details guests come prepared decent alternatives around enough side tables balcony noisy temple festival next doors seems yearly ritual property needs let guests know things like make informed decisions staying another peeve decor grand house beautiful period furniture shame upholstery curtains serveware decor items tacky would lovely could accessorize place traditional local textiles crafts extremely rich region respect",
                "came cousins daytime houseboat ride wonderful experience staff courteous kerala lunch delight us including kids delighted experience would like come back",
                "sadly guesthouse longer exists hub spice routes houseboats building refurbished restored still one favourite buildings still retains original charm kuttanad"
            ]
        },
        {
            "name": "Maria Heritage Homes",
            "rating": [
                4.4
            ],
            "address": [
                "Pullinkunnu, Kuttanad Taluk, Kerala 688504, India"
            ],
            "reviews": [
                {
                    "text": "Recently me and my family stayed in maria heritage just for 1 day but all of us wanted to stay there more because of the hospitality of rema chechi and her husband,the peaceful atmosphere.we had very nice time there with yummy homemade kerala food.they even arranged kayaking and spa for us which was also wonderful..the whole property is aesthetic",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Totally splendid. We really enjoyed our stay, as the name suggests home is decorated with some great antiques. With paddy fields behind and backwater at the front, Location is absolutely amazing. Host Rema mam and the entire team is very welcoming. Rooms are great and spacious. You can spend some wonderful time here with family and friends it's very peaceful and serene. I would really like to visit this place again. Food served is tasty and homely.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Maria Heritage Homes\n\nThis is easily one of the best ever homestay experiences we ever had. Such an extremely beautiful traditional house/bungalow with giant wooden swings, fish pond and scenic views all around.  This stands right on a strip of land which is sandwiched between backwaters at the front and paddy fields at the back. Rema Aunty and Mohan Uncle gave us a wonderful hospitality right from the moment we checked-in on our day one. Their hospitality with respect to every meal (breakfast - complimentary, lunch & dinner - prepared on request & payable) & evening coffee was making us feel like we were just visiting a lovely relative's home. They even prepared very early breakfast for us as we were to check-out before 7: 30 AM in the morning. Kudos and thanks to them.  As for the food, cook Mr. Raju gives the perfect Kerala Nadan cuisines at your preferred time of choice. Very yummy food. This is a must visit and the locality taken in consideration together with this amazing house offers the best worth for the price. The church we see in VTV movie is standing majestically on the other side of the backwaters.  You can even hop on a traditional hand-rowed wooden boat and enjoy a sunset ride on the water and reach the other shore too. Full recommendation to book this place and enjoy and get the worth to your last penny.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Super accomodation in a beautiful location in the heart of Kuttanad ( backwaters). Pampa river, right in front of the property and acres of lush green paddy fields at the back. Ms. Rama Mohan is a super host supported by a great team. Booked for 1 night but stayed for 3 nights as the room was available. Great place to chill and relax.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently stayed at Maria Heritage Home, a resort constructed in the traditional Kerala style. The delightful homely food served was a highlight, and the spacious, clean rooms with balconies added to the overall comfort of our stay. Highly recommended for a relaxing getaway.\n\nOur stay at Maria Heritage Home was further enhanced by its lakeside location. Mrs. Rema, the manager, went above and beyond, organizing rejuvenating Ayurvedic massages and a memorable boat trip, allowing us to immerse ourselves in the breathtaking natural beauty surrounding the resort. A truly holistic and enjoyable experience.\n\nWe had the opportunity to speak with the owner, Mary Thomas. Her personal touch ensured that our stay was not only comfortable but also exceptionally enjoyable. The dedication of the owner truly reflects in the overall quality of the resort.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently family stayed maria heritage day us wanted stay hospitality rema chechi husbandthe peaceful atmospherewe nice time yummy homemade kerala foodthey even arranged kayaking spa us also wonderfulthe whole property aesthetic",
                "totally splendid really enjoyed stay name suggests home decorated great antiques paddy fields behind backwater front location absolutely amazing host rema mam entire team welcoming rooms great spacious spend wonderful time family friends peaceful serene would really like visit place food served tasty homely",
                "maria heritage homes easily one best ever homestay experiences ever extremely beautiful traditional housebungalow giant wooden swings fish pond scenic views around stands right strip land sandwiched backwaters front paddy fields back rema aunty mohan uncle gave us wonderful hospitality right moment checkedin day one hospitality respect every meal breakfast complimentary lunch dinner prepared request payable evening coffee making us feel like visiting lovely relatives home even prepared early breakfast us checkout morning kudos thanks food cook mr raju gives perfect kerala nadan cuisines preferred time choice yummy food must visit locality taken consideration together amazing house offers best worth price church see vtv movie standing majestically side backwaters even hop traditional handrowed wooden boat enjoy sunset ride water reach shore full recommendation book place enjoy get worth last penny",
                "super accomodation beautiful location heart kuttanad backwaters pampa river right front property acres lush green paddy fields back ms rama mohan super host supported great team booked night stayed nights room available great place chill relax",
                "recently stayed maria heritage home resort constructed traditional kerala style delightful homely food served highlight spacious clean rooms balconies added overall comfort stay highly recommended relaxing getaway stay maria heritage home enhanced lakeside location mrs rema manager went beyond organizing rejuvenating ayurvedic massages memorable boat trip allowing us immerse breathtaking natural beauty surrounding resort truly holistic enjoyable experience opportunity speak owner mary thomas personal touch ensured stay comfortable also exceptionally enjoyable dedication owner truly reflects overall quality resort"
            ]
        },
        {
            "name": "Captains Cabin Luxury Backwater Resorts",
            "rating": [
                4.4
            ],
            "address": [
                "Thekkekara P.O, Nedumudy, Kuttanad Taluk, Kerala 688503, India"
            ],
            "reviews": [
                {
                    "text": "Amazing place! Nice clean and spacious rooms. The location is bang on the backwaters. You can get a boat ride rt from the property itself. Calm and serene surroundings away from the hustle bustle. The caretaker Suresh is very polite and helpful and ensures that you have a comfortable stay. Will definitely stay here again when I visit Alleppey next time.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "My self with my family and relatives stayed at the resort for 2 days. We felt that this was a very nice resort located in a village surrounded by paddy fields on one side and the other side, a wide river. Its a very calm and quiet area which is suitable for relaxed life.\nThe staff and the facilities are so nice and the food they served was almost Kerala cuisine, especially the mango juice they served was delicious. Thanks to the staff for the services extended to us.\nIt was a wonderful stay so I recommend this resort is a right place to relax.\nWishing the staff, all the best.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "In my 32 years of visiting Kerala,first time found a Home Away from Home.\nExcellent service, food, ambiance and everything. The owner herself takes care of our requirements. Nothing to complain. Would recommend for any short or long stay.Special mention of Suresh. All in one.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very cosy stay provided on the banks of the lake. Has an amazing view at an affordable price. The place is beautiful and quiet. The rooms are spacious and we'll maintained and the service is also very good. Highly recommended for people planning to stay away from the town. The rural setting provides opportunities for walks along the roads and fields and enjoying the beauty of nature.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Captain Cabin Resort Location is Fantastic.One side with water and other side with Paddy.\nPeople who work there Kind, very Friendly, down to Earth behaviour ready with any type of help you been asking for\nFood is amzing, there is no words about food.If I give 5 star for the food , I think it's not enough.\nThe Owner of the place was ready with any help with transportation or any other help.\nI highly recommend this place for anybody who wants to have a great holiday.\nWe are looking forward to have  a relaxing time  and fabulous food whenever we go to India.Words are not enough to praise this place.Amazing,Amazing,Amaizing.👍",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing place nice clean spacious rooms location bang backwaters get boat ride rt property calm serene surroundings away hustle bustle caretaker suresh polite helpful ensures comfortable stay definitely stay visit alleppey next time",
                "self family relatives stayed resort days felt nice resort located village surrounded paddy fields one side side wide river calm quiet area suitable relaxed life staff facilities nice food served almost kerala cuisine especially mango juice served delicious thanks staff services extended us wonderful stay recommend resort right place relax wishing staff best",
                "years visiting keralafirst time found home away home excellent service food ambiance everything owner takes care requirements nothing complain would recommend short long stayspecial mention suresh one",
                "cosy stay provided banks lake amazing view affordable price place beautiful quiet rooms spacious well maintained service also good highly recommended people planning stay away town rural setting provides opportunities walks along roads fields enjoying beauty nature",
                "captain cabin resort location fantasticone side water side paddy people work kind friendly earth behaviour ready type help asking food amzing words foodif give star food think enough owner place ready help transportation help highly recommend place anybody wants great holiday looking forward relaxing time fabulous food whenever go indiawords enough praise placeamazingamazingamaizingð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Kuttanad Kayak Club",
            "rating": [
                4.9
            ],
            "address": [
                "Kuttanad Kayak Club, Paruthickal House, Pulincunnoo P.O Near Pulincunnoo, Panchayat Office Rd, Alappuzha, Pullinkunnu, Kerala 688504, India"
            ],
            "reviews": [
                {
                    "text": "The resort provided a delightful escape with its picturesque surroundings and luxurious amenities. The well-maintained facilities, attentive staff, and diverse recreational options made for a memorable and relaxing stay. The culinary offerings were exceptional, catering to various tastes. While the pricing reflected the quality of service, the overall experience justified the cost. Highly recommended for those seeking a tranquil and indulgent getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Our time at the Riverside Cottage was nothing short of unforgettable.\nThe family's attentive service, combined with cozy accommodations, made for a delightful retreat. Kayaking on the river was a highlight, and the gourmet meals cooked by the family were simply divine. A perfect getaway for those seeking relaxation and adventure in equal measure. Highly recommended and would love to spend time at the riverside cottage.\nThankyou Hormese 😊",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Such a wonderful stay! The house is charming and unique, the food was the best we had in Kerala so far, and the host is very helpful with arranging everything. We did kayaking in the morning and it was an unforgettable experience. Highly recommend!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Had an amazing stay. Host was really nice and polite. They served us amazing breakfast as well. Also enjoyed kayaking! Overall its an amazing place to chill and have fun with friends and family. I would highly recommend everyone to come here and stay.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Great ambiance,My stay at kuttanad kayak club was truly exceptional, leaving me thoroughly impressed with every aspect of the experience. From the moment I stepped into the property, I was greeted with warmth and professionalism by the attentive staff, setting the tone for a memorable stay.\n\nThe homestay ambiance exudes luxury and elegance, with tastefully decorated rooms that offer both comfort and sophistication. The attention to detail is evident in every corner, from the plush bedding to the modern amenities provided. The room's cleanliness was impeccable, ensuring a pleasant and relaxing environment throughout my stay.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort provided delightful escape picturesque surroundings luxurious amenities wellmaintained facilities attentive staff diverse recreational options made memorable relaxing stay culinary offerings exceptional catering various tastes pricing reflected quality service overall experience justified cost highly recommended seeking tranquil indulgent getaway",
                "time riverside cottage nothing short unforgettable familys attentive service combined cozy accommodations made delightful retreat kayaking river highlight gourmet meals cooked family simply divine perfect getaway seeking relaxation adventure equal measure highly recommended would love spend time riverside cottage thankyou hormese ð\u009f\u0098\u008a",
                "wonderful stay house charming unique food best kerala far host helpful arranging everything kayaking morning unforgettable experience highly recommend",
                "amazing stay host really nice polite served us amazing breakfast well also enjoyed kayaking overall amazing place chill fun friends family would highly recommend everyone come stay",
                "great ambiancemy stay kuttanad kayak club truly exceptional leaving thoroughly impressed every aspect experience moment stepped property greeted warmth professionalism attentive staff setting tone memorable stay homestay ambiance exudes luxury elegance tastefully decorated rooms offer comfort sophistication attention detail evident every corner plush bedding modern amenities provided rooms cleanliness impeccable ensuring pleasant relaxing environment throughout stay"
            ]
        },
        {
            "name": "Tulsi Kayal Retreat",
            "rating": [
                4.9
            ],
            "address": [
                "Pally Jetty, Kainakary Pooppally Road, Chennamkary, Kainakary South, Kerala 688501, India"
            ],
            "reviews": [
                {
                    "text": "This was one of the most beautiful experiences I have ever had. I have been to Alleppey before, but this stay was a different experience altogether. As we arrived, we were received by a boat to get us to the stay, which was pretty exciting. The other side of the river was the beautiful homestay. It has spacious rooms, lip-smacking food, amazing view with  impressive location making it a great place to chill with family and friends. By evening, you can sit on the patio and witness the calming sunset by the river. If you are interested, you can go fishing. We took a shikara ride one of the days; it was all worth it. I must say that you will feel at home, and there is a peculiar kind of happiness here. I loved all the days that I stayed here. I would highly recommend this place! Go for it! 😊",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The homestay is located in the middle of the backwaters right on the water. Therefore, getting there is a little more complicated, but doable, especially by boat from Aleppey. There is a very nice hammock from which you can watch the hustle and bustle on the river and enjoy the peace and quiet surroundings. The room is very basic, but the bed linen and towels are clean. The food is freshly cooked, very tasty and reasonably priced. Wifi works great.\n\nAshique took great care of everything and was always available via WhatsApp. He helped me book a bus and organized a boat transfer and a tuktuk for my onward journey. Thanks a lot!!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Amazing backwater location! Plenty of water activities. Once you get there you wouldn’t want to leave the place, tranquility at its best. They serve the best food and take care of you like family.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "This place is not very touristy, quite and away from the hussle. This place gives the exact feel of how people of back waters live.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Excellent Retreat.  Feels like to visit again and again.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one beautiful experiences ever alleppey stay different experience altogether arrived received boat get us stay pretty exciting side river beautiful homestay spacious rooms lipsmacking food amazing view impressive location making great place chill family friends evening sit patio witness calming sunset river interested go fishing took shikara ride one days worth must say feel home peculiar kind happiness loved days stayed would highly recommend place go ð\u009f\u0098\u008a",
                "homestay located middle backwaters right water therefore getting little complicated doable especially boat aleppey nice hammock watch hustle bustle river enjoy peace quiet surroundings room basic bed linen towels clean food freshly cooked tasty reasonably priced wifi works great ashique took great care everything always available via whatsapp helped book bus organized boat transfer tuktuk onward journey thanks lot",
                "amazing backwater location plenty water activities get wouldnâ\u0080\u0099t want leave place tranquility best serve best food take care like family",
                "place touristy quite away hussle place gives exact feel people back waters live",
                "excellent retreat feels like visit"
            ]
        }
    ]
}