{
    "places_with_reviews": [
        {
            "name": "Hotel MS Victoria /AC rooms hotel in batala /Hotels in Batala/Best Luxury Hotels in Batala/banquet hall in Batala",
            "rating": [
                4.5
            ],
            "address": [
                "Q6W2+8W Jalandhar, Amritsar Bypass, Thathari Gate, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "All hotel management is perfect you can take perfect portait over there\nbut Noise of Fly killers inside the hotel is too high I shocked first time when I noticed light hearted don't sit close to it",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I stay in this hotel for 5 days and the services they provides is soo good and too fast except of all hotels in Batala and the food that they give to me is fresh and fully baked that’s soo good .\nThe furniture in hotel is too good ❤️",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It's superb comfortable rooms\nStaff was very cooperative\nI really enjoy my stay\nMiss gagan help me to how share the review",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "no water in attached bathrooms. stayed for one night but it was a nightmare. zero room set ice no one was there to pick the phone as if we were only guest there with no staff member to serve except chokidar and one at reception to take money for the stay. only room ac was working fine. room was neat and clean and newly built.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good ambience.. Good catering service.. Very spacious.. It was my first visit to Victoria",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel management perfect take perfect portait noise fly killers inside hotel high shocked first time noticed light hearted dont sit close",
                "stay hotel days services provides soo good fast except hotels batala food give fresh fully baked thatâ\u0080\u0099s soo good furniture hotel good â\u009d¤ï¸\u008f",
                "superb comfortable rooms staff cooperative really enjoy stay miss gagan help share review",
                "water attached bathrooms stayed one night nightmare zero room set ice one pick phone guest staff member serve except chokidar one reception take money stay room ac working fine room neat clean newly built",
                "good ambience good catering service spacious first visit victoria"
            ]
        },
        {
            "name": "Khazana Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Amritsar-Jalandhar Bye Pass Road Buddhe Di Khuhi, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Very good all members & staff",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place for wedding and party",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It is very good resort with good location.. It's spacious, neat & clean toilets.. It is good for large gatherings &  also a big hall for indoor functions..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very spacious well equipped with all the amenities located right on the gt road giving easy access to the people. Best part is that you can easily locate it and also have ample parking space for around more than 500 cars. This banquet is one of the best luxury resorts on the same belt and same can accommodate approx 2000 guests.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best quality food and delicious  and I f I talk about service it is brilliant",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good members staff",
                "good place wedding party",
                "good resort good location spacious neat clean toilets good large gatherings also big hall indoor functions",
                "spacious well equipped amenities located right gt road giving easy access people best part easily locate also ample parking space around cars banquet one best luxury resorts belt accommodate approx guests",
                "best quality food delicious f talk service brilliant"
            ]
        },
        {
            "name": "Khushi Vatika",
            "rating": [
                3.9
            ],
            "address": [
                "Pathankot Amritsar, National Highway Road, R56M+2FF, near Bye Pass Chowk, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Overall a nice well organized venue. Setup and Décor is clean and airy. Especially the washrooms are clean glamorous. Lobby area is beautiful. We attended 3-4 events. Very courteous staff and tables get cleared fast. The food can be improved a notch.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "On November 16, 2023, I attended a ceremony function at this venue, a former industrial unit transformed into a spacious resort ( in local language, otherwise it is not resort but a banquet hall).\n\nThe location, situated on the main Amritsar Kashmir Road, offers a banquet hall, open space, and parking.\n\nWhile the venue has potential, it lacks noticeable ambiance, and a significant drawback is its inconspicuousness from the road. Absence of a glow sign makes it challenging for visitors to spot it at first glance, necessitating reliance on Google Maps Directions for navigation.\n\nThe single-story banquet hall, devoid of decorations, falls short in comparison to other resorts in Amritsar. However, it accommodates gatherings of around 500 people. Despite these drawbacks, the venue remains a decent choice for organizing functions.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is one of the best resorts in batala. With the best catering services and the cleanliness in terms of cleaning and hygiene. Also the hospitality of staff and managment is very awesome. You must visit this resort.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's very good place for marriages...\nIt's has huge ground air conditioning halland it's own parking",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I loved the food and hospitality here... quality was awesome......nice place for reception..... surely recommend it",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall nice well organized venue setup dã©cor clean airy especially washrooms clean glamorous lobby area beautiful attended events courteous staff tables get cleared fast food improved notch",
                "november attended ceremony function venue former industrial unit transformed spacious resort local language otherwise resort banquet hall location situated main amritsar kashmir road offers banquet hall open space parking venue potential lacks noticeable ambiance significant drawback inconspicuousness road absence glow sign makes challenging visitors spot first glance necessitating reliance google maps directions navigation singlestory banquet hall devoid decorations falls short comparison resorts amritsar however accommodates gatherings around people despite drawbacks venue remains decent choice organizing functions",
                "one best resorts batala best catering services cleanliness terms cleaning hygiene also hospitality staff managment awesome must visit resort",
                "good place marriages huge ground air conditioning halland parking",
                "loved food hospitality quality awesomenice place reception surely recommend"
            ]
        },
        {
            "name": "Layalpuri Resort",
            "rating": [
                3.9
            ],
            "address": [
                "Q6MF+7C4, opp. reliance petrol pump, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "No room only marriage and party Place",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "this place was not as good as I remember it from 2018... I'd rate the earlier one 5 stars",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The waiter of this palace often demand tips from every person which is very bad. Overall outlook of the  palace is good.  Service by waiters are good to some extent",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very bad service.\nStaff is not cooperative.\nThe air conditioner of the hall failed.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Awesome place for a marriage function. Catering is really good with a variety of items on the menu and most importantly yummy taste.....🙂",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room marriage party place",
                "place good remember id rate earlier one stars",
                "waiter palace often demand tips every person bad overall outlook palace good service waiters good extent",
                "bad service staff cooperative air conditioner hall failed",
                "awesome place marriage function catering really good variety items menu importantly yummy tasteð\u009f\u0099\u0082"
            ]
        },
        {
            "name": "Grandway-2 Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "Near, Civil Hospital Rd, Dharampura Colony, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Very Nice food. Staff was great",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good food with quality and quantity 👌...not a crowded area...feel good to visit",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The interior of hotel was simple nice with dim lights . The customer service was very good they look after you very well .Food was good but presentation was just ok . They need to place plastic sheets above the tables as the cloth was very slippery  need to have good music 🎶 Washroom was not clean .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good quality of food  and arrangements, but service is now becoming ordinary",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best Hotel Experience with courteous staff and hygienic food for a healthy family environment.  Recommendable",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice food staff great",
                "good food quality quantity ð\u009f\u0091\u008cnot crowded areafeel good visit",
                "interior hotel simple nice dim lights customer service good look well food good presentation ok need place plastic sheets tables cloth slippery need good music ð\u009f\u008e¶ washroom clean",
                "good quality food arrangements service becoming ordinary",
                "best hotel experience courteous staff hygienic food healthy family environment recommendable"
            ]
        },
        {
            "name": "Khazana Resort Batala",
            "rating": [
                5
            ],
            "address": [
                "Bodhe Di Khui, Jal-Asr, Bye Pass, Shastri Nagar, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Its amazing resort wht a change u guys have done",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing resort wht change u guys done"
            ]
        },
        {
            "name": "Sunny Hotel Restaurant & Beer Bar",
            "rating": [
                3.8
            ],
            "address": [
                "Near Bus Stand Batala,Jalandhar Road, Shastri Nagar, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Average hotel with average facilities. But restaurant service and food are really good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Visited this place for lunch.\n\nFood is fine, service is good.\nWe opt for a private cabin, a good place for a gathering of 7-8 persons.\n\nWe ordered chilli chicken, rahra chicken, butter naan and fried rice.\nSurprisingly they are serving Chinese, but not noodles.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Great service and food was exceptional. Room was clean and the staff was also very polite. The cabins in the restaurant area are great for some quality time with family and friends and provide privacy.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This place is great! Had amazing food. The service we received was also amazing. I recommend this place to everyone and definitely I would like to come back here again and again. It's just \"THE BEST\" in the town.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Stayed here for 10 days for official tour.\nGood service with spacious rooms and staff behaviour was very good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "average hotel average facilities restaurant service food really good",
                "visited place lunch food fine service good opt private cabin good place gathering persons ordered chilli chicken rahra chicken butter naan fried rice surprisingly serving chinese noodles",
                "great service food exceptional room clean staff also polite cabins restaurant area great quality time family friends provide privacy",
                "place great amazing food service received also amazing recommend place everyone definitely would like come back best town",
                "stayed days official tour good service spacious rooms staff behaviour good"
            ]
        },
        {
            "name": "BASRA FARM",
            "rating": [
                3.7
            ],
            "address": [
                "R69F+2Q2, Kahnuwan Road, Jharia, Urban Estate, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Not bad experience. But hospitality is very low. If management will understand.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good place for functions .",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good 👍🏻😊",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very good very open grand haal parking very good palace",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good place for family functions and parties 🎉",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience hospitality low management understand",
                "good place functions",
                "good ð\u009f\u0091\u008dð\u009f\u008f » ð\u009f\u0098\u008a",
                "good open grand haal parking good palace",
                "good place family functions parties ð\u009f\u008e\u0089"
            ]
        },
        {
            "name": "Kang vila Palace",
            "rating": [
                4.3
            ],
            "address": [
                "R693+RC4, Shastri Nagar, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Beautiful palace",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Recommended",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Awesome 👍",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good",
                "beautiful palace",
                "recommended",
                "awesome ð\u009f\u0091\u008d",
                "good"
            ]
        },
        {
            "name": "Nirvana Banquet Garden",
            "rating": [
                4.3
            ],
            "address": [
                "Near Baba Motors,Bypass Chownk, Jalandhar Rd, Mahajan Colony, Umarpura, Batala, Punjab 143505, India"
            ],
            "reviews": [
                {
                    "text": "Lovely place to visit food is delicious, great venue, good experience nice banquet hall 👍👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The General manager and management is very good.We book Nirvana hall for our Sister marriage.The arrangement is very good.everything did smooth.Our guest enjoy and we are happy for the nirvana Management.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Food quality very good and staff service good",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good place to organise parties and ceremonies. Professional service, friendly staff, proper cleanliness,\nBig parking’s available at backside as well.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very nice and big banquet hall for weeding and parties\nParking is available at open space good kind of banquet hall they receive good responses",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "lovely place visit food delicious great venue good experience nice banquet hall ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "general manager management goodwe book nirvana hall sister marriagethe arrangement goodeverything smoothour guest enjoy happy nirvana management",
                "food quality good staff service good",
                "good place organise parties ceremonies professional service friendly staff proper cleanliness big parkingâ\u0080\u0099s available backside well",
                "nice big banquet hall weeding parties parking available open space good kind banquet hall receive good responses"
            ]
        }
    ]
}