{
    "places_with_reviews": [
        {
            "name": "The Triangle Glamping (Camping Site near Pune)",
            "rating": [
                4.4
            ],
            "address": [
                "Solu, Alandi-Markal Rd, behind Dosti Hotel, Pimpri-Chinchwad, Solu, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Our stay at Triangle Glamping was amazing! From the moment we’ve arrived till we left everything was up to the point.\n\nAll meals were delicious and timely served. That too in private dining area.\n\nAmazed by the staff, they were warm and welcoming and went above and beyond to ensure our stay was unforgettable. Whether it was for providing recommendations for nearby farm trails or arranging cozy bonfire under the stars, their hospitality truly made us feel like VIP guests.\n\nOverall,\n5 stars to the property and the service, will recommend to friends and family.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice place to celebrate birthday,anniversary. This place is near to city.atmosphere is very nice.food is also good. Please carry mosquito cream,as due to river side ,there is a lot of mosquito attack.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Best Place to hangout with Family for Birthday celebration. Privacy maintained Perfectly. Rooms are spacious and Neet n Clean. I like the most Games Area and Playing Options. One can't finish playing all games in the stat time. Must Visit, Thanks to Adinath n Dnyanesh for Best Service I Experienced. Surely visit again in Winter.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It was a overall a good experience here. Only drawback I would suggest is that you will encounter a lot of mosquitoes after evening and even if you apply odomos, you will get some mosquito bites but this is expected as it is beside river side and one has to prepare for it mentally. Also, the washroom for the Traingle AC tent can be improved as the shower and taps were very old and not functioning properly. I am sure for other new tents, the washroom is much better but for this particular tent, there is a scope for improvement. If you ignore these few drawbacks, overall the stay was very good and quite.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This place really ticked me off, It's not a kid friendly or pet friendly place.\nToo many mosquitoes, this is actually just beside a swamp. All you'll see is just green algae grown to it's fullest contributing to all the insects.\n\nIndoor game zone carrom board is broken, Foosball table handles are broken.\n\nThings were explained at the time of check in. But nothing was served as per planned time unless we called the guy nothing came.\n\nCooler in the room was broken, flush tank does not fill properly. Rooms mentioned that are attached with a pool it's just a small tank\n\nDrinking water which is termed filtered is not suitable for drinking.\n\nFood that we ate lead to an upset tummy for all of us as a fly.\n\nNot worth the cost honestly I would not recommend going here atleast with kids.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay triangle glamping amazing moment weâ\u0080\u0099ve arrived till left everything point meals delicious timely served private dining area amazed staff warm welcoming went beyond ensure stay unforgettable whether providing recommendations nearby farm trails arranging cozy bonfire stars hospitality truly made us feel like vip guests overall stars property service recommend friends family",
                "nice place celebrate birthdayanniversary place near cityatmosphere nicefood also good please carry mosquito creamas due river side lot mosquito attack",
                "best place hangout family birthday celebration privacy maintained perfectly rooms spacious neet n clean like games area playing options one cant finish playing games stat time must visit thanks adinath n dnyanesh best service experienced surely visit winter",
                "overall good experience drawback would suggest encounter lot mosquitoes evening even apply odomos get mosquito bites expected beside river side one prepare mentally also washroom traingle ac tent improved shower taps old functioning properly sure new tents washroom much better particular tent scope improvement ignore drawbacks overall stay good quite",
                "place really ticked kid friendly pet friendly place many mosquitoes actually beside swamp youll see green algae grown fullest contributing insects indoor game zone carrom board broken foosball table handles broken things explained time check nothing served per planned time unless called guy nothing came cooler room broken flush tank fill properly rooms mentioned attached pool small tank drinking water termed filtered suitable drinking food ate lead upset tummy us fly worth cost honestly would recommend going atleast kids"
            ]
        },
        {
            "name": "The Riverfront Resort & Camping",
            "rating": [
                4.6
            ],
            "address": [
                "Solu, Alandi-Markal Rd, behind Dosti hotel, Pimpri-Chinchwad, Solu, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Good location, good but limited food, worst possible service.\nWe booked 5 rooms but the guy was adamant that we had four.\nThe snacks were served sharp at 5, eat it or leave it,  is limited, no refills. No one to talk to at front desk.\nDinner at sharp 8, was unlimited.\nBreakfast at 8, limited, one bread omelet ot one plate idly and that's it. Rest you pay extra.\n\nThey have a lot to catch up on the service front. Won't recommend to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The staff were exceptional, providing a fabulous experience for our bachelorette celebration. The stunning decorations added to the ambiance, making our evening truly memorable. We highly recommend this place and eagerly anticipate returning for future celebrations. Thank you so much for making our evening memorable 💖💖!!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "It was not really that good. Recommended ONLY IF YOU are a nearby resident and looking for a low budgeted and quick celebrations\n\nHygiene was concern no. 1. Though clean but few of the equipments in the washroom was too old for our tent.\n\nThen the hospitality was always questionable. Not all of the staff members are humble or polite enough to respond to you with gratitude.\n\nHeavy load shedding issues.\n\nToo many things were asked to carry from our end which should have been provided by the hosts at this price point.\n\nVery limited food options.\n\nThe good parts - Very spacious, nice and well managed lawn, gaming options, clean swimming pool, room and event decoration at very reasonable price.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Recently visited Riverfront Resorts Perfect destination to spend peaceful time here.\nEye catching view and peaceful place which has 3 types of Cottage with attached washroom. Tent with Non Ac room.\nNo unnecessary crowd like other camps and you can enjoy your time peacefully.\n\nNon veg Food quality was good.\nSpecially barbeque along with bonfire.\nNice place for celebrating anniversary & birthday.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Awesome place to stay...environment was nurturing. Foood taste's delicious. Service provided was remarkable. Perfect to celebrate special moments.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good location good limited food worst possible service booked rooms guy adamant four snacks served sharp eat leave limited refills one talk front desk dinner sharp unlimited breakfast limited one bread omelet ot one plate idly thats rest pay extra lot catch service front wont recommend anyone",
                "staff exceptional providing fabulous experience bachelorette celebration stunning decorations added ambiance making evening truly memorable highly recommend place eagerly anticipate returning future celebrations thank much making evening memorable ð\u009f\u0092\u0096ð\u009f\u0092\u0096",
                "really good recommended nearby resident looking low budgeted quick celebrations hygiene concern though clean equipments washroom old tent hospitality always questionable staff members humble polite enough respond gratitude heavy load shedding issues many things asked carry end provided hosts price point limited food options good parts spacious nice well managed lawn gaming options clean swimming pool room event decoration reasonable price",
                "recently visited riverfront resorts perfect destination spend peaceful time eye catching view peaceful place types cottage attached washroom tent non ac room unnecessary crowd like camps enjoy time peacefully non veg food quality good specially barbeque along bonfire nice place celebrating anniversary birthday",
                "awesome place stayenvironment nurturing foood tastes delicious service provided remarkable perfect celebrate special moments"
            ]
        },
        {
            "name": "Goodluck Lunch Home 3 Moshi",
            "rating": [
                4
            ],
            "address": [
                "Gat No. 164, New, Dehu - Alandi Rd, Sastewadi, Moshi, Pune, Pimpri-Chinchwad, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Must visit place ❤. Loved the quality of food.\nSo affordable .  Family has seperate section to o. Must try their chicken raan.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very bad service. It is the stupidest restaurant I have ever seen. They don’t even Have the food which they have added in the menu I was gone for salad and so which was on their menu but they didn’t offer me. They said we just close that term and when I ordered Paneer tikka, they still not having that Even the person who should be a waiter, they were calling them captain And who are not even behaving with us properly they didn’t even give us the water they directly give us Bisleri water they they were not even having tap water\nThe only good thing was I ordered two chicken masala and he added one in the bill by mystically so it was good for us We get paid ₹200 less from the menu",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This restaurant may be famous for non-vegetarian dishes. But unfortunately we had to eat vegetarian when we last visited. Vegetarian options were not that great. Bhakri was very hot served and really tasty. Please do not try vegetarian food here. It was crowded and many visited there for non-vegetarian food only. So may try that.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "As the name suggests it's a lunch home with limited main courses, their main attraction is mutton thali in Maharashtrian style and it's worthy.  Manchurian was below average, veg curry was good and sufficient for two. their bhakri is too heavy even though one is enough. A better option for mutton lovers.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Must visit place for thali lovers. All dishes are prepared in ghee enhancing the taste & quality of food.\nWould highly recommend visiting this place.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "must visit place â\u009d¤ loved quality food affordable family seperate section must try chicken raan",
                "bad service stupidest restaurant ever seen donâ\u0080\u0099t even food added menu gone salad menu didnâ\u0080\u0099t offer said close term ordered paneer tikka still even person waiter calling captain even behaving us properly didnâ\u0080\u0099t even give us water directly give us bisleri water even tap water good thing ordered two chicken masala added one bill mystically good us get paid â\u0082¹ less menu",
                "restaurant may famous nonvegetarian dishes unfortunately eat vegetarian last visited vegetarian options great bhakri hot served really tasty please try vegetarian food crowded many visited nonvegetarian food may try",
                "name suggests lunch home limited main courses main attraction mutton thali maharashtrian style worthy manchurian average veg curry good sufficient two bhakri heavy even though one enough better option mutton lovers",
                "must visit place thali lovers dishes prepared ghee enhancing taste quality food would highly recommend visiting place"
            ]
        },
        {
            "name": "Emerald Tree Moshi",
            "rating": [
                3.9
            ],
            "address": [
                "Gate No. 174 Dattanagar, Moshi - Alandi Rd, near Mangalam Society, Pune, Pimpri-Chinchwad, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic Experience. Hotel Staff was not Courteous. Major safety and security concerns in the Hotel rooms.\nThe Hotel provides only 1 Litre Drinking water as complimentary. Every next drinking water is chargeable at Rs.25/Litre. The Hot drinking water that i requested was also charged at Rs. 25/Litre. Somebody kept trying to unlock my room at night 2 am. This kept repeatedly happening every 15 minutes upto 3.30 am when i finally called the Reception and told them about this incidence.\n\nI had booked this hotel via Treebo Trend. I called the Hotel to check if they had my booking. To my surprise the Hotel informed me that they are no more connected with Treebo Trend so they cannot accept the booking and that the Hotel was completely booked for the dates i wanted. I cancelled the booking made via Treebo Trend. Then i called the Hotel again to check if they had rooms available, to my surprise they said they had rooms available but the prices were higher. I booked the room anyways as i had no choice for the dates and had time constraints.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The pictures speak louder! Such horrible bedspread I’ve never seen. Treebo says they provide fresh sheets and this is what I got. The full bed picture is the changed sheet!!! There are no hangers inside wardrobe, there is no table to keep the intercom, it’s kept on the bed!\nPathetic rooms. Please avoid",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Experienced the Bad stay here, there is no proper door mat, toilet mat, no proper flush, I ordered curd rice which wasn't good even a single percentage, AC remote wasn't working, I would never stay here again.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel's facilities were top-notch. I enjoyed unwinding at the spa and staying active at the fitness center. Additionally, the hotel's central location made it convenient to explore local attractions and return to the comfort of Treebo Trend Emerald Tree Chakan at the end of the day.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The staff at the hotel was very polite, understanding and courteous. I need an extended stay as my flight was late night and was dealt with promptly without even been asked for. Will be staying again soon.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic experience hotel staff courteous major safety security concerns hotel rooms hotel provides litre drinking water complimentary every next drinking water chargeable rslitre hot drinking water requested also charged rs litre somebody kept trying unlock room night kept repeatedly happening every minutes upto finally called reception told incidence booked hotel via treebo trend called hotel check booking surprise hotel informed connected treebo trend accept booking hotel completely booked dates wanted cancelled booking made via treebo trend called hotel check rooms available surprise said rooms available prices higher booked room anyways choice dates time constraints",
                "pictures speak louder horrible bedspread iâ\u0080\u0099ve never seen treebo says provide fresh sheets got full bed picture changed sheet hangers inside wardrobe table keep intercom itâ\u0080\u0099s kept bed pathetic rooms please avoid",
                "experienced bad stay proper door mat toilet mat proper flush ordered curd rice wasnt good even single percentage ac remote wasnt working would never stay",
                "hotels facilities topnotch enjoyed unwinding spa staying active fitness center additionally hotels central location made convenient explore local attractions return comfort treebo trend emerald tree chakan end day",
                "staff hotel polite understanding courteous need extended stay flight late night dealt promptly without even asked staying soon"
            ]
        },
        {
            "name": "Shree Ashoka Veg",
            "rating": [
                4.1
            ],
            "address": [
                "Pune - Alandi Rd, near Balaji Mandir, Wadmukhwadi, Charholi Budruk, Pune, Pimpri-Chinchwad, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "This is the best option for veg food (multi cuisine) on Pune Alandi Road near Dighi, Charholi and Wadmukhwadi area. Huge option in food and cold drinks. Food is quality and tasty with excellent service. Hige sitting and parking area. Small children play area is also there.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food was very disappoting.Overall experience was bad.\nWe ordered Paneer kebab neither it was tasty nor properly roasted.Both curries were having same taste only with different name and price tag.Rotis were not properly cooked.\nStaff was just lost.No coordination confused among themselves only.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The hotel's administration and service are poor. When we arrived at 4 p.m., we were advised to wait 15 minutes while our rooms were being cleaned; it has been an hour and they still can't check us in. When I arrived, they had stated that they had several rooms available, but now they were claiming that they only had one, which is equally unclear. There is no room cleaning.\n\nThe manager responded to our question in an impolite manner, and the staff refused to comply when we asked for room service or a cleaning.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best party hall, food, service & very good decoration for shree Krishna event orgnizer",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "What I can say besstt hotel, Best Staff, Great food, good management, Good location. Staff, manager very helpful and polite..\n\nEach and every guest was happy with the food quality...Everyone one enjoyed the food...\n\nThank you...\nHighly recommended..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best option veg food multi cuisine pune alandi road near dighi charholi wadmukhwadi area huge option food cold drinks food quality tasty excellent service hige sitting parking area small children play area also",
                "food disappotingoverall experience bad ordered paneer kebab neither tasty properly roastedboth curries taste different name price tagrotis properly cooked staff lostno coordination confused among",
                "hotels administration service poor arrived pm advised wait minutes rooms cleaned hour still cant check us arrived stated several rooms available claiming one equally unclear room cleaning manager responded question impolite manner staff refused comply asked room service cleaning",
                "best party hall food service good decoration shree krishna event orgnizer",
                "say besstt hotel best staff great food good management good location staff manager helpful polite every guest happy food qualityeveryone one enjoyed food thank highly recommended"
            ]
        },
        {
            "name": "Jeevansathi mangal karyalaya",
            "rating": [
                4.2
            ],
            "address": [
                "MVFP+QVP, Indrayani Nagar Rd, Alandi, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Good and affordable place for marriage arrangement 😇😌. Budget friendly rates are recommended by them, location accessible point.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Gud place but you need to be aware and vigilant what is the deal and what ther are giving",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Small but very nice hall 200 people capacity hall,Nit and Nice",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice😄",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Great hall",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good affordable place marriage arrangement ð\u009f\u0098\u0087ð\u009f\u0098\u008c budget friendly rates recommended location accessible point",
                "gud place need aware vigilant deal ther giving",
                "small nice hall people capacity hallnit nice",
                "niceð\u009f\u0098\u0084",
                "great hall"
            ]
        },
        {
            "name": "Hotel Ambience Inn",
            "rating": [
                4.2
            ],
            "address": [
                "Dudulgoan phata, Moshi - Alandi Rd, Moshi, Pimpri-Chinchwad, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "The room is clean and there is enough parking space hot water is 24hrs\nOverall a good stay",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very great place this is for the stay!\nNice interior of the room gives us good feel!\nGood service gives a good stay experience!\nAnd that all for a very reasonable rate!\nThe place for Parking our vehicles is also sufficient spacious, and the hotel is just on the way, right beside the highway!\nSi Good accessible!\nA perfect place for stay in Alandi!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Room rates are high for the facilities they provide.Staff is helpful. There were no towels, no tissues, no bath or toilet soap, but got them fast on request. Food was reasonable, but they made vegetarian as per our request. Their yellow dal was very tasty. Had ordered poha for breakfast & they burnt the poha. They say they cater to corporate clients, I am not sure about the same.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms are good & clean. It's a newly constructed hotel. Staff okay. Food items are restricted only for few items. Hotel owners does not seem to be much concerned about regular customers staying in this hotel on regular basis. Attachment of owners with regular customers need to be improved",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Outside look is not good, building is in construction condition, rooms have more space and clean, food also good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room clean enough parking space hot water hrs overall good stay",
                "great place stay nice interior room gives us good feel good service gives good stay experience reasonable rate place parking vehicles also sufficient spacious hotel way right beside highway si good accessible perfect place stay alandi",
                "room rates high facilities providestaff helpful towels tissues bath toilet soap got fast request food reasonable made vegetarian per request yellow dal tasty ordered poha breakfast burnt poha say cater corporate clients sure",
                "rooms good clean newly constructed hotel staff okay food items restricted items hotel owners seem much concerned regular customers staying hotel regular basis attachment owners regular customers need improved",
                "outside look good building construction condition rooms space clean food also good"
            ]
        },
        {
            "name": "OYO Hotel Shetkari",
            "rating": [
                2.9
            ],
            "address": [
                "S.no 2/12/6, Charholi Phata, Alandi, Near Dehu Phata Mumbai Pune Bypass Rd, Charholi Budruk, near ANKUR SOCIETY, Chovisawadi, Dehu Phata, Pune, Maharashtra 410501, India"
            ],
            "reviews": [
                {
                    "text": "Worst experience ever.  Disguisting staff. Low quality food. Never visit. Don't drink or eat here. Dalindar hotel...",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Regrettably, upon my arrival at the hotel, the staff informed me that they had no record of my booking. I was left stranded without a room, and the situation was not only distressing but also highly inconvenient. I immediately contacted your customer support hotline, but the issue was not resolved promptly.",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Very poor test of biryani.its tested like yesterday rice cooked.do not waste your money.",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Taste is nothing ..too much ajino moto use please do not visit",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Very Bad... Experience in Restaurant... specially..... service staff... service delay every time....even Water bottle ordered...not happy with the Restorant....",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst experience ever disguisting staff low quality food never visit dont drink eat dalindar hotel",
                "regrettably upon arrival hotel staff informed record booking left stranded without room situation distressing also highly inconvenient immediately contacted customer support hotline issue resolved promptly",
                "poor test biryaniits tested like yesterday rice cookeddo waste money",
                "taste nothing much ajino moto use please visit",
                "bad experience restaurant specially service staff service delay every timeeven water bottle orderednot happy restorant"
            ]
        },
        {
            "name": "Haveli Executive",
            "rating": [
                4.5
            ],
            "address": [
                "Shop No 45, Silvana County, Charholi Rd, above Lucky Wine, Chovisawadi, Charholi Budruk, Pune, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Taste was immense and superb. Service was totally commendable! Enjoyed every part of the experience I had. Lovely seating and great ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Food is very tasty. service is also good",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Haveli food it's very delicious and off course service also good nice staff I am so happy",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Service was slow\nBut food was good. Our waiter was humble",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Great place for parties and birthday celebrations. Drinks and food is at affordable rates and the taste is really good.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "taste immense superb service totally commendable enjoyed every part experience lovely seating great ambience",
                "food tasty service also good",
                "haveli food delicious course service also good nice staff happy",
                "service slow food good waiter humble",
                "great place parties birthday celebrations drinks food affordable rates taste really good"
            ]
        },
        {
            "name": "OYO Hotel Shivay Executive Lodging & Boarding",
            "rating": [
                4.1
            ],
            "address": [
                "Alandi Markal Road, Dhanore Phata, Dhanore, Pune, Maharashtra 412105, India"
            ],
            "reviews": [
                {
                    "text": "Property is situated near to Alandi and Markal road. We booked 3 rooms each at 1,200/- per night. Rooms are good having a double bed and attached bathroom. There is no kichen in hotel. However staff can arrange food from outside. Staff is polite. Thanks to Omkar and Surji for helping.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stayed in Room 302, cockroaches. Had to get hit sprayed. Television of no use since only free channels.  Hot water a constraint,  had to regularly start geyser. Service very dicey. But ok for a day. Not for a longer duration.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Service was very good....and the room was very clean.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very bad service this lodge not good this is not secured service boy are very bad",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is way off as it is very far from the city. It is showing in OYO but there booking is done manually. It does not accept OYO bookings. Overall service was good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property situated near alandi markal road booked rooms per night rooms good double bed attached bathroom kichen hotel however staff arrange food outside staff polite thanks omkar surji helping",
                "stayed room cockroaches get hit sprayed television use since free channels hot water constraint regularly start geyser service dicey ok day longer duration",
                "service goodand room clean",
                "bad service lodge good secured service boy bad",
                "location way far city showing oyo booking done manually accept oyo bookings overall service good"
            ]
        }
    ]
}