{
    "places_with_reviews": [
        {
            "name": "GREEN ISLAND RESORT",
            "rating": [
                4.3
            ],
            "address": [
                "Poothotta East, Kanjiramattom, Ernakulam District, Kochi, Kerala 682315, India"
            ],
            "reviews": [
                {
                    "text": "Food: While the food quality was okay, the organization and serving were lacking, leading to limited portions. It’s recommended to increase the headcount to ensure enough food is available, especially after morning activities when guests are hungry. Pricing for non-vegetarian items seemed high, particularly for smaller portions.\n\nAmbience: The ambience was unsuitable for summer with minimal greenery to provide relief from the heat.\n\nRoom: Despite upfront requests for additional rooms, only one room was provided for a large group, leading to discomfort and frustration, especially after a long day of activities.\n\nSatisfaction: Overall, the experience was unsatisfactory, particularly in terms of organization and room allocation, making it not advisable for summer visits.\n\nActivities: While there were various activities available, guests felt rushed due to the emphasis on boating, which limited the time available for other activities.\n\nBoating: The promise of a well-equipped boat with equal seating wasn’t fulfilled, leading to discomfort and safety concerns for some guests. The quality of the boat was also below expectations compared to other services in the area.\n\nOverall, while the resort offers a range of activities, improvements in organization, room allocation, and boating services are needed to enhance guest satisfaction, particularly during peak seasons like summer.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Went for my team out. Costs 1000 per person with pool and meals.\n\nThe resort is situated on an island, and a boat is required to reach which they're providing.\n\nThere is a 3 hour boating through the lake, which is nice and relaxing.\n\nThe food was okayish. Service and other amenities were good.\n\nDefinitely recommend a one day team out.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best suited for a one day trip from Cochin. Rooms are available. I am not sure about the rooms as we went on a day trip which includes a boat ride which was quite good and lunch. The premises can be used till evening after lunch.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We  conduct a family get-together with around 200 people, they provide boat service to the island resort , kid friendly park, swimming pool, rooms are also neat and clean, meeting hall, variety of foods everything is ok,\nit could have been better if they provide a shop for everyone's daily needs, because being it's a small island there is no shop available to purchase our daily needs",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very bad customer service. Not properly attending the call to make a booking. Tried many times after a booking to confirm.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food food quality okay organization serving lacking leading limited portions itâ\u0080\u0099s recommended increase headcount ensure enough food available especially morning activities guests hungry pricing nonvegetarian items seemed high particularly smaller portions ambience ambience unsuitable summer minimal greenery provide relief heat room despite upfront requests additional rooms one room provided large group leading discomfort frustration especially long day activities satisfaction overall experience unsatisfactory particularly terms organization room allocation making advisable summer visits activities various activities available guests felt rushed due emphasis boating limited time available activities boating promise wellequipped boat equal seating wasnâ\u0080\u0099t fulfilled leading discomfort safety concerns guests quality boat also expectations compared services area overall resort offers range activities improvements organization room allocation boating services needed enhance guest satisfaction particularly peak seasons like summer",
                "went team costs per person pool meals resort situated island boat required reach theyre providing hour boating lake nice relaxing food okayish service amenities good definitely recommend one day team",
                "best suited one day trip cochin rooms available sure rooms went day trip includes boat ride quite good lunch premises used till evening lunch",
                "conduct family gettogether around people provide boat service island resort kid friendly park swimming pool rooms also neat clean meeting hall variety foods everything ok could better provide shop everyones daily needs small island shop available purchase daily needs",
                "bad customer service properly attending call make booking tried many times booking confirm"
            ]
        },
        {
            "name": "Silent River Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Vadakara.P.O Thalayolaparambu In ernakulam- kottayam route take left from Varickamkunnu, Thalayolaparambu, Velloor, Kerala 686605, India"
            ],
            "reviews": [
                {
                    "text": "I must commend your team for their impeccable service and attention to detail throughout our stay. The dedication and professionalism exhibited by every staff member, from the front desk to the dining area, were truly commendable. Special mention must be made of the culinary delights served at your resort. The food and beverages surpassed our expectations in both taste and presentation, and we found ourselves thoroughly enjoying every meal.It is evident that Silent River Resort takes great pride in providing its guests with an exceptional experience, and it certainly did not go unnoticed. Our time spent at your resort will be cherished for years to come, and we look forward to the opportunity to return in the future.Once again, thank you for making our stay at Silent River Resort a truly unforgettable one. Please extend our gratitude to your entire team for their outstanding hospitality and dedication.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Great place, with a great view of the lake. Had my brother bachelor's party here. Staff and owners were very much accomodating. This is also sorted for family and kids as well. Will be coming back for sure.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hy all,  It was great experience and very peacefully place to spend with family..They do have fishing facility, boating and kayaking. They provide delicious food and good service on time with out delay.. Overall nice trip for a day.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "There is a very good atmosphere here.  100% satisfied with our stay.  The staff are very friendly and supportive and they made our stay more comfortable.  Affordable price for us",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good experience,  they provide daily package and more . They have fishing facility,  boating and kayaking. They provide delicious food. Overall nice trip for a day.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "must commend team impeccable service attention detail throughout stay dedication professionalism exhibited every staff member front desk dining area truly commendable special mention must made culinary delights served resort food beverages surpassed expectations taste presentation found thoroughly enjoying every mealit evident silent river resort takes great pride providing guests exceptional experience certainly go unnoticed time spent resort cherished years come look forward opportunity return futureonce thank making stay silent river resort truly unforgettable one please extend gratitude entire team outstanding hospitality dedication",
                "great place great view lake brother bachelors party staff owners much accomodating also sorted family kids well coming back sure",
                "hy great experience peacefully place spend familythey fishing facility boating kayaking provide delicious food good service time delay overall nice trip day",
                "good atmosphere satisfied stay staff friendly supportive made stay comfortable affordable price us",
                "good experience provide daily package fishing facility boating kayaking provide delicious food overall nice trip day"
            ]
        },
        {
            "name": "Hotel Eden Garden",
            "rating": [
                3.8
            ],
            "address": [
                "Kottayam - Kanjiramattom Road, Ernakulam, Kochi, Kerala 682315, India"
            ],
            "reviews": [
                {
                    "text": "Peaceful and nice ambiance in food talk restaurant, tasy and Lot's of variety food, well maintained rooms, very good service and other staffs also, big parking area,\nBanquet is awesome, big and very beautiful.... Very nice place to take a break from your busy life. And the coffee shop, the Oh India Bar all are very nice.......\nAll the staff.... Thanks for your wonderful caring... ❤️❤️❤️",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It's a great experience that we stay in hotel eden garden    Rooms are very spacious with all amenities and high standard decor and furnish.  We get a fresh feel and also the staff of the hotel give as a great experience.......we really thankfull to them ....we love that time",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Star hotel in a village,tourists can stay here with family. Large banquettes available for functions with tasty food.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Wonderful hotel to stay with family and solo.. Rooms are very spacious with all amenities and high standard decor and furnish.\nFood at Straight Drive Restaurant is really yummy. Mm. Must try food is Turkish Shish Taouk and Chicken Crispers in Basket... Wowwww..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very nice food all atem super Good 👍👍👍👍 food",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "peaceful nice ambiance food talk restaurant tasy lots variety food well maintained rooms good service staffs also big parking area banquet awesome big beautiful nice place take break busy life coffee shop oh india bar nice staff thanks wonderful caring â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
                "great experience stay hotel eden garden rooms spacious amenities high standard decor furnish get fresh feel also staff hotel give great experiencewe really thankfull love time",
                "star hotel villagetourists stay family large banquettes available functions tasty food",
                "wonderful hotel stay family solo rooms spacious amenities high standard decor furnish food straight drive restaurant really yummy mm must try food turkish shish taouk chicken crispers basket wowwww",
                "nice food atem super good ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d food"
            ]
        },
        {
            "name": "Coconut Meadows",
            "rating": [
                4.7
            ],
            "address": [
                "Poothotta, east, Kanjiramattom, Kochi, Kerala 682315, India"
            ],
            "reviews": [
                {
                    "text": "Certainly a must visit. Had a great time with family.Excellent service and Breathtaking location with fun adventurous activities. Enjoyable for people of all ages. Food served was very nice and homely. 10/10 recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent  place to spend time with family and friends. The food served was good and homely. The water activities were truly a fun and adventurous experience.The best part about the boat ride was getting down in the middle of Vembanad lake. We had a wonderful experience at Coconut Meadows.The water activities kayaking and the bamboo rafting was truly a fun and adventurous experience.We had a great time at Coconut Meadows is a must try place..",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "My  family thoroughly enjoyed our visit to coconut meadows , finding solace and relaxation for our minds.\nThe caretakers’ exceptional hospitality added a special touch to our stay, making us feel welcomed and cherished.\nIndulging in delicious, homely food further enhanced our experience, satisfying both our appetites and souls.\nOne of the highlights was the remarkable assistance provided for photography, allowing us to capture precious moments effortlessly.\nOverall, our time at coconut meadows was a perfect blend of tranquility, warmth, and memorable experiences, leaving us longing to return.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "My visit to Coconut Meadows Resort was truly amazing. Arriving by boat was a delightful surprise, allowing me to enjoy the backwaters and sunset, setting the perfect scene. The staff were exceptionally polite and attentive, ensuring every detail was taken care of. The culinary experience surpassed expectations, with each dish highlighting Kerala's rich flavors. Overall, it was a magical experience that created cherished memories for years to come.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Coconut Meadow Resort, nestled in the serene surroundings of Ernakulam, Kerala, offers a tranquil retreat with a blend of comfort and natural beauty.\n\nFor those seeking adventure, Coconut Meadow Resort provides an array of water activities. Guests can enjoy a three-hour boating experience on Vembanad Lake, which is highly recommended for its breathtaking views and serene atmosphere. Additionally, the resort offers bamboo rafting, kayaking, and pedal boating, allowing visitors to explore the waters at their own pace.\n\nResort package is affordable and reasonable .",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "certainly must visit great time familyexcellent service breathtaking location fun adventurous activities enjoyable people ages food served nice homely recommended",
                "excellent place spend time family friends food served good homely water activities truly fun adventurous experiencethe best part boat ride getting middle vembanad lake wonderful experience coconut meadowsthe water activities kayaking bamboo rafting truly fun adventurous experiencewe great time coconut meadows must try place",
                "family thoroughly enjoyed visit coconut meadows finding solace relaxation minds caretakersâ\u0080\u0099 exceptional hospitality added special touch stay making us feel welcomed cherished indulging delicious homely food enhanced experience satisfying appetites souls one highlights remarkable assistance provided photography allowing us capture precious moments effortlessly overall time coconut meadows perfect blend tranquility warmth memorable experiences leaving us longing return",
                "visit coconut meadows resort truly amazing arriving boat delightful surprise allowing enjoy backwaters sunset setting perfect scene staff exceptionally polite attentive ensuring every detail taken care culinary experience surpassed expectations dish highlighting keralas rich flavors overall magical experience created cherished memories years come",
                "coconut meadow resort nestled serene surroundings ernakulam kerala offers tranquil retreat blend comfort natural beauty seeking adventure coconut meadow resort provides array water activities guests enjoy threehour boating experience vembanad lake highly recommended breathtaking views serene atmosphere additionally resort offers bamboo rafting kayaking pedal boating allowing visitors explore waters pace resort package affordable reasonable"
            ]
        },
        {
            "name": "Pranayakulam Homestay",
            "rating": [
                4.7
            ],
            "address": [
                "Mevelloor, Velloor, Kerala 686609, India"
            ],
            "reviews": [
                {
                    "text": "This place is a perfect place if you want to relax, meditate , sit and read books or simply sit on the river bank and do nothing. Highly recommended to fellow travellers",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "That was an amazing experience! This place is just magical, located around nature, directly next to the river. The family is so friendly and helpful. We really enjoyed to meditate every morning with Swami, who showed us many different techniques of meditation.\n\nOur room was big and comfortable, and homemade food always fresh and delicious. 10/10, I really recommend to stay! Thank you for amazing time, I hope to meet again :)",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Amazing experience! The food was tasty, healthy, abundant and very cheap. All of the people there treated us like part of the family. The garden (very big) and the views very fulfilling. Shala for yoga or meditation, with openness to the surroundings, to the lake and with beautiful sounds of nature. Meditation every morning at 8, the best way to start the day. Highly recommend it!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We had a great week at Pranayakulam Homestay. Ananth and his whole family are warm-hearted. We had fantastic food every day, a great meditation every morning, a nice boat tour and lots of time to relax and listen to the nature. We enjoyed every second and highly recommend it!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Located at the banks of muvattupuzha river, this place was our home for 4 days. We escaped from all the hustle and pollution of city and had a calm and peaceful 4 days. Even though it was a quick plan Ananth and family accomodated us. It was an escape from Bhrampuram fire and smoke and truly enjoyed the nature and fresh air. Now this place has turned the preferred vacation destination for our kids and will definitely come again.\nWith lots of love 💕",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place perfect place want relax meditate sit read books simply sit river bank nothing highly recommended fellow travellers",
                "amazing experience place magical located around nature directly next river family friendly helpful really enjoyed meditate every morning swami showed us many different techniques meditation room big comfortable homemade food always fresh delicious really recommend stay thank amazing time hope meet",
                "amazing experience food tasty healthy abundant cheap people treated us like part family garden big views fulfilling shala yoga meditation openness surroundings lake beautiful sounds nature meditation every morning best way start day highly recommend",
                "great week pranayakulam homestay ananth whole family warmhearted fantastic food every day great meditation every morning nice boat tour lots time relax listen nature enjoyed every second highly recommend",
                "located banks muvattupuzha river place home days escaped hustle pollution city calm peaceful days even though quick plan ananth family accomodated us escape bhrampuram fire smoke truly enjoyed nature fresh air place turned preferred vacation destination kids definitely come lots love ð\u009f\u0092\u0095"
            ]
        },
        {
            "name": "CENTRAL GARDENS",
            "rating": [
                4
            ],
            "address": [
                "V93X+FP, Kanjiramattom, Kerala 682315, India"
            ],
            "reviews": [
                {
                    "text": "5 star for Nice ambience and well maintained. But the food was not that good. We ordered chicken 65 and that was not well cooked. The masala was not cooked.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice bar. Calm and quiet atmosphere. Quality of food is ok. Ambience is good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Simply loved their food though we went there for a very late lunch at 4pm. The service staff was courteous too... the restrooms are very neat.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I visited your restaurant after the renovation and it looks great with ample parking space.moderate price range.  The ambience is so fascinating, enjoy the balcony view 🪟 chilled beer 🍻. Tried Beck's Ice beer with chilly beef 🍖. For me one bottle is enough to fly high 🤣. Chilly beef was soo delicious., kudos to the chef .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Stay experience was good. Food is reasonably priced",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "star nice ambience well maintained food good ordered chicken well cooked masala cooked",
                "nice bar calm quiet atmosphere quality food ok ambience good",
                "simply loved food though went late lunch pm service staff courteous restrooms neat",
                "visited restaurant renovation looks great ample parking spacemoderate price range ambience fascinating enjoy balcony view ð\u009fª\u009f chilled beer ð\u009f\u008d » tried becks ice beer chilly beef ð\u009f\u008d\u0096 one bottle enough fly high ð\u009f¤£ chilly beef soo delicious kudos chef",
                "stay experience good food reasonably priced"
            ]
        },
        {
            "name": "Vattathuruth island Lake Resort",
            "rating": [
                4.3
            ],
            "address": [
                "near Poothotta Bridge, Poothotta, Kanjiramattom, Kochi, Kerala 686585, India"
            ],
            "reviews": [
                {
                    "text": "Decent spot where you can get all the privacy you need. Went there with a group and had a good time there. Special mention to the handler, the evergreen cheerful old chap. Also went to the delta region, a large area with only waist deep water in the middle of the lake. Poothotta is a less explored part of the backwaters. Recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Wow wow wow... What an experience was that. Standing in the middle of the backwaters. It's a wonderful place with lot's of privacy. The facilities are limited so you're paying for the privacy and the service provided by the man named Sasi. He owns the whole credit if the positive review.\n\nThis is a small island and a 3 bedroom cottage. You have to take the boat to get there. It was really a nice experience.\nWhen it comes to the facilities there are three rooms with two attached bathrooms. One of the room have a/c. Refrigerator is there. Gas is there. The food can be either bought from outside or they will cook by themselves and serve.\nThey will charge extra 600 for a one hour boat ride through the backwaters. But it's a must try. Don't go for one hour. Take two hours and enjoy the whole ride. They will arrange both house boats and normal boats. If you want to get optimum output take the normal boat and explore. In the ride they will lead you to pambumkaav. That place is really beautiful. It's a narrow way so houseboats don't go through there.\nDuring the ride at a specific point they will allow to jumb into the backwaters. The water level is just upto the waist and you'll be in the middle of the backwaters.\n\nWhen it comes to the food they gave, we aren't satisfied. It was so spicy and doesn't had much taste. Even if the food was not good we all are satisfied with the place.\n\nSasi holds the whole credit. The lead us to the backwaters, Pambukaavu. He arranged fresh toddy and everything we wanted.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Ambiance is good.but the place is not at all hygienic",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best spot for staying with friends or family and best views worth the money",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good place. Toilet need to improve",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent spot get privacy need went group good time special mention handler evergreen cheerful old chap also went delta region large area waist deep water middle lake poothotta less explored part backwaters recommended",
                "wow wow wow experience standing middle backwaters wonderful place lots privacy facilities limited youre paying privacy service provided man named sasi owns whole credit positive review small island bedroom cottage take boat get really nice experience comes facilities three rooms two attached bathrooms one room ac refrigerator gas food either bought outside cook serve charge extra one hour boat ride backwaters must try dont go one hour take two hours enjoy whole ride arrange house boats normal boats want get optimum output take normal boat explore ride lead pambumkaav place really beautiful narrow way houseboats dont go ride specific point allow jumb backwaters water level upto waist youll middle backwaters comes food gave arent satisfied spicy doesnt much taste even food good satisfied place sasi holds whole credit lead us backwaters pambukaavu arranged fresh toddy everything wanted",
                "ambiance goodbut place hygienic",
                "best spot staying friends family best views worth money",
                "good place toilet need improve"
            ]
        },
        {
            "name": "Soma Kerala Palace",
            "rating": [
                4.2
            ],
            "address": [
                "Cochin -Kumarakom Near Murinjupuzha, Chempu P.O. Vaikom, Cochin College Rd, Chullickal, Kochi, Murinjupuzha, Kerala 686615, India"
            ],
            "reviews": [
                {
                    "text": "Very good resort with great views. The island is very good and neatly maintained. Even tough it is a island the hotel staff took great care to reach the island trough a boat. The view of fish nets and backwaters from the resort are awesome. Resort is full of coconut trees and nets tied to them for relaxing. Relaxing in the nets is awesome there.  Coming to the rooms, they are not much hifi but reasonably good and the food is a bit costly there. Overall it is a very good place to hangout for the weekend with family.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice hotel, is on a island so you don't have much food options of going outside! Service is exceptional and the resort is beautiful! Nice photographics places and a good view of sunsets too! There are other facilities like Yoga Hall, Swimming Pool and ayurvedic massages and all too which is a good try! The rooms are created like little homes and follow a wooden theme and all the rooms are made like seperate shacks! You have to order the food early as they don't keep anything ready and make it from scratch and hence the quality and taste of food is awesome! A must visit if you are around the area! Attaching some samples pics for reference!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It is a nice heritage hotel! Is on an island of its own in the backwaters with amazing views. Friendly and helpful staff. Very quiet and serene. They have a yoga center, a meditation area and a Ayurveda center with a variety of treatments. Is frequented by Germans tourists( they have a sizable collection of German literature! ) Its a great place if you are in a big group and want to relax. Not recommend for tourists because of remote location and the only way to get to the mainland is through a 10 minute boat ride.\nBook if you are planning to stay for more than a couple of days to soak up sun and rejuvenate. Do not make it a stop-over on a sightseeing tour. Food is wonderful but pricey! ( And there is no second option on the island)",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The resort is in a beautiful and well maintained location. The boat trip to reach the resort is also good and the food was also good to our tastes, HOWEVER from the moment we (9 family) entered the entire experience was totally pathetic.\n1) The room that we (2 adults, 2 kids ",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "They have reconstructed the old traditional heritage buildings brought in from other parts of kerala and put it up brick by brick in a private island. They will pick u up from their private jet and row u across the backwaters to reach this resort. It's a wonderful place. The food is great!  Staff very courteous and ambience just soothing!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good resort great views island good neatly maintained even tough island hotel staff took great care reach island trough boat view fish nets backwaters resort awesome resort full coconut trees nets tied relaxing relaxing nets awesome coming rooms much hifi reasonably good food bit costly overall good place hangout weekend family",
                "nice hotel island dont much food options going outside service exceptional resort beautiful nice photographics places good view sunsets facilities like yoga hall swimming pool ayurvedic massages good try rooms created like little homes follow wooden theme rooms made like seperate shacks order food early dont keep anything ready make scratch hence quality taste food awesome must visit around area attaching samples pics reference",
                "nice heritage hotel island backwaters amazing views friendly helpful staff quiet serene yoga center meditation area ayurveda center variety treatments frequented germans tourists sizable collection german literature great place big group want relax recommend tourists remote location way get mainland minute boat ride book planning stay couple days soak sun rejuvenate make stopover sightseeing tour food wonderful pricey second option island",
                "resort beautiful well maintained location boat trip reach resort also good food also good tastes however moment family entered entire experience totally pathetic room adults kids",
                "reconstructed old traditional heritage buildings brought parts kerala put brick brick private island pick u private jet row u across backwaters reach resort wonderful place food great staff courteous ambience soothing"
            ]
        },
        {
            "name": "RIVER LAND HOME STAY",
            "rating": [
                4.8
            ],
            "address": [
                "HOME STAY NJANDUKADU THURUTH, poothotta East. Kanjiramattom, Kerala 682315, Poothotta, Kattikkunnu, Kerala 682315, India"
            ],
            "reviews": [
                {
                    "text": "Very nice resort and home stay. Boating and other services are available. Reach to the resort is only through water means which gives us a different aspect for a water ride. Vehicle parking facilities are available ashore. Swimming areas in river are found where the boat service will lead us. Water activities, swimming at a knee level water and other sports can also be entertained there. In just simple words it's an affordable home stay for a family in a very good atmosphere in Kings way to spend your weekends. Fishing is also available. A small entertainment hall and dining area and food with T.V, Music etc are available. The resort is very much decorated with fishes and all in a variety manner (must explore). Many places nearby are there to visit. It was my first experience there and I'm absolutely flabbergasted. Planning next visit soon. So happy to give 5 up. 😊",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Clean and peaceful, an out of the way corner to kick back and relax with friend or family and comes with the option to take a tour of the water way on a cool boat. Day well spent.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It was totally amazing.The place was pretty awesome. Calm and quiet place...but experience is superb.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Really amazing experience, peace and quiet place. enjoy a lot.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A wonderful place for every age group",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice resort home stay boating services available reach resort water means gives us different aspect water ride vehicle parking facilities available ashore swimming areas river found boat service lead us water activities swimming knee level water sports also entertained simple words affordable home stay family good atmosphere kings way spend weekends fishing also available small entertainment hall dining area food tv music etc available resort much decorated fishes variety manner must explore many places nearby visit first experience im absolutely flabbergasted planning next visit soon happy give ð\u009f\u0098\u008a",
                "clean peaceful way corner kick back relax friend family comes option take tour water way cool boat day well spent",
                "totally amazingthe place pretty awesome calm quiet placebut experience superb",
                "really amazing experience peace quiet place enjoy lot",
                "wonderful place every age group"
            ]
        },
        {
            "name": "The River Queen",
            "rating": [
                "Unknown"
            ],
            "address": [
                "R9CV+FV, Kerala 686608, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}