{
    "places_with_reviews": [
        {
            "name": "Hotel Sai Panchvati",
            "rating": [
                4
            ],
            "address": [
                "Jagadmba Towers, Lane, Cinema Rd, opp. Gandhi Printing Press, Kumarpet, Mahalaxmiwada, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Nice place. May be because of how not busy it is room service is slow as is the dine-in restuarant service. Rooms were ok - linen was clean but walls had seepage damage",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Comfortable hotel with spacious rooms. Staff is friendly and there is late night room service available.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice place. May be because of how not busy it is room service is slow as is the dine-in restuarant service.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We stayed here for one night on our road trip and Considering a small city- Adilabad... It's a good hotel with all amenities. We had a good comfortable stay. Complementary breakfast was also good!  Room was pretty big enough and clean! Washroom also was clean. That's all we want from a hotel! ⭐⭐⭐⭐",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We habe booked this ona way to banglore from delhi, room was ok with lots of mosquitoes bed was ok but blanket was stained. We had paid 3500 for 3 people which is little costly for this place and underground parking was submerge inwater atleat 3-5 cm so not very good experince for me.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place may busy room service slow dinein restuarant service rooms ok linen clean walls seepage damage",
                "comfortable hotel spacious rooms staff friendly late night room service available",
                "nice place may busy room service slow dinein restuarant service",
                "stayed one night road trip considering small city adilabad good hotel amenities good comfortable stay complementary breakfast also good room pretty big enough clean washroom also clean thats want hotel â­\u0090â­\u0090â­\u0090â­\u0090",
                "habe booked ona way banglore delhi room ok lots mosquitoes bed ok blanket stained paid people little costly place underground parking submerge inwater atleat cm good experince"
            ]
        },
        {
            "name": "Hotel Ravi Teja",
            "rating": [
                3.5
            ],
            "address": [
                "N.H. No. 7, near Bus Stand, Vidya Nagar, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Worth to stay, ROOMS are very good and clean. I like there service and attitude towards customers. For business and corporates they offer special price which is best part",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Rooms are big\nToilet and washrooms cleaning need much improvement\nBedsheet cleanliness also much needed\n\nOwn parking space which is good\n1200 for AC room without AC running charges",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "We went to check the rooms and didn't stay as the rooms were not good.\n\nThey have a big parking areas inside their property.\n\nThey don't serve food.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Rooms are in very pathetic condition\nManagement should renovate the rooms\nIf I had any other options than, I wouldn't have stayed here\nIt was late at night around 1:30 am hence I stayed here as there was no other place to go as I had to sleep overnight but if I had any other options I wouldn't have stayed here at any cost\nThe views are pathetic\nSomeone excreted in front of my room as one of the photo suggest\nOnly thing good was air conditioner which was in working condition I didn't hope for the same\nPillows were bad inside the cover I couldn't go to sleep keeping in mind the condition of pillow inside the pillow cover\nBed sheet was also stained on multiple parts\nWalls were also not good\nOverall very pathetic experience\nI will describe the hotel as the hotel to go only when there is last resort\nCockroaches were seen roaming here and there\nPlace is not recommended at all.\nAvoid at all cost",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The hotel is not maintained properly at all.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worth stay rooms good clean like service attitude towards customers business corporates offer special price best part",
                "rooms big toilet washrooms cleaning need much improvement bedsheet cleanliness also much needed parking space good ac room without ac running charges",
                "went check rooms didnt stay rooms good big parking areas inside property dont serve food",
                "rooms pathetic condition management renovate rooms options wouldnt stayed late night around hence stayed place go sleep overnight options wouldnt stayed cost views pathetic someone excreted front room one photo suggest thing good air conditioner working condition didnt hope pillows bad inside cover couldnt go sleep keeping mind condition pillow inside pillow cover bed sheet also stained multiple parts walls also good overall pathetic experience describe hotel hotel go last resort cockroaches seen roaming place recommended avoid cost",
                "hotel maintained properly"
            ]
        },
        {
            "name": "KAKAKU The Guest House",
            "rating": [
                4.4
            ],
            "address": [
                "7-1-33/5, 1st Floor, NTR Square, Dwaraka Nagar, Ravindra Nagar Colony, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "This is an old facility and I found the food to be a little overpriced. However our stay was amazing. Never seen such great hospitality. This place should not be confused with a hotel, it’s a guest house and gives you a very homely “heritage homestay vibe” .\nSo if you are planning to stay here, better make arrangements for food at the reception beforehand. Best suited for people traveling from Bangalore and Hyderabad onwards to Varanasi or Jabalpur or vice versa. And yes, if the owner is in town, don’t miss the delicious chicken curry prepared by him. Net net, I will choose this place for its hospitality, pleasant and supportive staff and a charming owner with great culinary skills.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Didn't expect such a beautiful guest house in the small town of Adilabad! Rooms are great, neat and tidy, decorated. The location is bit odd having narrow lanes with no parking, and a alcohol shop located nearby. There is one person in the reception, who received cordially, but there is no watchman. There are 5 rooms, each with different capacity. There is also a hall, and Verandah, separate self serving kitchen with dining hall.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had a great stay here. Very cooperative staff especially Shiva and Amjad. Well decorated and highly maintained guesthouse. The staff are very friendly, the food is good. Very beautiful furniture and decor too. Felt like Goa honestly ✨",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms are very clean and neat . Ambience are very nice . Receptionist is communicating really soft . Price is high but totally value for money 👌.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The road in front is very narrow and has a cheap Liquor store (crowded) adjacent to the stay and it is highly unsafe and specially not recommended for families.\n\nPathetic experience. We thought of booking a decent stay with family without bothering for the expense (cost). Rooms are small with too much plastic stuff (unnecessary) and very less useful space inside and outside the rooms. It is a very congested place and feels claustrophobic.\n\nParking is not available.\n\nFor the cost there's hardly any amenities, Not a working TV (without recharge if available), a decent closet, water kettle.\n\nThe bedsheets were not soft and clean, blanket were smelly.\n\nFood is expensive and below average in taste.\n\nThere was Hiccups in the room allotment process. The caretaker (obviously with owners involvement) tried to cheat us for a double Deluxe room instead of booking triple deluxe room (with prior full payment). After a long confrontation they gave us the room booked. The worst is that they did not had the courtesy to accept their mistake. They took 2 bookings for the same room that day and the other family had to suffer.\n\nThe staff is not courteous and professional.\nOverall an underwhelming experience and highly unrecommended.\n\nPlease do not waste your hard earned money, there are decent places in Adilabad at cheaper cost.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "old facility found food little overpriced however stay amazing never seen great hospitality place confused hotel itâ\u0080\u0099s guest house gives homely â\u0080\u009cheritage homestay vibeâ\u0080\u009d planning stay better make arrangements food reception beforehand best suited people traveling bangalore hyderabad onwards varanasi jabalpur vice versa yes owner town donâ\u0080\u0099t miss delicious chicken curry prepared net net choose place hospitality pleasant supportive staff charming owner great culinary skills",
                "didnt expect beautiful guest house small town adilabad rooms great neat tidy decorated location bit odd narrow lanes parking alcohol shop located nearby one person reception received cordially watchman rooms different capacity also hall verandah separate self serving kitchen dining hall",
                "great stay cooperative staff especially shiva amjad well decorated highly maintained guesthouse staff friendly food good beautiful furniture decor felt like goa honestly â\u009c¨",
                "rooms clean neat ambience nice receptionist communicating really soft price high totally value money ð\u009f\u0091\u008c",
                "road front narrow cheap liquor store crowded adjacent stay highly unsafe specially recommended families pathetic experience thought booking decent stay family without bothering expense cost rooms small much plastic stuff unnecessary less useful space inside outside rooms congested place feels claustrophobic parking available cost theres hardly amenities working tv without recharge available decent closet water kettle bedsheets soft clean blanket smelly food expensive average taste hiccups room allotment process caretaker obviously owners involvement tried cheat us double deluxe room instead booking triple deluxe room prior full payment long confrontation gave us room booked worst courtesy accept mistake took bookings room day family suffer staff courteous professional overall underwhelming experience highly unrecommended please waste hard earned money decent places adilabad cheaper cost"
            ]
        },
        {
            "name": "Mangalamurthy Hotels",
            "rating": [
                4.5
            ],
            "address": [
                "Andhra Bank Building, Cinema Rd, Mahalaxmiwada, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Stayed here in Jan 2024 with family.\n1. Food quality is good.\n2. Coffee was good. They accommodated requests.\n3. They offered us 2 complimentary breakfasts.\n\nBut overall experience was not great since\n1. There were ants in the room.\n2. The cleanliness is not up to the mark. The old guests had left the old soap and it wasn't cleaned.\n3. No drinking water was given at the time of check-in. Then later, they charged us for the bottles we requested. Albeit they removed the charge after pointing it out.\n4. Check out time was changed and we were informed at the last minute during breakfast.\n5. Keeping the luggage in the reception or lounge is also not allowed. We had to haul the luggage around till the train departure timing.\n6. The staff had a loud verbal fight in front of my family. Perceivably about the confusion of our checkout.\n7. They did not offer any help in booking cabs or auto rickshaws.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Stayed here in Jan 2024.\n1.Food quality is good.\n2. Coffee was good.\n3. They offered us 2 breakfasts.\n\nBut overall experience was not great since\n1. There were ants in the room.\n2. The cleanliness is not upto the mark. The old guests had left the old soap and it wasn't cleaned.\n3. No drinking water was given at time of check in.\n4. Late check out is not allowed.\n5. Keeping the luggage in the reception is also not allowed.\n6. The staff had a loud verbal fight in front of my family.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The best thing for this hotel is the location and parking in center of city. All and all the rooms are neat and clean ... service was also apt in my short stay at this property.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The Services are quite good, and also liked the Food here.\nRecommended.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Wow super hotel. It is one of the most cleaned and luxury hotel in Adilabad. It's quality and ambience is to good. The hospitality is also good. The food was to good It is very tasty. Specially I liked the breakfast.  Super hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed jan family food quality good coffee good accommodated requests offered us complimentary breakfasts overall experience great since ants room cleanliness mark old guests left old soap wasnt cleaned drinking water given time checkin later charged us bottles requested albeit removed charge pointing check time changed informed last minute breakfast keeping luggage reception lounge also allowed haul luggage around till train departure timing staff loud verbal fight front family perceivably confusion checkout offer help booking cabs auto rickshaws",
                "stayed jan food quality good coffee good offered us breakfasts overall experience great since ants room cleanliness upto mark old guests left old soap wasnt cleaned drinking water given time check late check allowed keeping luggage reception also allowed staff loud verbal fight front family",
                "best thing hotel location parking center city rooms neat clean service also apt short stay property",
                "services quite good also liked food recommended",
                "wow super hotel one cleaned luxury hotel adilabad quality ambience good hospitality also good food good tasty specially liked breakfast super hotel"
            ]
        },
        {
            "name": "Dwaraka Hotel.",
            "rating": [
                3.7
            ],
            "address": [
                "MGCJ+6J2, Dwaraka Nagar, Ravindra Nagar Colony, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "All the hotel staff were well behavedand Room was good but price is a bit high compared to other places",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very good hotel, low cost, best bed, best rooms, best toilet, everything is good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We chose this Hotel for an overnight stay for family. There are not too many hotels in Adilabad and this one would be among top 5 hotels. I think we checked all hotels and lodges in the town before getting into this one. Some hotels didn't have room and some didn't have parking. Most of the hotels were in delapitated conditions. This one was atleast decent hotel with clean room, clean toilet and linens.\nStaffs were cordial and tried to help us with all our requirements. Ok for an overnight stay if you are not looking for luxury.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Rooms at not upto mark ....no geyser in the room.no towel or soap is provided.not value for money",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "1. Hot water facility is good.\n2. Car parking is available.\n3. Staff behaviour is good.\n4. Rooms are in neat and clean.\n5. Wash rooms are good and hygienic.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel staff well behavedand room good price bit high compared places",
                "good hotel low cost best bed best rooms best toilet everything good",
                "chose hotel overnight stay family many hotels adilabad one would among top hotels think checked hotels lodges town getting one hotels didnt room didnt parking hotels delapitated conditions one atleast decent hotel clean room clean toilet linens staffs cordial tried help us requirements ok overnight stay looking luxury",
                "rooms upto mark geyser roomno towel soap providednot value money",
                "hot water facility good car parking available staff behaviour good rooms neat clean wash rooms good hygienic"
            ]
        },
        {
            "name": "Hotel New Krishna Lodge",
            "rating": [
                4.2
            ],
            "address": [
                "bustand, Vidya Nagar, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Kashmir to Kanyakumari Cycling - We had stayed here in Feb 2024 during our expedition. This was the only city where we had to go to different hotels to find a room with decent parking space for our cycles.\n\nThe people in general I noticed are a bit shrude in this town. Room and washroom was decent though you have to walk all the way up since there are no lifts.\n\nThe caretaker brought us dinner from outside which was good too. We were able to park our cycles in the gates garage. Okay for a one night short stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stayed in New Krishna Hotel Adilabad. Really enjoyed the stay. I recommend everyone. Nice decent location and good staff response made my stay very enjoyable. Thanks",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Super sarvice and rooms also very nice good 👍 bathroom also super nitnice and locection alao good super parking also available safe parking good hotel stay for adilabad very nice super 💫👌........\n\nMeagment karan and vilash is super respone given good 👍 room sarvice also very nice 👍 ........\n\nI like it and iam happy to stay in this hotel 👌👌👌👌💫💫👌💫👌💫💫💫💫👌",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Highly experience with hotel management team. Good rooms and stay calm. Recommended to add one time food for free too.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Super service and rooms also very nice good bathroom also nitnices super hotel for stay in adilabad plz stay for this hotel nice good  i like it and manejment also good respons given to me karan villash is very nice management super good 👍👍👍👍👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "kashmir kanyakumari cycling stayed feb expedition city go different hotels find room decent parking space cycles people general noticed bit shrude town room washroom decent though walk way since lifts caretaker brought us dinner outside good able park cycles gates garage okay one night short stay",
                "stayed new krishna hotel adilabad really enjoyed stay recommend everyone nice decent location good staff response made stay enjoyable thanks",
                "super sarvice rooms also nice good ð\u009f\u0091\u008d bathroom also super nitnice locection alao good super parking also available safe parking good hotel stay adilabad nice super ð\u009f\u0092 « ð\u009f\u0091\u008c meagment karan vilash super respone given good ð\u009f\u0091\u008d room sarvice also nice ð\u009f\u0091\u008d like iam happy stay hotel ð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0092 « ð\u009f\u0092 « ð\u009f\u0091\u008cð\u009f\u0092 « ð\u009f\u0091\u008cð\u009f\u0092 « ð\u009f\u0092 « ð\u009f\u0092 « ð\u009f\u0092 « ð\u009f\u0091\u008c",
                "highly experience hotel management team good rooms stay calm recommended add one time food free",
                "super service rooms also nice good bathroom also nitnices super hotel stay adilabad plz stay hotel nice good like manejment also good respons given karan villash nice management super good ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Hotel Adilabad Lodge",
            "rating": [
                3.8
            ],
            "address": [
                "Door No 4-56 Beside Punjab National Bank walk able from Bus Stand Old, NH 44, Vidya Nagar, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Zabardast lodge\nThey arange kuntala waterfall tour\nTippeswar wild life\nand kawal reserve forest\n\nThey have helped us and arranged car to visit places",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Decent hotel to stay near the bus Stop, can improve a bit on their rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very good hotel\n\nFriendly people\n\nCan visit",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Usually i don't write a negative review as i know how hard it is to run any ihotel. But..this is exceptional.\nWriting this review at 7:52 morning, we are bikers n checked in at 3 o clock morning itself as we got tired. As the AC room was costly we opted for non AC which is 1000 rupees but now at 7:30 i am sweating profusely as fan not working, they r saying they can't on generator. We r traveling from past 32 days m it's my Worst experience in hotel stay. Rooms are not so clean n bedsheets were stains they changed our bedsheets after i told them, bathroom is smelly u can't sit for more than 5 mins in toilet.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It’s good\nAnd safe 😊",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "zabardast lodge arange kuntala waterfall tour tippeswar wild life kawal reserve forest helped us arranged car visit places",
                "decent hotel stay near bus stop improve bit rooms",
                "good hotel friendly people visit",
                "usually dont write negative review know hard run ihotel butthis exceptional writing review morning bikers n checked clock morning got tired ac room costly opted non ac rupees sweating profusely fan working r saying cant generator r traveling past days worst experience hotel stay rooms clean n bedsheets stains changed bedsheets told bathroom smelly u cant sit mins toilet",
                "itâ\u0080\u0099s good safe ð\u009f\u0098\u008a"
            ]
        },
        {
            "name": "Dhana Lakshmi Hotel",
            "rating": [
                3.7
            ],
            "address": [
                "MGGM+J4X, Punjab chowk, Mahalaxmiwada, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Hotel was good for a day or two stay. Its accessibility was the main reason for me to choose this hotel, the room were spic and span. Try to reach this hotel before 11 PM, else there is the owner who acts like a grandmother and closes the door to the lodge post that. Staying at this hotel reminded me of Indian coffee house popularly known as ICH. Try to get food before the lodge closes. Hotel rooms comes with balcony also which is a huge plus at this price point.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It's near to railway station..and old hotel but avarage rooms .ok..",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Only one person which was at reception counter incharge was poor in nature not friendly\n\nIn this hotel there is no online payment taken only cash was taken and no printed bill was given by him",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice Hotel.. Clean and Hygienic.. Best choice for stay…",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "One of the old hotels in Adilabad. Though it is located on the main raod it is difficult to find. Fortunately the room in which we were staying was having a working AC. Average hotel, obviously with no Amenities. Overall good hotel to stay for one day or so.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel good day two stay accessibility main reason choose hotel room spic span try reach hotel pm else owner acts like grandmother closes door lodge post staying hotel reminded indian coffee house popularly known ich try get food lodge closes hotel rooms comes balcony also huge plus price point",
                "near railway stationand old hotel avarage rooms ok",
                "one person reception counter incharge poor nature friendly hotel online payment taken cash taken printed bill given",
                "nice hotel clean hygienic best choice stayâ\u0080¦",
                "one old hotels adilabad though located main raod difficult find fortunately room staying working ac average hotel obviously amenities overall good hotel stay one day"
            ]
        },
        {
            "name": "Tirumala Lodge",
            "rating": [
                3.2
            ],
            "address": [
                "NH 7ROAD, BACK SIDE OF VAGDEVI COLLEGE, near BUS STAND, Vidya Nagar, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "Washroom not working. Rooms were not clean. Zero rating.",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "Right from manager to service boys are grouped and liers , I'm a retired range officer ,my name is John Bennet raj from Hyderabad.",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "In june 2021, I stayed here when I'm traveling from hyderabad to ladakh with my activa",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "washroom working rooms clean zero rating",
                "right manager service boys grouped liers im retired range officer name john bennet raj hyderabad",
                "june stayed im traveling hyderabad ladakh activa"
            ]
        },
        {
            "name": "Mamtha lodge",
            "rating": [
                3.6
            ],
            "address": [
                "Adilabad - Nagpur Rd, Punjab chowk, Bhagya Nagar, Bhuktapur, Adilabad, Telangana 504001, India"
            ],
            "reviews": [
                {
                    "text": "The worst lodge & Rooms are not clean , they don't have lights also",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Poor maintenance....not good",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Excellent service and facilities",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Worst and not clean",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good behaviour",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst lodge rooms clean dont lights also",
                "poor maintenancenot good",
                "excellent service facilities",
                "worst clean",
                "good behaviour"
            ]
        }
    ]
}