{
    "places_with_reviews": [
        {
            "name": "Hotel Regency",
            "rating": [
                4.1
            ],
            "address": [
                "B-49, Mac Donald Hill, Zarkawt, Aizawl, Mizoram 796007, India"
            ],
            "reviews": [
                {
                    "text": "Most third class quality hotel. No value for money. They will provide you small single bedrooms instead of double room price.\nGood quality is worst. No service at buffet. No person will be there to serve. Foods will be kept insufficient in breakfast.\nDon't go for this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Probably among the best hotels in Aizawl. Had a really good experience. The staff are excellent and the restaurant serves fantastic food.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I am not a usual guy who gives a review. When something different happens it matters. I always travel around and stay at good hotels. I was amazed by the efficiency of service and politeness and readiness to do things here. They treat you with a personal touch. Amazing. I have no say for the room as it never served the purpose. But yes the service O got never got me to think of my room. Room was good just 2 single beds instead of a king size. I checked in as 2 adults and 1 child. I still never understood why I got 2 single bed. My son fell of many times from the bed while sleeping as he had to sleep with one of us in a single bed. Otherwise amazing.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food was not up to the mark. Below average taste including breakfast items served cold. Service was professional but the friendly personal touch was missing. The hotel is usually full and hence the overall attitude of the staff was on a \"take it or leave it\" lines.\n\nRooms were clean but the overall quality was not of the type one expects from a supposed top ranked hotel in the city.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Supposed to be the best place to stay in aizawl, breakfast should improve a lot for the charges they are levying, never go for non ac rooms which are the only ones available at makemytrip, better call them and check it out. They need to improve a lot and their staff needs to work on ensuring better customer service. The house keeping also needs to improve, the bathrooms stink and they need to work upon the same.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "third class quality hotel value money provide small single bedrooms instead double room price good quality worst service buffet person serve foods kept insufficient breakfast dont go hotel",
                "probably among best hotels aizawl really good experience staff excellent restaurant serves fantastic food",
                "usual guy gives review something different happens matters always travel around stay good hotels amazed efficiency service politeness readiness things treat personal touch amazing say room never served purpose yes service got never got think room room good single beds instead king size checked adults child still never understood got single bed son fell many times bed sleeping sleep one us single bed otherwise amazing",
                "food mark average taste including breakfast items served cold service professional friendly personal touch missing hotel usually full hence overall attitude staff take leave lines rooms clean overall quality type one expects supposed top ranked hotel city",
                "supposed best place stay aizawl breakfast improve lot charges levying never go non ac rooms ones available makemytrip better call check need improve lot staff needs work ensuring better customer service house keeping also needs improve bathrooms stink need work upon"
            ]
        },
        {
            "name": "Aizawl Guest House",
            "rating": [
                4.3
            ],
            "address": [
                "PHE Bill Pekna Bul, Laipuitlang Rd, Laipuitlang, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "Very bad service. I stayed for 2 days. Every morning I have to asked for hot water and they are unable to give.They always switch off Geyser intentionally. Very bad food. Only bread and egg, and 1  Banana in their breakfast. Moreover surprisingly  they charged security deposit when a person goes their, even after paying the all bill in advance. My company has already make payment but when I reached hotel , they are asking for Rs. 2000 as security deposit. And they also asked to me go other places if I am unable to pay the deposit. Very rude behaviour. Don't go that place, it is outskirt of the city.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This property has great views from the rooms with balcony. But everything else is below par.  Maintenance and food are very poor. Old room where we stayed for dirt three nights are not fit for staying by any standards.Newly built upper rooms are so cramped that we couldn’t sleep till the next door guests went silent after 11 pm.\n\nThe free breakfast is a joke. No varieties. Stuff doesn’t bother to clean the tables in the so called dining room where you must go for the breakfast.\n\nWe stayed here for three times - a total of five nights. Honestly, we would have looked for other options if all of our are bookings were not pre-paid and refundable.\n\nWe booked our stays considering the review scores on various platforms. It was a big time mistake.\n\nWe failed to understand if this place is hotel or a homestay. It has no convenience if a hotel and no warmth of a home stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Just Amazing!! Mary was such a gem of a person. Always greeting with a smile and ready to help whenever you call her. I had booked a long stay in short intervals as I had to travel the whole of Mizoram for 15 days and she took care of my stay at Aizawl. The rooms provided were just amazing, I got a rooms with stunning Birds Eye view of Aizawl city get and your own Oven, Gas stove, washing machine and fridge along with eatables like Chips, Wai-wai, juice and biscuits . Clean rooms with superb beds and spick and span washrooms. They provide pick up and drop from airport along with cab service for site seeing. Definitely recommending others when in Aizawl. Keep it up Mary🫡",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I have stayed more than 2 days. For family members it's really wonderful. You all can feel like home.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "My second stay, this year, at this property. From the time that I had first visited in July, I noticed a lot of improvement in infrastructure. Ms. Mary Anne, the Manager of the property has achieved wonders in a short span of time. The new wing is very beautiful.\n\nDon't expect star category service because you aren't paying for it. Rooms and bathrooms are spotless clean. Mary Anne is still in the process of streamlining the ancillary services like tours and drivers, etc.\n\nOut of the 4 drivers who were at our service (airport pickup, city tour 1, city tour 2, airport drop), two were absolute gems, one was a cheating rogue and one was a sweet, well mannered and not too knowledgeable kid. Ask for Mr. David, he is brilliant driver and guide.\n\nI would advise guests to exercise patience and treat the hotel staff with respect to get the best out of them. If you don't speak Mizo, please speak English or Hindi with the staff, slowly.\n\nPlease remember that this is a guest house and not a hotel and facilities are limited. However, the amenities will improve over time. Some rooms are equipped with Microwave ovens, gas cooking stove, all utensils, etc. You may opt for these rooms if you wish to get things as per your schedule and convenience. This, being a guest house, has its own rules and timings which may not be convenient for all.\n\nI experienced wonderful service from Ms. Mary Anne and her elderly aunt (who is the owner of the property). This lady went out of her way, despite her advanced age, to keep me happy and meet my personal requests for Dragon fruit, Passion fruit and Avocados. It is not something that every property owner will do.\n\nTo sum up, if you want a spectacular view of Aizawl and if you like the sound of children laughing and playing - stay at this property and you won't regret it.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad service stayed days every morning asked hot water unable givethey always switch geyser intentionally bad food bread egg banana breakfast moreover surprisingly charged security deposit person goes even paying bill advance company already make payment reached hotel asking rs security deposit also asked go places unable pay deposit rude behaviour dont go place outskirt city",
                "property great views rooms balcony everything else par maintenance food poor old room stayed dirt three nights fit staying standardsnewly built upper rooms cramped couldnâ\u0080\u0099t sleep till next door guests went silent pm free breakfast joke varieties stuff doesnâ\u0080\u0099t bother clean tables called dining room must go breakfast stayed three times total five nights honestly would looked options bookings prepaid refundable booked stays considering review scores various platforms big time mistake failed understand place hotel homestay convenience hotel warmth home stay",
                "amazing mary gem person always greeting smile ready help whenever call booked long stay short intervals travel whole mizoram days took care stay aizawl rooms provided amazing got rooms stunning birds eye view aizawl city get oven gas stove washing machine fridge along eatables like chips waiwai juice biscuits clean rooms superb beds spick span washrooms provide pick drop airport along cab service site seeing definitely recommending others aizawl keep maryð\u009f « ¡",
                "stayed days family members really wonderful feel like home",
                "second stay year property time first visited july noticed lot improvement infrastructure ms mary anne manager property achieved wonders short span time new wing beautiful dont expect star category service arent paying rooms bathrooms spotless clean mary anne still process streamlining ancillary services like tours drivers etc drivers service airport pickup city tour city tour airport drop two absolute gems one cheating rogue one sweet well mannered knowledgeable kid ask mr david brilliant driver guide would advise guests exercise patience treat hotel staff respect get best dont speak mizo please speak english hindi staff slowly please remember guest house hotel facilities limited however amenities improve time rooms equipped microwave ovens gas cooking stove utensils etc may opt rooms wish get things per schedule convenience guest house rules timings may convenient experienced wonderful service ms mary anne elderly aunt owner property lady went way despite advanced age keep happy meet personal requests dragon fruit passion fruit avocados something every property owner sum want spectacular view aizawl like sound children laughing playing stay property wont regret"
            ]
        },
        {
            "name": "Royale Lalawi Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "House No: D, 7, Khatla, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "I stayed 40 days in this hotel and will love to come back again. Had a room with a great view. One that you can live with for 40 days and cherish. The rooms are very cozy with full floor carpeting. The rooms are big and the linen is absolutely fresh. It’s absolutely neat and clean. The staff is young but very courteous and helpful. I became friends with most. The breakfast is decent.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The place has poor parking space. The place has no lift and you have to carry all the bags from the road to their reception which is almost two floors.  Then they have a lift which is a matchbox and only fits 3-5 pax max and no bags.  Room's were ok.  Breakfast spread was sufficient however service was slow and there were almost no refills for hot items or even juices and fruits.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It is a good 3 star hotel. For its class and promise, it delivers value for money. Good clean rooms, good food, friendly staff and well located within Aizawl. Rooms offer great views of cloud swept hills. Enjoyed the stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Excellent in all respect. One experience stands out which I would like to share.  I hired a car from the hotel to drop me to Airport. While getting down at Airport I forgot to take my selfie-stick and left it in the car. After 10-15 minutes I realised and called up the hotel reception informing about it. The driver came back in search for me and handed over the selfie-stick. Thank you Hotel Royale Lalawi.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The Building and Location is good.. let's point out the worst part\n1) some of the staff always drunk and smell like  Shikar , smoke\n2) The restaurant staff doesn't behave well becuz they talk in a very loud voice in a counter area\n3) Restaurant wash room next to the kitchen was soooo freaking  dirty , even Guest  & Staff are sharing The same wash/ rest room\n4) Restaurant table cloth was soooo dirty , they should remove the cloth because the table without cover look more good & Classy\n5) restaurant staff grooming was not up to the mark especially Girls .\n6) Restaurant was sooo dirty ,, I think HK never clean the restaurant.\n7) For senior citizens better not stay in this hotel , the elevator and Lobby was on 2nd Floor . Taking stairs when you are tired and not feeling  will makes you  uncomfortable & dizzy\n8) kitchen Service was toooo slow ..... During my stay I always have food outside ...\n9) HK performance is not very good , stairs are not cleaned , My room HK service was very unprofessional.\n10) Owner family & relatives are more important than the Guest ...( as I heard from some staff , they need give VVIP service to owner and their relatives and friends.)\n\nLastly I never recommend this hotel if you want a good service...... Room was good for to stay ... But Kitchen , restaurant,Hk service was not good...",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed days hotel love come back room great view one live days cherish rooms cozy full floor carpeting rooms big linen absolutely fresh itâ\u0080\u0099s absolutely neat clean staff young courteous helpful became friends breakfast decent",
                "place poor parking space place lift carry bags road reception almost two floors lift matchbox fits pax max bags rooms ok breakfast spread sufficient however service slow almost refills hot items even juices fruits",
                "good star hotel class promise delivers value money good clean rooms good food friendly staff well located within aizawl rooms offer great views cloud swept hills enjoyed stay",
                "excellent respect one experience stands would like share hired car hotel drop airport getting airport forgot take selfiestick left car minutes realised called hotel reception informing driver came back search handed selfiestick thank hotel royale lalawi",
                "building location good lets point worst part staff always drunk smell like shikar smoke restaurant staff doesnt behave well becuz talk loud voice counter area restaurant wash room next kitchen soooo freaking dirty even guest staff sharing wash rest room restaurant table cloth soooo dirty remove cloth table without cover look good classy restaurant staff grooming mark especially girls restaurant sooo dirty think hk never clean restaurant senior citizens better stay hotel elevator lobby nd floor taking stairs tired feeling makes uncomfortable dizzy kitchen service toooo slow stay always food outside hk performance good stairs cleaned room hk service unprofessional owner family relatives important guest heard staff need give vvip service owner relatives friends lastly never recommend hotel want good service room good stay kitchen restauranthk service good"
            ]
        },
        {
            "name": "Hotel Dinthar Zara",
            "rating": [
                4.6
            ],
            "address": [
                "DT-12, Zawlphei St, beside Taxi Stand, Dinthar Veng, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "This is one of the nicest hotels that I have stayed in, mainly because of the stunning views and newly constructed, clean and tidy rooms. Breakfast is also complimentary and the taxi stand is also nearby. Overall, it is a very nice budget accommodation in Aizawl. Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Had a wonderful stay here. Fine quality food and welcoming staff.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "It's a good hotel, staff is very hepful, kitchen is very neat and clean, rooms are very good, food is good, view from there is very good.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Spent some wonderful time here in Aizawl. Wonderful staff with amazing view of city.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I had a wonderful experience at Hotel Dinthar Zara. The staff was extremely friendly and attentive to my needs!. The rooms were very comfortable and clean, providing a peaceful and relaxing stay. The food at the on-site restaurant was delicious, and the service was exceptional. The hotel's location is perfect for exploring the city, with many popular sites and attractions within walking distance. Its a great place to stay during their travels.\"",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one nicest hotels stayed mainly stunning views newly constructed clean tidy rooms breakfast also complimentary taxi stand also nearby overall nice budget accommodation aizawl highly recommended",
                "wonderful stay fine quality food welcoming staff",
                "good hotel staff hepful kitchen neat clean rooms good food good view good",
                "spent wonderful time aizawl wonderful staff amazing view city",
                "wonderful experience hotel dinthar zara staff extremely friendly attentive needs rooms comfortable clean providing peaceful relaxing stay food onsite restaurant delicious service exceptional hotels location perfect exploring city many popular sites attractions within walking distance great place stay travels"
            ]
        },
        {
            "name": "Emerald Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "PPG9+C6G, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "Dear Emerald Te am,\n\nI recently had the pleasure of staying at your hotel, and overall, my experience was positive. The cleanliness of the rooms and common areas was commendable, and the staff had to improve a little bit in professionalism but the friendliness was outstanding\n\nI appreciated the variety of amenities offered. However, I would suggest the room services(Glass Water Bottle to change continuously)and F&B Team(Serving period)to improvement as it could enhance the overall guest experience.\n\nThank you for a pleasant stay, and I look forward to considering your hotel for future visits.\n\nBest regards,\nBiaklawma",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Stayed in a ‘double room’ which was decent but on the smaller side. The room had a new 55 inch tv which doesn’t work. However, service needs much more improvement, there was no hot water in shower. Staff is hospitable but needs more training to be professional. Coming to food, had a mixed experience at the restaurant. Staff is excellent but they take long time to serve food. Chinese and continental items are better than the Indian section. Breakfast served was skeletal.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Pros:\nRooms were vey clean.\nFood here was very tasty and hygiene.\nNear to many government offices.\nStaff is very cooperative and helpful.\nCons:\nIf you want to enjoy TV then wifi should be available. Because sometimes this wifi goes down.\nBreakfast had very little options.\nNo good view from room (except few rooms)",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "DO NOT BOOK THIS HOTEL! I specifically called ahead to ask about the family suite. On the website it says it allows 4 adults and 2 children. I asked how many beds the room comes and was told it had 2 beds. I booked the room and upon arrival was shown the room that only has 1 king bed inside and a sitting room separate. They said I could get an extra mattress on the floor for a fee. The room was so dirty and still under construction. The floor was covered in black filth that left our feet so dirty. The shower drain was completely plugged and no flow. No hotel slippers were provided. No hot water kettle was provided. No table was provided. For 9,000 ruppee a night, I expected far more. I found worms and other insects in the bathroom. There was no accomodations provided by management for the complete inadequate room provided. The entire staff needs retraining in international hotel hospitality. Rooms need to have the highest standard of cleaning.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "it's a decent hotel the location is great,  rooms are fine and pretty decent as well. The staffs are good and easy to interact with, appreciate their efforts for showing kindness and love towards their customers as it can be seen through their  actions but the hotel maintenance is bad and the manager should take a quick action in fixing the geezer because it's cold now. Overall it's fine",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dear emerald te recently pleasure staying hotel overall experience positive cleanliness rooms common areas commendable staff improve little bit professionalism friendliness outstanding appreciated variety amenities offered however would suggest room servicesglass water bottle change continuouslyand fb teamserving periodto improvement could enhance overall guest experience thank pleasant stay look forward considering hotel future visits best regards biaklawma",
                "stayed â\u0080\u0098double roomâ\u0080\u0099 decent smaller side room new inch tv doesnâ\u0080\u0099t work however service needs much improvement hot water shower staff hospitable needs training professional coming food mixed experience restaurant staff excellent take long time serve food chinese continental items better indian section breakfast served skeletal",
                "pros rooms vey clean food tasty hygiene near many government offices staff cooperative helpful cons want enjoy tv wifi available sometimes wifi goes breakfast little options good view room except rooms",
                "book hotel specifically called ahead ask family suite website says allows adults children asked many beds room comes told beds booked room upon arrival shown room king bed inside sitting room separate said could get extra mattress floor fee room dirty still construction floor covered black filth left feet dirty shower drain completely plugged flow hotel slippers provided hot water kettle provided table provided ruppee night expected far found worms insects bathroom accomodations provided management complete inadequate room provided entire staff needs retraining international hotel hospitality rooms need highest standard cleaning",
                "decent hotel location great rooms fine pretty decent well staffs good easy interact appreciate efforts showing kindness love towards customers seen actions hotel maintenance bad manager take quick action fixing geezer cold overall fine"
            ]
        },
        {
            "name": "Zonunpar Resort",
            "rating": [
                4.2
            ],
            "address": [
                "QM62+P8, Aizawl, Mizoram 796009, India"
            ],
            "reviews": [
                {
                    "text": "The pool was great and fun size. Showers and toilets were good. Footsal ground is there too. Everything was tidy and is a great open place for picnic.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It was nice and all except for the road leading to the resort.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice place, but road",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The place is good specially the view of the mountains 🌄",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Found new crush",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pool great fun size showers toilets good footsal ground everything tidy great open place picnic",
                "nice except road leading resort",
                "nice place road",
                "place good specially view mountains ð\u009f\u008c\u0084",
                "found new crush"
            ]
        },
        {
            "name": "The Grand Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "G-47, Chanmari, Opposite To KFC, Zarkawt, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "Stayed for 5 days, hotel is located in a prime location, good connectivity to other places through two & four wheeler taxis. Service is very good, hotel staff is very polite & helpful. Food is little costly but tasty. As for as rooms it's comfortable for the budget, though the lift is small but one person can fit along with his luggage.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This property is very comfortable and located close to main market. Rooms are very neat and clean. Staff are courteous and visitor friendly. Their complimentary breakfast options are good and food is tasty. Alu Paratha and Chole bhatura is very good. Kid friendly hotel with lift facility. Opposite KFC and 2 mins walk to museum. Best hotel for all types of travellers. Airport drop and pick up is there. Special discounts for solo travellers and bloggers.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Location is real good....close to shopping. Room was bad, especially the bathroom. the bathroom window was half broken. The toilet side of the bathroom was dirty. Most of all, water supply is not consistent. They close the Front Desk at 10 PM; don't open till 6:00 AM. They rent rooms to single guys for only Rs. 1000 per person per night; they are extremely noisy. On January 23 night they made noise, were loud with music and talk till 3:00AM. NO ONE FROM THE HOTEL SAYS ANYTHING. In other words, THOSE SINGLE GUYS ARE LICENSED TO BE LOUD!!!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Rooms are ok. Try to check it before you check it. It is a hilly place so there are chances of lack of water in the night time , so, it is advisable to keep one bucket of water full in the bathroom. Food is some are very good and some are not upto the mark especially the veg items. Food is little costly side. Complementary breakfast you can chose any two eatable and any two beverages.Lift space is very small. But location is too prime for hang arounds and check out.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This was my first visit to Grand Hotel Aizawl. No doubt it's Good and Affordable. Rooms are clean, bed sheets, pillows are clean too, we don't feel HIZZZ to sleep like some other hotels. Love it. My next visit for sure. Very important free Wifi n free Breakfast that feels great. Thank you for your service G.H. staffs.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed days hotel located prime location good connectivity places two four wheeler taxis service good hotel staff polite helpful food little costly tasty rooms comfortable budget though lift small one person fit along luggage",
                "property comfortable located close main market rooms neat clean staff courteous visitor friendly complimentary breakfast options good food tasty alu paratha chole bhatura good kid friendly hotel lift facility opposite kfc mins walk museum best hotel types travellers airport drop pick special discounts solo travellers bloggers",
                "location real goodclose shopping room bad especially bathroom bathroom window half broken toilet side bathroom dirty water supply consistent close front desk pm dont open till rent rooms single guys rs per person per night extremely noisy january night made noise loud music talk till one hotel says anything words single guys licensed loud",
                "rooms ok try check check hilly place chances lack water night time advisable keep one bucket water full bathroom food good upto mark especially veg items food little costly side complementary breakfast chose two eatable two beverageslift space small location prime hang arounds check",
                "first visit grand hotel aizawl doubt good affordable rooms clean bed sheets pillows clean dont feel hizzz sleep like hotels love next visit sure important free wifi n free breakfast feels great thank service gh staffs"
            ]
        },
        {
            "name": "Berawtlang Tourist Centre",
            "rating": [
                4.1
            ],
            "address": [
                "PQJ7+P2X, NH-54, Aizawl, Mizoram 796017, India"
            ],
            "reviews": [
                {
                    "text": "Clean and friendly natural environment. Got a beautiful view point. But it's a little bit of a  scary place because of high altitude and both sides direct down.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is very nice but maintenance is a big issue.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This tourist centre is environmental friendly but it is far from aizawl city which is around 10 to 12km .Zero noise pollution unlike aizawl and other main town. Visitor will find a nice a nice view at night beside the dinning room .Apart of that explore yourself  further good luck to all the visitor  👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We used to come here with tons of friends for parties or just to hangout. Aaaaaa the good old days 😆😆",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is great. Food is good. You can book online @Mizoram tourism",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean friendly natural environment got beautiful view point little bit scary place high altitude sides direct",
                "location nice maintenance big issue",
                "tourist centre environmental friendly far aizawl city around km zero noise pollution unlike aizawl main town visitor find nice nice view night beside dinning room apart explore good luck visitor ð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "used come tons friends parties hangout aaaaaa good old days ð\u009f\u0098\u0086ð\u009f\u0098\u0086",
                "location great food good book online mizoram tourism"
            ]
        },
        {
            "name": "The Esquire",
            "rating": [
                4.3
            ],
            "address": [
                "D-51, Sikulpuikawn, Mission Veng, Republic Veng, Aizawl, Mizoram 796005, India"
            ],
            "reviews": [
                {
                    "text": "One of the worst hotel, no value for money. Rooms are smelling and dirty with torn linen. Seepage marks all over. I was on single occupancy and given a twin bed room.No exhaust in bathroom. Service is something you can't expect from this hotel. Staff is very rude. They have placed notices everywhere that outside food is not allowed. However,  when I called to give the order for dinner,  they were like chef is on leave and you can have your dinner outside. Breakfast is another disaster you will get 2 slice of bread and 1 omellete that's it and that too was not provided since the chef was unavailable. Complete waste of money.  Never book this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "One of the worst hotel ever. Poor services. Very rude staff. Dirty rooms. Torn linen. Food quality is worst. Never book this hotel. No value for money.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Cosy place with OK rooms. Good food and good service. Affordable prices",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The Esquire is a fantastic hotel that offers a perfect blend of comfort and luxury. The rooms are spacious, elegantly furnished, and equipped with modern amenities that cater to your every need. The hotel staff is friendly, courteous, and always ready to assist you with anything you need, making for a pleasant and comfortable stay. The hotel's restaurant serves delicious food that caters to all tastes, and the breakfast spread is particularly impressive. The location is also great, with easy access to many local attractions. Overall, The Esquire is an excellent choice for anyone looking for a luxurious and comfortable stay in Aizawl. Highly recommended!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I loved this hotel\n\nExcellent, neat and clean room including bathroom. good and tasty food, beyond my expectations.  Value for money.\n\nVery friendly staaf, Environment is too good Firstly prime location, secondly food quality is very good, thirdly hotel rooms are very clean all furniture is decorative neatly arranged, & lastly the working staff is co-operative, and expert with prompt service. Really very excellent hotel for stay\n\nI do recommend this hotel. Worth it.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one worst hotel value money rooms smelling dirty torn linen seepage marks single occupancy given twin bed roomno exhaust bathroom service something cant expect hotel staff rude placed notices everywhere outside food allowed however called give order dinner like chef leave dinner outside breakfast another disaster get slice bread omellete thats provided since chef unavailable complete waste money never book hotel",
                "one worst hotel ever poor services rude staff dirty rooms torn linen food quality worst never book hotel value money",
                "cosy place ok rooms good food good service affordable prices",
                "esquire fantastic hotel offers perfect blend comfort luxury rooms spacious elegantly furnished equipped modern amenities cater every need hotel staff friendly courteous always ready assist anything need making pleasant comfortable stay hotels restaurant serves delicious food caters tastes breakfast spread particularly impressive location also great easy access many local attractions overall esquire excellent choice anyone looking luxurious comfortable stay aizawl highly recommended",
                "loved hotel excellent neat clean room including bathroom good tasty food beyond expectations value money friendly staaf environment good firstly prime location secondly food quality good thirdly hotel rooms clean furniture decorative neatly arranged lastly working staff cooperative expert prompt service really excellent hotel stay recommend hotel worth"
            ]
        },
        {
            "name": "Hotel Platinum Zarkawt",
            "rating": [
                4.3
            ],
            "address": [
                "upper Before Trinity diagnostic, MacDonald Hill, Zarkawt, Aizawl, Mizoram 796001, India"
            ],
            "reviews": [
                {
                    "text": "Really nice place to dine in. Ambience excellent. Food is best among available options. Both veg and non veg served here. Staff is courteous. The best part of this restaurant is that all the dishes are tasty and reasonably priced.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This hotel is at Aizawl, Mizoram. Hotel environment is very nice. Rooms are good. Resturent is at 2nd floor. Variety of food6is available. North Indian food is also available in this resturent. Fish items are very tasty. Maintain proper cleanliness at hotel rooms. Staffs can speak English and hindi both. Good for family also. The view of Aizawl from this hotel is beautiful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A calming experience.\n\nI visited it at noon on a weekday and I am impressed by the vibe and calming effect that the restaurant had even during the day.\nA must visit, a must taste, and a must stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Situated at the heart of Aizawl, Zarkawt Lane. Rooms are pretty decent with complementary breakfast. Hotel is quite accessible from the main road.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good place ..very tasty food..nice place for get together for friends..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "really nice place dine ambience excellent food best among available options veg non veg served staff courteous best part restaurant dishes tasty reasonably priced",
                "hotel aizawl mizoram hotel environment nice rooms good resturent nd floor variety foodis available north indian food also available resturent fish items tasty maintain proper cleanliness hotel rooms staffs speak english hindi good family also view aizawl hotel beautiful",
                "calming experience visited noon weekday impressed vibe calming effect restaurant even day must visit must taste must stay",
                "situated heart aizawl zarkawt lane rooms pretty decent complementary breakfast hotel quite accessible main road",
                "good place tasty foodnice place get together friends"
            ]
        }
    ]
}