{
    "places_with_reviews": [
        {
            "name": "Dew Dale Resorts, Baratang Island",
            "rating": [
                4.7
            ],
            "address": [
                "Sundergarh Village Baratang Island, Andaman and Nicobar Islands 744210, India"
            ],
            "reviews": [
                {
                    "text": "Stayed at this quiet hotel away from the city bustle. Both the manager and staff were super nice and went out of their way to help. The food was yummy too!\nHowever when the power went out in the area, they were slow to get their generator going, and we had to keep calling them. No food delivery to the room, which was a bummer.\nStill, it's a good place if you want some peace and quiet.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This resort at Baratang is placed at such an awesome spot, far from the crowd and surrounded by greeneries. Loved this place. My little one said it was the best place we have stayed in Baratang. Baratang of Andaman is actually a remote area, where one have very limited options to put up, but we were happy and satisfied to have managed a cottage in Dew Dale. The staffs were very cordial and helpful. The foods were served fresh and hot. We stayed for a night in Dew Dale. I would highly recommend this resort at Baratang to my friends and family.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We saw this property on Internet. Baratang people don’t stay there and make day visit. But we stayed at Dew Dale. It was the best decision as we were mesmerised with the pristine nature it offers. Limestone caves, parrot island were simply awesome. The owner Jessy is such a warm person who made our stay thoroughly pleasant. We thank entire Dew Dale team.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Dew Dale resorts was like an oasis of calm within the wilderness of Baratang. Mrs. Jessy our host is an amazing person and took great care of us. The location was great and very quiet. The food was amazing as well. The aloo parathas especially were just like home.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Amazing experience at Dew Dale Resorts.  Mrs Jessy Madam and her teams politeness, receptions, rooms and food are exceptionally good.  The staff Mr Hari Prasad and Pradeep are so kind and helpful always.  Hope to visit again the same resorts when we go next time.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed quiet hotel away city bustle manager staff super nice went way help food yummy however power went area slow get generator going keep calling food delivery room bummer still good place want peace quiet",
                "resort baratang placed awesome spot far crowd surrounded greeneries loved place little one said best place stayed baratang baratang andaman actually remote area one limited options put happy satisfied managed cottage dew dale staffs cordial helpful foods served fresh hot stayed night dew dale would highly recommend resort baratang friends family",
                "saw property internet baratang people donâ\u0080\u0099t stay make day visit stayed dew dale best decision mesmerised pristine nature offers limestone caves parrot island simply awesome owner jessy warm person made stay thoroughly pleasant thank entire dew dale team",
                "dew dale resorts like oasis calm within wilderness baratang mrs jessy host amazing person took great care us location great quiet food amazing well aloo parathas especially like home",
                "amazing experience dew dale resorts mrs jessy madam teams politeness receptions rooms food exceptionally good staff mr hari prasad pradeep kind helpful always hope visit resorts go next time"
            ]
        },
        {
            "name": "OYO 61587 Coral Creek Resort",
            "rating": [
                4.5
            ],
            "address": [
                "1 Baratang, Great Trunk Rd, Port Blair, Andaman and Nicobar Islands 744210, India"
            ],
            "reviews": [
                {
                    "text": "This is the only good Resort in Baratang and they provide high speed Wi-Fi. If you're planning to visit Mayabunder and Diglipur, this is a great place to spend the night. The food is costly but it's alright if the isolation and transportation is taken into consideration.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Pretty neat place to stay given how isolated Baratang is. The rooms are nice and the food is delicious. Service is good. Beautiful countryside setting as well.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The location is in the country side. I think it is the best place to stay when you are in Baratanga as there are only two hotels in the area and this is the best one.\nThe food here is good and atmosphere is very calm. You will get a complete feeling of living in the village.\n\nPlease take due note that only Airtel and BSNL cards are working there and there is not coverage for Jio SIM cards.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "A very clean and beautiful place with all essential amenities for staying in the middle andaman.\n\nThe staff is very friendly. The food was good. We will definitely recommend this resort if there is plan to stay in Baratang.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "A small resort with neat and clean rooms.  Wifi, hotwater, restaurant facilities are available. The restaurant prices are very high, a coffee costing Rs 60!\nVisit my YouTube channel Life Travel Vlogs for videos.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good resort baratang provide high speed wifi youre planning visit mayabunder diglipur great place spend night food costly alright isolation transportation taken consideration",
                "pretty neat place stay given isolated baratang rooms nice food delicious service good beautiful countryside setting well",
                "location country side think best place stay baratanga two hotels area best one food good atmosphere calm get complete feeling living village please take due note airtel bsnl cards working coverage jio sim cards",
                "clean beautiful place essential amenities staying middle andaman staff friendly food good definitely recommend resort plan stay baratang",
                "small resort neat clean rooms wifi hotwater restaurant facilities available restaurant prices high coffee costing rs visit youtube channel life travel vlogs videos"
            ]
        },
        {
            "name": "Andaman Coral Creek",
            "rating": [
                "Unknown"
            ],
            "address": [
                "south creek baratang, Andaman and Nicobar Islands 744210, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}