{
    "places_with_reviews": [
        {
            "name": "Sukoon Retreat, Dakpathar | Best Ayurvedic Wellness Retreats in a Farm Stay",
            "rating": [
                4.6
            ],
            "address": [
                "Near, Barrage, across Pull Number 1, Dakpatthar, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "Visited this place to plan future stay. Literally staff is so rude and seems illiterate. Mr. Tinku (staff) stood in front of the entry gate and asked to pay to get in the property. I requested him to just let me see the property to decide for further booking but he flatly refused and closed the gate in front of me. Obviously they concern about money not service. Better to avoid. Not recommended at all.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I have nothing to crib about this place ...\nI mean everything is so nice...From entrance to rooms to swimming pool...to lemonade... to food... to river side walk... to greenery... to scenery...\n\nOh we just fell in love.... and everyone on the staff is amazing... Pradeep bhaiyya our chef ...did some wonderful job with ingredients and bound us to eat only that food... we didn't even think of ordering or going out for food for once ...\n\nIf you want a peaceful weekend outing with serene surroundings and soul refreshing air and water.... just go for it ...\n\nGo for it ... ❤️❤️❤️❤️",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I have been here 2 times now and cant wait to go back again. The peace this place offers is what i look forward to along with the amazing food. It feels like home to me as the staff in the property is so friendly and is promptly available at your service. The bon fire nights and the foggy mornings are just perfect at this place.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Hey i visited with my partner and we felt so good and the best part is ankit the chef who served delicious food i loved to stay at this place , loved the environment and all the activities were amazing",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Great place with best indoor swimming pool for kids. Staff and food is wonderful. Enjoyed my stay with kids.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited place plan future stay literally staff rude seems illiterate mr tinku staff stood front entry gate asked pay get property requested let see property decide booking flatly refused closed gate front obviously concern money service better avoid recommended",
                "nothing crib place mean everything nicefrom entrance rooms swimming poolto lemonade food river side walk greenery scenery oh fell love everyone staff amazing pradeep bhaiyya chef wonderful job ingredients bound us eat food didnt even think ordering going food want peaceful weekend outing serene surroundings soul refreshing air water go go â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
                "times cant wait go back peace place offers look forward along amazing food feels like home staff property friendly promptly available service bon fire nights foggy mornings perfect place",
                "hey visited partner felt good best part ankit chef served delicious food loved stay place loved environment activities amazing",
                "great place best indoor swimming pool kids staff food wonderful enjoyed stay kids"
            ]
        },
        {
            "name": "Hotel Prem Plaza",
            "rating": [
                3.8
            ],
            "address": [
                "opposite Sbi, Punjabi Colony, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "Its situated in maine mkt for small party lik n.day or other small things there is hall for tht n other shops are also there lik for shopping or gift gallery etc",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice place to stay with beautiful loction\nAll staff members are very friendly and polite\nManager was good at there work totally outstanding experience with this property",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best profile hotel full recommended property. All staff and General manager was very polite todays us and all guest . and best part was service and rooms are veg good and inversive. we recommed this hotel to all my family and friends to stay here",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had my wedding reception and night stay at this hotel. It was the worst experience of my life the staff members harassed us in night at they were drunk and tried to come inside our room AT 2AM. despite of us telling them that the person they were looking is not in our room had to call police. It was clear in CCTV what they were upto still the property owner denied   Saying the staff member had some misunderstanding. They dont  follow the simple SOPS a hotel staff has to follow. Bed sheet was very dirty, no  toiletries Provided.  Very unprofessional behaviour and staff.\nNot recommended for family.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The best hotel in vikas nagar I recommend every one . Polite staff and the nature of the prashant was very good\nI am staying last year and every year I am staying at the same hotel",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "situated maine mkt small party lik nday small things hall tht n shops also lik shopping gift gallery etc",
                "nice place stay beautiful loction staff members friendly polite manager good work totally outstanding experience property",
                "best profile hotel full recommended property staff general manager polite todays us guest best part service rooms veg good inversive recommed hotel family friends stay",
                "wedding reception night stay hotel worst experience life staff members harassed us night drunk tried come inside room despite us telling person looking room call police clear cctv upto still property owner denied saying staff member misunderstanding dont follow simple sops hotel staff follow bed sheet dirty toiletries provided unprofessional behaviour staff recommended family",
                "best hotel vikas nagar recommend every one polite staff nature prashant good staying last year every year staying hotel"
            ]
        },
        {
            "name": "Hotel Four Seasons R",
            "rating": [
                4.4
            ],
            "address": [
                "Line Jeewangarh, FQHQ+6GP, Chakarata Rd, near Indian Oil Petrol Pump, Rasoolpur, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "The Four Seasons Hotel R is really fancy and nice. The service is great, the rooms are big and beautiful, and the food is delicious. It's a fantastic place to stay if you want to feel pampered and relaxed.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Overall Good experience with Hotel and Property. Great ambience.\nIt was a pleasant stay.\nAmazing stay in this hotel. Staff is always ready to help. Clean rooms. Good location.\nI would definitely recommend this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The best place ever. So peaceful, service is best, staff is cooperative punctual and hospitable. Loved the ambience. Rate is very low as per the service provided.. super amazing.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I stayed here for 3 nights and the hotel was very good. The location is also very good and the petrol pump is just next to the hotel. The staff is very decent and helpful. Service was always quick. Every person in staff is very polite and responsive. The rooms are also clean with good view, rooms are very airy so you will definitely enjoy your stay. Thanks to the hotel and staff for such comfortable stay. Keshar Chauhan & Rahul Tomar made our stay comfortable, the food was also amazing.  Will definitely visit the place next time.👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Superb beautiful ultimate place to spend a we time😍☺️🥰",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "four seasons hotel r really fancy nice service great rooms big beautiful food delicious fantastic place stay want feel pampered relaxed",
                "overall good experience hotel property great ambience pleasant stay amazing stay hotel staff always ready help clean rooms good location would definitely recommend hotel",
                "best place ever peaceful service best staff cooperative punctual hospitable loved ambience rate low per service provided super amazing",
                "stayed nights hotel good location also good petrol pump next hotel staff decent helpful service always quick every person staff polite responsive rooms also clean good view rooms airy definitely enjoy stay thanks hotel staff comfortable stay keshar chauhan rahul tomar made stay comfortable food also amazing definitely visit place next timeð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "superb beautiful ultimate place spend timeð\u009f\u0098\u008dâ\u0098ºï¸\u008fð\u009f¥°"
            ]
        },
        {
            "name": "Prakash Hotel & Lounge, Vikasnagar",
            "rating": [
                3.4
            ],
            "address": [
                "FQ9C+82H, Vikasnagar - Barkot Rd, Rasoolpur, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "This is an excellent place to stay for the night. You will come to across meet here lots of Garhwali brothers staying with theirs families. Local staffs and owner of the hotel is very helpful and kind person. Aromatic delicious organic food is supplied here to the utmost taste and the fullest satisfaction of the customers, at the lowest rate.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Delicious Indian food at low price",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Good place co-operative staff no TV in the room",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Veg food is very delicious",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "👍",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place stay night come across meet lots garhwali brothers staying families local staffs owner hotel helpful kind person aromatic delicious organic food supplied utmost taste fullest satisfaction customers lowest rate",
                "delicious indian food low price",
                "good place cooperative staff tv room",
                "veg food delicious",
                "ð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Yatrik Inn Hotel",
            "rating": [
                3.3
            ],
            "address": [
                "Vikas Nagar, Dehradun NH-123, Vikash Nagar, Vikasnagar - Barkot Rd, Bahadur Garh, Dehradun, Vikasnagar, Uttarakhand 248159, India"
            ],
            "reviews": [
                {
                    "text": "Location of the hotel is good , rooms are neat and clean, food was awesome, staff was nice and cooperative ..just a little issue with the transportation.. its better u will come by your own vehicle.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Room is very bad condition also not cleanness in hotel",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Its OK for resting here good rooms . but food is not aviable here.thank you for reading..✌👌",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "It is easy to access and also a chik and contemporary place to visit. It is also an economic place so mediocre person may visit to this Inn.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Nice place but food is not much good quality",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location hotel good rooms neat clean food awesome staff nice cooperative little issue transportation better u come vehicle",
                "room bad condition also cleanness hotel",
                "ok resting good rooms food aviable herethank readingâ\u009c\u008cð\u009f\u0091\u008c",
                "easy access also chik contemporary place visit also economic place mediocre person may visit inn",
                "nice place food much good quality"
            ]
        },
        {
            "name": "Mid Way Hotel",
            "rating": [
                3.9
            ],
            "address": [
                "Jeevan Garh, Dehradun, NH-123, Vikash Nagar Barkot Road, Dehradun, Rasoolpur, Dehradun, Vikasnagar, Uttarakhand 248159, India"
            ],
            "reviews": [
                {
                    "text": "We took a lunch break here, super tasty food. We took buffet lunch. Very tasty. Liked each item, fresh.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good Indian food and have beautiful paintings related to Uttrakhand and its beauty.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Please do not expect much in this locality. Clean bright dining hall. Good tasty food. Cordial service. Restrooms in the attached lodge can be used.. Clean. Road side parking.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very bad... Service",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Fantastic",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "took lunch break super tasty food took buffet lunch tasty liked item fresh",
                "good indian food beautiful paintings related uttrakhand beauty",
                "please expect much locality clean bright dining hall good tasty food cordial service restrooms attached lodge used clean road side parking",
                "bad service",
                "fantastic"
            ]
        },
        {
            "name": "Hotel Neeraj Palace",
            "rating": [
                4
            ],
            "address": [
                "FQFJ+JPQ, Chakrata Rd, Laxmanpur, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "On road location.. peaceful environment. Good service. Rooms are neat and clean.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Overall nice and awesome experience here. Clean and decorative rooms with all essential facilities. Totally hygiene place for guests. Required furniture was there. Totally peaceful area no disturbance .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice property in hotel neeraj place 🥰🥰😎\nNice 👍🏿🙂 friendly staff 🥰\nNd food service staff is good\nFast service 😎😎😎\nTottly saying to •••OSM🥰•••\ni visiting 4 time this hotel 🛏️🏨 nice amazing 😍\nThanks you so much neeraj hotel 🏨 place 🥰😎😎😎",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The hotel has ample parking space. Stayed there for a single night. Staff is cooperative, room and washroom were clean and well maintained.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The quality of the rooms is decent and it's located on the main road. Ample parking space is available. Food in not available so you'll have to rely on outside places to eat",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "road location peaceful environment good service rooms neat clean",
                "overall nice awesome experience clean decorative rooms essential facilities totally hygiene place guests required furniture totally peaceful area disturbance",
                "nice property hotel neeraj place ð\u009f¥°ð\u009f¥°ð\u009f\u0098\u008e nice ð\u009f\u0091\u008dð\u009f\u008f¿ð\u009f\u0099\u0082 friendly staff ð\u009f¥° nd food service staff good fast service ð\u009f\u0098\u008eð\u009f\u0098\u008eð\u009f\u0098\u008e tottly saying â\u0080¢â\u0080¢â\u0080¢osmð\u009f¥°â\u0080¢â\u0080¢â\u0080¢ visiting time hotel ð\u009f\u009b\u008fï¸\u008fð\u009f\u008f¨ nice amazing ð\u009f\u0098\u008d thanks much neeraj hotel ð\u009f\u008f¨ place ð\u009f¥°ð\u009f\u0098\u008eð\u009f\u0098\u008eð\u009f\u0098\u008e",
                "hotel ample parking space stayed single night staff cooperative room washroom clean well maintained",
                "quality rooms decent located main road ample parking space available food available youll rely outside places eat"
            ]
        },
        {
            "name": "Hotel Shaurya",
            "rating": [
                4.1
            ],
            "address": [
                "FQCF+2Q3, Hospital Rd, Bahadur Garh, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "Nice clean and spacious rooms. Awesome hospitality. Staff was polite and soft-spoken.  Mr Deepak is really gem of a person. He  explained us the cultural heritage of Uttarakhand and introduced with its cuisine.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Great place to dine in!! Quality food with great staff attitude towards customer. Perfect location to stay, very handy connectivity. Must visit again to try some other great dishes from the Menu.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good food quality, nice service.  *visted restaurant for family dinner.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is great the only problem is parking issue...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's not quite wrong to give a four star rating to this hotel as there are only two or three hotels that facilitate your needs. It is  cozy enough and clean. Restorent is also good. Stayed here for one night ..  I think it's a good. Little crowdy street and traffic noise can disturb you in day time. Well... You can enjoy a good hostility here..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice clean spacious rooms awesome hospitality staff polite softspoken mr deepak really gem person explained us cultural heritage uttarakhand introduced cuisine",
                "great place dine quality food great staff attitude towards customer perfect location stay handy connectivity must visit try great dishes menu",
                "good food quality nice service visted restaurant family dinner",
                "food great problem parking issue",
                "quite wrong give four star rating hotel two three hotels facilitate needs cozy enough clean restorent also good stayed one night think good little crowdy street traffic noise disturb day time well enjoy good hostility"
            ]
        },
        {
            "name": "Sandeep Hotel & Restaurant",
            "rating": [
                3.8
            ],
            "address": [
                "Pahari Gali, Kalyanpur, Vikasnagar, Dehradun, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "Sandeep restaurant is quite amazing for vegetarians and there are 2 menu cards here and your taste is also quite amazing.  If you go here to eat then you must try Chole Bhature, it is awesome",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It's one of the old restaurants ina Vikasnagar.\n\nFood - Really good, do try laccha parantha and Nan(the crispness is just amazing)\nPaneer curry was also good and so does the daal makhni\n\nPricing-Not too expensive but actually worth the money",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Quality food,genuine price and simple and peaceful place for a good eating out experience with family.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food and service is good at reasonable price",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Service was okay and the food quality was destitute. Restaurants have not categorized staff who take the orders and who clean tables. The standard is very low and it's distraught me.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sandeep restaurant quite amazing vegetarians menu cards taste also quite amazing go eat must try chole bhature awesome",
                "one old restaurants ina vikasnagar food really good try laccha parantha nanthe crispness amazing paneer curry also good daal makhni pricingnot expensive actually worth money",
                "quality foodgenuine price simple peaceful place good eating experience family",
                "food service good reasonable price",
                "service okay food quality destitute restaurants categorized staff take orders clean tables standard low distraught"
            ]
        },
        {
            "name": "Hotel Shiva Main Road Vikas Nagar",
            "rating": [
                3.3
            ],
            "address": [
                "Near pahari Gali, Main Road, Punjabi Colony, Vikasnagar, Uttarakhand 248198, India"
            ],
            "reviews": [
                {
                    "text": "Hall is spacious and comfy. Very good service. Rooms are very reasonable and clean. On road location. All main places are nearby located. Very high recommendable.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "One of the best place to stay , they are so humane, when I told them that didn't like like market food , they specially cooked for we elderly couple at home and charged nothing❤❤\n\nYou can get anything by spending but not the comforts and satisfaction, staff was nice , service was upto the mark, it's really a home away from home❤❤❤❤",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Average hotel, can stay there staff was good , but  rooms are not matching any level of price to pay",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "An average hotel in Vikas nagar. Room was clean but small in size. Bathroom tap was not working properly I stayed in room no 104. The mattress was also hard. No ventilation available in my room and also exhaust from bathrooms leaves to corridor. Leaves pathetic smell in corridor. But if wanna stay in a budget hotel in the middle of market where you can get everything this is the place.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Very good experience. Get 2 room in 2000 for 1 night.\n\nThe only problem is kitchen is not at this hotel so they provide the dinner and breakfast from outside restorent",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hall spacious comfy good service rooms reasonable clean road location main places nearby located high recommendable",
                "one best place stay humane told didnt like like market food specially cooked elderly couple home charged nothingâ\u009d¤â\u009d¤ get anything spending comforts satisfaction staff nice service upto mark really home away homeâ\u009d¤â\u009d¤â\u009d¤â\u009d¤",
                "average hotel stay staff good rooms matching level price pay",
                "average hotel vikas nagar room clean small size bathroom tap working properly stayed room mattress also hard ventilation available room also exhaust bathrooms leaves corridor leaves pathetic smell corridor wan na stay budget hotel middle market get everything place",
                "good experience get room night problem kitchen hotel provide dinner breakfast outside restorent"
            ]
        }
    ]
}