{
    "places_with_reviews": [
        {
            "name": "Hotel Mayura Chalukya Badami",
            "rating": [
                3.8
            ],
            "address": [
                "Ramdurg Rd, PWD Compound, Badami Rural, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "The rooms were spacious and the maintenance was good. The staff was very helpful.\nWe had only 2 issues: the food was average, and the AC was quite noisy.\nI'd still recommend this place, but suggest against having breakfast here.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This is a government run hotel located right on the main road. Rooms are large. The deluxe rooms are provided with an electric kettle. The AC worked well and there was running hot and cold water in the attached bathroom. Car parking is outside the hotel, but  under CCTV surveillance. There is a restaurant with reasonable variety of dishes and a beer bar. Food at the restaurant is OK but not great. Service is quick. The staff are polite and helpful. There are a lot of monkeys; it is sensible to keep the door locked. Overall, a good place to stay in Badami",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Absolutely fantastic experience here while staying here for 1 night during my recent solo motorcycle ride to Karnataka.\n\nI had booked this property directly through the Karnataka Tourism website. And it was a seamless experience without any glitches.\n\nThe property is quite dated and it shows. But at the same time, it is excellently maintained by the staff of professionals.\n\nThe room alloted to me was spacious, clean, comfortable and adequate for a solo rider like me.\n\nThe in-house restaurant was fantastic and I thoroughly enjoyed the evening coffee, morning breakfast and the dinner I had.\n\nThe location is super convenient. The market is at a walking distance and the Badami Caves are quite close too.\n\nThe parking space provided inside the property was super helpful as well.\n\n100% recommended for anyone looking for a comfortable and friendly stay in Badami.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Set in lovely gardens with monkeys, a range of birds and bats. It’s in an excellent location for Badami’s amazing historical temples 20 mins walk. Rooms were clean, spacious and comfortable but non AC is really hot, it’s worth upgrading to AC,especially this time of year.  They have hot water all the time too The staff were incredibly friendly and helpful especially in the restaurant area, the food was good and they have many options, just check what is available.\n\n1.5 km from the bus station\n5 km from train station (nothing around there anyway)\n\nOverall, I would highly recommend this hotel if you are in n Badami.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "An amazing stay, good for family or friends.\nHotel has an old school charm, similar to what you can expect from any Govt. establishment.\nFood was good, bathrooms were clean.\nWe stayed in the Dome room, which was an unique experience altogether.\nWould love to visit again.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms spacious maintenance good staff helpful issues food average ac quite noisy id still recommend place suggest breakfast",
                "government run hotel located right main road rooms large deluxe rooms provided electric kettle ac worked well running hot cold water attached bathroom car parking outside hotel cctv surveillance restaurant reasonable variety dishes beer bar food restaurant ok great service quick staff polite helpful lot monkeys sensible keep door locked overall good place stay badami",
                "absolutely fantastic experience staying night recent solo motorcycle ride karnataka booked property directly karnataka tourism website seamless experience without glitches property quite dated shows time excellently maintained staff professionals room alloted spacious clean comfortable adequate solo rider like inhouse restaurant fantastic thoroughly enjoyed evening coffee morning breakfast dinner location super convenient market walking distance badami caves quite close parking space provided inside property super helpful well recommended anyone looking comfortable friendly stay badami",
                "set lovely gardens monkeys range birds bats itâ\u0080\u0099s excellent location badamiâ\u0080\u0099s amazing historical temples mins walk rooms clean spacious comfortable non ac really hot itâ\u0080\u0099s worth upgrading acespecially time year hot water time staff incredibly friendly helpful especially restaurant area food good many options check available km bus station km train station nothing around anyway overall would highly recommend hotel n badami",
                "amazing stay good family friends hotel old school charm similar expect govt establishment food good bathrooms clean stayed dome room unique experience altogether would love visit"
            ]
        },
        {
            "name": "Morpho Banashree Resort",
            "rating": [
                4.1
            ],
            "address": [
                "S B Yaragoppa Village, Ward no 6, Building No 890, Muttlageri Gram Panchayat, Taluk, Badami, Yaragoppa.S.B, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful resort with a lot of potential.\nThis place is hard to reach and has nothing in the vicinity. It's 6km away from the city. We stayed here in beginning of April and it was deserted. There was barely anyone in the premises.\nOur allocated room was big, had a cupboard, a coffee table with 2 chairs, a big comfy bed and nice veranda. Our room had A/c which was very handy during the heat wave.\nThe pool was pleasant. Apart from swimming pool there's shuttle badminton and indoor games.\nThey have in-house dining option which we tried the first evening and decided not to return. The placemats at the table were unclean. The salt and pepper shakers had splashes of sauces on the outside. And the food was below average.\nBreakfast was a-la carte was very average.\nThe surroundings are beautiful and green. Very peaceful.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "No Wifi at all....The receptionist had lot of lousy excuses to defend themselves from giving wifi connection 🤬, TV ..,.no entertainment at all ....But we enjoyed the tasty food from Vatapi Restaurant n thanks to Rupali for the same... special mention....The rates are bit expensive but worth the same. The property is great but poor maintenance is what needs to be addressed n taken care of specially the geyser/ exhausts....The swimming pool is great n clean.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Wonderful place with reasonable prices. Rooms are really spacious and clean. Well behaved staff with polite behaviour. Food is really good. Do opt for buffet and pay before hand. The only negative is there are No games for little kids like swings or slides, but i heard that they getting them installed soon.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "one of the worst hotels we have stayed in the recent years. They claim many stars for this resort, however they don't understand what basic hygiene means. It is a 2 year old resort and it looks like 10 year old one due to poor maintenance. Flushes don't work, gets clogged in front of the room, TV channels don't work due to subscription expiry, windows don't close etc. Restaurant serves very few items with exorbitant prices.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Morpho Banasree resort in Badami fail to offer a satisfactory experience during our stay. Claiming to be a four star resort, they cannot maintain basic standards of hygiene and cleanliness. As soon as we arrived at the resort, we were greeted with a huge stink  coming from the room and the bathroom. The vanity mirror was missing too. I am surprised to see that despite the good reviews, they did not offer us a good experience in the stay. They did not even offer us a refund, claiming that we had to check in before, but that day we were the first ones to check in. They also failed to do a simple job such as moving our luggage into the room which is truly disappointing and disheartening from the consumers aspect. This is definitely a ripoff for Rs.20,000 and advise nobody else to stay in this resort.\n\nUpdate: They offered us another room in which the Geyser wasn't working, which we had replaced after another 30 minutes of argument. The next day the geyser stopped working and we were asked to use the adjacent room for our showers and baths.\nBefore checking out they only offered us a 300Rs discount which is unfair beyond doubt. Was truly a headache staying in this resort. They called me to remove this review too.\n\nWould advise not to book.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful resort lot potential place hard reach nothing vicinity km away city stayed beginning april deserted barely anyone premises allocated room big cupboard coffee table chairs big comfy bed nice veranda room ac handy heat wave pool pleasant apart swimming pool theres shuttle badminton indoor games inhouse dining option tried first evening decided return placemats table unclean salt pepper shakers splashes sauces outside food average breakfast ala carte average surroundings beautiful green peaceful",
                "wifi allthe receptionist lot lousy excuses defend giving wifi connection ð\u009f¤¬ tv entertainment enjoyed tasty food vatapi restaurant n thanks rupali special mentionthe rates bit expensive worth property great poor maintenance needs addressed n taken care specially geyser exhauststhe swimming pool great n clean",
                "wonderful place reasonable prices rooms really spacious clean well behaved staff polite behaviour food really good opt buffet pay hand negative games little kids like swings slides heard getting installed soon",
                "one worst hotels stayed recent years claim many stars resort however dont understand basic hygiene means year old resort looks like year old one due poor maintenance flushes dont work gets clogged front room tv channels dont work due subscription expiry windows dont close etc restaurant serves items exorbitant prices",
                "morpho banasree resort badami fail offer satisfactory experience stay claiming four star resort maintain basic standards hygiene cleanliness soon arrived resort greeted huge stink coming room bathroom vanity mirror missing surprised see despite good reviews offer us good experience stay even offer us refund claiming check day first ones check also failed simple job moving luggage room truly disappointing disheartening consumers aspect definitely ripoff rs advise nobody else stay resort update offered us another room geyser wasnt working replaced another minutes argument next day geyser stopped working asked use adjacent room showers baths checking offered us rs discount unfair beyond doubt truly headache staying resort called remove review would advise book"
            ]
        },
        {
            "name": "Clarks Inn Badami",
            "rating": [
                3.6
            ],
            "address": [
                "1755, Veerpulakeshi Circle Main Road, Badami Rural, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "We booked a Premium Room which was on the 4th Floor.\n\nThe positive thing about Clarks Hotel is the location, in the center of the City a lot of the sites are within walking distance.\nBut being in the City Center the noise of traffic in the front, road facing rooms is very loud.  We requested a room at the back of the hotel which was fine until there was this loud roaring noise that started at 6:30pm when we enquired what it was, we were told it is the kitchen exhaust.  This got switched off only at 10:00pm. Therefore when the kitchen is working the exhaust gets switched on so the rooms to the back too are very noisy as well\n\nNumbers given on the web site as well as the Booking Confirmation email are not functional. I wanted to inform the Hotel that we would be checking in late but could not contact the Hotel.\n\nRooms are in a pretty run down condition, no fridge no toilet paper, no amenities on day one, day two we were provided with minimal amenities.\n\nThe common toilet off the Dinning Room is in a terrible state of disrepair.\n\nA very elaborate Menu card is placed in the rooms, when we  tried to place our order, everything we asked for (vegetarian) was not available.  Finally we said tell us what you can give us, we were informed that only North Indian food, limited menu could be served.  The breakfast, mostly South Indian was adequate.\n\nThe Staff at Clarks Inn Badami are the only saving point,  thought we could see they were understaffed, they were very helpful, courteous and polite.\n\nOverall impression was not good, I personally would not recommend it to friends or family.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Located at Badami town main circle, 10 mins walk to Badami caves.\nRooms clean and big.\nService needs improvement.\nHave a long food menu, but serves only Indian cuisine. Ordered Veg tikka, but got burnt tikkas twice, finally had to cancel order.\nOverall good stay, although a bit pricey.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Supposedly a 3 star hotel, but in fact it is a third class hotel. We booked this hotel because of good experience at Clark's Hampi. But we were very disappointed  with Clark's Badami.\nThe linen and towels were filthy, torn and yellow. We asked for a replacement but found them similarly sub standard. The bathroom fittings were old,  rusted, leaking, dysfunctional. The toiletries and tea bags were of lowest quality. They could not be used, so we bought our own from Badami market.\nOverall we were left with a feeling of being in an unhygienic, dirty environment. The restaurant had very few options, and breakfast was stale. It made us sick.\nExcept for the location, I would not recommend this hotel.\nThe wi-fi did not connect.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "This is luxurious hotel to stay at Badami.\nMust visit as it is 4 star hotel so it’s expensive. But worth to have good ambience and service.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "They didn't have ac room but provided and a stand fan. Parking is poor its first come first serve. My car was scratched as the cars are parked way to closer to each other.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked premium room th floor positive thing clarks hotel location center city lot sites within walking distance city center noise traffic front road facing rooms loud requested room back hotel fine loud roaring noise started pm enquired told kitchen exhaust got switched pm therefore kitchen working exhaust gets switched rooms back noisy well numbers given web site well booking confirmation email functional wanted inform hotel would checking late could contact hotel rooms pretty run condition fridge toilet paper amenities day one day two provided minimal amenities common toilet dinning room terrible state disrepair elaborate menu card placed rooms tried place order everything asked vegetarian available finally said tell us give us informed north indian food limited menu could served breakfast mostly south indian adequate staff clarks inn badami saving point thought could see understaffed helpful courteous polite overall impression good personally would recommend friends family",
                "located badami town main circle mins walk badami caves rooms clean big service needs improvement long food menu serves indian cuisine ordered veg tikka got burnt tikkas twice finally cancel order overall good stay although bit pricey",
                "supposedly star hotel fact third class hotel booked hotel good experience clarks hampi disappointed clarks badami linen towels filthy torn yellow asked replacement found similarly sub standard bathroom fittings old rusted leaking dysfunctional toiletries tea bags lowest quality could used bought badami market overall left feeling unhygienic dirty environment restaurant options breakfast stale made us sick except location would recommend hotel wifi connect",
                "luxurious hotel stay badami must visit star hotel itâ\u0080\u0099s expensive worth good ambience service",
                "didnt ac room provided stand fan parking poor first come first serve car scratched cars parked way closer"
            ]
        },
        {
            "name": "THE HERITAGE RESORT, BADAMI",
            "rating": [
                4
            ],
            "address": [
                "Station Road, District Bagalkot,, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "It was an amazing experience , great to spend time with friends and family, food is good, little bit clean needs to be done mainly in the washroom. Because of the bad smell a lot of mosquitoes are there so it has to be taken care of rest everything is good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great hotel in Badami close to the caves.\nWe were greeted warmly, the accommodation was large and comfortable. A bit rustic but expected.\nThey have some lovely cottages but we had a deluxe room with AC\nThe breakfast was a bit too limited but dinner and lunch was very good and tasty.\nWe had a good stay here and would recommend.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Noteworthy thing about this resort is the STAFF. Very much polite and humble ready to serve with the best attitude.\nRooms are spacious and well equipped with all amenities.\nFood veg/non-veg is simply delicious. Quantity and quality.\nThey gave us best price as we booked directly by calling the hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are also comfortable,\nService is good in sincerely and staff is friendly,\nLocation is fine good and any time rabbits are there n morning was very beautiful with fresh air n no air pollution, no sound pollution n looks like a great place.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great experience.  The rooms are near and tidy and spacious.  There is no pool. The restaurant menu is good. Very polite staff. Highly recommended. We updated our room to cottage.  The shifting was easy.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing experience great spend time friends family food good little bit clean needs done mainly washroom bad smell lot mosquitoes taken care rest everything good",
                "great hotel badami close caves greeted warmly accommodation large comfortable bit rustic expected lovely cottages deluxe room ac breakfast bit limited dinner lunch good tasty good stay would recommend",
                "noteworthy thing resort staff much polite humble ready serve best attitude rooms spacious well equipped amenities food vegnonveg simply delicious quantity quality gave us best price booked directly calling hotel",
                "rooms also comfortable service good sincerely staff friendly location fine good time rabbits n morning beautiful fresh air n air pollution sound pollution n looks like great place",
                "great experience rooms near tidy spacious pool restaurant menu good polite staff highly recommended updated room cottage shifting easy"
            ]
        },
        {
            "name": "Rajsangan International Hotel",
            "rating": [
                3.6
            ],
            "address": [
                "NH367, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is old but for the price point, it is very well placed. Good for a short stay.\n\nStaff was helpful and accommodating. Normally it gets filled on weekends and long holidays because a lot of groups from colleges and schools visit the sites.\n\nIt's next to the bus stand so if you are using public transport, the location is the best.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "This hotel is located exactly in front of the Badami bus stand, which will make your commute very convenient. The room was clean and equipped with basic amenities. The staff was very helpful. When we talked with them, they helped us with the bus timings, points we must visit, and places where we can have local food. We covered all points by walking from this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Stayed for three days. It's right opp to bus stand which is a good thing as well as bad, it's always noisy right from 5 AM till 10 PM. Parking is behind the building which goes through a narrow road. Walk from room to parking is not advisable if women are along as it goes through a bar which is always occupied. Rooms are average and lot of scope of improvement.\n\nRecommend to leave 4 wheeler here if visiting badami historical places and use public transport, roads to these places are super narrow and parking is a nightmare.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "PROS:\n1. Close to the bus stop.\n2. Hot water availability.\n\nCONS:\n1. Very old building and rooms\n2. Didn’t even  change the bed spread. There was hair and flowers still on the bed. Requested to change the bed spread but they didn’t do it.\n3. Suspecting bed bugs in the room.\n4. Parking is an issue. Though there is parking behind the hotel, passing through the narrow streets was not easy.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "One of the best hotels if you need convenience and comfort at one place. It is right opposite to badami bus stand. All major sightseeing places are at walkable distance. For auto hotel itself arrange it otherwise ample autos available at bus stand.for food one famous restaurant is in the same premises. Others also very nearby and all are open early morning.\n\nRooms are specious, clean and with all gadgets in working condition. 24 hours hot water available which is like a rare thing.\n\nAll the staff is very nice and cooperative\n\nOverall best hotel to stay in Badami",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel old price point well placed good short stay staff helpful accommodating normally gets filled weekends long holidays lot groups colleges schools visit sites next bus stand using public transport location best",
                "hotel located exactly front badami bus stand make commute convenient room clean equipped basic amenities staff helpful talked helped us bus timings points must visit places local food covered points walking hotel",
                "stayed three days right opp bus stand good thing well bad always noisy right till pm parking behind building goes narrow road walk room parking advisable women along goes bar always occupied rooms average lot scope improvement recommend leave wheeler visiting badami historical places use public transport roads places super narrow parking nightmare",
                "pros close bus stop hot water availability cons old building rooms didnâ\u0080\u0099t even change bed spread hair flowers still bed requested change bed spread didnâ\u0080\u0099t suspecting bed bugs room parking issue though parking behind hotel passing narrow streets easy",
                "one best hotels need convenience comfort one place right opposite badami bus stand major sightseeing places walkable distance auto hotel arrange otherwise ample autos available bus standfor food one famous restaurant premises others also nearby open early morning rooms specious clean gadgets working condition hours hot water available like rare thing staff nice cooperative overall best hotel stay badami"
            ]
        },
        {
            "name": "HOTEL BADAMI COURT(unit of Shreejit Resorts Pvt Ltd)",
            "rating": [
                3.7
            ],
            "address": [
                "17/3, Station Rd, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "An excellent place for staying, all sight seeing places are at close proximity. Friendly staff though they have a restaurant which serves vegetarian and non-vegetarian food we preferred going to their pure veg restaurant Pakwan situated about 7 minutes drive from the hotel. Overall a very good stay with comfort.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Went by looks and hoped for a good experience, Visited for lunch on 27. The restaurant was fully occupied and there were some people already waiting. On enquiry we were asked to wait. One table was billed and they vacated, waiter asked a few mins to clean the table. Even after 20 mins they purposefully didn't clean the table and kept us waiting and the restaurant manager was abusing when enquired why the delay. It was over 40 mins thanks to their arrogance, it was very much intentional. We were a family with 2 kids. Front desk manager was a useless fellow simply stating at our face with all this drama happening. It felt more like a harassment towards tourists. This place is not recommended for anyone given the arrogant and third class behavior from their hopeless staff.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good service. Rooms are bit old, but has all basic needs. The Breakfast was also good. Overall good value for the money.\nOne person in our group left his wrist watch at the room. On contacting the hotel after checkout they collected it from the room & agreed to courier it.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Unfortunately Had to be here only bcz of our tour guide as there wasn’t any restaurants available nearby… but once we reached by looking at the interiors & everything we were like bro here will get some good food but to our surprise it was disappointing like we were the frst group to order food & were the last to receive the same from the people present there….\n\nLike seriously I have to say lazy staff even the quantity was like offering food for child….",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We had ordered the meal , and we had received it after almost 1.5hrs.\nOne of my friend has ordered Mango Icecream and later on after 1 hr he comes to know that Mango Icecream is not available. This is like how politician asks for Vote and later on they don't work for it.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place staying sight seeing places close proximity friendly staff though restaurant serves vegetarian nonvegetarian food preferred going pure veg restaurant pakwan situated minutes drive hotel overall good stay comfort",
                "went looks hoped good experience visited lunch restaurant fully occupied people already waiting enquiry asked wait one table billed vacated waiter asked mins clean table even mins purposefully didnt clean table kept us waiting restaurant manager abusing enquired delay mins thanks arrogance much intentional family kids front desk manager useless fellow simply stating face drama happening felt like harassment towards tourists place recommended anyone given arrogant third class behavior hopeless staff",
                "good service rooms bit old basic needs breakfast also good overall good value money one person group left wrist watch room contacting hotel checkout collected room agreed courier",
                "unfortunately bcz tour guide wasnâ\u0080\u0099t restaurants available nearbyâ\u0080¦ reached looking interiors everything like bro get good food surprise disappointing like frst group order food last receive people present thereâ\u0080¦ like seriously say lazy staff even quantity like offering food childâ\u0080¦",
                "ordered meal received almost hrs one friend ordered mango icecream later hr comes know mango icecream available like politician asks vote later dont work"
            ]
        },
        {
            "name": "Krishna Heritage Hotel",
            "rating": [
                4
            ],
            "address": [
                "State Highway 14,Ramdurg Road, Badami, Badami Rural, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "I recently stayed at a resort that exceeded my expectations. The spacious and impeccably clean rooms created a comfortable atmosphere. The ambiance was delightful, providing a relaxing environment. The staff's exceptional service and politeness added to the positive experience, and the food served was of high quality. While the gated parking was a plus, improving the open area could enhance the overall experience. Nevertheless, it's undeniably a fantastic place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We stayed at Krishna heritage in Jan 2024. It was a wonderful stay in a calm environment with lots of green and rabbits😀. Rooms were big. Bathrooms too were big like bath halls with a privison open to sky shower. Well maintained hotel... Food too was tasty.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The place is absolutely beautifully kept. The rooms are huge and quite clean. The rent for such a room is quite reasonable. As soon as you enter the place you are greeted by playful rabbits (which are kept by the owner of the place) which definitely changes your mood.\n\nI would just suggest some quick service for their restaurants. Overall great thumbs up to this place and its owner & staff who maintained the place exceptionally well.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Krishna Heritage Hotel stands out as one of the best value-for-money accommodations in Badami, Karnataka. Recently visited there for a short visit.\nIt is situated conveniently near the main market, it offers easy access to local attractions.\n\nThe resort's charm lies in its picturesque green surroundings, complete with rabbits, swings, lotus ponds and a swimming pool, although during my visit, the pool was unfortunately not operational.\n\nThe rooms are very spacious. Each room has separate entrance looby and individual amenities like dressing rooms and open to sky showers. Each room feels like a mini-suite, providing ample comfort and privacy.\n\nThe dining area reflects a rustic charm with tables and chairs crafted from real tree trunks, adding to the hotel's unique ambiance. However, while the food served is decent, offering a variety of cuisines including Punjabi and Chinese, it lacks any outstanding flavor or signature dishes.\n\nOverall, Krishna Heritage Hotel offers excellent value for money, with its spacious accommodations and convenient location setting it one of the best options in Badami.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Amazing place ... Huge rooms, balcony  and a ridiculously large bathroom ... Can't praise this place enough. The hotel also has pet rabbits which were the highlight for my kid. The food is amazing , we had all meals here for breakfast, lunch as well as dinner. Staff is super friendly. Wifi is available only in the reception area. Best place if you are going to be exploring badami, aihole area",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently stayed resort exceeded expectations spacious impeccably clean rooms created comfortable atmosphere ambiance delightful providing relaxing environment staffs exceptional service politeness added positive experience food served high quality gated parking plus improving open area could enhance overall experience nevertheless undeniably fantastic place stay",
                "stayed krishna heritage jan wonderful stay calm environment lots green rabbitsð\u009f\u0098\u0080 rooms big bathrooms big like bath halls privison open sky shower well maintained hotel food tasty",
                "place absolutely beautifully kept rooms huge quite clean rent room quite reasonable soon enter place greeted playful rabbits kept owner place definitely changes mood would suggest quick service restaurants overall great thumbs place owner staff maintained place exceptionally well",
                "krishna heritage hotel stands one best valueformoney accommodations badami karnataka recently visited short visit situated conveniently near main market offers easy access local attractions resorts charm lies picturesque green surroundings complete rabbits swings lotus ponds swimming pool although visit pool unfortunately operational rooms spacious room separate entrance looby individual amenities like dressing rooms open sky showers room feels like minisuite providing ample comfort privacy dining area reflects rustic charm tables chairs crafted real tree trunks adding hotels unique ambiance however food served decent offering variety cuisines including punjabi chinese lacks outstanding flavor signature dishes overall krishna heritage hotel offers excellent value money spacious accommodations convenient location setting one best options badami",
                "amazing place huge rooms balcony ridiculously large bathroom cant praise place enough hotel also pet rabbits highlight kid food amazing meals breakfast lunch well dinner staff super friendly wifi available reception area best place going exploring badami aihole area"
            ]
        },
        {
            "name": "Vikas Residency",
            "rating": [
                3.9
            ],
            "address": [
                "Badami Rural, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "A decent place to stay, although a few things can be improved. The bedsheets have stains, AC is also not of very good quality. And unlike other stays there are no discounts on multiple day bookings",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are very nice,but the manager is a cheater. Check in time is 12 o clock,we reached early and check in at 8:30,I informed that time that next day we will check out at 10:00.That time manager did not not informed that I have to pay one days extra charge if we check out after one hour.next day morning also he did not inform me that your time is over. Half an hour before checkin he asked for half day charge,I agree and tell that will leave room after 3 o clock,then he tell that you have to pay full day charge.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's easily accessible located on the main road which connects to the railway station, busstand is near by just 4 minutes away,  a lot of hotels are there nearby, the popular chain grocery store MORE is just beneath the residency.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms were well maintained and clean. Very nicely maintained property. MORE is just below which was helpful… loved the stay.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Decent rooms. No in room services available. If you are looking for just accommodation, this place is good",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent place stay although things improved bedsheets stains ac also good quality unlike stays discounts multiple day bookings",
                "rooms nicebut manager cheater check time clockwe reached early check informed time next day check time manager informed pay one days extra charge check one hournext day morning also inform time half hour checkin asked half day chargei agree tell leave room clockthen tell pay full day charge",
                "easily accessible located main road connects railway station busstand near minutes away lot hotels nearby popular chain grocery store beneath residency",
                "rooms well maintained clean nicely maintained property helpfulâ\u0080¦ loved stay",
                "decent rooms room services available looking accommodation place good"
            ]
        },
        {
            "name": "Hotel Anand Deluxe",
            "rating": [
                3
            ],
            "address": [
                "bus stand, railway station road, near, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "Stayed in this lodge on 24th dec 2023, though service found good, Rooms are not fresh ,Toilet cleanliness is pathetic, Parking is congested\nFor simmilar rates you find good lodges on peak days,\n5kms away from Shakhambari temple",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Rooms are not clean, pathetic service, this hotel does not provide basic items like towel etc in normal room.\nPathetic rooms, service and rude reception",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Incident when I went in March 2023- My experience was not good, I went to Badami with my family, I went to see the room alone and I fixed the room and also decided the rate, after a while I went to check in with my family, then The man at the counter was different and the man was sitting drunk, he started demanding more than the agreed amount. I paid more because I had no choice,\nYou can see the condition of the room.",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Worst Hotel is very expensive and service is bad and hotel staff also rudes to customer do not visit this hotel you will get more trouble and problem and not even you get hot and cold water the boys in this photos are very disgusting they not even respect to old age people",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Beware of bedbugs here.\n\nIt's a over priced stay in Badami. They charge ₹1500 for each room which is very expensive for this kind of room and service.\n\nRooms are very small and toilets are not so in good condition. If you don't have any other choice, stay here.\n\nPower goes sometimes without backup for few minutes. Hot water they said it will be available till 10 AM while we check-in but morning they said take bath quickly it will be stopped at 9 AM.\n\nDon't reach this hotel in the late night, they will be in the deep sleep and not so easy to make them awake or get a stay here.",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed lodge th dec though service found good rooms fresh toilet cleanliness pathetic parking congested simmilar rates find good lodges peak days kms away shakhambari temple",
                "rooms clean pathetic service hotel provide basic items like towel etc normal room pathetic rooms service rude reception",
                "incident went march experience good went badami family went see room alone fixed room also decided rate went check family man counter different man sitting drunk started demanding agreed amount paid choice see condition room",
                "worst hotel expensive service bad hotel staff also rudes customer visit hotel get trouble problem even get hot cold water boys photos disgusting even respect old age people",
                "beware bedbugs priced stay badami charge â\u0082¹ room expensive kind room service rooms small toilets good condition dont choice stay power goes sometimes without backup minutes hot water said available till checkin morning said take bath quickly stopped dont reach hotel late night deep sleep easy make awake get stay"
            ]
        },
        {
            "name": "Hotel Mookambika Deluxe",
            "rating": [
                3.6
            ],
            "address": [
                "Station Rd, Badami Rural, Badami, Karnataka 587201, India"
            ],
            "reviews": [
                {
                    "text": "The staff and the owner is very supportive.It is in very convenient location and affordable rates. Rooms were well maintained.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Great value for price. \"Deluxe\" is not the word I'd choose to describe it, but it's comfortable and sufficient. The location is awesome, major sites all in walking distance. I was particularly impressed with the staff. The site through which I had booked the hotel had failed to forward my booking and the booked room was not available on the first night, but the staff was kind enough to give me different (bigger) room for one night with no added charges. Also extremely helpful in general with tips & arrangements.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Excellent hotel for budget travellers, right across from the bus station. Nice garden bar nearby.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I stayed only for one night. My booking was originally at some other hotel but i had to stay here for one night due to some issue with the booking. I was sceptical at first but the Manager/Owner was very helpful. He made sure I was comfortable and also arranged for a cab for sightseeing. Rooms are slightly old and a little rough around the edges. But they are passably clean. The hotel is located right opposite the bus stand. So it is very convenient but also quite noisy (although I did not face much of an issue). Do not expect 5 star service but f you want a reasonay comfortable stay for a couple of nights this will do the job.\n\nThe hotel has a bar but does not serve meals. Veg snacks are fine but nonveg is not.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The good part about this hotel is that location, which is hardly 10 minutes away from the Badami cave temples. The rooms were clean and we had a comfortable stay of two days. They should start the food service as well, we had to go out for the food.\nAlso, the staff need to talk in Hindi or English, as a tourist nobody will learn Kannada.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff owner supportiveit convenient location affordable rates rooms well maintained",
                "great value price deluxe word id choose describe comfortable sufficient location awesome major sites walking distance particularly impressed staff site booked hotel failed forward booking booked room available first night staff kind enough give different bigger room one night added charges also extremely helpful general tips arrangements",
                "excellent hotel budget travellers right across bus station nice garden bar nearby",
                "stayed one night booking originally hotel stay one night due issue booking sceptical first managerowner helpful made sure comfortable also arranged cab sightseeing rooms slightly old little rough around edges passably clean hotel located right opposite bus stand convenient also quite noisy although face much issue expect star service f want reasonay comfortable stay couple nights job hotel bar serve meals veg snacks fine nonveg",
                "good part hotel location hardly minutes away badami cave temples rooms clean comfortable stay two days start food service well go food also staff need talk hindi english tourist nobody learn kannada"
            ]
        }
    ]
}