{
    "places_with_reviews": [
        {
            "name": "Hotel Mandal Ghang",
            "rating": [
                4.3
            ],
            "address": [
                "Upper, near PWD Circuit House, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "This place had amazing views and lovely people who made our stay even more exciting.\n\nWe had bonfire in the evening and spent some time with the people there chit chatting with good music and ambience.\n\nThe view from our room was awesome and we could see the sunrise.\nThe kameng river can also be seen from here.\n\nThey had lots and lots of plants and beautiful flowers. Perfect place for a nature lover.\n\nThey have their own restaurant where you can order food and the food tastes really good.\n\nI loved my stay there and would definitely visit again if I go to Bhalukpong.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The best thing about this hotel is that you will get to experience one of the best sunrises. The hotel is located just next to the river and you will get the best view from the terrace. You can also see the clear sky with n number of stars.\nThe rooms were pretty good, clean and well-maintained. The staff was courteous and helpful, and the food served was good.\nSo overall it was a comforting stay for me.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had a comfortable stay here. They accommodated our last minute request of having an extra guest. The rooms, washroom are nice & decent. Food prepared was homely. The views, sunrise are beautiful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great hotel, very clean, very well situated next to the Tiger reserve, but the best of all was definitely the service. Big thanks to Jessica who managed everything perfectly and was always ver helpful and on point on everything. Food, activities, transport, she organised everything on time in the best way.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The location of the hotel is great with a very good sunrise view. The food was okaish, but rooms were very good.\nGood budget hotel to be considered for your halt in Bhalukponk",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place amazing views lovely people made stay even exciting bonfire evening spent time people chit chatting good music ambience view room awesome could see sunrise kameng river also seen lots lots plants beautiful flowers perfect place nature lover restaurant order food food tastes really good loved stay would definitely visit go bhalukpong",
                "best thing hotel get experience one best sunrises hotel located next river get best view terrace also see clear sky n number stars rooms pretty good clean wellmaintained staff courteous helpful food served good overall comforting stay",
                "comfortable stay accommodated last minute request extra guest rooms washroom nice decent food prepared homely views sunrise beautiful",
                "great hotel clean well situated next tiger reserve best definitely service big thanks jessica managed everything perfectly always ver helpful point everything food activities transport organised everything time best way",
                "location hotel great good sunrise view food okaish rooms good good budget hotel considered halt bhalukponk"
            ]
        },
        {
            "name": "Waii International Hotel Bhalukpong",
            "rating": [
                3.9
            ],
            "address": [
                "Lower Bhalukpong, near IOCL Petrol Pump, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "Located just near the Arunachal Pradesh checking point in Bhalukpong, the location is perfectly accessible. There's a market place just outside the hotel, and is also near a petrol pump. The hotel building has great amenities like a salon, a gym, and a restaurant. The rooms are spacious, well furnished, and is lit (except for few ceiling lights which were broken). Overall a great hotel to book your stay in for any purpose! 👍🏻",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is only worth the location as a way-stop. The food was tasteless. The staff are very cooperative but the hotel fails. The rooms are not worth the rate.\n\nThe door locks don't work, poor maintenance, no power, no soft drink, no cold water, food quality is poor. After 8 nobody will answer reception.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Not preferable.\nRooms don't give a feeling of cleanliness.\nAssam tourism guest house is nearby should be considered instead of this place",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Conveniently located near the border of Arunachal Pradesh and Assam, the hotel has spacious rooms and all the necessary privileges.\nThere are markets and eateries near this hotel\nCourteous staff, good food (complementary breakfast was very good)\nOn our request they gave us an all-out also since the room had some mosquitoes.\nOverall very good stay experience for one night.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Beautiful and cozy stay, food was great, over all hotel is nice and clean. The property location is good. The staff has been very polite and welcoming.  Tq Soo much All Of Staff & Managers Sir ☺️👍",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located near arunachal pradesh checking point bhalukpong location perfectly accessible theres market place outside hotel also near petrol pump hotel building great amenities like salon gym restaurant rooms spacious well furnished lit except ceiling lights broken overall great hotel book stay purpose ð\u009f\u0091\u008dð\u009f\u008f »",
                "hotel worth location waystop food tasteless staff cooperative hotel fails rooms worth rate door locks dont work poor maintenance power soft drink cold water food quality poor nobody answer reception",
                "preferable rooms dont give feeling cleanliness assam tourism guest house nearby considered instead place",
                "conveniently located near border arunachal pradesh assam hotel spacious rooms necessary privileges markets eateries near hotel courteous staff good food complementary breakfast good request gave us allout also since room mosquitoes overall good stay experience one night",
                "beautiful cozy stay food great hotel nice clean property location good staff polite welcoming tq soo much staff managers sir â\u0098ºï¸\u008fð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Hotel Seagull Bhalukpong",
            "rating": [
                3.6
            ],
            "address": [
                "Chariduar-Tawang Rd, Cona, 2J8P+6X8, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "Hotel seagull is one of the best hotels I have ever stayed..\nThe rooms are very big and airy.\nWashrooms are clean and have all sanitary facilities.\nWe enjoyed s great view from balcony.\nTheir service was mind blowing.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "This  hotel cum homestay offered the perfect blend of homely warmth and hotel-style comforts. Our stay here was an exquisite experience that combined the best of both worlds. It is siruated in the Upper Bhalukpong area.\nIt is good for a stay if you have come from a long distance (afar) and want to rest for the day to travel for the next day to a new destination.\nOur room was spacious, elegantly furnished, and meticulously clean. The attention to detail in design and the comfort of the bed made every night's rest truly rejuvenating.\nThe staff's hospitality was exceptional. From the moment we stepped in, their warm welcome and attentiveness made us feel like honored guests. They ensured every request was promptly met.The hotel's dining options were decent. Breakfast was simple but tasted good. The menu had quite a few options that catered to various tastes. The breakfast spread was extensive and delicious.\n\nThe seamless blend of homely comforts and hotel-like amenities created an unforgettable experience. It is a kid friendly stay. In all it was clean, well maintained and provided  a comfortable stay to relax after a tiring journey before starting a fresh for the    next day  .   Considering the price point, the hotel offered good value for money.  Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Lovely stay. The location is great with a nice view. The hotel itself was also beautifully decorated with plants and flowers. Rooms were spacious and clean and all rooms had hot water. Staff was also very friendly and readily helped us with everything.\n\nOverall, I highly recommend it for families and large groups.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "This is a pretty good one. Spacious rooms with absolutely amazing food.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very spacious rooms. Hotel full of various flower & orchid. 24 hours hot water served. Hygienic rooms & bathroom. Service is little bit slow but manageable. Kameng river is within walking distance.  Stayed for one days on Oct'22. Recommended for family trip.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel seagull one best hotels ever stayed rooms big airy washrooms clean sanitary facilities enjoyed great view balcony service mind blowing",
                "hotel cum homestay offered perfect blend homely warmth hotelstyle comforts stay exquisite experience combined best worlds siruated upper bhalukpong area good stay come long distance afar want rest day travel next day new destination room spacious elegantly furnished meticulously clean attention detail design comfort bed made every nights rest truly rejuvenating staffs hospitality exceptional moment stepped warm welcome attentiveness made us feel like honored guests ensured every request promptly metthe hotels dining options decent breakfast simple tasted good menu quite options catered various tastes breakfast spread extensive delicious seamless blend homely comforts hotellike amenities created unforgettable experience kid friendly stay clean well maintained provided comfortable stay relax tiring journey starting fresh next day considering price point hotel offered good value money highly recommended",
                "lovely stay location great nice view hotel also beautifully decorated plants flowers rooms spacious clean rooms hot water staff also friendly readily helped us everything overall highly recommend families large groups",
                "pretty good one spacious rooms absolutely amazing food",
                "spacious rooms hotel full various flower orchid hours hot water served hygienic rooms bathroom service little bit slow manageable kameng river within walking distance stayed one days oct recommended family trip"
            ]
        },
        {
            "name": "Hotel Kameng Inn",
            "rating": [
                4
            ],
            "address": [
                "2J8Q+5QX, Chariduar - Tawang Rd, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "I will give negative review to this hotel.\nI stayed there one night on 26th Oct 2023. At night while we were sleeping, thief entered our room through the window and took away my mobile and also money from my wallet. I think it is the responsibility of the owner to provide security to the tourists. In the morning they said, \" you should have locked the window\". Actually the window was closed but not locked and the window was covered by curtain so we didn't checked the lock.  I think if such thefts are common in this area then they should warn the tourist.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Apart from the location, this hotel is probably one of the worst things that happened during the Arunachal Pradesh trip.\n\n1.\tThe hotel staff, including the manager(probably owner), seemed shady. First, they must learn the difference between running a shop and operating in the hospitality industry. We came from a different place, and there were many other hotels in that area, but there was not a pinch of hospitality in their gesture. I remember the owner or manager (I don’t know who the lady was), asked me twice about the advanced payment as if I was going to run away without paying.\n2.\tWhen my wife asked for an extra blanket, she plainly said every room had a fixed amount of blankets and not possible to provide. It may be possible, not a problem in that, but the way she threw the sentence was as if we came to a dharmasala.\n3.\tThe ambience was straight out from Norman Bate’s hotel (Hitchcock’s Psycho). Nobody was there; two staff looked at us as if we were the first guests they ever saw. The sceptical looks indifferent attitude show the room, and when asking about the food, the uninteresting reply to tell us to go to the nearby shops to search for food.\n4.\tA few days ago, before our arrival, a theft happened in the hotel, and the owner completely denied the responsibility. She even told us to lock all doors and windows. When we entered the room, the balcony door’s latches were broken.\n\nOverall, in my opinion if anyone wants to stay in Bhalukpong, it is better to stay in Tippi or any hotel near the city. The location is good but the food joints are very rudimentary, people are cynical, and there is a strange air, which is a bit disturbing.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Excellent property and very convenient with very peaceful environment. The hotel with an enchanting view ,scenery was beautiful to watch from the room itself and it was a relieve to walk in such a quiet and peaceful environment. The staffs were very helpful and always available , even in midnights.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Heartiest thank you sam bro n your staff, your hospitality, services are too good it's beyond our imagination, price is too reasonable,... Keep it up bro, hoping to make a next visit next year...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice hotel ,&very good service",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "give negative review hotel stayed one night th oct night sleeping thief entered room window took away mobile also money wallet think responsibility owner provide security tourists morning said locked window actually window closed locked window covered curtain didnt checked lock think thefts common area warn tourist",
                "apart location hotel probably one worst things happened arunachal pradesh trip hotel staff including managerprobably owner seemed shady first must learn difference running shop operating hospitality industry came different place many hotels area pinch hospitality gesture remember owner manager donâ\u0080\u0099t know lady asked twice advanced payment going run away without paying wife asked extra blanket plainly said every room fixed amount blankets possible provide may possible problem way threw sentence came dharmasala ambience straight norman bateâ\u0080\u0099s hotel hitchcockâ\u0080\u0099s psycho nobody two staff looked us first guests ever saw sceptical looks indifferent attitude show room asking food uninteresting reply tell us go nearby shops search food days ago arrival theft happened hotel owner completely denied responsibility even told us lock doors windows entered room balcony doorâ\u0080\u0099s latches broken overall opinion anyone wants stay bhalukpong better stay tippi hotel near city location good food joints rudimentary people cynical strange air bit disturbing",
                "excellent property convenient peaceful environment hotel enchanting view scenery beautiful watch room relieve walk quiet peaceful environment staffs helpful always available even midnights",
                "heartiest thank sam bro n staff hospitality services good beyond imagination price reasonable keep bro hoping make next visit next year",
                "nice hotel good service"
            ]
        },
        {
            "name": "Hotel wanga tsang residency",
            "rating": [
                4.1
            ],
            "address": [
                "Chariduar - Tawang Road, Balipara - Bhalukpung Rd, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "We stayed here for one night while going towards Tawang from Guwahati. Room is decent, budget-friendly. It is situated in the main market area, so you'll get lot of food options outside. Regarding room service one thing I would like to mention, they didn't provide drinking water, we had to buy from outside. Overall good option for one night stay within budget.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very Good Service provided. Value for money rooms. Hot water 24×7. Warm Rooms. Clean Beds. Beautiful Mountain View.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "When we were heading towards Tawang we decided to stay here for a night.Very clean and tidy. AC and non AC both are available.The place from where you will get the Pass to go to Tawang is very close to this hotel.This is situated absolutely at the border area of Arunachal and Assam.Quality foods are available.I would love to prefer the momos.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A cheap and clean hotel alone the main market area with ample of restaurant options nearby",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Guests happy. Neat & Clean Rooms. Location Good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed one night going towards tawang guwahati room decent budgetfriendly situated main market area youll get lot food options outside regarding room service one thing would like mention didnt provide drinking water buy outside overall good option one night stay within budget",
                "good service provided value money rooms hot water ã\u0097 warm rooms clean beds beautiful mountain view",
                "heading towards tawang decided stay nightvery clean tidy ac non ac availablethe place get pass go tawang close hotelthis situated absolutely border area arunachal assamquality foods availablei would love prefer momos",
                "cheap clean hotel alone main market area ample restaurant options nearby",
                "guests happy neat clean rooms location good"
            ]
        },
        {
            "name": "Hotel Druk",
            "rating": [
                4.2
            ],
            "address": [
                "2J8P+PC3, near EAC office, Upper Bhalukpong, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "Nothing extraordinary about the place but no complaints as well. Spacious and clean rooms with all basic facilities. An all girls staff that was friendly enough. Good food and fairly priced. Just 2 minutes drive from the main road.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A convenient hotel in AP located right on the entrance/ exit to Greater Arunachal, very close to Assam border. Convenient for travellers coming down from Bomdilla for evening stay, or those reaching it from Guwahati airport in the morning before commencing the climb to the mighty Himalayas early next morning. Rooms are spacious and comfortable, food is very tasty and staff is courteous. One can enjoy a drive to the Maneri national park and Tipi Orchid Research Center nearby by taking an extra days stay",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Moderately rated hotel. Although doesn't give an impressive look from outside,  the hotel inside is quite impressive. Rooms are well furnished and spacious. Dining com reception hall is a huge one. Food is also not bad. Both veg. as well as non veg. items are available.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Perfect place for stay when you plan tawang or dirang road trip its very pleasant place good for family or solo travelers too",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent service and cooperative staff. Food is wonderful. The rooms are clean and well kept. Moreover, it is in a quaint place. HIGHLY RECOMMENDED.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nothing extraordinary place complaints well spacious clean rooms basic facilities girls staff friendly enough good food fairly priced minutes drive main road",
                "convenient hotel ap located right entrance exit greater arunachal close assam border convenient travellers coming bomdilla evening stay reaching guwahati airport morning commencing climb mighty himalayas early next morning rooms spacious comfortable food tasty staff courteous one enjoy drive maneri national park tipi orchid research center nearby taking extra days stay",
                "moderately rated hotel although doesnt give impressive look outside hotel inside quite impressive rooms well furnished spacious dining com reception hall huge one food also bad veg well non veg items available",
                "perfect place stay plan tawang dirang road trip pleasant place good family solo travelers",
                "excellent service cooperative staff food wonderful rooms clean well kept moreover quaint place highly recommended"
            ]
        },
        {
            "name": "Hotel Gori Chen",
            "rating": [
                3.6
            ],
            "address": [
                "Bhalukpong Lower Bhalukpong, near IOCL Petrol Pump, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "Too tight and congested rooms. Poor service and costly rooms. Even oyos in Guwahati is far better then this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good enough as a budget stay at Bhalukpong.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very satisfied..the hotel is neat and clean..keep up Gorichen team,👍",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Value for money",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very costly",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "tight congested rooms poor service costly rooms even oyos guwahati far better hotel",
                "good enough budget stay bhalukpong",
                "satisfiedthe hotel neat cleankeep gorichen teamð\u009f\u0091\u008d",
                "value money",
                "costly"
            ]
        },
        {
            "name": "Chotten Hotel, fooding and lodging",
            "rating": [
                4.6
            ],
            "address": [
                "opposite to Maruti Suzuki dealership, Tippi Village, 790114"
            ],
            "reviews": [
                {
                    "text": "This place is in Tippi which is around 5-6 km away from the Assam-Arunachal border area \"Bhalukpong\". The Hotel has a very good parking space and the place is located near the river front . The food is very homely and yum. The owner here is a lady who is very friendly and helpful. They have lodging and gift corner as well. Overall a very nice place to stay overnight and enjoy the the orchid, scenic view, waterfall of Tippi.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Ample parking area. A place to relax and prepare for perilous journey towards Bomdila - Tawang. Nearby places to visit during the stay - Science museum, Orchidarium, waterfall, Kameng river.\nFood is yum. Air conditioners in the fooding area helps a lot. Staff - always helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very nice food in sarvesh for room",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good to stay here",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Phone number?",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place tippi around km away assamarunachal border area bhalukpong hotel good parking space place located near river front food homely yum owner lady friendly helpful lodging gift corner well overall nice place stay overnight enjoy orchid scenic view waterfall tippi",
                "ample parking area place relax prepare perilous journey towards bomdila tawang nearby places visit stay science museum orchidarium waterfall kameng river food yum air conditioners fooding area helps lot staff always helpful",
                "nice food sarvesh room",
                "good stay",
                "phone number"
            ]
        },
        {
            "name": "Hotel Solu",
            "rating": [
                3.5
            ],
            "address": [
                "2J6W+6F9, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "We reached Bhalukpong on 19th May 2016 late evening, our driver, BabuAli suggested this riverside hotel. Really a superb view of the river and the road to Tawang just below, you could see all the vehicles zooming to Tawang. We got Egg curry cooked and served mostly by young girls. A darkish young girl, (around 22yrs) the manager, showed us the rooms and we at once fell in love with the ambience, started staying, though perhaps not so luxurious in appearance and cleanliness, but we loved the moon-lit view of the river rather too much and the decency of the manager, a little snobbish, yet tolerable. Interestingly, this hotel has all the energizing switches of AC, geyser etc. at the reception counter too and I was told different rates would apply if we used AC, we laughed at this very inexpensive hotel's extra-charges !!! Next morning there was a ceremony for all Tibetans living in and around Arunachal, there was a huge queue, (300 kids) around 6:30 AM, the festivities started right from this hotel with the burning of Fern Tree Leaves and an agile Ghost dancing like a snake-dragon !!! I took long videos for an hour right from my balcony, then the queue move away. We were refused BF as there was no cook at the time, all had gone participating in the rituals, yet we pardoned them as we were still awed with the ceremony. Started for Dirang...alas ! forgot my expensive pant and belt and a few other items etc. at Solu hotel room !!\nOn our return journey from Tawang, a few days later, we just took a chance if the pant and items were still there ! OMG, everything was kept  we had never expected to be,  a fair looking chef girl (around 25yrs) brought the items immediately and returned to me ! I really wanted to give her a hefty sum as tips since she literally shocked me with their honesty, but was unfortunately distracted by some incoming tourists asking me questions about the dangers of touring Tawang etc. while explaining I move out of the hotel and forgot about the tips I owed her ! So sorry ! got onto our vehicle when I realized my mistake I was far away in Assam returning to Mumbai..but even to this day I remember the girl's (Solu's)  honesty !!! If there were pics of the hotel staff  I could send her the money I still feel indebted !",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "It's a great budget option to stay at bhalukpong, next to river. It has a great view and calm environment to offer . Location shown on map is not right. It's actually at Tippi, 5 km ahead of bhalukpong, next to Essar fuel pump. Service is good, rooms are decent. If you are staying der don't miss to visit d river in d backyard of d hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Specialty in Chinese cuisine also... It's a wonderful cosy place for newly couple's .....",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The name of the hotel has been changed to hotel Mandal Ghang. The best place to stay in Bhalukpong....",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Very good service .good view",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "reached bhalukpong th may late evening driver babuali suggested riverside hotel really superb view river road tawang could see vehicles zooming tawang got egg curry cooked served mostly young girls darkish young girl around yrs manager showed us rooms fell love ambience started staying though perhaps luxurious appearance cleanliness loved moonlit view river rather much decency manager little snobbish yet tolerable interestingly hotel energizing switches ac geyser etc reception counter told different rates would apply used ac laughed inexpensive hotels extracharges next morning ceremony tibetans living around arunachal huge queue kids around festivities started right hotel burning fern tree leaves agile ghost dancing like snakedragon took long videos hour right balcony queue move away refused bf cook time gone participating rituals yet pardoned still awed ceremony started dirangalas forgot expensive pant belt items etc solu hotel room return journey tawang days later took chance pant items still omg everything kept never expected fair looking chef girl around yrs brought items immediately returned really wanted give hefty sum tips since literally shocked honesty unfortunately distracted incoming tourists asking questions dangers touring tawang etc explaining move hotel forgot tips owed sorry got onto vehicle realized mistake far away assam returning mumbaibut even day remember girls solus honesty pics hotel staff could send money still feel indebted",
                "great budget option stay bhalukpong next river great view calm environment offer location shown map right actually tippi km ahead bhalukpong next essar fuel pump service good rooms decent staying der dont miss visit river backyard hotel",
                "specialty chinese cuisine also wonderful cosy place newly couples",
                "name hotel changed hotel mandal ghang best place stay bhalukpong",
                "good service good view"
            ]
        },
        {
            "name": "7th Heaven",
            "rating": [
                3.5
            ],
            "address": [
                "2J6V+GWV, Chariduar - Tawang Rd, Bhalukpong, 790114"
            ],
            "reviews": [
                {
                    "text": "IITG students bound for Tawang\nGood place good food\nVeg thali and fried rice were good\nDon't go for any cafe here",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Stayed here in April 2023. Very ordinary. Good location. No mirror and wardrobe. Unhygenic Bathroom with broken door and broken window pane. Will not suggest for family stay. Backpackers and low budget travellers may opt for. Restaurant is good. Food price on the higher side like in all part of AP. Owner lady is nice and cooperative.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Food is very nice. Try ethnic food like boiled chicken or boiled pork etc",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Very unhygienic and unsatisfied service, with very poor quality food with such high rate. Really unsatisfied with this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Would Rate This Place 5 Of 5 This Place Serves Amazing Food",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "iitg students bound tawang good place good food veg thali fried rice good dont go cafe",
                "stayed april ordinary good location mirror wardrobe unhygenic bathroom broken door broken window pane suggest family stay backpackers low budget travellers may opt restaurant good food price higher side like part ap owner lady nice cooperative",
                "food nice try ethnic food like boiled chicken boiled pork etc",
                "unhygienic unsatisfied service poor quality food high rate really unsatisfied hotel",
                "would rate place place serves amazing food"
            ]
        }
    ]
}