{
    "places_with_reviews": [
        {
            "name": "Four seasons Banquet and Resort",
            "rating": [
                4.5
            ],
            "address": [
                "The Lalit Cafe Rd, Bajrang Colony, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "HAD VISITED IN MANY MARRIAGES AND\nALSO HAVE MANY PARTIES THERE GOOD RESORT FOR MARRIAGE PARTY OF 700 PEOPLE",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "One of the wonderful properties to visit in the nearby location of Balortra.  It has a nice and large banquet and an open garden for functions or weddings. Rooms are comfortable and washrooms are neat and clean. Makes for a good stay!\nVery delicate arrangement for a destination wedding.\nOverall property was good and clean.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The resort is nice for family events with big size like weddings, inauguration, parties etc. The best part is that it is situated within Balotra city so the commute becomes so easy. It has good amenities like banquet hall, rooms, swimming pool and many more.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good  restaurants and  marriage garden 🏡",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Best resort in the town",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited many marriages also many parties good resort marriage party people",
                "one wonderful properties visit nearby location balortra nice large banquet open garden functions weddings rooms comfortable washrooms neat clean makes good stay delicate arrangement destination wedding overall property good clean",
                "resort nice family events big size like weddings inauguration parties etc best part situated within balotra city commute becomes easy good amenities like banquet hall rooms swimming pool many",
                "good restaurants marriage garden ð\u009f\u008f¡",
                "best resort town"
            ]
        },
        {
            "name": "THE ZURY RESORT",
            "rating": [
                4.4
            ],
            "address": [
                "The Lalit Cafe Rd, Bajrang Colony, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "Good resort located inside the town for weddings and big events.\nRooms are also good. Just the banquet hall is a bit far to walk 3 times a day but they have ecart for it.\nWe stayed there for 3 days. It was good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good events management, but\nSomewhere, it feels like not enough clean and stink, and there is no specific place provided for workers and drivers.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Its good, spacious but having continuous bad smell of colour and chemicals",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Great Rooms and good for marriage birthday functions and gathering",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "If you want a cool, big and clean place for hosting a big gathering, than your search ends here.  They have maintained a good and nice atmosphere here.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good resort located inside town weddings big events rooms also good banquet hall bit far walk times day ecart stayed days good experience",
                "good events management somewhere feels like enough clean stink specific place provided workers drivers",
                "good spacious continuous bad smell colour chemicals",
                "great rooms good marriage birthday functions gathering",
                "want cool big clean place hosting big gathering search ends maintained good nice atmosphere"
            ]
        },
        {
            "name": "Majisa Bhawan Jasol",
            "rating": [
                4.5
            ],
            "address": [
                "R689+7V8, Jasol, Rajasthan 344024, India"
            ],
            "reviews": [
                {
                    "text": "Haldi & sangeet dance choreography available\nSchool college annual function and farewell choreography available\nParty & baby shower choreography available",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "These are the arrangements made by the mother's temple for its devotees.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Here,Rooms are like luxury hotels with AC.In night the rooms from outside looking like marriage decoration.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Come and see the heaven",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Best",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "haldi sangeet dance choreography available school college annual function farewell choreography available party baby shower choreography available",
                "arrangements made mothers temple devotees",
                "hererooms like luxury hotels acin night rooms outside looking like marriage decoration",
                "come see heaven",
                "best"
            ]
        },
        {
            "name": "Hotel tulsi inn",
            "rating": [
                4.1
            ],
            "address": [
                "Near Ist railway crossing Mahadev tower, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "The place is situated near the railway station so it is easy to travel. We took the basic room, it was very congested and the washroom was too small to be used. The hot water geyser was not working the bed sheets/blankets were not clean the worst bason had few spots of Pan masala which was not cleaned properly by the staff before giving us the room. We did not get any soap or towels. They do not provide any food but they provide basic tea and coffee which is made near their reception area.\n\nIf you are very tight on budget then you can go with this hotel or else you can find other hotels with much better facilities.\n\nI can see this hotel was the cheapest among the options available but the quality can be improved.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A good and cosy place to stay in Balotra at a very low price, The location is fantastic, Rooms are nice and well maintained, Helpful staff. The railway station is just walking distance, surrounded by the busiest market, auto taxis are easily available . Must recommend to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I am from Nepál and first Time visit  at balotra. I stáy at hotel tulsi balotra . and Staff and owner Dino bohaté friendly Nature. bohat Help kiya mera . Thank you.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Friendly staff and near to railway station 🚉. Food delivery at room is also available. Surly recommend 👍\nHappy to stay here 🏨",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best location and hotel.nearest to railway station Balotra.highly recommended for balotra😊",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place situated near railway station easy travel took basic room congested washroom small used hot water geyser working bed sheetsblankets clean worst bason spots pan masala cleaned properly staff giving us room get soap towels provide food provide basic tea coffee made near reception area tight budget go hotel else find hotels much better facilities see hotel cheapest among options available quality improved",
                "good cosy place stay balotra low price location fantastic rooms nice well maintained helpful staff railway station walking distance surrounded busiest market auto taxis easily available must recommend stay",
                "nepã¡l first time visit balotra stã¡y hotel tulsi balotra staff owner dino bohatã© friendly nature bohat help kiya mera thank",
                "friendly staff near railway station ð\u009f\u009a\u0089 food delivery room also available surly recommend ð\u009f\u0091\u008d happy stay ð\u009f\u008f¨",
                "best location hotelnearest railway station balotrahighly recommended balotrað\u009f\u0098\u008a"
            ]
        },
        {
            "name": "Hotel City Square",
            "rating": [
                3.8
            ],
            "address": [
                "Hotel City Square, Jodhpur Road, Near New Bus stand, opp. Dudh Dairy, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "The place where food is made is very unhygienic and dirty. You will not be able to eat food if you watch it getting prepared.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst Hotel,worst service we stayed for 2 days but the elevator was fully closed no cleanliness nothing please do not check in this hotel don't go for photos",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst hotel I seen in my life. Never stay this type of hotel. No power in hotel ND food quality is very poor with limited items. Staff has no manner of talking and water leakage in every room I changed 3 to 4 rooms ll rooms are in worst conditions.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Don't check in bcz photos looks great\nThose pics are 10years old and when I took two rooms then I found  Pathetic plcae and hospitality is also worst\nthere is no sense of service\nIn mid night water supply off and ac unit fail and when we complain on same then staff spoke we can not fix it\nI changed 5 rooms to commander in this Hotel all are in same condition\nNote: there is big difference in delux and super deluxe category\nAC and water issue is same\n\nDon't suggest to go",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best room for night stop and good service.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place food made unhygienic dirty able eat food watch getting prepared",
                "worst hotelworst service stayed days elevator fully closed cleanliness nothing please check hotel dont go photos",
                "worst hotel seen life never stay type hotel power hotel nd food quality poor limited items staff manner talking water leakage every room changed rooms rooms worst conditions",
                "dont check bcz photos looks great pics years old took two rooms found pathetic plcae hospitality also worst sense service mid night water supply ac unit fail complain staff spoke fix changed rooms commander hotel condition note big difference delux super deluxe category ac water issue dont suggest go",
                "best room night stop good service"
            ]
        },
        {
            "name": "Mansarovar Hotel",
            "rating": [
                3.7
            ],
            "address": [
                "building No 1, Plot no 6, Khed Rd, near 2nd Railway Crossing Road, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "I had booked this hotel for my parents for their visit to Balotra. And they faced such a bad experience from the staff. The staff didn't address our requirements. They asked 100 times for hot waters. Rooms are not cleaned, and the bedsheets didn't washed.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "nice stay, I always stay at this hotel, owner narsingh ji is very cooperative and good persen",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "People should ask manager during check-in. Bcoz there is some technical issue with this hotel regarding payment. Today I went for check-in. They refused my check-in. They said they had not received payment from OYO, but I was booked that hotel from GOIBIBO and made payment earlier. It is recommended that hotel should resolve this issue with OYO management.\nAnd customer should confirm about their checkin after making payment whether they received payment or not. Bcoz cancellation window will be closed during check-in day.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Mansarovar Hotel is an average place to stay in the town Balotra. The facilities and hygiene are maintained decently. You can't expect luxury stay but for regular stat it is a decent option. It is economic and pocket friendly option. There is food, grocery and market available nearby.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hotel, staff are good ,washrooms are new and renovated, good hotel in budget price, location in heart of balotracity",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked hotel parents visit balotra faced bad experience staff staff didnt address requirements asked times hot waters rooms cleaned bedsheets didnt washed",
                "nice stay always stay hotel owner narsingh ji cooperative good persen",
                "people ask manager checkin bcoz technical issue hotel regarding payment today went checkin refused checkin said received payment oyo booked hotel goibibo made payment earlier recommended hotel resolve issue oyo management customer confirm checkin making payment whether received payment bcoz cancellation window closed checkin day",
                "mansarovar hotel average place stay town balotra facilities hygiene maintained decently cant expect luxury stay regular stat decent option economic pocket friendly option food grocery market available nearby",
                "good hotel staff good washrooms new renovated good hotel budget price location heart balotracity"
            ]
        },
        {
            "name": "Hotel milan",
            "rating": [
                4.1
            ],
            "address": [
                "R6RX+32M, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are good spacious neat & clean only staff is also well behaved manager is good, Only 1 Suggestion one Small lift must install the hotel it will be just Add on facility for elderly people to go to 2 nd floor  easily. Overall I rate 5 star for stay experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nearest new Bus Balotra Walking Distance",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "As per reviews it was not satisfactory. As electricity issue was often during a day. Even service was not up to mark as repeatedly reminders has to be given to room service. Room wasn't ready during check in & they were preparing room after check-in. Eventhough staff cooperation was good. But towards paying like 2500 per night it wasn't a worth. Definitely not recommended for family unless you are on business trip & alone for day.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Located in an isolated area.There is no good restaurant nearby.Rooms are okay, however room rent is moderate.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's new and good hot hotel, because is luxui hotels in the area and good service providing me with the same time this weekend is true.\nThis hotels service and the staff member are very nice company.\nFood and water are clean and room are luxury levels.\nMostly this hotel management is good and parking structure available that weekend life is better in hotels.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms good spacious neat clean staff also well behaved manager good suggestion one small lift must install hotel add facility elderly people go nd floor easily overall rate star stay experience",
                "nearest new bus balotra walking distance",
                "per reviews satisfactory electricity issue often day even service mark repeatedly reminders given room service room wasnt ready check preparing room checkin eventhough staff cooperation good towards paying like per night wasnt worth definitely recommended family unless business trip alone day",
                "located isolated areathere good restaurant nearbyrooms okay however room rent moderate",
                "new good hot hotel luxui hotels area good service providing time weekend true hotels service staff member nice company food water clean room luxury levels mostly hotel management good parking structure available weekend life better hotels"
            ]
        },
        {
            "name": "Moti Palace hotel , bar & restaurant",
            "rating": [
                3.9
            ],
            "address": [
                "kshatriyo ka morcha, opp. to Kheteshwar Colony Road, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "This is the best bet you got in this area, a very good hotel in and around Balotra. The rooms are well kept, spacious, well ventilated. The beds, bed sheets and comforter were all clean and also smelled good.\nThe staff was prompt and courteous. The room service was faster than what I had expected.\nThis hotel has a restaurant in its building. I found the restaurant to be a bit on expensive side keeping in view the town. The food wasn’t that tasty but not disappointing.\nOverall I would rate it a 4 star experience.\nThe owner gave me a discount on the room as I checked out about 10 hrs early.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Great food at a great price! Love the fish plates as well as the salads. restaurant that doesn't feel like a chain! Love this place!\nStopped here for a snack on our way back to Jodhpur.\nHad the boneless buffalo wings and potato skins appetizer and some French onion soup. Appetizer was very good...\nFood was very good and reasonably priced. Ordered a steak dinner. It was tender and well seasoned.\nMoti palace Restaurants are well known in the Balotra area. Reasonably priced good food and drink. Lots of bar and dining room seating, with plenty of flat screen TV's to give...\nThe menu offers a wide variety of mouth-watering starters. I had the white asparagus accompanied by a mousseline sauce and poached eggs, while my friend tried the zucchini carpaccio served with sundries tomatoes and a mozzarella strudel. They were exquisite. The main course consisted in a risotto with scallop cooked in cream and a cassolette of coley with mussels, which really thrilled us. It all was followed by a delicious apple pie served with a scoop of vanilla ice cream for dessert.\nyou enter the place you are welcomed by a magnificent setting, a delightful marriage of antique cut stones and the luxuries of modernity.  Sitting in any table you have a wonderful view of the workshop-like kitchen where you can see the chefs working. For those who do not book a table and are waiting, there is a cosy lounge with aged leather armchairs and pictures of polo players displayed on the walls.\nAll the products were fresh and the dishes had the warmth of home-made food. The chefs takes great care in selecting the best quality ingredients. The restaurant also caters for all tastes by providing a large selection of the best wines of the region, which are pricy but worth sampling.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's fine as far as rooms are concern in this small place. From outer look don't look sofesticate, rather looks simple. Rooms are good with all basic facilities especially for hot water, tea and coffee, slow service in restaurant, limited food option in restaurant. Lift is available and you can pay by card too. I have stayed in other available hotels in this town and found that the rooms of this hotel are better .... Yes, you have to compare with price and facilities as well.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's ok",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Restaurant & bar, high in pricing as its services.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best bet got area good hotel around balotra rooms well kept spacious well ventilated beds bed sheets comforter clean also smelled good staff prompt courteous room service faster expected hotel restaurant building found restaurant bit expensive side keeping view town food wasnâ\u0080\u0099t tasty disappointing overall would rate star experience owner gave discount room checked hrs early",
                "great food great price love fish plates well salads restaurant doesnt feel like chain love place stopped snack way back jodhpur boneless buffalo wings potato skins appetizer french onion soup appetizer good food good reasonably priced ordered steak dinner tender well seasoned moti palace restaurants well known balotra area reasonably priced good food drink lots bar dining room seating plenty flat screen tvs give menu offers wide variety ofâ mouthwatering starters white asparagus accompanied mousseline sauce poached eggs friend tried zucchini carpaccio served sundries tomatoes mozzarella strudel exquisiteâ main course consisted inâ risotto scallop cooked cream cassolette coley mussels really thrilled us followed delicious apple pie served scoop vanilla ice cream dessert enter place welcomed magnificent setting delightful marriage antique cut stones luxuries modernity sitting table wonderful view workshoplike kitchen see chefs working book table waiting cosy lounge aged leather armchairs pictures polo players displayed walls products fresh dishes warmth homemade food chefs takes great care selecting best quality ingredients restaurant also caters tastes providing large selection best wines region pricy worth sampling",
                "fine far rooms concern small place outer look dont look sofesticate rather looks simple rooms good basic facilities especially hot water tea coffee slow service restaurant limited food option restaurant lift available pay card stayed available hotels town found rooms hotel better yes compare price facilities well",
                "ok",
                "restaurant bar high pricing services"
            ]
        },
        {
            "name": "Hotel Malani International",
            "rating": [
                4.1
            ],
            "address": [
                "New Bus Stand, Jodhpur - Balotra Rd, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "Very bad experience\nThe room was so dirty 😞",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Fine taste",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very good service",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Ok",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Owners behaviour is sooo rude",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience room dirty ð\u009f\u0098\u009e",
                "fine taste",
                "good service",
                "ok",
                "owners behaviour sooo rude"
            ]
        },
        {
            "name": "Hotel Neelam Inn",
            "rating": [
                4.3
            ],
            "address": [
                "Jodhpur - Balotra Rd, opposite Nilam Cenema Hall, HOTELNEELAMINNLNN, Balotra, Rajasthan 344022, India"
            ],
            "reviews": [
                {
                    "text": "Stayed here during a friend's wedding ceremony.\nDecent place.\nThere was no power backup as we had to take stairs for upto three floors as the lifts were not working. The staffs were helpful and supportive.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Hotel is in a lane . good for solo traveller or budget traveller. Room is mid size OK too. with hot water 24 hrs on tap. Cleanliness is OK. Man on reception is nice guy.try not to opt when with family . you can reach hotel either from railway stn side or from collect rate circle side. Walking distance from both the side. Food is OK and prices are very genuine. You can take edibles in hotel itself. Various hotels are available nearby.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "'Neelam In' hotel is nice place to stay with freindly staff. All rooms are fully furnished and well managed.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Meelam Inn Hotel is best stay .\nSuch a nice location and views, clean comfortable great location.\nI suggest you my friends this is a great place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good job",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed friends wedding ceremony decent place power backup take stairs upto three floors lifts working staffs helpful supportive",
                "hotel lane good solo traveller budget traveller room mid size ok hot water hrs tap cleanliness ok man reception nice guytry opt family reach hotel either railway stn side collect rate circle side walking distance side food ok prices genuine take edibles hotel various hotels available nearby",
                "neelam hotel nice place stay freindly staff rooms fully furnished well managed",
                "meelam inn hotel best stay nice location views clean comfortable great location suggest friends great place stay",
                "good job"
            ]
        }
    ]
}