{
    "places_with_reviews": [
        {
            "name": "Lemon Tree Hotel, Aligarh",
            "rating": [
                4.3
            ],
            "address": [
                "Plot No:B/11, Marris Rd, opp. Pragati Vihar Colony, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "The staff is super helpful in this facility particularly Ashish at the front desk, Nitin and Ankit at the restaurant. These amazing individuals are determined to make this facility stand out. I have traveled the world and have stayed in the finest places and surely this facility is among the best.\nTruly beyond expectations!! A five star experience.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Lemon Tree Hotels are known for their vibrant decor, refreshing ambiance, and warm hospitality. The hotel chain has a strong presence across India, offering comfortable stays at reasonable prices.\n\nThe rooms are clean, well-maintained, and come with all the necessary amenities. The staff is courteous and always ready to assist, adding a personal touch to the stay. The hotel's dining options are also impressive, with a variety of delicious dishes to choose from.\n\nOne of the highlights of Lemon Tree Hotels is their focus on sustainability. They have implemented various eco-friendly practices, such as water and energy conservation measures, which is commendable.\n\nOverall, Lemon Tree Hotels offer a pleasant and memorable stay experience, making them a great choice for both business and leisure travelers.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good location on Marris Road. Well designed and located. The lobby and restaurant are quite decent. Rooms are also state of the art, not very luxurious yet good enough for a business hotel. Staff is warm and courteous. Food is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great ambiance, good food, comfortable stay.\nRefreshes you after a tiring day.\nThis is the essence of Lemon Tree Hotel, Aligarh\nEnjoyed it and will always recommend it.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Its located centrally, has good staff, Shavez at the reception and Chef Moin are exceptional. Rooms are a little smaller in size and so are the bathrooms. Other than that the staff was responsive and service was good.They don't have a vallet parking, the owners should look into it.\nThe cleanliness and food was good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff super helpful facility particularly ashish front desk nitin ankit restaurant amazing individuals determined make facility stand traveled world stayed finest places surely facility among best truly beyond expectations five star experience",
                "lemon tree hotels known vibrant decor refreshing ambiance warm hospitality hotel chain strong presence across india offering comfortable stays reasonable prices rooms clean wellmaintained come necessary amenities staff courteous always ready assist adding personal touch stay hotels dining options also impressive variety delicious dishes choose one highlights lemon tree hotels focus sustainability implemented various ecofriendly practices water energy conservation measures commendable overall lemon tree hotels offer pleasant memorable stay experience making great choice business leisure travelers",
                "good location marris road well designed located lobby restaurant quite decent rooms also state art luxurious yet good enough business hotel staff warm courteous food also good",
                "great ambiance good food comfortable stay refreshes tiring day essence lemon tree hotel aligarh enjoyed always recommend",
                "located centrally good staff shavez reception chef moin exceptional rooms little smaller size bathrooms staff responsive service goodthey dont vallet parking owners look cleanliness food good"
            ]
        },
        {
            "name": "Clarks Inn Aligarh",
            "rating": [
                4
            ],
            "address": [
                "Mandir Ka Nagla, Agra Rd, near Flyover, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "This is a great place to stay at aligarh. 100 metre Near the highway and easily approachable. I travelled here as a business solo traveler. Ambience is good. Rooms are super clean. Staff behaviour is also good. What I personally liked about the property is the calm and quiet environment. Restaurant is also great and the food is super delicious. 5 out of 5 points for the property.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I'm thrilled to express my satisfaction with Hotel Clarks Inn Aligarh following my brother's engagement on October 24, 2023. The starters were delightful, the ambiance was ideal, and the main course surpassed our expectations. The attentive service contributed to an overall exceptional experience, creating lasting memories for our family. I highly recommend this venue for special celebrations!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotel with very supportive staff.\nI went for one of my relatives engagement function.\nStaff was very proactive and bringing the items before it finishes.\nFood quality is very good.\nPart hall ambienece is good.\nOverall its a good place for family functions",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This hotel resides just on the corner on aligarh highway\n1. ROOMS PRICES\n• We booked 2 rooms for our guests priced at 3500₹ per room\n2.  FOOD\n• In hotel restaurant was OUTSTANDING 5/5\n3. SERVICE\n• Service was very quick and amazing and specially High quality staff in restaurant which helps you with children handling and gives you comfort\n\nThis hotel is highly recommended",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "\"ZERO\" ratings\n\nWorst ever services, unprofessional management, unhygienic mattress.. never ever recommended even for free. This hotel is more like a 500/- OYO where no lift is working, walls are unpainted, no electricity in rooms, electricity boards are broken, no water supply in rooms. Here I'm attaching some photos for your reference. If you need more proofs, contact me.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great place stay aligarh metre near highway easily approachable travelled business solo traveler ambience good rooms super clean staff behaviour also good personally liked property calm quiet environment restaurant also great food super delicious points property",
                "im thrilled express satisfaction hotel clarks inn aligarh following brothers engagement october starters delightful ambiance ideal main course surpassed expectations attentive service contributed overall exceptional experience creating lasting memories family highly recommend venue special celebrations",
                "good hotel supportive staff went one relatives engagement function staff proactive bringing items finishes food quality good part hall ambienece good overall good place family functions",
                "hotel resides corner aligarh highway rooms prices â\u0080¢ booked rooms guests priced â\u0082¹ per room food â\u0080¢ hotel restaurant outstanding service â\u0080¢ service quick amazing specially high quality staff restaurant helps children handling gives comfort hotel highly recommended",
                "zero ratings worst ever services unprofessional management unhygienic mattress never ever recommended even free hotel like oyo lift working walls unpainted electricity rooms electricity boards broken water supply rooms im attaching photos reference need proofs contact"
            ]
        },
        {
            "name": "Hotel Orchid Blu",
            "rating": [
                4.6
            ],
            "address": [
                "Hotel Orchid Blu, Ramghat Rd, Kishanpur, Janakpuri, Hem Chand Compound, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "Superb location. Excellent service rendered by every member of staffs that served us especially Mr Aslam khan at the reception .Very clean ambience from the hotel entry to the room and the toilet . Good heater service and hot water in this cold winter trip of ours. Definitely worth the price and this is our  hotel whenever we stay in Aligarh. Would recommend others to book this hotel too.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "One of the best hotel for small function like engagement, party etc. Food and Hall was excellent. Pradeep AGM behaviour was very cooperative. Rooms services was good. Parking was too spacious.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We are really impressed with the best ambience, food and service we have experienced in Aligarh. The Orchid staff were really helpful and cooperative.\n\nPlease visit as soon as possible.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Loved the service and food here. Staff is very patient and well behaved. Quality of food is very good.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Enjoyed the food.\nThe services were really good\nEveryone enjoyed alot.\nWe celebrated my in the \"Lotus hall\", it is very spacious.\nThe staff is really polite and sweet.\nEnjoyed the evening :)",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "superb location excellent service rendered every member staffs served us especially mr aslam khan reception clean ambience hotel entry room toilet good heater service hot water cold winter trip definitely worth price hotel whenever stay aligarh would recommend others book hotel",
                "one best hotel small function like engagement party etc food hall excellent pradeep agm behaviour cooperative rooms services good parking spacious",
                "really impressed best ambience food service experienced aligarh orchid staff really helpful cooperative please visit soon possible",
                "loved service food staff patient well behaved quality food good",
                "enjoyed food services really good everyone enjoyed alot celebrated lotus hall spacious staff really polite sweet enjoyed evening"
            ]
        },
        {
            "name": "Fortune Park, Aligarh - Member ITC's hotel group",
            "rating": [
                4.4
            ],
            "address": [
                "fortune park, 3747/1, GT Rd, near Maharaja Agrasen Sewa Sadan, Budh Vihar North, Bannadevi, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "It had also automatic water tap. They sensed our hands and automatically opened. We put our hands in the water dryer and it gave us cool air. The flush of toilet had two one big and one small. I clicked the big one and holded it the water ran throught the toilet until I pressed the button. The walls of the living room had water sprinklers. Outside there was also a amazing fountain.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I had a worst experience with the staff….worst hospitality… staff don’t even know how to  talk with the visitors…not even manager specially Mr. Kuldeep has any gesture to show … this hotel staff should be change immediately first of all main manager. He did misbehave with our little kids to enjoying with Christmas decoration.  He told us that your kids can’t touch it and plz apne bacche sambhaliye … ये कैसे बच्चे हैं …. I hope the action will be taken soon otherwise I will have to take any action",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Kaushal Parashar and team is doing perfect job.\nHis followup brought me to hotel.\nAll things perfect .\nBest for Aligarh.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I had great experience with fortune park in..My sister's wedding event was organised here and Groom and his family were overwhelmed with their hospitality.\nJalsa banquet hall was too spacious tidy clean and well managed during entire event.\ndecor team did fabulous work.\nAatish ji and sneha were at their best .... both of them made my entire family relaxed while welcoming groom and executing the shadi event effortlessly..... Very smooth.\n\nChef Himmat ji and his staff were also good. food was good\n\nambience was good.\nmy relatives who all were outstation guest, they were mesmerized to see this property, that too in aligarh.... I mean my entire family is happy..",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms were good and spacious but washroom having a peculiar smell and the lock was not working I stayed in room no303on 26th Jan.The food was amazing.It was fresh, attractive and delicious.some of the staff were very attentive and caring towards my kids.As there was some marriage function so lots of noise on 27th Jan.Overall it was a good experience would love to come again.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "also automatic water tap sensed hands automatically opened put hands water dryer gave us cool air flush toilet two one big one small clicked big one holded water ran throught toilet pressed button walls living room water sprinklers outside also amazing fountain",
                "worst experience staffâ\u0080¦worst hospitalityâ\u0080¦ staff donâ\u0080\u0099t even know talk visitorsâ\u0080¦not even manager specially mr kuldeep gesture show â\u0080¦ hotel staff change immediately first main manager misbehave little kids enjoying christmas decoration told us kids canâ\u0080\u0099t touch plz apne bacche sambhaliye â\u0080¦ à¤¯à¥\u0087 à¤\u0095à¥\u0088à¤¸à¥\u0087 à¤¬à¤\u009aà¥\u008dà¤\u009aà¥\u0087 à¤¹à¥\u0088à¤\u0082 â\u0080¦ hope action taken soon otherwise take action",
                "kaushal parashar team perfect job followup brought hotel things perfect best aligarh",
                "great experience fortune park inmy sisters wedding event organised groom family overwhelmed hospitality jalsa banquet hall spacious tidy clean well managed entire event decor team fabulous work aatish ji sneha best made entire family relaxed welcoming groom executing shadi event effortlessly smooth chef himmat ji staff also good food good ambience good relatives outstation guest mesmerized see property aligarh mean entire family happy",
                "rooms good spacious washroom peculiar smell lock working stayed room noon th janthe food amazingit fresh attractive delicioussome staff attentive caring towards kidsas marriage function lots noise th janoverall good experience would love come"
            ]
        },
        {
            "name": "Hotel Abha Regency",
            "rating": [
                4
            ],
            "address": [
                "Ramghat Rd, near Sumangalam Hospital, New Vishnupuri, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "Useless hotel and the staff. They keep giving you excuses for the wifi usage. Bad Room Service. Geyser doesn't work as well. Highly disappointed!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotel\nAbove average\nPlan to stay for your short visits",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Not upto the Mark ..Have to Improve a lot on the Cleanliness Front ..Washrooms should be large .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This review is about the restaurant and not the property (which they seem to have nice and well maintained). The food I didn't find delicious but average. They don't suggest or advise you regarding food (once I ordered two Sabzi, the waiter did't tell me that the greavy of both was same, so the taste was also same. Both were sweet in taste also. In other restaurants I find waiters telling you these things so that you don't get surprised when your order arrives). Location and service is good. Resturant is well maintained, clean and pleasing. Facilities are good. Staff is nice.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Restaurant is a make shift to another floor as the main restaurant was hired for some other event. However the ambience and seating in makeshift location is not so comfortable but the rate/cost is as main restaurant. These are only money minded restaurant and not concern about quality and standard.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "useless hotel staff keep giving excuses wifi usage bad room service geyser doesnt work well highly disappointed",
                "good hotel average plan stay short visits",
                "upto mark improve lot cleanliness front washrooms large",
                "review restaurant property seem nice well maintained food didnt find delicious average dont suggest advise regarding food ordered two sabzi waiter didt tell greavy taste also sweet taste also restaurants find waiters telling things dont get surprised order arrives location service good resturant well maintained clean pleasing facilities good staff nice",
                "restaurant make shift another floor main restaurant hired event however ambience seating makeshift location comfortable ratecost main restaurant money minded restaurant concern quality standard"
            ]
        },
        {
            "name": "Palm Tree Hotel & Restaurant",
            "rating": [
                3.9
            ],
            "address": [
                "3/291, Marris Rd, Opposite Income Tax Office, Durga Baadi, Civil Lines, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "Ambience was good. Breakfast offered was excellent. Staff was helpful in carrying the luggage. However, the bathroom had no proper drainage and room service also didn't pay much attention on the complaints.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is a pick of Raj Kachori, which looks so bad in appearance, how bad it will be in eating ? and in fact, its taste was so bad that I could not even eat it, I liked Palm Tree Raj Kachori,  So I had ordered but maybe their staff has changed and I did not get the old taste, when I asked them to taste it, the staff there took the plate and put curd in it without asking me. They might have thought that adding curd would improve the taste but nothing like this happened in the taste. 😅😅😅\nAnd the staff is such that they don't even have the manners to talk to the customers.\nPerhaps due to less money, less educated staff has been hired. 🤔",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is good. I attended a family event, I feel a lack of support from the service staff. Amenities cleanliness are good. They need to work on the front and outer part of the building, no name and building seems under construction.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Food tastes really amazing and quantity is sufficient as per the price. Overall a good option for parties or get together.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "One of good Aligarh hotels. Nice rooms for stay and one of best resturants inhouse including Karim's resturant.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ambience good breakfast offered excellent staff helpful carrying luggage however bathroom proper drainage room service also didnt pay much attention complaints",
                "pick raj kachori looks bad appearance bad eating fact taste bad could even eat liked palm tree raj kachori ordered maybe staff changed get old taste asked taste staff took plate put curd without asking might thought adding curd would improve taste nothing like happened taste ð\u009f\u0098 ð\u009f\u0098 ð\u009f\u0098 staff dont even manners talk customers perhaps due less money less educated staff hired ð\u009f¤\u0094",
                "hotel good attended family event feel lack support service staff amenities cleanliness good need work front outer part building name building seems construction",
                "food tastes really amazing quantity sufficient per price overall good option parties get together",
                "one good aligarh hotels nice rooms stay one best resturants inhouse including karims resturant"
            ]
        },
        {
            "name": "Hotel Ruby",
            "rating": [
                3.8
            ],
            "address": [
                "GT Rd, Opposite Old Bus stand, Gandhi Park, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "Nice location, very spacious , Good parking , close to Railway station and Bus stand, but poorly maintained. The condition of the room was not good and maintained. Lots of mosquitos are welcome in the room. Discolored walls do not feel good. The bathroom door was without stoper causing a lot of inconvenience. The hotel owner must give a thought over it.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room key and WiFi has to be activated every day - which is such a pain! Front desk is very irresponsive and doesn’t care about the guests! We booked a cab through the hotel and had a nightmare of an experience! Not recommended!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Excellent stay near and clean room ...and food quality is also very good..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Service has detoriated. I am staying in executive room. I asked for wifi details at around 09.45 PM. I was told that he will call back. I waited for 40 minutes. Nobody called . Ultimately I called them they gave me PW but not user ID. Thereafter phone got continuously engaged and I couldn't contact. This is the situation.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The worstest hotel in Aligarh city zero quality food serve 😡 I ordered spicy dal makhni and they serve sweet dal makhni zero quality, low quality Cook they have, I suggest you don't go, wasting of money  #rubyhotel",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice location spacious good parking close railway station bus stand poorly maintained condition room good maintained lots mosquitos welcome room discolored walls feel good bathroom door without stoper causing lot inconvenience hotel owner must give thought",
                "room key wifi activated every day pain front desk irresponsive doesnâ\u0080\u0099t care guests booked cab hotel nightmare experience recommended",
                "excellent stay near clean room food quality also good",
                "service detoriated staying executive room asked wifi details around pm told call back waited minutes nobody called ultimately called gave pw user id thereafter phone got continuously engaged couldnt contact situation",
                "worstest hotel aligarh city zero quality food serve ð\u009f\u0098¡ ordered spicy dal makhni serve sweet dal makhni zero quality low quality cook suggest dont go wasting money rubyhotel"
            ]
        },
        {
            "name": "Hotel The Royal Residency",
            "rating": [
                4.9
            ],
            "address": [
                "5th KM, Delhi Road, GT Rd, Sangam Nagar, Sarsol, Sarsaul, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "The entire property was very beautiful(Royal Residency), especially the banquet hall of the hotel.The decoration was further enhancing her beauty far expectations.The rooms were quite spacious and neat and clean .staff was very helpful and professional.\nThe moments mentioned here will be memorable.\nThank you Royal Residency",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We have celebrated our mom's birthday. They have made special arrangements. Amazing decoration, and good service. Thank you Rahil Sir for helping us in the same.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The nature of the people serving the food is very good. The taste of the food is very good. The interior of the banquet hall is very beautiful. The rooms are also worth seeing. The food is at normal rate and not very expensive. My experience was very good and I am very happy. If anyone asks me for a good hotel from now i will always be suggesting this.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Well maintained rooms with all facilities. Extremely comfortable and spacious. A bit outside the overcrowded city makes location very nice. Food is very tasty. This place is good value for money. The staff is very helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "\"Hotel Royal Residency Aligarh provided an unforgettable experience. Upon arrival, their warm hospitality immediately stood out. The blend of elegant décor and modern amenities offered a luxurious retreat. The staff's impeccable service enhanced the stay, ensuring a comfortable experience throughout. Dining at their restaurant was a culinary delight, complemented by the hotel's convenient central location for city exploration. The cleanliness and attention to detail, from the plush bedding to the exquisite meals, surpassed expectations. I highly recommend Hotel Royal Residency Aligarh for an unparalleled stay characterized by outstanding staff, cleanliness, and overall excellence.\"",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "entire property beautifulroyal residency especially banquet hall hotelthe decoration enhancing beauty far expectationsthe rooms quite spacious neat clean staff helpful professional moments mentioned memorable thank royal residency",
                "celebrated moms birthday made special arrangements amazing decoration good service thank rahil sir helping us",
                "nature people serving food good taste food good interior banquet hall beautiful rooms also worth seeing food normal rate expensive experience good happy anyone asks good hotel always suggesting",
                "well maintained rooms facilities extremely comfortable spacious bit outside overcrowded city makes location nice food tasty place good value money staff helpful",
                "hotel royal residency aligarh provided unforgettable experience upon arrival warm hospitality immediately stood blend elegant dã©cor modern amenities offered luxurious retreat staffs impeccable service enhanced stay ensuring comfortable experience throughout dining restaurant culinary delight complemented hotels convenient central location city exploration cleanliness attention detail plush bedding exquisite meals surpassed expectations highly recommend hotel royal residency aligarh unparalleled stay characterized outstanding staff cleanliness overall excellence"
            ]
        },
        {
            "name": "UP81 Suites",
            "rating": [
                4.1
            ],
            "address": [
                "GT Rd, opposite Church, near Maruti Showroom, Near Suraksha Vihar, Tubewell Colony, Chauhapur, Aligarh, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "I recently had my sons wedding at UP81 Suits, the service was outstanding. The staff was really supportive and helpful. The Food was extremely delicious, the Owner were really nice and all and all was a wonderful and memorable experience for everybody. 100% recommend to everybody.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This hotel is fraud and very unprofessional. They don’t have standard of service but they think of themselves some big 4 star hotel range. The location is so far from city with traffic worse situation. They don’t stick to what they commit. Very bad dont book and take their services . Very pricey",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Worst service ever, I visited yesterday with my friends, as soon as we entered they gave the menu card and asked to order. We told them we were expecting some other friends as well.\n\nFood was pathetic, initially we ordered tomato soup , sweetcorn soup ..\nIn sweetcorn soup, sweet corn were not properly boiled they were so hard that they can’t be chew by humans. I asked the manager to check the soup , she came and checked it, and asked me do you want replacement. I clearly said NO .\nAnd this doesn’t end here now it’s time for tomato soup, tomato soup were stinking like hell, we also complained about the same, manager in well dressed blazer said this is the only way it is served, the soup is perfect.\n\nThis is my request to all the hotel management staff out there … replacement is not the option for the mistake you do .\n\nNow it’s time for starters and their well known sizzler , all the starters were too oily that we had to left them as it is, it was our mistake that we had given the order at a single moment.\nNo Taste at all.\nNow we talk about their well known sizzler,\nTheir chef forgot to add the Paneer pieces in the sizzler. Initially they serve the Sizzler on our table and later five minutes later one of the waiter came and gave us six pieces of Paneer in an another plate. This was hilarious seriously guys. This was hilarious.\n\nNeither the taste nor the staff nothing was good. This was my first worst worst experience ever at any restaurant.\n\nI would never recommend you guys to go at UP81 suites.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stayed for around three days....for a wedding. Impeccable cleanliness, yummy food and polite and friendly staff. Property Owners were also very courteous...Loved the stay...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very Nice Experience , Food Was Very Good And Delicious . Best Service . Must Visit And Try The Food . Best Of Luck To UP 81 Suites Owner And As Well As Staff For Future . Very Much Satisfied .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently sons wedding suits service outstanding staff really supportive helpful food extremely delicious owner really nice wonderful memorable experience everybody recommend everybody",
                "hotel fraud unprofessional donâ\u0080\u0099t standard service think big star hotel range location far city traffic worse situation donâ\u0080\u0099t stick commit bad dont book take services pricey",
                "worst service ever visited yesterday friends soon entered gave menu card asked order told expecting friends well food pathetic initially ordered tomato soup sweetcorn soup sweetcorn soup sweet corn properly boiled hard canâ\u0080\u0099t chew humans asked manager check soup came checked asked want replacement clearly said doesnâ\u0080\u0099t end itâ\u0080\u0099s time tomato soup tomato soup stinking like hell also complained manager well dressed blazer said way served soup perfect request hotel management staff â\u0080¦ replacement option mistake itâ\u0080\u0099s time starters well known sizzler starters oily left mistake given order single moment taste talk well known sizzler chef forgot add paneer pieces sizzler initially serve sizzler table later five minutes later one waiter came gave us six pieces paneer another plate hilarious seriously guys hilarious neither taste staff nothing good first worst worst experience ever restaurant would never recommend guys go suites",
                "stayed around three daysfor wedding impeccable cleanliness yummy food polite friendly staff property owners also courteousloved stay",
                "nice experience food good delicious best service must visit try food best luck suites owner well staff future much satisfied"
            ]
        },
        {
            "name": "The Chandra Garden",
            "rating": [
                4.3
            ],
            "address": [
                "Daultabad, Mathura Road, Laxmi Nagar, Sasni Gate, Aligarh, Daultabad, Uttar Pradesh 202001, India"
            ],
            "reviews": [
                {
                    "text": "Space is good and enough. But toilets are not maintained. Toilets are limited and damaged. Parking need to be managed better.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "They are building in phase ,renovating 3 floor  . 2 grounds available rest room also available . Service is good . With large ground booking also available",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's a wonderful banquet hall for Marriage and birthday celebration",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Tasty food, heaven for food lovers.😍🤗",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's nice banquet hall for wedding place and 👍I visit Many Many times here🤩",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "space good enough toilets maintained toilets limited damaged parking need managed better",
                "building phase renovating floor grounds available rest room also available service good large ground booking also available",
                "wonderful banquet hall marriage birthday celebration",
                "tasty food heaven food loversð\u009f\u0098\u008dð\u009f¤\u0097",
                "nice banquet hall wedding place ð\u009f\u0091\u008di visit many many times hereð\u009f¤©"
            ]
        }
    ]
}