{
    "places_with_reviews": [
        {
            "name": "Radisson Blu Resort Dharamshala",
            "rating": [
                4.8
            ],
            "address": [
                "Village Kandi PO, Khanyara Rd, Dharamshala, Kand, Himachal Pradesh 176215, India"
            ],
            "reviews": [
                {
                    "text": "This hotel has outstanding location. You can see The Dhauladhar Range. Beautiful snow covered range. This hotel is in five different block. Each block have different views. Very nice breakfast in the morning to start your day. Also offer complimetary high tea between 4.30 and 5.30 pm. Also offer yoga session in the morning. Amazing pool area with bar. We had dinner each night we stayed here. Food was excellent and if it was not on menu they made it special for you. I highly recommend this property for your stay. Staff was so good. Each one did great job to keep us happy.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Loved the resort… food is good, rooms are well equipped, but no great view from the room. The location is very convenient. Staff is really helpful and friendly. They have kids play area, temperature controlled swimming pool (small), complementary evening snacks. Gym could have been better.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Our 3 day stay was unbelievable. All staff were fantastic, from front desk to restaurant staff to room service. A special thank you to Komal & Roy for their attention to detail & their kindness to us. We would definitely recommend staying here. Wonderful experience. 5 Stars.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "By far the best service ever. Each and every staff member were great. Their response to our requests and attention to detail was  outstanding. Nice location, the buffet spread was awesome too.\nCould not find a single fault.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I stayed in Radisson Blu Resort Dharamshala for two nights three days with my Hubby. It was an excellent experience for us. It is a meticulously maintained resort with beautiful ambience. The pool-side, the spa, the gym and ultimately the restaurant - all are unique. I will ever remember the caring services of Ms. Balvinder  in the restaurant. Altogether it was a memorable visit.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel outstanding location see dhauladhar range beautiful snow covered range hotel five different block block different views nice breakfast morning start day also offer complimetary high tea pm also offer yoga session morning amazing pool area bar dinner night stayed food excellent menu made special highly recommend property stay staff good one great job keep us happy",
                "loved resortâ\u0080¦ food good rooms well equipped great view room location convenient staff really helpful friendly kids play area temperature controlled swimming pool small complementary evening snacks gym could better",
                "day stay unbelievable staff fantastic front desk restaurant staff room service special thank komal roy attention detail kindness us would definitely recommend staying wonderful experience stars",
                "far best service ever every staff member great response requests attention detail outstanding nice location buffet spread awesome could find single fault",
                "stayed radisson blu resort dharamshala two nights three days hubby excellent experience us meticulously maintained resort beautiful ambience poolside spa gym ultimately restaurant unique ever remember caring services ms balvinder restaurant altogether memorable visit"
            ]
        },
        {
            "name": "Hyatt Regency Dharamshala Resort",
            "rating": [
                4.5
            ],
            "address": [
                "Village, Dharamkot, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "This place is best situated.Their services are marvelous. I had motion sickness on reaching there. They served me meals in the room with great courtesy as we had a breakfast and dinner package with them. They even upgraded our room because of my health.\nAll the drain pipes were functional.\nNo seepage,no dampness.\nIf I get a chance I will definitely like to visit again.\n\nPlace is value for money. Thanks for everything you have done for us to make our trip memorable in good sense.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This property is a stunning blend of lush landscaping, elegant architecture, and picturesque views. Every detail of the resort's design has been crafted to create an ambiance of tranquility and luxury. Our dining experience was nothing short of extraordinary. 😍\nWhat truly set the resort apart was the exceptional staff. I remember Sunny in particular, was incredibly welcoming and gave us a detailed tour of the beautiful property. The rest of the team was equally fantastic, always available and eager to help with any requests or questions we had. I can't recommend resort enough for anyone looking for a memorable and comfortable stay in mountain. ✨ 🤩",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The Hyatt Regency is an impressive hotel with a very grand lobby. It's location is out of town, but still close to the main sites in McLeod Gang and Dharamshala by car. Our room was spacious and very comfortable. And nice that you can open the window and get some fresh air. The pool is lovely and they also offer lots of extras such as yoga (which I thoroughly enjoyed), and walks which we didn't get a chance to do.\nBreakfast buffet and dinner were very tasty and very generous, with many local and international options. And all the staff incredibly courteous and helpful. So if you want some luxury while visiting Dharamshala this is definitely the place for you.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Not really worth it given the amount of money they charge. Its not a huge property- definitely lacks a lot of what an ideal resort should be. Broken dustbins in the room. And theres no point of having a balcony if you’re constantly afraid of fat insects and monkeys. The front desk staff is not well coordinated among themselves- they would often say one thing at a certain moment and then back out from their commitment without a single thought. Non-professionals - not expected from a chain that claims to be “5-star”. Buyers beware.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We had the best time with our 19 month old twins at this hotel. We came here to celebrate our 10 year anniversary. We chose this hotel as it was the closest nicest hotel that met our needs closer to Punjab. I think we made the best decision. We loved our room as it was spacious for our toddlers to run around and it had a balcony from which we enjoyed the view of the hotels garden area and an occasional visit from the mountain monkeys who were not a bother at all. :-)\nThe one thing that I will say that stood out about the hotel was its staff. Extremely, pleasant, helpful and charming. they went above and beyond to make us comfortable and tended to our toddlers so that we could have a good time whenever we hung around in any of the facilities in the hotel. It really felt like home. If you are a small family, or a big family looking for a quiet, peaceful getaway, I highly recommend this hotel. We hope to be back.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place best situatedtheir services marvelous motion sickness reaching served meals room great courtesy breakfast dinner package even upgraded room health drain pipes functional seepageno dampness get chance definitely like visit place value money thanks everything done us make trip memorable good sense",
                "property stunning blend lush landscaping elegant architecture picturesque views every detail resorts design crafted create ambiance tranquility luxury dining experience nothing short extraordinary ð\u009f\u0098\u008d truly set resort apart exceptional staff remember sunny particular incredibly welcoming gave us detailed tour beautiful property rest team equally fantastic always available eager help requests questions cant recommend resort enough anyone looking memorable comfortable stay mountain â\u009c¨ ð\u009f¤©",
                "hyatt regency impressive hotel grand lobby location town still close main sites mcleod gang dharamshala car room spacious comfortable nice open window get fresh air pool lovely also offer lots extras yoga thoroughly enjoyed walks didnt get chance breakfast buffet dinner tasty generous many local international options staff incredibly courteous helpful want luxury visiting dharamshala definitely place",
                "really worth given amount money charge huge property definitely lacks lot ideal resort broken dustbins room theres point balcony youâ\u0080\u0099re constantly afraid fat insects monkeys front desk staff well coordinated among would often say one thing certain moment back commitment without single thought nonprofessionals expected chain claims â\u0080\u009cstarâ\u0080\u009d buyers beware",
                "best time month old twins hotel came celebrate year anniversary chose hotel closest nicest hotel met needs closer punjab think made best decision loved room spacious toddlers run around balcony enjoyed view hotels garden area occasional visit mountain monkeys bother one thing say stood hotel staff extremely pleasant helpful charming went beyond make us comfortable tended toddlers could good time whenever hung around facilities hotel really felt like home small family big family looking quiet peaceful getaway highly recommend hotel hope back"
            ]
        },
        {
            "name": "Best Western Plus Revanta",
            "rating": [
                4.8
            ],
            "address": [
                "Satobari Hills, Near Dal Lake, Upper, McLeod Ganj, Dharamshala, Dhial, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "We stayed there in Jan 2024. We took premium room as it had a balcony and the view which the hotel has can be best enjoyed in the premium rooms. The hotel is located nearby McLeod Ganj. The location of the hotel is superb. The views from the hotel are mind blowing. Though I found the parking could be allotted somewhere else as it directly is in front of the balconies of the rooms thus invading the privacy. Anyways hill stations has its limitations. The room size was pretty decent with all the required facilities. Though in our room the television was little defected with the display not being proper and in spite of complaining the defect was not rectified.\nHotel has a roof top restaurant also from which the view was absolutely mind blowing. They have live music on weekends. That was very beautiful experience. You need to have your own vehicle, as the main road is quite far from the hotel. Special mention to hotel restaurant staff Mr. Vikas and Mr. Ajay for their courteous service. The food was also good with buffet breakfast having many options to choose from. So overall it was a very nice stay for us. We would definitely recommend it to others.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Our recent stay at Best Western Plus Revanta was a memorable experience overall. Nestled in the scenic Dhauladhar range, the resort boasts breathtaking valley views and invigorating mountain air, providing a perfect retreat to explore the majestic Himalayas.\n\nArriving an hour before the standard check-in time, we encountered a small delay at the reception. While the wait was a minor inconvenience, it prompted us to suggest that the check-in process could be expedited with an increase in staff, enhancing the efficiency of the service.\n\nOnce settled into our rooms, the stunning sunset view from our balconies erased any initial concerns. The hotel's infrastructure, hospitality, and amenities truly stand out, making it one of the best in the area. Our room,  was spacious and impeccably clean.\n\nThe complimentary breakfast was a daily highlight, offering a fresh and diverse selection. The dinner menu, with ample vegetarian options, was equally impressive and served with warmth. The restaurant team deserves special commendation for their outstanding service, delightful ambiance, and exceptional food.\n\nThe hotel's rooftop restaurant, complete with live music, added a charming touch to our evenings. Additionally, amenities like the spa, gym, and playroom provided extra enjoyment.\n\nIn conclusion, Best Western Plus Revanta is a gem in the heart of the mountains, offering a perfect blend of comfort, hospitality, and breathtaking views. While our check-in experience suggested a potential improvement, the overall stay was fantastic, and we look forward to returning.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Our stay was good. Staff is very co-operative. And very good service provided by the staff. They were quick in resolving and providing the solution.\nHotel is nice to stay and good breakfast too.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It was awesome stay here with family. Best location , very co operative and quick service by staff . Being Gujarati traveler we always think about food and food from this place is just delicious and hygienic.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "It was our first stay and it was recommended by our friends as had a great experience earlier. We are carrying the similar experience for this property and would not shy away coming back to the property. Miss Deepa helped us for the booking and ensures we had a pleasant stay. Mr Jay Karan also assisted in managing the day trip for us which was worth value",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed jan took premium room balcony view hotel best enjoyed premium rooms hotel located nearby mcleod ganj location hotel superb views hotel mind blowing though found parking could allotted somewhere else directly front balconies rooms thus invading privacy anyways hill stations limitations room size pretty decent required facilities though room television little defected display proper spite complaining defect rectified hotel roof top restaurant also view absolutely mind blowing live music weekends beautiful experience need vehicle main road quite far hotel special mention hotel restaurant staff mr vikas mr ajay courteous service food also good buffet breakfast many options choose overall nice stay us would definitely recommend others",
                "recent stay best western plus revanta memorable experience overall nestled scenic dhauladhar range resort boasts breathtaking valley views invigorating mountain air providing perfect retreat explore majestic himalayas arriving hour standard checkin time encountered small delay reception wait minor inconvenience prompted us suggest checkin process could expedited increase staff enhancing efficiency service settled rooms stunning sunset view balconies erased initial concerns hotels infrastructure hospitality amenities truly stand making one best area room spacious impeccably clean complimentary breakfast daily highlight offering fresh diverse selection dinner menu ample vegetarian options equally impressive served warmth restaurant team deserves special commendation outstanding service delightful ambiance exceptional food hotels rooftop restaurant complete live music added charming touch evenings additionally amenities like spa gym playroom provided extra enjoyment conclusion best western plus revanta gem heart mountains offering perfect blend comfort hospitality breathtaking views checkin experience suggested potential improvement overall stay fantastic look forward returning",
                "stay good staff cooperative good service provided staff quick resolving providing solution hotel nice stay good breakfast",
                "awesome stay family best location co operative quick service staff gujarati traveler always think food food place delicious hygienic",
                "first stay recommended friends great experience earlier carrying similar experience property would shy away coming back property miss deepa helped us booking ensures pleasant stay mr jay karan also assisted managing day trip us worth value"
            ]
        },
        {
            "name": "Fortune Park Moksha - Member ITC's hotel group",
            "rating": [
                4.4
            ],
            "address": [
                "Strawberry Hills, Satobari, near Dal Lake, Satovari, Mcleod Ganj, Dharamshala, Tota Rani, Himachal Pradesh 176216, India"
            ],
            "reviews": [
                {
                    "text": "I visited Dharamshala with my family a couple of days back for a long weekend trip, and it was absolutely remarkable. Our stay at Fortune Park Moksha was amazing. The hotel staff is very humble and friendly who make sure that the guests have everything they need.\n\nWould recommend this place to everyone who visits this gem of a town. Definitely a 10/10.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Worst travel desk, they are just literally thugs. We booked a cab for full day and the car arrived 1.5 hours late, then the next day they didn’t let us see all points and told when we said them we want to see the all sight seeing, they told us to get out of the car and soniya madam was so rude. She called the cab driver and made the car stopped out of nowhere for 1 hour.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We as,a group stayed hotel on 17 th to 21 st March, beautiful scenic view location of hotel, great food and great kitchen staff & chef group, polite room services and above all their dynamic GM Mr. Arun verma presence in hotel, always looking for hotel guest comfort and very cooperative. Great experience for our group. ketan doshi-mujesh neisheri- jayesh sheth & prajesh mistry.\nFor all gujju it's must experience to stay in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The views from our room were amazing. The staff were excellent, very attentive. A lovely hotel in a magnificent location.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Had great experience. Want to thanks to all front office staff to arrange a cake for me and make me feel welcomed.\nNot to forget, special thanks to Mandeep and Ayush for their fantastic hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited dharamshala family couple days back long weekend trip absolutely remarkable stay fortune park moksha amazing hotel staff humble friendly make sure guests everything need would recommend place everyone visits gem town definitely",
                "worst travel desk literally thugs booked cab full day car arrived hours late next day didnâ\u0080\u0099t let us see points told said want see sight seeing told us get car soniya madam rude called cab driver made car stopped nowhere hour",
                "asa group stayed hotel th st march beautiful scenic view location hotel great food great kitchen staff chef group polite room services dynamic gm mr arun verma presence hotel always looking hotel guest comfort cooperative great experience group ketan doshimujesh neisheri jayesh sheth prajesh mistry gujju must experience stay hotel",
                "views room amazing staff excellent attentive lovely hotel magnificent location",
                "great experience want thanks front office staff arrange cake make feel welcomed forget special thanks mandeep ayush fantastic hospitality"
            ]
        },
        {
            "name": "Spring Valley Spa Resort by DLS Hotels",
            "rating": [
                4.4
            ],
            "address": [
                "Bhagsu Nag, Dharamshala, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "Nestled in a picturesque setting, Spring Valley hotel offers a romantic escape like no other. Situated amidst breathtaking scenery, every moment spent here feels like a dream. The rooms exude a charming ambiance, perfect for couples seeking a romantic getaway. From cozy rooms to luxurious amenities, every detail is meticulously crafted to create an unforgettable experience. Whether enjoying a leisurely stroll through the scenic grounds or indulging in a morning tea in balcony attached rooms, Spring Valley hotel captures the essence of romance in every aspect. It's truly a haven for those seeking love and serenity amidst nature's beauty.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Stayed here this week. It was a very nice experience. Got to stay in 2 rooms, one of them was just good other being really great with good view and private balcony.\n\nLocation is subjectively very good. But the experience with staff and their hospitality was top notch. It was actually very warm, every one was ever smiling. Took care of requests we made. Have been travelling for 8 years but this was the best staff I encountered. Felt like a home while leaving. Kudos!!!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The rooms are very clean and the services are fantastic. Food is awesome though we are from southern part of India, the foods offered are much tasty. The stay has Mountain view with private terrace which is top notch. The stay surrounded by medical shop, hotel, shops.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We stayed with our family here 4 rooms for 2 days in April first week. Overall stay was very pleasant. Hotel staff is very helpful and cooperative. Rooms are well maintained and hygiene.\nSpecially food quality is very good, mountain views from the balcony are amazing.\nI recommend this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Amazing experience of the hotel and superb services, excellent people. Also the view and location is best. Best for the values also, you can go for this one without second thought.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nestled picturesque setting spring valley hotel offers romantic escape like situated amidst breathtaking scenery every moment spent feels like dream rooms exude charming ambiance perfect couples seeking romantic getaway cozy rooms luxurious amenities every detail meticulously crafted create unforgettable experience whether enjoying leisurely stroll scenic grounds indulging morning tea balcony attached rooms spring valley hotel captures essence romance every aspect truly seeking love serenity amidst natures beauty",
                "stayed week nice experience got stay rooms one good really great good view private balcony location subjectively good experience staff hospitality top notch actually warm every one ever smiling took care requests made travelling years best staff encountered felt like home leaving kudos",
                "rooms clean services fantastic food awesome though southern part india foods offered much tasty stay mountain view private terrace top notch stay surrounded medical shop hotel shops",
                "stayed family rooms days april first week overall stay pleasant hotel staff helpful cooperative rooms well maintained hygiene specially food quality good mountain views balcony amazing recommend hotel",
                "amazing experience hotel superb services excellent people also view location best best values also go one without second thought"
            ]
        },
        {
            "name": "Indraprastha Spa Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Satobari, Strawberry Hills, Near, Dal Lake-Mcleod Ganj, Dharamshala, Dhial, Himachal Pradesh 176216, India"
            ],
            "reviews": [
                {
                    "text": "Location was good but the Premium room do not offer any View,\nThe hotel is just like a big 4 Star Hotel, however you end up in staying in a room where you can only watch others.\nStaff was good, but the in cold seasons the heater takes time a long time to heat.\nFood ok, book your breakfast and dinner along with your room as it may be expensive post you land over there.\nCarry an extra toothbrush if you are two and a shower cap also. As they only provide one for each room.\nThere is no restaurant or food joint nearby hence you need to eat your dinner in the hotel itself, which can be expensive.\n\nOverall experience was OK.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had a pleasant stay in this hotel.  We were happy with their services, rooms,and food. The staff were very hospitable and friendly. Great value for money. Not forgettig the scenic view from the rooms and patio.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Had an amazing 3 day stay at this serene location. Loved every bit of it. The rooms, friendly service, food and ambiance. Friday night dinner with live music killed it🎼❣️‼️ Great music and lovely evening. Gonna recommend this resort to all my contacts in India and US. Ty Allllll…🫵👍👌‼️",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at the Indraprastha Resort, and I must say, it was an unforgettable experience. This resort exceeded my expectations in every way.The housekeeping service was impeccable. My room was always spotless, and the attention to detail was remarkable. They truly went above and beyond to ensure a comfortable and clean environment. The dining experience was a culinary delight. The restaurant at the resort offered a wide range of delicious dishes. From breakfast to dinner, the food was consistently excellent, and the service was top-notch.The combination of outstanding housekeeping and delectable food made my stay at Indraprastha Resort truly remarkable. I cannot recommend this place enough. It's a 5-star gem that provides the perfect blend of comfort, luxury, and fantastic service. I look forward to returning in the future.Thank you to the staff at Indraprastha Resort for making my stay so enjoyable",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Not worth paying for this hotel.  Rooms are very old and needs renovation.  They charge for bed, but provide a thin mattress to sleep on floor. Food is also not good. Dosa is just like eating batter.  During checkout,  they don't send anyone to transfer the luggage to car. Definitely I don't recommend this hotel to anyone..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location good premium room offer view hotel like big star hotel however end staying room watch others staff good cold seasons heater takes time long time heat food ok book breakfast dinner along room may expensive post land carry extra toothbrush two shower cap also provide one room restaurant food joint nearby hence need eat dinner hotel expensive overall experience ok",
                "pleasant stay hotel happy services roomsand food staff hospitable friendly great value money forgettig scenic view rooms patio",
                "amazing day stay serene location loved every bit rooms friendly service food ambiance friday night dinner live music killed itð\u009f\u008e¼â\u009d£ï¸\u008fâ\u0080¼ï¸\u008f great music lovely evening gon na recommend resort contacts india us ty allllllâ\u0080¦ð\u009f « µð\u009f\u0091\u008dð\u009f\u0091\u008câ\u0080¼ï¸\u008f",
                "recently pleasure staying indraprastha resort must say unforgettable experience resort exceeded expectations every waythe housekeeping service impeccable room always spotless attention detail remarkable truly went beyond ensure comfortable clean environment dining experience culinary delight restaurant resort offered wide range delicious dishes breakfast dinner food consistently excellent service topnotchthe combination outstanding housekeeping delectable food made stay indraprastha resort truly remarkable recommend place enough star gem provides perfect blend comfort luxury fantastic service look forward returning futurethank staff indraprastha resort making stay enjoyable",
                "worth paying hotel rooms old needs renovation charge bed provide thin mattress sleep floor food also good dosa like eating batter checkout dont send anyone transfer luggage car definitely dont recommend hotel anyone"
            ]
        },
        {
            "name": "Triund",
            "rating": [
                4.8
            ],
            "address": [
                "Mcleodganj, Dharamshala, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "Best place for first-time trekkers. Must go place if you wish to see snow as well as beautiful mountains covered in snow. Recommend going up from the base camp cause the view up there is amazing and can capture beautiful pictures.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A Majestic Adventure at Triund Top\n\nMy recent journey to Triund Top proved to be a captivating expedition, showcasing the majestic allure of the Dhauladhar range. Nevertheless, the discernible impact of human intervention on the trail is disheartening, with litter tarnishing the once-pristine environment.\n\nThe trek itself offers an enjoyable challenge, presenting striking views of verdant meadows and rugged terrains. The panoramic scenes from Triund Top are truly breathtaking, catering to both seasoned adventurers and novices. The path meanders through diverse landscapes, creating an engaging and ever-changing trail.\n\nReaching the summit is a triumphant moment, with snow-capped peaks extending across the horizon. The basic camping facilities at Triund Top contribute to the rustic charm of the experience, and the sunrise and sunset vistas from this high vantage point are truly magical.\n\nHowever, the undeniable impact of litter on the trail is disheartening. The negligence of some trekkers tarnishes the natural beauty, as discarded items ranging from plastic bottles to wrappers pose a threat to the delicate ecosystem. There is a pressing need to underscore responsible trekking practices to safeguard Triund Top's pristine beauty for future generations.\n\nDespite this environmental concern, Triund Top remains an essential destination for nature enthusiasts and thrill-seekers. The tranquil ambiance, starlit nights, and the sheer grandeur of the Himalayas make it an expedition worth undertaking. Yet, it is imperative for visitors to actively contribute to the preservation of this natural wonder by adopting responsible trekking habits and ensuring they leave no trace behind.\n\nNote: When you start trekking, you will have to pay an amount of 200/person for a permit to the forest department.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The Triund Trek, nestled near Dharamshala, Himachal Pradesh, offers a stunning escape into the Himalayas, suitable for both seasoned hikers and enthusiastic beginners. The moderate 6-9 kilometer trail, with manageable inclines, winds through rhododendron forests, offering glimpses of McLeodganj and the Dhauladhar range.\n\nThe beauty lies in the gradual unfolding of the landscape. Lush greenery gives way to panoramic mountain vistas, leaving you breathless with each turn. Tea shops along the route provide pitstops for refreshments and stunning photo opportunities.\n\nReaching Triund is like stepping onto a postcard. The campsite boasts meadows bathed in golden sunlight, perfect for pitching a tent and stargazing at night.  For the more adventurous, the snowline lies a further two hours ahead, offering an extra challenge and even more spectacular views.\n\nBe prepared for some crowds, especially on weekends. However, the simple amenities at the top, like basic cafes and shops, cater to trekkers' needs. Remember, it's best to pack light and bring essentials as prices can be higher at the summit.\n\nOverall, the Triund Trek is a must-do for anyone seeking a taste of Himalayan adventure. The scenic beauty, manageable difficulty, and stunning campsite make it a rewarding experience for all.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Absolutely gorgeous. A must do when fresh snow is there. It's one of the lowest effort treks in himachal and the rewards are very high",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "One of the most beautiful trek ...a bit tough but you will take 3 hr to climb...it is around 8 km... Treking charge is 200 rs per person and camping charge is 500 taken by forest department...",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place firsttime trekkers must go place wish see snow well beautiful mountains covered snow recommend going base camp cause view amazing capture beautiful pictures",
                "majestic adventure triund top recent journey triund top proved captivating expedition showcasing majestic allure dhauladhar range nevertheless discernible impact human intervention trail disheartening litter tarnishing oncepristine environment trek offers enjoyable challenge presenting striking views verdant meadows rugged terrains panoramic scenes triund top truly breathtaking catering seasoned adventurers novices path meanders diverse landscapes creating engaging everchanging trail reaching summit triumphant moment snowcapped peaks extending across horizon basic camping facilities triund top contribute rustic charm experience sunrise sunset vistas high vantage point truly magical however undeniable impact litter trail disheartening negligence trekkers tarnishes natural beauty discarded items ranging plastic bottles wrappers pose threat delicate ecosystem pressing need underscore responsible trekking practices safeguard triund tops pristine beauty future generations despite environmental concern triund top remains essential destination nature enthusiasts thrillseekers tranquil ambiance starlit nights sheer grandeur himalayas make expedition worth undertaking yet imperative visitors actively contribute preservation natural wonder adopting responsible trekking habits ensuring leave trace behind note start trekking pay amount person permit forest department",
                "triund trek nestled near dharamshala himachal pradesh offers stunning escape himalayas suitable seasoned hikers enthusiastic beginners moderate kilometer trail manageable inclines winds rhododendron forests offering glimpses mcleodganj dhauladhar range beauty lies gradual unfolding landscape lush greenery gives way panoramic mountain vistas leaving breathless turn tea shops along route provide pitstops refreshments stunning photo opportunities reaching triund like stepping onto postcard campsite boasts meadows bathed golden sunlight perfect pitching tent stargazing night adventurous snowline lies two hours ahead offering extra challenge even spectacular views prepared crowds especially weekends however simple amenities top like basic cafes shops cater trekkers needs remember best pack light bring essentials prices higher summit overall triund trek mustdo anyone seeking taste himalayan adventure scenic beauty manageable difficulty stunning campsite make rewarding experience",
                "absolutely gorgeous must fresh snow one lowest effort treks himachal rewards high",
                "one beautiful trek bit tough take hr climbit around km treking charge rs per person camping charge taken forest department"
            ]
        },
        {
            "name": "Alt Life - Dharamkot (Mcleodganj)",
            "rating": [
                4
            ],
            "address": [
                "Upper Dharamkot, Bhagsu Nag, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "I had done a solo trip to Dharamkot and stayed in this hostel. Staff was polite and helpful. Food was delicious. Room was clean and had hot shower. The view is good.\n\nPopular cafes like Trek & Dine, Morgan’s place, Moonlight cafe and The Birdhouse Cakery are at a walkable distance.\n\nThere were couple of things which disrupted my sleep :\n\nLoud music at night on the weekends &\nOn some nights there were dogs barking a lot just outside my room\n\nOverall I highly recommend it!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This place got the vibe, would 200% recommend everyone (solo, groups, gangs). Food is great, fall in love with cheese Maggi. View, stars, bonfire, friendly employees and comfort. They help you 24*7 for any assistance.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I enjoyed my stay at Alt Life. The location is beautiful and short walking distance to everything you need. Staff are all super friendly and helpful. The room was newly renovated and had an amazing view.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Without any disrespect to the staff, who were quite pleasant during my week-long stay, I have to say that I was quite disappointed by the money-focused mindset of this establishment. While they likely had the capacity to place a portable heater in the rooms, they did not do so (not once) during my stay in December,  when the temp dropped to minus 1 or 2 celcius. They only managed to get the woodstove going on my last night, which didn't give off much heat because all the doors were kept open. Housekeeping was non-existent, which meant that the trash can never emptied , toilet paper never replenished, and the general surfaces never cleaned. I thank heavens for having relatively clean roomies during my stay. Food is quite pricey as is laundry, so you may want to go somewhere else for these things. Although, I have to admit that it was convenient having a cafe on site on super chilly days. On the plus side, this is a great hostel to meet other travelers. It's very warm and inviting in that regard. I also really liked the live music on the weekends. Two local bands played on two separate nights and they were both great! Finally, the location is pretty spot-on. Granted, this area is quite hilly naturally, but it's relatively central to McLeod Ganj and Bhagsu. Mixed feelings on whether I would stay here again, but if you're a first timer staying for a night or two, then I think it's definitely worth checking out!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The property is in a terrible state with construction going on and iron rods, cement bags, construction workers and water pipes all around. The rooms smell of damp and even the common area is unkept. They are selling the rooms online at costs which are at par with really good hotels around ( charged me between 4.5k - 5K per night ) with hyped marketing and professionally taken pictures but once you reach there it’s all shambles. Highly disappointed and will very strongly advise against it.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "done solo trip dharamkot stayed hostel staff polite helpful food delicious room clean hot shower view good popular cafes like trek dine morganâ\u0080\u0099s place moonlight cafe birdhouse cakery walkable distance couple things disrupted sleep loud music night weekends nights dogs barking lot outside room overall highly recommend",
                "place got vibe would recommend everyone solo groups gangs food great fall love cheese maggi view stars bonfire friendly employees comfort help assistance",
                "enjoyed stay alt life location beautiful short walking distance everything need staff super friendly helpful room newly renovated amazing view",
                "without disrespect staff quite pleasant weeklong stay say quite disappointed moneyfocused mindset establishment likely capacity place portable heater rooms stay december temp dropped minus celcius managed get woodstove going last night didnt give much heat doors kept open housekeeping nonexistent meant trash never emptied toilet paper never replenished general surfaces never cleaned thank heavens relatively clean roomies stay food quite pricey laundry may want go somewhere else things although admit convenient cafe site super chilly days plus side great hostel meet travelers warm inviting regard also really liked live music weekends two local bands played two separate nights great finally location pretty spoton granted area quite hilly naturally relatively central mcleod ganj bhagsu mixed feelings whether would stay youre first timer staying night two think definitely worth checking",
                "property terrible state construction going iron rods cement bags construction workers water pipes around rooms smell damp even common area unkept selling rooms online costs par really good hotels around charged k k per night hyped marketing professionally taken pictures reach itâ\u0080\u0099s shambles highly disappointed strongly advise"
            ]
        },
        {
            "name": "Hotel The Nest",
            "rating": [
                4.3
            ],
            "address": [
                "shivam marg, Jogiwara Rd, McLeod Ganj, Dharamshala, Himachal Pradesh 176219, India"
            ],
            "reviews": [
                {
                    "text": "Cooperative staff, good food, good views from the terrace, very small rooms, very small bathrooms, good games, lacks privacy. Rooms are different from those in the pictures. I got very late in the evening and missed capturing the pics and had to leave early the next day as well. My room was 104 and it was absolutely different from what's shown in pics on Maps. This is surely not a place for couples.\n\n1. Location: 3/5\nMall road and other places are not walkable from the hotel.\n\n2. Room: 1/5\nVery small size room. Even the hostel rooms are larger than this. Heater was separately chargeable as at any other hotel.  Bathroom is extremely small. Rooms have a common balcony with a common entrance from the lobby (not rooms). This lacked privacy as whatever you talk inside the room could be easily heard outside by anyone in the balcony and vice versa. Electric kettle, tea-cofee sachets available in rooms. Elevator available.\n\n3. Food: 4/5\nVeg Food is really amazing. The options were pretty good. Restaurant is on terrace and faces a hill. All the items carry great taste typically North Indian.\n\n4. Staff: 5/5\nThey are highly cooperative. We check-in around 11:45 in the night. They still served us hot dinner even when the kitchen gets closed at 10. Our car got stuck around 300m downhill. They didn't mind sending their team to bring the luggage to the hotel. Someone is available at the reception always as I remember calling them at 2 in the morning for heater.\n\n5. Parking: 2/5\nThe place outside the hotel is very narrow. However, the hotel staff guides the drivers on the same. Mind that the hotel team doesn't have any driver who could park on your behalf and street is very narrow.\n\n6. Games: 4/5\nThey have snooker, chess, table-tennis available.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Really pathetic service.\n\nFirstly, they don’t provide rooms with heater. You have to ask for that separately. And they take extra charges just for that even if you are booking in winters.\n\nSecondly, there’s a massive lack of service. They don’t have running water even when it’s 8:30 am. So if you are planning to go out or use washroom, forget about it.\n\nEven after complaining multiple times, they do not take any action.\n\nAnd lastly their geyser doesn’t work.\n\nSo if you are planning to stay at this, please look for other options.\n\nHighly NOT RECOMMENDED.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I had an incredibly disappointing experience with this hotel. I made a reservation well in advance, only to arrive at the hotel and find out that they had unceremoniously canceled my booking without any prior notification. The lack of communication was shocking, to say the least.\n\nUpon arriving at the hotel, I was met with a rude and unhelpful staff who simply refused to assist me in finding alternative accommodations. It's baffling that a hotel would not only cancel a guest's reservation without notice but also be so unwilling to help rectify the situation. This left me stranded, tired, and frustrated, not to mention the inconvenience of finding a last-minute replacement hotel, which cost me more money.\n\nThe level of customer service exhibited by this establishment was nothing short of abysmal. The complete disregard for their guests' well-being and the lack of accountability for their own mistakes was utterly disheartening. I would strongly advise against booking with this hotel unless you want to risk your travel plans being derailed, your money wasted, and your experience ruined. This was a colossal failure on their part, and I would not recommend this hotel to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Impeccable and faultless rooms in a boutique hotel ideally located a few hundreds meters from Mcleodganj Main Street. Modern style room with balcony are the great deal, perched on the hill. The friendly staff add its value to what is already the best option by far. Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "One of the best hotels for middle class. Good rooms with all basic facilities, e.g. geiser, electric kettle with tea coffee kits, hair dryer, TV, balcony with sofas and table.\n\nView from room, balcony and rooftop is just awesome.\n\nRearaurant has extremely good food. I booked with breakfast.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "cooperative staff good food good views terrace small rooms small bathrooms good games lacks privacy rooms different pictures got late evening missed capturing pics leave early next day well room absolutely different whats shown pics maps surely place couples location mall road places walkable hotel room small size room even hostel rooms larger heater separately chargeable hotelâ bathroom extremely small rooms common balcony common entrance lobby rooms lacked privacy whatever talk inside room could easily heard outside anyone balcony vice versa electric kettle teacofee sachets available rooms elevator available food veg food really amazing options pretty good restaurant terrace faces hill items carry great taste typically north indian staff highly cooperative checkin around night still served us hot dinner even kitchen gets closed car got stuck around downhill didnt mind sending team bring luggage hotel someone available reception always remember calling morning heater parking place outside hotel narrow however hotel staff guides drivers mind hotel team doesnt driver could park behalf street narrow games snooker chess tabletennis available",
                "really pathetic service firstly donâ\u0080\u0099t provide rooms heater ask separately take extra charges even booking winters secondly thereâ\u0080\u0099s massive lack service donâ\u0080\u0099t running water even itâ\u0080\u0099s planning go use washroom forget even complaining multiple times take action lastly geyser doesnâ\u0080\u0099t work planning stay please look options highly recommended",
                "incredibly disappointing experience hotel made reservation well advance arrive hotel find unceremoniously canceled booking without prior notification lack communication shocking say least upon arriving hotel met rude unhelpful staff simply refused assist finding alternative accommodations baffling hotel would cancel guests reservation without notice also unwilling help rectify situation left stranded tired frustrated mention inconvenience finding lastminute replacement hotel cost money level customer service exhibited establishment nothing short abysmal complete disregard guests wellbeing lack accountability mistakes utterly disheartening would strongly advise booking hotel unless want risk travel plans derailed money wasted experience ruined colossal failure part would recommend hotel anyone",
                "impeccable faultless rooms boutique hotel ideally located hundreds meters mcleodganj main street modern style room balcony great deal perched hill friendly staff add value already best option far highly recommended",
                "one best hotels middle class good rooms basic facilities eg geiser electric kettle tea coffee kits hair dryer tv balcony sofas table view room balcony rooftop awesome rearaurant extremely good food booked breakfast"
            ]
        },
        {
            "name": "Anupam Resort By DLS Hotels, Naddi",
            "rating": [
                4.3
            ],
            "address": [
                "Naddi Rd, near Dal Lake, Naddi, Upper, Dharamshala, Himachal Pradesh 176216, India"
            ],
            "reviews": [
                {
                    "text": "I stayed here for a night and I woke up to an amazing view of the snowy peak of mountains from the window (My room did not have a balcony).\nFood was quite good. The complimentary breakfast was excellent. Overall I liked the buffet for dinner as well as breakfast.\nEnough parking space and they provide good service at par with other dls hotels. Overall I had a good stay in the hotel. Naddi viewpoint is just 1 km walk so that's an added benefit.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The place is located in a good location. A bit away from the main city. The person at the reception is warm and welcoming.\nProbably the place is still under some construction for upgrade.\nThe service at the dining is very good and food is tasty.\nOverall a good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed in Dharamshala Hotel Anupama Resort for 03 nights. We had a great experience. Regarding the food, rooms & services were excellent.\nGeneral Manager Mr Bobby Kumar was excellent in coordination and helped us through every problem which we were facing.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We actually booked with hotel by visiting the websites and mainly the high rated reviews. But then I really felt disappointed when visited this hotel. Thats where I come to know all these reviews are paid ones... Trust me.. This property doesn't even look very well maintained as its shown in the pictures. The grills are rusted and sideways its totally wrecked. They are running a scam machine via this hotel. And there is nothing like resorts as they mention in there name. Total wastage. I wish google reviews could have introduced giving minus star ratings and this should reach everyone before looking to book such hotels.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "my room was worst with basic hygiene also not in place. Room had no locks working,  I would not recommend family rooms in this hotel as access to other room was also via bathroom. also the balcony seems haunted. Food was ok and location I would say extreme on height and very quiet.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed night woke amazing view snowy peak mountains window room balcony food quite good complimentary breakfast excellent overall liked buffet dinner well breakfast enough parking space provide good service par dls hotels overall good stay hotel naddi viewpoint km walk thats added benefit",
                "place located good location bit away main city person reception warm welcoming probably place still construction upgrade service dining good food tasty overall good experience",
                "stayed dharamshala hotel anupama resort nights great experience regarding food rooms services excellent general manager mr bobby kumar excellent coordination helped us every problem facing",
                "actually booked hotel visiting websites mainly high rated reviews really felt disappointed visited hotel thats come know reviews paid ones trust property doesnt even look well maintained shown pictures grills rusted sideways totally wrecked running scam machine via hotel nothing like resorts mention name total wastage wish google reviews could introduced giving minus star ratings reach everyone looking book hotels",
                "room worst basic hygiene also place room locks working would recommend family rooms hotel access room also via bathroom also balcony seems haunted food ok location would say extreme height quiet"
            ]
        }
    ]
}