{
    "places_with_reviews": [
        {
            "name": "Hotel Orion",
            "rating": [
                3.8
            ],
            "address": [
                "NH16, Samaraipur, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "Good food , good service . Price a bit high compared to Other road side AC restaurant but was compensated by the cordial staff and great service .... food was freshly prepared and very tasty. We stopped only for lunch . Didn't stay here. Bar is alongside the restaurant",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "My experience was a little bad because the tv and the land line was not working there. And the room was ok but I saw a bad Habit of staffs that after knocking door they enter the room like a bullish condition I mean very hurried up they are at that time. Not even ask for permission to enter the room no matter they are for food service or something else, they should ask for permission before entering room. And afterall at the time of checkout, after making the bill and after my payment to them the receptionist said a staff to check the room . That was very bad experience, I'm 23 so I think I was not hesitate on this but I'm sure if a aged person was there he must showed the anger to the staff/receptionist. Thank you and I'll go again to see whether my experience can be changed or not..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Phone lines are dead and customers have to save the mobile numbers of restaurant and reception, ring them up to contact. The waiters have no courtesy of waiting for an answer after knocking and immediately break into rooms like untrained thugs. Food is fine.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Review of a place decide it's worthiness( customer - employee relations)\n\nBooking price : price can vary according to situation.\n\nPlace:  It's  around 5 km from bhadrak railway station and connected via National Highway.\n\nParking: parking is free for registered guest and ample space for parking.\n\nFood : complementary breakfast for registered guest free of cost.\n\nRoom : room are nice and clean ,for any other services the attendent come .\n\nBar : Bar available.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The phone lines don't work. We have to save the mobile numbers of the restaurateur and the receptionist separately. The waiters and staff are so untrained that they immediately break into a room without seeking permission from the guests. Food is fine.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good food good service price bit high compared road side ac restaurant compensated cordial staff great service food freshly prepared tasty stopped lunch didnt stay bar alongside restaurant",
                "experience little bad tv land line working room ok saw bad habit staffs knocking door enter room like bullish condition mean hurried time even ask permission enter room matter food service something else ask permission entering room afterall time checkout making bill payment receptionist said staff check room bad experience im think hesitate im sure aged person must showed anger staffreceptionist thank ill go see whether experience changed",
                "phone lines dead customers save mobile numbers restaurant reception ring contact waiters courtesy waiting answer knocking immediately break rooms like untrained thugs food fine",
                "review place decide worthiness customer employee relations booking price price vary according situation place around km bhadrak railway station connected via national highway parking parking free registered guest ample space parking food complementary breakfast registered guest free cost room room nice clean services attendent come bar bar available",
                "phone lines dont work save mobile numbers restaurateur receptionist separately waiters staff untrained immediately break room without seeking permission guests food fine"
            ]
        },
        {
            "name": "Hotel Kalyani, Bhadrak, Odisha",
            "rating": [
                4.3
            ],
            "address": [
                "NH 16, Dahanigadia, Chhak, Charampa, Odisha 756101, India"
            ],
            "reviews": [
                {
                    "text": "I recently had the pleasure of staying at and I must say that my experience was exceptional.  From the warm welcome at check-in to the impeccable service throughout my stay, every aspect exceeded my expectations.\n\nThe comfortable and well-appointed room, along with the attention to cleanliness and hygiene, made my stay truly enjoyable. The hotel's staff members were courteous, accommodating, and went above and beyond to ensure that all my needs were met.\n\nThe dining experience was delightful with a diverse and delicious selection of meals and the complementary breakfast was truly satisfying. I particularly appreciated it.\n\nOverall, I'm thoroughly impressed by the level of professionalism and hospitality exhibited by everyone at all. My stay was nothing short of memorable, and I look forward to returning in the future.\n\nThank you for providing such a wonderful experience.\n\nWarm regards,\nCA Sarbeswar Subudhi",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Location is good. Rooms are ok. We have just checked in and waiting for dinner so shall share views on food later on. Apparently the staff behaviour felt good but sooner a incident made us feel how bad is the customer service. We had taken three rooms 203, 204 and 205. Accidentally tea got spilled and there was a spot on bedsheet. I informed immediately to hotel staff who came and said that we need to pay Rs 4000 for it. How pathetic. We need number of the owner to discuss.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel is a small but beautiful property. Parking is there . Food is great . Service is very good . The staff's behaviour was polite . Exactly on the highway..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It was an office trip, I stayed in hotel for 3 nights, the rooms were comfortable and clean. The experience was very good. The hotel stay is economic. Only I found mosquitos in my room which was disturbing",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We have just checked into the hotel & ordered for tea. The tea accidentally spilled on the bedsheet causing strain, the hotel is demanding INR 4000/-, when we wanted to negotiate, we were told we could be exempted but in that event the poor housekeeping guy will have to compensate. The overall behaviour was found weird. We expected better treatment & more accommodotating attitude. Would be helpful if someone can share the phone number of the owner/MD.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently pleasure staying must say experience exceptional warm welcome checkin impeccable service throughout stay every aspect exceeded expectations comfortable wellappointed room along attention cleanliness hygiene made stay truly enjoyable hotels staff members courteous accommodating went beyond ensure needs met dining experience delightful diverse delicious selection meals complementary breakfast truly satisfying particularly appreciated overall im thoroughly impressed level professionalism hospitality exhibited everyone stay nothing short memorable look forward returning future thank providing wonderful experience warm regards ca sarbeswar subudhi",
                "location good rooms ok checked waiting dinner shall share views food later apparently staff behaviour felt good sooner incident made us feel bad customer service taken three rooms accidentally tea got spilled spot bedsheet informed immediately hotel staff came said need pay rs pathetic need number owner discuss",
                "hotel small beautiful property parking food great service good staffs behaviour polite exactly highway",
                "office trip stayed hotel nights rooms comfortable clean experience good hotel stay economic found mosquitos room disturbing",
                "checked hotel ordered tea tea accidentally spilled bedsheet causing strain hotel demanding inr wanted negotiate told could exempted event poor housekeeping guy compensate overall behaviour found weird expected better treatment accommodotating attitude would helpful someone share phone number ownermd"
            ]
        },
        {
            "name": "OYO Shree Sai Resorts",
            "rating": [
                3.8
            ],
            "address": [
                "PANTALOONS,COMMERCIAL POINT, CHHAPULIA, BYPASS ROAD, Naripur, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "This one a good place to spend some time with your love ones.... pretty place...and good foods 💕😇",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "One of the worst hotel experience ever. Checked in late night and found 4-5 guys smoking and drinking at the reception. The whole night they were creating ruckus. The room was also very dirty with cigarette butts and alcohol boxes below the bed and washroom.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst experience. It's so good from outside but management of this hotel sucks. They initially denied check in because i paid almost 90% amount to oyo online and as per them OYO don't release fund to them hence they will not allow guest. For exams I next morning I had a late check in around 8pm and after too many calls to OYO which was getting unanswered,they did me a favour to get me worst room possible with uncleaned linen, unfreshed room for staying. The room was so wrecked bathroom had no lock, no exaust, broken door, wires coming out of electrical board, AC didn't gave remote, fan wasn't working with regulator, used bed sheet, stinking comforter, bathroom flush broken. Dirty floors, I mean infact they closed main electricity supply as well from early morning. I mean there was nothing good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very nice parking",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very very bad hotel. Bathroom light not working, bedsheet is dirty and torn, AC not working but charge AC room price, bathroom flush not work, cupboard area is very much dirty, they dont provide any item like towel, blanket, soap etc. After demand only they provide.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one good place spend time love ones pretty placeand good foods ð\u009f\u0092\u0095ð\u009f\u0098\u0087",
                "one worst hotel experience ever checked late night found guys smoking drinking reception whole night creating ruckus room also dirty cigarette butts alcohol boxes bed washroom",
                "worst experience good outside management hotel sucks initially denied check paid almost amount oyo online per oyo dont release fund hence allow guest exams next morning late check around pm many calls oyo getting unansweredthey favour get worst room possible uncleaned linen unfreshed room staying room wrecked bathroom lock exaust broken door wires coming electrical board ac didnt gave remote fan wasnt working regulator used bed sheet stinking comforter bathroom flush broken dirty floors mean infact closed main electricity supply well early morning mean nothing good",
                "nice parking",
                "bad hotel bathroom light working bedsheet dirty torn ac working charge ac room price bathroom flush work cupboard area much dirty dont provide item like towel blanket soap etc demand provide"
            ]
        },
        {
            "name": "Hotel Hello",
            "rating": [
                3.5
            ],
            "address": [
                "SH 35, Samaraipur, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "One of the worst hotels I have seen/stayed, I travel a lot and have to stay in remote places and I know what I am talking about. No electricity, no water, unhygienic bathroom, rooms with mould growing on walls, dirty bedsheets, cockroachs in the room, fruit fly all over inside the room... Overall a complete disaster. BTW I forgot to mention I took their best room \"Presidential suite\". Road noise is so much you rather sleep in your car it will be more clean, comfortable, quite.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "One of the worst hotels I had seen and stayed at. The commodes of the bathroom are in bad condition. We had taken two rooms. In both rooms the outlet pipes basins are leaking and have spots. In one room there was no mirror. In one room there was no phone or calling bell to call the attendant. Though we had stayed for two days the room was not cleaned or made on the second day though asked for several times. The room rate is too high as per room condition and in the town like Bhadrak",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Worst ever experience, stinky rooms with fungus all around, highly overpriced, Hospitality totally ZERO, If you will look into their kitchen you will not even drink a glass of water, They don't give even  a half litre water bottle complementary.\nIn a nutshell, One should spend night on roadside but never stay in this Hotel Hello",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Good infrastructure but required to develop in hospitality and food services areas.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Stayed here for 3 days for business purpose. The hotel is located on a highway and doesn't have any nearby activities. Its quite far from city. So not suitable for family stays. But quite comfortable for business travelers. I was initially sceptical to stay in this hotel after reading lot of bad reviews. But the experience was completely different. Rooms are good and comfortable. But can improve on the maintenance especially the walls and bathroom. Since the room given to me was not occupied for quite few days, could feel the damp smell initially. But not to complain. Few amenities in the room like TV, few lights were not functioning. The USP of this hotel is their food and the service. Lip smacking food served hot either at your room or at the restaurant. They do have a wide spread menu (I preferred to choose local food to be on a safer side). Lift is available. But wasn't working. Parking is limited to 6 cars and is a open parking. As the hotel is located in the vicinity of highway, the rooms can become sometimes noisy.\n\nWould I prefer to stay here again? Yes if I travel for business purpose.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one worst hotels seenstayed travel lot stay remote places know talking electricity water unhygienic bathroom rooms mould growing walls dirty bedsheets cockroachs room fruit fly inside room overall complete disaster btw forgot mention took best room presidential suite road noise much rather sleep car clean comfortable quite",
                "one worst hotels seen stayed commodes bathroom bad condition taken two rooms rooms outlet pipes basins leaking spots one room mirror one room phone calling bell call attendant though stayed two days room cleaned made second day though asked several times room rate high per room condition town like bhadrak",
                "worst ever experience stinky rooms fungus around highly overpriced hospitality totally zero look kitchen even drink glass water dont give even half litre water bottle complementary nutshell one spend night roadside never stay hotel hello",
                "good infrastructure required develop hospitality food services areas",
                "stayed days business purpose hotel located highway doesnt nearby activities quite far city suitable family stays quite comfortable business travelers initially sceptical stay hotel reading lot bad reviews experience completely different rooms good comfortable improve maintenance especially walls bathroom since room given occupied quite days could feel damp smell initially complain amenities room like tv lights functioning usp hotel food service lip smacking food served hot either room restaurant wide spread menu preferred choose local food safer side lift available wasnt working parking limited cars open parking hotel located vicinity highway rooms become sometimes noisy would prefer stay yes travel business purpose"
            ]
        },
        {
            "name": "SPOT ON Mahaveer Resort",
            "rating": [
                2.9
            ],
            "address": [
                "Plot-26/119, Aradhi suare road,Area, Aradi, City, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "Don't visit this hotel, service is very bad, restaurant food are stock material bcz, 2-3 people are going every day. Pura Touter",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Too costly for a standard room.. paid 1500 per night for 2 days.. didn't tried their food bcoz of many bad reviews.. not recommended 👎🏻",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "This hotel is a pure garbage 🗑️ hotel, In the name of OYO they doing SCAM with people. Don't book... Staff members are disgusting so as owner.",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Worst hotel in the town plz don’t visit this hotel I have booked my room from oyo customer care number they charged me 540 rupees and why I came to hotel the drama is different they told  me no our room price is 1200 rupees u have to pay and have your room then I have asked  what about the amount that I have paid in online by oyo customer care number they replied me sir don’t worry we I’ll see that then I paid 1200 and had my room  when I came back  next day ì again called to oyo care they told me sir u have took the room so we can’t give back your money then I said I have paid 1200 there and they told me ki sir your 540 rupees it will  be back within 24 hr then they told kii sir your status is showing that u took the room at 540 so we can’t do any ..then I call to this hotel they r not answering my call seriously this hotel took my 540 and 1200 rupees too for a single room seriously this hotel is worst",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                },
                {
                    "text": "Iam booking two rooms but the hotel staff members... Behaviour very badly ... Misunderstanding with customer",
                    "languageCode": "en",
                    "rating": [
                        2.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dont visit hotel service bad restaurant food stock material bcz people going every day pura touter",
                "costly standard room paid per night days didnt tried food bcoz many bad reviews recommended ð\u009f\u0091\u008eð\u009f\u008f »",
                "hotel pure garbage ð\u009f\u0097\u0091ï¸\u008f hotel name oyo scam people dont book staff members disgusting owner",
                "worst hotel town plz donâ\u0080\u0099t visit hotel booked room oyo customer care number charged rupees came hotel drama different told room price rupees u pay room asked amount paid online oyo customer care number replied sir donâ\u0080\u0099t worry iâ\u0080\u0099ll see paid room came back next day ã¬ called oyo care told sir u took room canâ\u0080\u0099t give back money said paid told ki sir rupees back within hr told kii sir status showing u took room canâ\u0080\u0099t call hotel r answering call seriously hotel took rupees single room seriously hotel worst",
                "iam booking two rooms hotel staff members behaviour badly misunderstanding customer"
            ]
        },
        {
            "name": "Panthanivas, Bhadrak",
            "rating": [
                4.1
            ],
            "address": [
                "Motel Chaka, Mathasahi, Gabasahi, Bhadrak, Odisha 756101, India"
            ],
            "reviews": [
                {
                    "text": "Good place rooms ok, staffs very cordial, restaurant food very good. Overall good experience.\nBut outside garden needs maintenance, pond can be decorated.\nRequesting authorities to look\ninto this matter",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location, Area, Rooms are good. Food and Services are not good.\nStaff need to be active. Food preparation is not Hygienic. For marriage, Party functions. Facilities are there.\nFood Hygienic and Quality issues are there. Recently experienced. Therefore, a  proper follow up and supervision must be there for any event.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The worst management faced ever.. noone is available during late hours.. one room did not open inspite of trying with alternate keys available with security guard..unhygienic room condition.. unhygienic and dirty washroom with no toilet kit available.. manager is unresponsive especially during night.. I would recommend not to visit this if you wish to stay here for more than 2 hours.. this hotel is unbearable..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I personally stayed there for 3 days for a wedding. I was disappointed with the service. Cause they don't have glass , extra mattress or even extra blanket.\n\nThe washroom stinks and the doors where broken.\n\nIf you are planning to do a wedding then it's a good decision cause it's spacious and good ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Reasonably good, but staying charges are on the higher side.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place rooms ok staffs cordial restaurant food good overall good experience outside garden needs maintenance pond decorated requesting authorities look matter",
                "location area rooms good food services good staff need active food preparation hygienic marriage party functions facilities food hygienic quality issues recently experienced therefore proper follow supervision must event",
                "worst management faced ever noone available late hours one room open inspite trying alternate keys available security guardunhygienic room condition unhygienic dirty washroom toilet kit available manager unresponsive especially night would recommend visit wish stay hours hotel unbearable",
                "personally stayed days wedding disappointed service cause dont glass extra mattress even extra blanket washroom stinks doors broken planning wedding good decision cause spacious good ambience",
                "reasonably good staying charges higher side"
            ]
        },
        {
            "name": "Hotel Dixit Resort",
            "rating": [
                3.3
            ],
            "address": [
                "Mathasahi, Gabasahi, Bhadrak, Odisha 756101, India"
            ],
            "reviews": [
                {
                    "text": "All the details given over google is wrong , they don’t have pool and its not 4 star hotel its a low class hotel. The staff will mislead you over the call. Its a under construction hotel and you will avoid to stay at such place . Please don’t get fooled by the google description .",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "I visited this hotel during a marriage ceremony. Food was awesome. But the manager was a very irresponsible person 😡. He just given my room key to a stranger. And he was telling me that he was with me.\n\nThe bathrooms we clean but after use they become very smelly even after flushing for  3 to 4 times. The windows of bathrooms were very large. There is no privacy. But has a large parking area. The hall was medium sized. And the hall's wash besin were choked.\n\nThis deserves ⭐⭐ 2 star rating only.\n😡",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Better to avoid. Pathetic service. Initially negotiated room charges including breakfast, but was not provided. Later completely denied by manager about same",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Except the location and parking available of the Hotel, nothing is in order. Rooms, services, attendant, ambiance etc. are extremely poor. Even no basic amenities are available in the room and very much unhegenic condition. It is just a Roadside Hotel for emergency stay but room tariff is extremely high.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "I had to pay 1000 rs for non ac room for a night. I try to convince the Manager to negotiate something as I need to stay for some hours and need to leave in early morning. But he was too firm. It was late night, I had no choice to stay. The room condition was bad. Smell coming from the bedsheet and materess. Light was so dim in the washroom, you can hardly see anything. Hotel was like Haunted Bungalow. Might be because of less guests, condition was like this.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "details given google wrong donâ\u0080\u0099t pool star hotel low class hotel staff mislead call construction hotel avoid stay place please donâ\u0080\u0099t get fooled google description",
                "visited hotel marriage ceremony food awesome manager irresponsible person ð\u009f\u0098¡ given room key stranger telling bathrooms clean use become smelly even flushing times windows bathrooms large privacy large parking area hall medium sized halls wash besin choked deserves â­\u0090â­\u0090 star rating ð\u009f\u0098¡",
                "better avoid pathetic service initially negotiated room charges including breakfast provided later completely denied manager",
                "except location parking available hotel nothing order rooms services attendant ambiance etc extremely poor even basic amenities available room much unhegenic condition roadside hotel emergency stay room tariff extremely high",
                "pay rs non ac room night try convince manager negotiate something need stay hours need leave early morning firm late night choice stay room condition bad smell coming bedsheet materess light dim washroom hardly see anything hotel like haunted bungalow might less guests condition like"
            ]
        },
        {
            "name": "Hotel Anand",
            "rating": [
                3.8
            ],
            "address": [
                "3GH6+397 Dahanigadia, Bhadrak, Odisha 756101, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are not properly maintained..food is also not good.the worst part is the waiters behaviour..they start asking for tips as soon one reached at the room..not only single person.. each person providing service at the room asks for tip...I recommend not to stay in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very nice and beautiful rooms service.manager service very good .",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very nice.staffs are good.cost is moderate.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Mostly the food was good for dinner..  the main things they should look after is they should have an insect killer or atleast a trap as it's very disturbing . All together the facility was quiet good. We asked for extra blanket and pillow which they promised to give but did not provide .",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good but not as per the tariffa",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms properly maintainedfood also goodthe worst part waiters behaviourthey start asking tips soon one reached roomnot single person person providing service room asks tipi recommend stay hotel",
                "nice beautiful rooms servicemanager service good",
                "nicestaffs goodcost moderate",
                "mostly food good dinner main things look insect killer atleast trap disturbing together facility quiet good asked extra blanket pillow promised give provide",
                "good per tariffa"
            ]
        },
        {
            "name": "Yashoda Hotel",
            "rating": [
                3.7
            ],
            "address": [
                "101, kacheri road, kacheri, Chandan Bazar Rd, Naripur, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "Try to avoid this hotel at any cost. You can get bunch of options nearby even during holiday rush. But don't make mistake to come here. This hotel is just bad from every aspect.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Basically the hotel was good and the behaviour of all staff is kind.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It is one of the oldest hotels in Bhadrak. Rooms are standard. You can have a budget stay. Don't expect luxury. Service is ok. Location is the main plus point. It's is situated in the main market, so everything is within walkable distance. Since it is in the middle of the vegetable market, it is always over crowded. The vegetable vendors are sitting in the front of the hotel. So there is no parking space. Sometimes not even a single four wheeler can be parked 😉. Coming to the restaurant, the food is also budget oriented. The food tastes good, the rate is good. Ambience is normal. There is no thali. It's ala carta but don't have a fixed menu. Chicken kassa, pohola macha curry, macha besar taste is very good. Good for lunch and dinner. Usually crowded in the lunch time.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Superb hotel. The hotel manager Ranjan babu is a nice, very helpful person. He is a superb human being. There is a restaurant on the ground floor. The food is also very good. All the staff are really good and helpful. Completely safe and secure place to saty. I really enjoyed my stay here. I would strongly recommend this hotel 10 out of 10. Thank you so much Ranjan babu for your help",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice looking hotel best in bhadrak\nNice service",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "try avoid hotel cost get bunch options nearby even holiday rush dont make mistake come hotel bad every aspect",
                "basically hotel good behaviour staff kind",
                "one oldest hotels bhadrak rooms standard budget stay dont expect luxury service ok location main plus point situated main market everything within walkable distance since middle vegetable market always crowded vegetable vendors sitting front hotel parking space sometimes even single four wheeler parked ð\u009f\u0098\u0089 coming restaurant food also budget oriented food tastes good rate good ambience normal thali ala carta dont fixed menu chicken kassa pohola macha curry macha besar taste good good lunch dinner usually crowded lunch time",
                "superb hotel hotel manager ranjan babu nice helpful person superb human restaurant ground floor food also good staff really good helpful completely safe secure place saty really enjoyed stay would strongly recommend hotel thank much ranjan babu help",
                "nice looking hotel best bhadrak nice service"
            ]
        },
        {
            "name": "Hotel Sampark",
            "rating": [
                3.6
            ],
            "address": [
                "3GF5+25R, Bypass, Bankashi, Bhadrak, Odisha 756100, India"
            ],
            "reviews": [
                {
                    "text": "Worst hotel I ever visited...there was a power cut at middle of the night but the hotel stuff those who saty here used the inverter to sleep well but they didn't provide electricity to the guest...and I couldn't sleep the whole night",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Not good....they give the worst rooms for staying even if they have better rooms at first...washrooms need to be cleaned regularly...they provide torn and damaged blankets with very bad smell....rooms are very dirty with worse smell",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good for family. Not an oyo",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Best room with good staff behavior.\nAffordable room rates and good food.\nHealthy and Hygienic\nOwner is very sweet too.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Bad behaviour person manager.\nNot good for stay.ogly place, foods are not tasty 🤢😡🤬",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst hotel ever visitedthere power cut middle night hotel stuff saty used inverter sleep well didnt provide electricity guestand couldnt sleep whole night",
                "goodthey give worst rooms staying even better rooms firstwashrooms need cleaned regularlythey provide torn damaged blankets bad smellrooms dirty worse smell",
                "good family oyo",
                "best room good staff behavior affordable room rates good food healthy hygienic owner sweet",
                "bad behaviour person manager good stayogly place foods tasty ð\u009f¤¢ð\u009f\u0098¡ð\u009f¤¬"
            ]
        }
    ]
}