{
    "places_with_reviews": [
        {
            "name": "Hotel Narendra Palace",
            "rating": [
                4
            ],
            "address": [
                "Pindari, Munsyari - Thal Road, Kailkhuriya, Bageshwar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "Best for multiple events.\nRooms are beautiful.\nRestaurant with beautiful river view & delicious food . We have celebrated birthday, anniversary, weddings, engagement & many parties happily. Owner & staff are so cooperative.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "\"The location was perfect - close to the city centre and attractions. The hotel had great facilities and was very convenient.” Fresh welcoming faces all around\n\nBuffet breakfast is too delicious.\n\nHope to see you soon guys",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good vibes only !\n5:30am yoga classes on terrace.\nA good breakfast buffet was waiting seating towards the river Saryu.\n\nFresh environment\nCosy big size rooms\nAwesome variety of food & drinks",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The accommodations and service offer excellent value. The location is stunning, providing clear views of the river stream (Gomti river I believe) from both the common area and cafeteria.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Cool place to hang- out with friends & family.\nWe always enjoy our stay being frequent to these landscapes.\n\n#Homely, clean environment.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best multiple events rooms beautiful restaurant beautiful river view delicious food celebrated birthday anniversary weddings engagement many parties happily owner staff cooperative",
                "location perfect close city centre attractions hotel great facilities convenientâ\u0080\u009d fresh welcoming faces around buffet breakfast delicious hope see soon guys",
                "good vibes yoga classes terrace good breakfast buffet waiting seating towards river saryu fresh environment cosy big size rooms awesome variety food drinks",
                "accommodations service offer excellent value location stunning providing clear views river stream gomti river believe common area cafeteria",
                "cool place hang friends family always enjoy stay frequent landscapes homely clean environment"
            ]
        },
        {
            "name": "Hotel Deep Palace",
            "rating": [
                4.3
            ],
            "address": [
                "Almora-Bageshwar Rd, Bageshwar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "We chose hotel Deep Palace for my sister's colleagues from Norway, France and Spain for her wedding in Bageshwar. This has been very great experience for all of them. The owner takes personal attention to all the needs and services. They have the cleanest room and very good service. We requested food as per the guests food habits and they were provided with it. We will be always thankful for the owner's hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice hotel on road location price per night Rs 700-900 depends on your bargaining skills.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel was good but the Verity of dishes was small",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "If not the best, Hotel Deep palace is one of the best hotels in the locality. With well trained staff full of hospitality and smiling faces, we were treated well throughout the stay. The hotel is located just alongside the main road so didn't have to roam around much. The rooms are cosy and centrally heated as such you won't have to worry about the cold. The food tasted great and the other facilities were also good. The only drawback was the parking space as it's shared with the neighbouring Reliance Trends also. Overall a great stay, would definitely recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is the worst hotel I have been to in my life. I booked this in October 2021 after looking into the good Google reviews, talking to the owner over phone and reached the place.\nThe rooms are the worst with spider webs all over the room, bathroom, no grills in the bathroom, there was no lock in my room and the owner temporarily fixed it.\nThe rooms, bedsheets had not been cleaned since months and had to request them to change. The replacement’s were also unclean and not ironed.\nThe manager, cleaners and owner weren’t professional at all.\nI visited with family and couldn’t stay in such a place so moved to another close by hotel after an hour.\nPlease don’t visit the place.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "chose hotel deep palace sisters colleagues norway france spain wedding bageshwar great experience owner takes personal attention needs services cleanest room good service requested food per guests food habits provided always thankful owners hospitality",
                "nice hotel road location price per night rs depends bargaining skills",
                "hotel good verity dishes small",
                "best hotel deep palace one best hotels locality well trained staff full hospitality smiling faces treated well throughout stay hotel located alongside main road didnt roam around much rooms cosy centrally heated wont worry cold food tasted great facilities also good drawback parking space shared neighbouring reliance trends also overall great stay would definitely recommend",
                "worst hotel life booked october looking good google reviews talking owner phone reached place rooms worst spider webs room bathroom grills bathroom lock room owner temporarily fixed rooms bedsheets cleaned since months request change replacementâ\u0080\u0099s also unclean ironed manager cleaners owner werenâ\u0080\u0099t professional visited family couldnâ\u0080\u0099t stay place moved another close hotel hour please donâ\u0080\u0099t visit place"
            ]
        },
        {
            "name": "Hotel Siddhartha",
            "rating": [
                3.9
            ],
            "address": [
                "Bhauli, Bageshwar, SH-11, Bageshwar Road, Bageshwar, Bageshwar, Bari Khalsa, Uttarakhand 263669, India"
            ],
            "reviews": [
                {
                    "text": "For rooms I have shared details below. The rooms were dirty. The service was very poor and careless. What to talk about service. There was a landline phone but it was damaged. The beds were of very poor quality. If you are planning to come and stay in this hotel, then ease change your decision. Stay in any other hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is one of the oldest hotel in Bageswar, uttarakhand. Rooms is okay, it is beside the Gomti river , so there is a good view of river from this hotel. No food is served, but there is attached restaurant and nearby restaurant from where one can easily take the food. Room door should be locked, otherwise monkey may take your things from the room.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Centrally located budget hotel.Rooms are ok clean with attached bathroom, hot water facility, free parking. Restaurant for basic food. Affordable price.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is located in Main Market and at the same time on River Bank. Rooms are quite spacious and clean. Bedsheets, Toilet were also clean. Overall experience is quite good in budget prices.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good hotel and very good staff",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms shared details rooms dirty service poor careless talk service landline phone damaged beds poor quality planning come stay hotel ease change decision stay hotel",
                "one oldest hotel bageswar uttarakhand rooms okay beside gomti river good view river hotel food served attached restaurant nearby restaurant one easily take food room door locked otherwise monkey may take things room",
                "centrally located budget hotelrooms ok clean attached bathroom hot water facility free parking restaurant basic food affordable price",
                "hotel located main market time river bank rooms quite spacious clean bedsheets toilet also clean overall experience quite good budget prices",
                "good hotel good staff"
            ]
        },
        {
            "name": "Hotel Prashant Bageshwar",
            "rating": [
                4.9
            ],
            "address": [
                "Kanda Road NH309 Nearby The Karan Sweets Bageshwar 100 Metre From The Karan Sweets , Kanda, Road, Matiyoli, Bageshwar, Namtichetabagar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "Very bad everything. You cannot get food,\nthey don't provide a seat for the driver.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We had an awesome stay at the hotel. The staff was helpful and was available 24x7. The hotel is at walking distance from the main market. Rooms were clean and proper hygiene was maintained.\n\nI would suggest this highly.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "This is our 3rd visit and they never disappoint me in service. I came because of vinay bhai he manages us like a family. Kabhi Delhi aao bhai.❤️",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "One of Best Hotel in Bageshwar having Neat & Clean , Hygienic and spacious rooms\nWith supportive and  decent staff.\nProvided Best Services.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Nice place to stay. Well maintained rooms. Good and humble staff.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad everything get food dont provide seat driver",
                "awesome stay hotel staff helpful available x hotel walking distance main market rooms clean proper hygiene maintained would suggest highly",
                "rd visit never disappoint service came vinay bhai manages us like family kabhi delhi aao bhaiâ\u009d¤ï¸\u008f",
                "one best hotel bageshwar neat clean hygienic spacious rooms supportive decent staff provided best services",
                "nice place stay well maintained rooms good humble staff"
            ]
        },
        {
            "name": "KMVN TRH Bageshwar",
            "rating": [
                3.5
            ],
            "address": [
                "SH 37, Bageshwar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "No maintenance। In very bad shape। Need immediate attention from higher authority",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "A very economical and reliable place to stay if one is looking for a break in the journey.\nDon't keep high expectations from this place in terms of rooms and service.\nIt is a  govt owned place to provide accommodation at very reasonable rate to tourists.\nThe only comforting factor is that as tourist one will not be fleeced by the touts, and also the tie up they have with taxis ensures that a taxi is made available to you at the govt approved rates.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Huge construction, lots of rooms. When we reached no power, neither provision of power back up. Neither the attendant was interested in the allotment of the room. As summer was there.\nGood parking space. No guests in the TRH.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Great infrastructure, but poorly maintained, open/broken electrical wiring in the room, wooden almirah eaten by termites, plenty of webs created by spiders. Concerned authorities should take immediate steps to maintain it. Kitchen works as per the order. Rooms should be stuffed with electrical kettle etc to make tea coffee etc so that one can prepare it at odd times. Room sizes are more than good, what we get at private hotels at a cheaper rates. Lots of parking space for parking cars.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Nice place to stay.. Old but neat and clean. services is good. parking is available. Location is good.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "maintenanceà¥¤ bad shapeà¥¤ need immediate attention higher authority",
                "economical reliable place stay one looking break journey dont keep high expectations place terms rooms service govt owned place provide accommodation reasonable rate tourists comforting factor tourist one fleeced touts also tie taxis ensures taxi made available govt approved rates",
                "huge construction lots rooms reached power neither provision power back neither attendant interested allotment room summer good parking space guests trh",
                "great infrastructure poorly maintained openbroken electrical wiring room wooden almirah eaten termites plenty webs created spiders concerned authorities take immediate steps maintain kitchen works per order rooms stuffed electrical kettle etc make tea coffee etc one prepare odd times room sizes good get private hotels cheaper rates lots parking space parking cars",
                "nice place stay old neat clean services good parking available location good"
            ]
        },
        {
            "name": "Hotel Vivek",
            "rating": [
                3.9
            ],
            "address": [
                "Tehsil Road, Bageshwar SH-37, Bageshwar Rd, Bageshwar, Kaphalkhet, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "Dirty and leakage in toilet, insects on bed.\nNo Parking, no regular power supply\nStaff rude.\nPower points are loose",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Don't order any food items from the menu.. You can visit any nearby restaurants *Recommended : Pahadi BOYS Restaurant",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The bathroom was cleaner than most available in the area but it was still not clean enough. There was no view from the room and the window was not visible from bed. So you miss out on morning sunshine and views. The location is good , it’s located at the centre of the city.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Such a nice place.\nInfrastructure is very well.\nIt provide hygienic atmosphere, atm is near by it.\nStaff is well behaved.\nFood is tasty nd healthy\nMain thing also give facilities of catering.\nMust choose to stay if u r seeking for an Adobe in baheshwar",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel Vivek is located right on the banks of the Sarayu River. One gets a great view of the river, which incidentally has crystal clear blue water, and the pine trees covered mountains. The rooms are great for moderate budget. The restaurant serves variety of Indian cuisine. It has a open parking right across the street. Not too many options for lodging in Bageshwar town, hence Hotel Vivek serves your purpose as the price of the rooms is reasonable.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dirty leakage toilet insects bed parking regular power supply staff rude power points loose",
                "dont order food items menu visit nearby restaurants recommended pahadi boys restaurant",
                "bathroom cleaner available area still clean enough view room window visible bed miss morning sunshine views location good itâ\u0080\u0099s located centre city",
                "nice place infrastructure well provide hygienic atmosphere atm near staff well behaved food tasty nd healthy main thing also give facilities catering must choose stay u r seeking adobe baheshwar",
                "hotel vivek located right banks sarayu river one gets great view river incidentally crystal clear blue water pine trees covered mountains rooms great moderate budget restaurant serves variety indian cuisine open parking right across street many options lodging bageshwar town hence hotel vivek serves purpose price rooms reasonable"
            ]
        },
        {
            "name": "Hotel Bhavishya inn",
            "rating": [
                4.6
            ],
            "address": [
                "PWD Tiraha, Kathayatbara, Bageshwar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "Decent hotel with great location. Rooms are clean, staff is friendly, parking space is available.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Amazing hotel, great service staff helpful professional management  and always available happy to help looks after well\nI will recommend this property to everyone if you want to enjoy great hospitality at the Pindari Glacier road  on the bank of Saryu and within the city of BAGNATH JI.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "It's a good place to live in Bageshwar however the manager will keep asking for pennies!! Better pay first and then take service",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "As a Tamilnadu resident, I found the hotel to have a fresh and pleasant ambiance. I was able to secure a single room for 700rs for a 24-hour stay, and I was pleased to find that they also offered affordable and delicious food options. I would strongly recommend this hotel to any South Indians seeking accommodations in Bageshwar.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Okay.. at first this place looked bad .. like really bad.. then we entered narendra inn .. and realized how good this place is in bageswar..\n\nThe rooms are fine but very good compared to others in the area .. they got fast and good room service, wifi n other stuff ... you will need to bring your own iron though.\n\nOverall the this the best you can find in this town so definitely recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent hotel great location rooms clean staff friendly parking space available",
                "amazing hotel great service staff helpful professional management always available happy help looks well recommend property everyone want enjoy great hospitality pindari glacier road bank saryu within city bagnath ji",
                "good place live bageshwar however manager keep asking pennies better pay first take service",
                "tamilnadu resident found hotel fresh pleasant ambiance able secure single room rs hour stay pleased find also offered affordable delicious food options would strongly recommend hotel south indians seeking accommodations bageshwar",
                "okay first place looked bad like really bad entered narendra inn realized good place bageswar rooms fine good compared others area got fast good room service wifi n stuff need bring iron though overall best find town definitely recommended"
            ]
        },
        {
            "name": "Shri Baghnath Palace",
            "rating": [
                4.3
            ],
            "address": [
                "1, Bhauli, SH11, Bageshwar - Didihat Rd, Bageshwar, Bari Khalsa, Uttarakhand 263669, India"
            ],
            "reviews": [
                {
                    "text": "It one of the best hotel in bageshwar at Mall road. It's near gomti river. View of gomti river from rooms are best.\nFood of this hotel is best. Taste is great and variety of food is available.\nHotel staff is very good specially manager and kitchen people.\nIt's was my best stay in bageshwar",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I stayed for 2 days and commendable experience  it was, the food was exquisite  and ambience  and the view  makes one's day.\n\nWill surely  visit again",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It was an awesome hotel and room are so good... Started from 500 to 3200 per day....",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very good location,  excellent staffs vehabiour, clean  and hygenic  nice place to stay in Bageshwar",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good Hotel and good staff ! Because Hotel MD is very Big heart ❤",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best hotel bageshwar mall road near gomti river view gomti river rooms best food hotel best taste great variety food available hotel staff good specially manager kitchen people best stay bageshwar",
                "stayed days commendable experience food exquisite ambience view makes ones day surely visit",
                "awesome hotel room good started per day",
                "good location excellent staffs vehabiour clean hygenic nice place stay bageshwar",
                "good hotel good staff hotel md big heart â\u009d¤"
            ]
        },
        {
            "name": "Hotel Ashish",
            "rating": [
                4
            ],
            "address": [
                "RQJ9+4RF, Bageshwar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "This hotel is situated at main road opposite to taxi stand for Almora and I find this location perfect for me. Staff was very supportive and helpful, rooms are hygienic and spacious, loved the balcony view.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great affordable hotel with friendly staff. Location is also good. Nice and clean rooms.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best hotel in bageshwar city at very reasonable rate . open area balcony ,parking space ,nice attendants make this hotel super.\nAshish ji, youth entrepreneur, himself is very welcoming person.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great hotel with spacious rooms and friendly staff. Away from the busy market area. Beautiful view of the mountains from the balcony.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best Hotel At Affordable Price. Wonderful Environment & Safe Location. Good For Family.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel situated main road opposite taxi stand almora find location perfect staff supportive helpful rooms hygienic spacious loved balcony view",
                "great affordable hotel friendly staff location also good nice clean rooms",
                "best hotel bageshwar city reasonable rate open area balcony parking space nice attendants make hotel super ashish ji youth entrepreneur welcoming person",
                "great hotel spacious rooms friendly staff away busy market area beautiful view mountains balcony",
                "best hotel affordable price wonderful environment safe location good family"
            ]
        },
        {
            "name": "HOTEL SHRI RAM PALACE BAGESHWAR / होटल श्री राम पैलेस मंडलसेरा बागेश्वर उत्तराखंड",
            "rating": [
                5
            ],
            "address": [
                "Mandalsera Bypass, Ring Road, Mandalsera, Namtichetabagar, Uttarakhand 263642, India"
            ],
            "reviews": [
                {
                    "text": "Overall, I had a great experience with the Shri Ram Palace; Staff was incredibly helpful and the amenities were great. The rooms were wonderful, clean, and perfect to stay.\n\nStaying in that hotel felt as if we were in the Lap of Nature.",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "The best you can get in bageshwar , this hotel is new near and clean with supportive staff and a wonderful amicable owner.... Prices are worth what they provide. Most recommended 👍👍👍❤️",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Well fecility ,clean, humble and kind staff provided. Best staying in Bageshwar. Highly recommend.😊",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Best hotel, great food .",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "One of  the best luxury hotel in the Bageshwar. Best service provided by their management.",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall great experience shri ram palace staff incredibly helpful amenities great rooms wonderful clean perfect stay staying hotel felt lap nature",
                "best get bageshwar hotel new near clean supportive staff wonderful amicable owner prices worth provide recommended ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008dâ\u009d¤ï¸\u008f",
                "well fecility clean humble kind staff provided best staying bageshwar highly recommendð\u009f\u0098\u008a",
                "best hotel great food",
                "one best luxury hotel bageshwar best service provided management"
            ]
        }
    ]
}