{
    "places_with_reviews": [
        {
            "name": "Hotel Sai Palace, Balangir",
            "rating": [
                4.6
            ],
            "address": [
                "Kacheri Chowk, Priyadarshani Talkies Road, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Unclean rooms - bed had cockroaches and other insects!! (photo attached)\nThey charged us separately for breakfast - where there were not too many options - idlis were inedible when we asked for toast (as it is a safe option), we were told toaster is not working so if we wanted toast they have to do it on a tawa, we agreed to that and asked for 4 slices of toast but served only 3!!\nOur journey was delayed by few hrs and we asked for few hrs extension and expected to pay a fair fee, but the front desk guy charged us full room charges for another full day and night!\nThis place takes advantage of the fact that there are not too many options available in a place like Bolangir",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Food was good. Rooms were adequate size with standard amenities. But not wow. Banquet hall for 50guest is there. Good place. Parking is a issue. And turn to reach hotel from the main road is bit clumsy. We had banquet buffet with chicken and meat dishes. Okay for family",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Excellent behaviour of the staff..Tasty and a variety of breakfast options.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Me and my cousins went there for a birthday party. But the restaurant is extremely small. They have limited seats and the place is packed. Staff are repeatedly ignoring us because they don't have seats to give us.. still they can say it properly in a good way. But they chose to ignore and later said that it will be vacant after 10 mins. After waiting for another 10 mins also they don't provide seats. Very disappointed.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Had booked a stay for friends and relatives and they enjoyed the hospitality. Rooms are spacious, service is good, and the food is also nice. The owner is a super chilled out person, and will recommend this hotel to everyone. It's way better than other hotels in town, location is also in close proximity to all necessary places.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "unclean rooms bed cockroaches insects photo attached charged us separately breakfast many options idlis inedible asked toast safe option told toaster working wanted toast tawa agreed asked slices toast served journey delayed hrs asked hrs extension expected pay fair fee front desk guy charged us full room charges another full day night place takes advantage fact many options available place like bolangir",
                "food good rooms adequate size standard amenities wow banquet hall guest good place parking issue turn reach hotel main road bit clumsy banquet buffet chicken meat dishes okay family",
                "excellent behaviour stafftasty variety breakfast options",
                "cousins went birthday party restaurant extremely small limited seats place packed staff repeatedly ignoring us dont seats give us still say properly good way chose ignore later said vacant mins waiting another mins also dont provide seats disappointed",
                "booked stay friends relatives enjoyed hospitality rooms spacious service good food also nice owner super chilled person recommend hotel everyone way better hotels town location also close proximity necessary places"
            ]
        },
        {
            "name": "Hotel Apoorva Royale",
            "rating": [
                4.7
            ],
            "address": [
                "Anand Niketan Marg, Near, Circuit House Rd, Salepali, Khujenpali, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "The property is very nice, with loads of amenities and in house restaurant. Rooms are spacious clean and neatly maintained. Service is prompt and satisfactory. Only disadvantage is location which feels a bit aloof from normal traffic route. However a very nice stay and pretty much recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent hotel  ideally located at the heart of the Bolangir Town. The rooms are specious, extremely clean & comfortable. Upon arrival we were warmly welcomed by the friendly staffs. The food was delicious with nice selection of breakfast, lunch & dinner.Would definitely recommend this hotel to everyone for quality & Value.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Worst hotel to stay specially the food . Both are so expensive and they first promise you for discount and when you are leaving they argue not to promise about the discount and that to im facing these issues after 4 time continue visit. With this behaviour and service is done to  regular customer god forbid the new commer.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Plz have a visit, you will be happy with hospitality as well as food quality",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Roof top dining is the most attractive point of this hotel\n\nGood for family outing.. enjoy the dinner",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property nice loads amenities house restaurant rooms spacious clean neatly maintained service prompt satisfactory disadvantage location feels bit aloof normal traffic route however nice stay pretty much recommended",
                "excellent hotel ideally located heart bolangir town rooms specious extremely clean comfortable upon arrival warmly welcomed friendly staffs food delicious nice selection breakfast lunch dinnerwould definitely recommend hotel everyone quality value",
                "worst hotel stay specially food expensive first promise discount leaving argue promise discount im facing issues time continue visit behaviour service done regular customer god forbid new commer",
                "plz visit happy hospitality well food quality",
                "roof top dining attractive point hotel good family outing enjoy dinner"
            ]
        },
        {
            "name": "Sarojinee Residency",
            "rating": [
                4
            ],
            "address": [
                "Infront HP Petrol Pump, Adarsha Pada, District Cold Storage Rd, Balangir, Odisha 767002, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel. Room services are bit sluggish, may be small town effect. Cordial staff. Please take your own toiletries, hair dryer with you.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms and service good but we were duped of Rs 3500/- because of their faulty website which was hacked by the time we booked. So be cautious while booking for hotels that you find from Google.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good Hotel in the city with spacious and clean rooms and food quality also good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Please be aware of fraud when you try to click the option of chat. Never ever book the hotel online. Pls  book only through known Agents",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It was pricey ,  naan was tasteless and felt like eating chapati",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel room services bit sluggish may small town effect cordial staff please take toiletries hair dryer",
                "rooms service good duped rs faulty website hacked time booked cautious booking hotels find google",
                "good hotel city spacious clean rooms food quality also good",
                "please aware fraud try click option chat never ever book hotel online pls book known agents",
                "pricey naan tasteless felt like eating chapati"
            ]
        },
        {
            "name": "HOTEL PARK LAND",
            "rating": [
                4
            ],
            "address": [
                "Rugudipada Ram Mandir Rd, Rugudipada, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "I love this hotel, it has a big hall feel to it. Very intimate common area spaces that are nicely decorated and feel very welcoming. the views to the marriage from the restaurant make for a delightful  experience if sitting in restaurant. Manager Sanjay made our function with smooth operation,was very concerned for each and everything .Every time he was stood up to help for Everything. make a point to enjoy a nice buffet dinner . Lavishing lobby , Beautiful interior and so peaceful..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst experience ever! Just checked out yesterday & I’d like to tell you the hotel staff is as lazy as they could ever be! It takes a hell lot of calls to be made for the simplest of requests to be fulfilled. Over anything, the staff is as less considerate of your needs as they could avoid!\nMake a wise decision and don’t BOOK!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are well maintained. And also spacious. Staff are not skilled, they need improvement. Parking space is also not much better. Above all I had a good experience during my stay. Love to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Centrally located and conveniently accessable, from Bus Stop & Railway station, with good ambience and spacious room.\nHotel Manager Mr. Sanjay was readily available to address the customer needs to make a stay comfortable.\nCentralized a/c, hot running water, spacious Hall for celebration and Restaurant is a plus.\nIn general hygiene and cleanliness is good though there is some scope to do proper dusting. Staff is polite and well behaved.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This hotel ambions is awesome...in  our 6 days stay...from starting to end match ...it was good stay aspects of room service and food at restaurant. Even though more than 50 players Hotel  Manager Mr.Sanjay was very cool and calm to handle everything with good manner .breakfast ,laundry service was on time...we all had good time in the hotel...best staffs behaviour ....",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "love hotel big hall feel intimate common area spaces nicely decorated feel welcoming views marriage restaurant make delightful experience sitting restaurant manager sanjay made function smooth operationwas concerned everything every time stood help everything make point enjoy nice buffet dinner lavishing lobby beautiful interior peaceful",
                "worst experience ever checked yesterday iâ\u0080\u0099d like tell hotel staff lazy could ever takes hell lot calls made simplest requests fulfilled anything staff less considerate needs could avoid make wise decision donâ\u0080\u0099t book",
                "rooms well maintained also spacious staff skilled need improvement parking space also much better good experience stay love visit",
                "centrally located conveniently accessable bus stop railway station good ambience spacious room hotel manager mr sanjay readily available address customer needs make stay comfortable centralized ac hot running water spacious hall celebration restaurant plus general hygiene cleanliness good though scope proper dusting staff polite well behaved",
                "hotel ambions awesomein days stayfrom starting end match good stay aspects room service food restaurant even though players hotel manager mrsanjay cool calm handle everything good manner breakfast laundry service timewe good time hotelbest staffs behaviour"
            ]
        },
        {
            "name": "Hotel Bhammars",
            "rating": [
                3.7
            ],
            "address": [
                "Shiv Durga Complex, Sambalpur Rd, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Service is too Poor\nNo Drinking water provided on Room service\nSanitation: Worst.\nLunch: too poor",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We were here for almost half an hour, they were slow as new wedded bride. Even after complaining, zero response . Not satisfied.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very very low quality service\nTaste less food ever",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Rooms are not so good pretty old matresses, the basins were chocking most of the time , no swimming pool available, but complimentary breakfast is very nice, must visit",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very nice place little  crowdy for parking",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service poor drinking water provided room service sanitation worst lunch poor",
                "almost half hour slow new wedded bride even complaining zero response satisfied",
                "low quality service taste less food ever",
                "rooms good pretty old matresses basins chocking time swimming pool available complimentary breakfast nice must visit",
                "nice place little crowdy parking"
            ]
        },
        {
            "name": "Triveni Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "Ramai Talkies Road, near Gurudwara, Rugudipada, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Not up to the mark. Many of the hotel staffs work very unprofessionally even the manager (specially mentioning manager bcoz as a leader we expect a bit more professional attitude from him). Rooms really needed to get renovated even the reception too. It seems that the appliances n switches are of a different era.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The hotel is at the heart of the city. Location is best near Ramai Takies. Food is good. Good for marriage bookings.\n\nRoom sizes are good. Quality of room are avarage.\n\nPro\nLocation , food quality and service\n\nCon\nParking\n\nOver all good for bolangir.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Value for money hotel.  No so cheap nor costly. Clean & maintained rooms, service also good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Got married here and one more function after that..great hotel....value for money...",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst hotel. They will cheat you every possible way.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mark many hotel staffs work unprofessionally even manager specially mentioning manager bcoz leader expect bit professional attitude rooms really needed get renovated even reception seems appliances n switches different era",
                "hotel heart city location best near ramai takies food good good marriage bookings room sizes good quality room avarage pro location food quality service con parking good bolangir",
                "value money hotel cheap costly clean maintained rooms service also good",
                "got married one function thatgreat hotelvalue money",
                "worst hotel cheat every possible way"
            ]
        },
        {
            "name": "Geetanjali Residency",
            "rating": [
                4.1
            ],
            "address": [
                "PF58+J4C, Unnamed Road, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Disappointing Experience with Unprofessional Service\n\nI recently stayed at this hotel and had a disappointing experience. Upon arrival at 2 AM, I found the bathroom latch broken.After bringing it to the hotel's attention, they failed to resolve  the issue during our two-day stay. When we requested a more  three-hour extension for our 5 AM checkout, the owner responded unprofessionally, stating we shouldn't have accepted the room with a broken latch.and by 7 PM of the 2 nd day we decided to checkout and to shift to another hotel for a pleasant  stay. This lack of accountability and customer service left a negative impression. I do not recommend this hotel to others.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very bad experience. No shop in the bathroom. Room properly not clean. Water not provided timely.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The experience was very bad and also the service was very poor, their manager including the owner are not solution oriented with a fully commercial & aurogent mindset.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Room are quite dirty. At morning water is not coming. T.V. is not coming. For only one day stay is okay but for one or more day to stay is not okay for my choice..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Well clean good behaviour renting",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "disappointing experience unprofessional service recently stayed hotel disappointing experience upon arrival found bathroom latch brokenafter bringing hotels attention failed resolve issue twoday stay requested threehour extension checkout owner responded unprofessionally stating shouldnt accepted room broken latchand pm nd day decided checkout shift another hotel pleasant stay lack accountability customer service left negative impression recommend hotel others",
                "bad experience shop bathroom room properly clean water provided timely",
                "experience bad also service poor manager including owner solution oriented fully commercial aurogent mindset",
                "room quite dirty morning water coming tv coming one day stay okay one day stay okay choice",
                "well clean good behaviour renting"
            ]
        },
        {
            "name": "Hotel Jk Residency , Balangir",
            "rating": [
                4.7
            ],
            "address": [
                "near school thikadar para priyadarshini takies road, Thikadarpara, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Had a great experience, loved the vibe, I came for a business trip and stayed here. The staff were really supportive. Would love to recommend for traveller. Afordable yet luxurious.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent facilities. Great staff. Nearby to all public spots like bus stop and station. Had a great experience staying in the hotel. A must visit hotel if anyone visiting bolangir",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice hotel in the city centre. Rooms are clean and spacious. The price is okay. 4 stars for the breakfast that the hotel is arranging from outside. It is recommended to cook a good breakfast at the hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The hotel exceeded expectations. Impeccable service, spacious and clean rooms. The staff was incredibly hospitable, making the stay truly enjoyable. The on-site dining options were exceptional, offering a variety of delicious cuisines. A top-notch experience that I highly recommend to all travelers.\n\nThe only thing is they don't have rooms for solo travelers and you have to adjust yourself in a double bed room.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Had a great experience staying in the hotel. Great staff along with best services",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great experience loved vibe came business trip stayed staff really supportive would love recommend traveller afordable yet luxurious",
                "excellent facilities great staff nearby public spots like bus stop station great experience staying hotel must visit hotel anyone visiting bolangir",
                "nice hotel city centre rooms clean spacious price okay stars breakfast hotel arranging outside recommended cook good breakfast hotel",
                "hotel exceeded expectations impeccable service spacious clean rooms staff incredibly hospitable making stay truly enjoyable onsite dining options exceptional offering variety delicious cuisines topnotch experience highly recommend travelers thing dont rooms solo travelers adjust double bed room",
                "great experience staying hotel great staff along best services"
            ]
        },
        {
            "name": "Hotel Blue Lagoon",
            "rating": [
                3.4
            ],
            "address": [
                "Tikrapara, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "The rooms are full of bed bugs, never ever go to this hotel. The in-house restaurant doesn't have any variety in food items. The staffs' behavior also not good. Don't waste your money staying in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Its getting older and rooms are not so good as compare to price. Need renovation.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Amazing room nd service is very faster of this hotel 🛏️",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Rooms are good in size but poor maintenance. Ac rooms are useless, ac stop working and they charge is fully. Dont go for ac rooms. Breakfast is included in rent and you have only 2 options, Puri bhaji & Bread omlet along with half cup of tea. Breakfast items are ice chilled.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Hotel is having many rooms. Though room size is good, I didn't like it due to poor maintenance and bad odor. Overall cleanliness and decor is poor.  Staffs are good, well behaved and cooperative.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms full bed bugs never ever go hotel inhouse restaurant doesnt variety food items staffs behavior also good dont waste money staying hotel",
                "getting older rooms good compare price need renovation",
                "amazing room nd service faster hotel ð\u009f\u009b\u008fï¸\u008f",
                "rooms good size poor maintenance ac rooms useless ac stop working charge fully dont go ac rooms breakfast included rent options puri bhaji bread omlet along half cup tea breakfast items ice chilled",
                "hotel many rooms though room size good didnt like due poor maintenance bad odor overall cleanliness decor poor staffs good well behaved cooperative"
            ]
        },
        {
            "name": "RIDHI SIDHI HOTEL & RESTAURANT",
            "rating": [
                3.9
            ],
            "address": [
                "MF83+VHP, Ng26, Balangir, Odisha 767001, India"
            ],
            "reviews": [
                {
                    "text": "Overall Good dining experience.\nGood Food.. Value for money. 👍",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good Service Hotel All Staff And Good Behavior 🥰🥰🥰",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "loved the wedding ceremony experience of my sister in law last week. beautiful location, great rooms at the resort with great food (odia marriages are all about foods :-) ) and great lush green garden. This is a great place for arranging wedding ceremonies and other family functions & get togethers. A definite recommedation",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Pro:\nFrom outdoor seating to indoor only good thing of this place is well maintained and good place to take photos\n\n* Taste of veg dishes are quite decent\n\nCons:\n1. There are a lot to dislike, my experience of having dinner here is not that good, from taste of food to behaviour of staff nothing is upto the mark for the price they charge.\n2. Delayed food serving.\n3. Even after complaining, the taste of dishes were unchanged.\n4. Overpriced for the quality of food they serve.\n5. Moreover, something that can catch you eye and put you in a complected situation is the plates where food was supposed to serve is not cleaned properly.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Beautiful location with hygienic and comfortable room and i love the the great lush green garden.this is a good place for arranging wedding ceremony and other family function.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall good dining experience good food value money ð\u009f\u0091\u008d",
                "good service hotel staff good behavior ð\u009f¥°ð\u009f¥°ð\u009f¥°",
                "loved wedding ceremony experience sister law last week beautiful location great rooms resort great food odia marriages foods great lush green garden great place arranging wedding ceremonies family functions get togethers definite recommedation",
                "pro outdoor seating indoor good thing place well maintained good place take photos taste veg dishes quite decent cons lot dislike experience dinner good taste food behaviour staff nothing upto mark price charge delayed food serving even complaining taste dishes unchanged overpriced quality food serve moreover something catch eye put complected situation plates food supposed serve cleaned properly",
                "beautiful location hygienic comfortable room love great lush green gardenthis good place arranging wedding ceremony family function"
            ]
        }
    ]
}