{
    "places_with_reviews": [
        {
            "name": "Haryana Tourism- Gauriyya Hotel And Restaurant",
            "rating": [
                4
            ],
            "address": [
                "National Highway 10, Sector 6, Opp: Devilal Park, Ashok Nagar, Old Industrial Area, Bahadurgarh, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Nestled near Brigadier Hoshiar Singh metro station, Gauriyya impresses with its charming ambiance and above-average party and wedding offerings. The well-equipped banquet hall and delectable food make it a standout choice ensuring a delightful experience for locals and tourists alike.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "On the main road of Bahadurgarh, government maintained resort, with good quality, cleaned banquet hall, open garden, small hall for small functions.\nRooms available are also clean with delux rooms and simple rooms.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very good place of Government in Bahadurgarh. It is on national highway and adjacent to metro station too. So don't worry about transportation too. Very economical with huge area.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I have been there for marriage function. The food was okay. Even snacks were okay.\n\nIt is very near to metro station at walkable distance.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Awesome place for party and marriage purpose, spacy and greenery like wow, on road location is perfect easy to find.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nestled near brigadier hoshiar singh metro station gauriyya impresses charming ambiance aboveaverage party wedding offerings wellequipped banquet hall delectable food make standout choice ensuring delightful experience locals tourists alike",
                "main road bahadurgarh government maintained resort good quality cleaned banquet hall open garden small hall small functions rooms available also clean delux rooms simple rooms",
                "good place government bahadurgarh national highway adjacent metro station dont worry transportation economical huge area",
                "marriage function food okay even snacks okay near metro station walkable distance",
                "awesome place party marriage purpose spacy greenery like wow road location perfect easy find"
            ]
        },
        {
            "name": "The Galaxy Resort | Banquet Hall in Bahadurgarh",
            "rating": [
                4.2
            ],
            "address": [
                "4 KM Milestone, Main Jhajjar Road, near Bypass Flyover, Bahadurgarh, Nuna Majra, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Excellent hotel in Bahadurgarh. Good service, spacious rooms, banquet hall etc. only thing that bothers me a lot is “Required Maintenance of Rooms” . Rest everything is perfect . Location is little bit far away from city. Food is good & Staff is outstanding",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Had my sister's marriage here. Rooms look a bit dated but the venue , decoration and banquet was pretty good.....parking space is ample and venue doesn't feel crowded even when lots of guests arrive. Nicely designed and good access from highway",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Wrost resort, bad behaviour , staff doesn't cooperate 😑",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I visited this place for attending a marrige function. Well maintaine,Large and airy hall. Though toilet was not cleaned. Otherwise it was all good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "💫Wonderful Hospitality & Docile Staff\nI could easily commute to Industrial Area as well as the Main City.\nWorth the money, very economical !\nThanks for the amazing experience",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent hotel bahadurgarh good service spacious rooms banquet hall etc thing bothers lot â\u0080\u009crequired maintenance roomsâ\u0080\u009d rest everything perfect location little bit far away city food good staff outstanding",
                "sisters marriage rooms look bit dated venue decoration banquet pretty goodparking space ample venue doesnt feel crowded even lots guests arrive nicely designed good access highway",
                "wrost resort bad behaviour staff doesnt cooperate ð\u009f\u0098\u0091",
                "visited place attending marrige function well maintainelarge airy hall though toilet cleaned otherwise good",
                "ð\u009f\u0092 « wonderful hospitality docile staff could easily commute industrial area well main city worth money economical thanks amazing experience"
            ]
        },
        {
            "name": "Mehar resort",
            "rating": [
                4.2
            ],
            "address": [
                "Jhajjar Rd, Bahadurgarh, Nuna Majra, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Very luxurious resort, with affordable prices. You can plan your marriages, corporate events and birthday celebrations here.\n\nIt is a highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Although a little cleaning and maintenance is required for the lake.\nBut believe me there is no place nearby in any district to visit one like this.\nThere is a nice restaurant in between of lake where kids enjoy a lot.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It has a very plush hall with ornate looks.\nThe small eats were ok.\nBut the main meals were not good. The dinner was not warm.\nService was average",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Visited for marriage function\nMy god what a mesmerizing place. Nice ambience. Location is perfect. Great parking",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Space and location is nice but food is the poorest one. Raw material and preparation both are just disgusting. Apna halwai karen.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "luxurious resort affordable prices plan marriages corporate events birthday celebrations highly recommended",
                "although little cleaning maintenance required lake believe place nearby district visit one like nice restaurant lake kids enjoy lot",
                "plush hall ornate looks small eats ok main meals good dinner warm service average",
                "visited marriage function god mesmerizing place nice ambience location perfect great parking",
                "space location nice food poorest one raw material preparation disgusting apna halwai karen"
            ]
        },
        {
            "name": "Hotel Beatific Epsilon",
            "rating": [
                4.5
            ],
            "address": [
                "The Beatific, main, Jhajjar Rd, Bahadurgarh, Nuna Majra, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "It's spacious and approach is quite good. Although they do not have any parking for vehicles but there is vacant land nearby and they employ a security guard there. Physical facilities are okay but there is huge scope of improvement in the quality of food. Service also needs to be improved.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Best hotel good service good food every thing is superb good behaviour Mr.Ravinder with us on reception no words very nice property I am very satisfied.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice place to visit specially their restaurant, their hospitality is superb. Food is awesome. Specially Thanks\nGm Mr.Vinod Thakur ji.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This is nice place... service was good... delicious food... Staff behaviour nice",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Food is awesome staff is very cooperative all excellent 👌  specially thanx Mr  vinod thakur ji",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "spacious approach quite good although parking vehicles vacant land nearby employ security guard physical facilities okay huge scope improvement quality food service also needs improved",
                "best hotel good service good food every thing superb good behaviour mrravinder us reception words nice property satisfied",
                "nice place visit specially restaurant hospitality superb food awesome specially thanks gm mrvinod thakur ji",
                "nice place service good delicious food staff behaviour nice",
                "food awesome staff cooperative excellent ð\u009f\u0091\u008c specially thanx mr vinod thakur ji"
            ]
        },
        {
            "name": "HOTEL EMMKAY RESIDENCY",
            "rating": [
                4.1
            ],
            "address": [
                "Kasaar Rd, Sector 15, Sankhol, Sector 15, Bahadurgarh, Sankhol, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel at Bahadurgarh. Rooms were clean, immaculate with all necessary facilities. Running hot water. Breakfast spread was impressive n tasty. Food in lunch n dinner was excellent, better than most good hotels. I had 2 day stay n all 4 meals were excellent with different menu. Highly recommended, value for money",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The food was very nice and tasty. The rooms are big, spacious and clean. The service was nice. Only thing the hot water system doesn't work properly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The overall experience was quite bad. I stayed with my friends for a night and the behaviour of staff members was very rude. They were not ready to adjust or even listen to what we have to say. Room service was also neglected. There was a big electricity breakdown for the whole night and no steps were taken to either resolve it or even give compensation to customers. In morning as well they were not ready to listen to what we have to say and were very rude. The only thing they care about is money and nothing else.\n\nOverall worst experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Rooms are excellent but poor service or you can say no service at all. Uneducated and unprofessional staff.. food is okay okay not upto the mark.. have stayed for more than 3 days.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We attend one party this hotel very nice place",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel bahadurgarh rooms clean immaculate necessary facilities running hot water breakfast spread impressive n tasty food lunch n dinner excellent better good hotels day stay n meals excellent different menu highly recommended value money",
                "food nice tasty rooms big spacious clean service nice thing hot water system doesnt work properly",
                "overall experience quite bad stayed friends night behaviour staff members rude ready adjust even listen say room service also neglected big electricity breakdown whole night steps taken either resolve even give compensation customers morning well ready listen say rude thing care money nothing else overall worst experience",
                "rooms excellent poor service say service uneducated unprofessional staff food okay okay upto mark stayed days",
                "attend one party hotel nice place"
            ]
        },
        {
            "name": "Royal Celebration",
            "rating": [
                4.3
            ],
            "address": [
                "Main, Jhajjar Rd, nr. Omaxe Galleria, Sector 14, Bahadurgarh, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "The Royal Celebration Banquet exceeded all expectations. The opulent decor set a regal tone, complemented by impeccable service. The diverse menu showcased culinary mastery, with each dish a gastronomic delight. The attention to detail, from table settings to entertainment, contributed to an unforgettable experience. A truly royal celebration worth every accolade.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good clean & green lawn, banquet hall also is spacious.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Food was awesome but golgappe bahot hi gande the.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "An excellent banquet hall with quality food at affordable price.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is a good party point...... Around 10000 people get together possible here. Big lawn and dining area is available. Situated on Jhajjar Road, Bahadurgarh, near bypass road. So, there is no connectivity issue.\n\nAnyone can go for JD Celebration if need a party, wedding or any other ceremony.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "royal celebration banquet exceeded expectations opulent decor set regal tone complemented impeccable service diverse menu showcased culinary mastery dish gastronomic delight attention detail table settings entertainment contributed unforgettable experience truly royal celebration worth every accolade",
                "good clean green lawn banquet hall also spacious",
                "food awesome golgappe bahot hi gande",
                "excellent banquet hall quality food affordable price",
                "good party point around people get together possible big lawn dining area available situated jhajjar road bahadurgarh near bypass road connectivity issue anyone go jd celebration need party wedding ceremony"
            ]
        },
        {
            "name": "Sampla",
            "rating": [
                4.3
            ],
            "address": [
                "MWRJ+HH3, Model Town, Bahadurgarh, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Good eating place. Reasonably priced. Clean Restrooms.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good home care service",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very Small Halt For Every Train",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "nyc",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Sweet home",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good eating place reasonably priced clean restrooms",
                "good home care service",
                "small halt every train",
                "nyc",
                "sweet home"
            ]
        },
        {
            "name": "Hiltan Resort",
            "rating": [
                4.2
            ],
            "address": [
                "Omaxe City, Bypass, Sector 14, Bahadurgarh, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Basically it’s not a hotel or resort. It’s a convention centre and a party place. They have some rooms for the people to have rest or get ready for the function. Those rooms are rented out.\nThere is absolutely no reception, no check in check out, no security, no restaurant, no heater, no lobby. You have only a person who stays with a family somewhere around this place.\nThere was not even a proper lock to our room and every time we had to call someone to open it. Someone was sleeping in the room when we arrived. We insisted to change the bed sheets. Each and every thing we had to insist to get changed. Room was totally dusty and was not cleaned. Bathrooms were dirty. There was no bucket no toiletries and don’t expect it from them. As I told you it’s just a room for people to change and get ready for the function.\nAbsolutely no Transport facilities. You have to walk around 1.4 kms to find a shop.\n\nOnly point is bathroom is almost as big as the room.\n\nNote:- All the reviews I give here is based on my personal experience. I give my reviews honestly and it’s not influenced by any means.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice weeding hall in Hiltan Resort",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good place for wedding anniversary ❣️",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Visited here in a marriage reception. Ample space here.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good place for large gathering.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "basically itâ\u0080\u0099s hotel resort itâ\u0080\u0099s convention centre party place rooms people rest get ready function rooms rented absolutely reception check check security restaurant heater lobby person stays family somewhere around place even proper lock room every time call someone open someone sleeping room arrived insisted change bed sheets every thing insist get changed room totally dusty cleaned bathrooms dirty bucket toiletries donâ\u0080\u0099t expect told itâ\u0080\u0099s room people change get ready function absolutely transport facilities walk around kms find shop point bathroom almost big room note reviews give based personal experience give reviews honestly itâ\u0080\u0099s influenced means",
                "nice weeding hall hiltan resort",
                "good place wedding anniversary â\u009d£ï¸\u008f",
                "visited marriage reception ample space",
                "good place large gathering"
            ]
        },
        {
            "name": "Red Huts",
            "rating": [
                3.7
            ],
            "address": [
                "873, Delhi - Rohtak Road opp Metro Pillar Number 461 Nehru Park, Nehru Park, Bahadurgarh, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Have visited 20 times at least Food quality was best till some time But As the  resturant got bigger quality went worse still  a good palace for family and couples",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Verry good and hygienic  food and service\nRoom small but like it",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The palace is located conveniently on Rohtak road near Brigediyar Hoshiyar Singh Metro station The rooms are good and very specious The quality of food was awesome",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Hi I am Prashant I was visit some time in bahadurgarh industry I am staying there name is hotel red huts hotel the hotel most liked is food quality is too much bettre then any Street food hotel and restaurant I perefer d to all of please visit and doing some expirince",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Best hotel in bahadurgarh city. Staaf behavior is very good. Little issue parking but all service good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited times least food quality best till time resturant got bigger quality went worse still good palace family couples",
                "verry good hygienic food service room small like",
                "palace located conveniently rohtak road near brigediyar hoshiyar singh metro station rooms good specious quality food awesome",
                "hi prashant visit time bahadurgarh industry staying name hotel red huts hotel hotel liked food quality much bettre street food hotel restaurant perefer please visit expirince",
                "best hotel bahadurgarh city staaf behavior good little issue parking service good"
            ]
        },
        {
            "name": "Hotel VC",
            "rating": [
                3.6
            ],
            "address": [
                "Rohtak Rd, Surya Nagar, Bahadurgarh, Sankhol, Haryana 124507, India"
            ],
            "reviews": [
                {
                    "text": "Very good hotel nd  good for business person",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "It's old hotel, needs some maintenance in rooms & illumination to be improved a lot. Staff is fantastic, polite & always ready to help. Overall hotel is good if you can ignore certain flaws then it can be a good place.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "They hardly maintained rooms!!The walls ,washrooms,closets, Air-conditioner ,Geyser,TV, nothing was working properly. The hotel didn't have reputation in the town as said by localities and some govt.officers. They don't give any discounts as they promise.. so enquire everything before you check in, service taxes,luxury taxes. Only good thing was they provide good food.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good option for night halt instead of Delhi. Have good food and tea/coffee options. Adjacent is a branch of Yes Bank and Mahindra, Tata and Renault workshops also.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I liked food of this hotel.room also clean hygiene .fast service always .",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel nd good business person",
                "old hotel needs maintenance rooms illumination improved lot staff fantastic polite always ready help overall hotel good ignore certain flaws good place",
                "hardly maintained roomsthe walls washroomsclosets airconditioner geysertv nothing working properly hotel didnt reputation town said localities govtofficers dont give discounts promise enquire everything check service taxesluxury taxes good thing provide good food",
                "good option night halt instead delhi good food teacoffee options adjacent branch yes bank mahindra tata renault workshops also",
                "liked food hotelroom also clean hygiene fast service always"
            ]
        }
    ]
}