{
    "places_with_reviews": [
        {
            "name": "Garden Palace Heritage Homestays",
            "rating": [
                4.4
            ],
            "address": [
                "Palace road, Brahmani Society, Balasinor, Gujarat 388255, India"
            ],
            "reviews": [
                {
                    "text": "Garden Palace Heritage Homestays was very nice\nVery Comfartable bad and sofa, room is very clean and staf coprative, all services very fast.\nThis hotal available in budget friendly rooms.\nTransport facility available all time",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nawab Saab & Begum Saheba run a lovely homestay in their ancestral property. They gave us the warmest hospitality, paying attention to the slightest detail. The food is delicious and with very unique flavors. The location is very peaceful, quiet but right next to the quaint old town of Balasinor. Go here to experience a slice of history & to see old world India not tampered by gentrification",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Balasinor State was founded BY Gujarati Muslim ruler Nawab, Sardar Muhammed khan Babi belonging to the family of last deputy Governor of Gujarat province in Mughal Empire. The rulers were titled Nawab Babi. It was a 9 gun salute state belonging to the Rewa Kantha Agency of the Bombay Presidency. The Last ruling Nawab Nawab[citation needed] was HH Nawab Muhammed Salabat Khanji II who died on 25 January 2018.The heir and son of Nawab Muhammed Salabat Khanji II Nawabzada Sultan Salauddinkhan Babi, born 1979 and educated at the Rajkumar College, Rajkot was crowned the titular Nawab of Balasinor on 4 March 2018 at the Raj Tilak and Gaadi Dastoor ceremony performed by both Islamic and Rajput traditions at their Garden Palace In Balasinor after the 40 days of mourning ended on 3 March 2018.\n\nI had great meeting with HH NAWABZADA SULTAN SALAUDDINKHAN BABI.He had shown the whole palace with full of paintings n ancient monuments\n\nUnique-u really feel that how gracefull were our royals lived earlier.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Next to the dinosaur park, you can enjoy a taste of royalty by learning about Balasinor’s royal family while enjoying the luxurious rooms and wildlife, such as bats, goats and roosters (that wake you up)!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Amazing place feel like the Mughals Era palace must visit ambience is superb",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "garden palace heritage homestays nice comfartable bad sofa room clean staf coprative services fast hotal available budget friendly rooms transport facility available time",
                "nawab saab begum saheba run lovely homestay ancestral property gave us warmest hospitality paying attention slightest detail food delicious unique flavors location peaceful quiet right next quaint old town balasinor go experience slice history see old world india tampered gentrification",
                "balasinor state founded gujarati muslim ruler nawab sardar muhammed khan babi belonging family last deputy governor gujarat province mughal empire rulers titled nawab babi gun salute state belonging rewa kantha agency bombay presidency last ruling nawab nawabcitation needed hh nawab muhammed salabat khanji ii died january heir son nawab muhammed salabat khanji ii nawabzada sultan salauddinkhan babi born educated rajkumar college rajkot crowned titular nawab balasinor march raj tilak gaadi dastoor ceremony performed islamic rajput traditions garden palace balasinor days mourning ended march great meeting hh nawabzada sultan salauddinkhan babihe shown whole palace full paintings n ancient monuments uniqueu really feel gracefull royals lived earlier",
                "next dinosaur park enjoy taste royalty learning balasinorâ\u0080\u0099s royal family enjoying luxurious rooms wildlife bats goats roosters wake",
                "amazing place feel like mughals era palace must visit ambience superb"
            ]
        },
        {
            "name": "Hotel Aakash",
            "rating": [
                3.9
            ],
            "address": [
                "Indore - Ahamadabad Hwy, Balasinor, Gujarat 388235, India"
            ],
            "reviews": [
                {
                    "text": "Hear is a very thadkalss staff ands rooms anny times drinking resapnest",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Food options are limited but taste is good",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very arrogant staff, busy watching and playing mobile. Avoid visiting this place.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good food tried kathiyawadi thali, kaju curry, Special paneer and butter roti.  The kathiyawadi Thali food was little spicy but all in all it was good in taste.  They serve 3 different sabzi in kathiyawadi Thai.  I tried sev tamatar ki sabzi, moong ki sabzi, baingan bharta and sukhe Aloo ki sabzi here. Service was good and hotel was also clean and hygienic. They serve variety of food here Punjabi, Chinese, kathiyawadi and south Indian. Kathiyawadi thali price was 120 and Punjabi thali was 140.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The food is tasty...just like dhabha style. The bathroom though is not well maintained.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hear thadkalss staff ands rooms anny times drinking resapnest",
                "food options limited taste good",
                "arrogant staff busy watching playing mobile avoid visiting place",
                "good food tried kathiyawadi thali kaju curry special paneer butter roti kathiyawadi thali food little spicy good taste serve different sabzi kathiyawadi thai tried sev tamatar ki sabzi moong ki sabzi baingan bharta sukhe aloo ki sabzi service good hotel also clean hygienic serve variety food punjabi chinese kathiyawadi south indian kathiyawadi thali price punjabi thali",
                "food tastyjust like dhabha style bathroom though well maintained"
            ]
        },
        {
            "name": "Hotel Mayur",
            "rating": [
                3.6
            ],
            "address": [
                "X86Q+7F8, Shree Ram Society, Indraprasth Society, Balasinor, Gujarat 388255, India"
            ],
            "reviews": [
                {
                    "text": "This is a good place to get reasonably good food and economical rates. The variety is available and staff is really and ready at your service. The manager is really cooperative with giving insights for the where to find what in balasinor. Also they have a lodging facility and the rooms are decent ones. They have installed cameras to it helps when you park your vehicle outside their hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very Bed service",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The cleanness of the hotel was so poor. Very bad service. And food is average. Not so impressive",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "One of the best hotel which have constant test of food from many years.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Gujarati , Punjabi & Chinese food\nAverage quality , best quantity\nAnd medium quality room to stay",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place get reasonably good food economical rates variety available staff really ready service manager really cooperative giving insights find balasinor also lodging facility rooms decent ones installed cameras helps park vehicle outside hotel",
                "bed service",
                "cleanness hotel poor bad service food average impressive",
                "one best hotel constant test food many years",
                "gujarati punjabi chinese food average quality best quantity medium quality room stay"
            ]
        },
        {
            "name": "Hotel Quality Inn",
            "rating": [
                3.7
            ],
            "address": [
                "Zalod - Ahmedabad Hwy, Vadadala, Gujarat 388235, India"
            ],
            "reviews": [
                {
                    "text": "I ate lots of dishes but I got very bad service and poor quality food 😪 And Also staff members are very disrespectful 😔 when visited few months ago it was good but nowadays it's very bad .😕",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very good place management clean place food are very good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very good quality food and service\nAnd good atmosphere",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "absolutely fell in love with this leafy eco-village and our stone cottage, the surroundings are so green and well maintained and we had a restful and relaxing time by the pool and in our stone cottage. All the members of staff are super friendly and helpful. Pro tip: don't miss trying out the covilhetes (mince pies) available to order from reception in the evening. So delicious!”",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Worst management 😒 they dont care about customer even dont take order . We have to go to them for giving order. Never go there . Waste of time and money",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ate lots dishes got bad service poor quality food ð\u009f\u0098ª also staff members disrespectful ð\u009f\u0098\u0094 visited months ago good nowadays bad ð\u009f\u0098\u0095",
                "good place management clean place food good",
                "good quality food service good atmosphere",
                "absolutely fell love leafy ecovillage stone cottage surroundings green well maintained restful relaxing time pool stone cottage members staff super friendly helpful pro tip dont miss trying covilhetes mince pies available order reception evening deliciousâ\u0080\u009d",
                "worst management ð\u009f\u0098\u0092 dont care customer even dont take order go giving order never go waste time money"
            ]
        },
        {
            "name": "SPOT ON 71912 Hotel Aakash And Guesthouse",
            "rating": [
                3.5
            ],
            "address": [
                "21, Indore - Ahamadabad Hwy, Nadiad, Gujarat 388235, India"
            ],
            "reviews": [
                {
                    "text": "YouTube channel Neha K Studio",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Not a place to stay",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Jvkhgk",
                    "languageCode": "en-US",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "youtube channel neha k studio",
                "nice",
                "place stay",
                "jvkhgk"
            ]
        },
        {
            "name": "Shreeji (madhuli)panjabi. gujrati. Kathiyavadi",
            "rating": [
                3.9
            ],
            "address": [
                "X87R+PVJ, GJ SH 2, Shree Ram Society, Indraprasth Society, Balasinor, Gujarat 388265, India"
            ],
            "reviews": [
                {
                    "text": "Nice place for family. Staff were good and friendly and helped us deciding items for kids.  Gujarati thali was good in taste and quantity. We tried Dal bati on their recommendation which turned out good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Such a nice vegitarian hotel Restaurant...\nTea is must try..\nChild water there..\nGood behaviour of manager and All staff..\nSuch agreate place for family..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The on way dhaba type hotel and good food if you travel between Balasinor to lunavada road.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very Dirty place not cleaning table n washbasin...so please suggest to hotel management that take care of places",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very bad",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place family staff good friendly helped us deciding items kids gujarati thali good taste quantity tried dal bati recommendation turned good",
                "nice vegitarian hotel restaurant tea must try child water good behaviour manager staff agreate place family",
                "way dhaba type hotel good food travel balasinor lunavada road",
                "dirty place cleaning table n washbasinso please suggest hotel management take care places",
                "bad"
            ]
        },
        {
            "name": "Balasinor Palace Hospitality Services",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Palace Road Garden Palace, Brahmani Society, Balasinor, Gujarat 388255, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Guru krupa Hotel",
            "rating": [
                3
            ],
            "address": [
                "W8PQ+C6Q, Balasinor - Sevaliya Rd, Handiya, Gujarat 388235, India"
            ],
            "reviews": [
                {
                    "text": "Kanhaiya",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "kanhaiya"
            ]
        },
        {
            "name": "होटल आकाश",
            "rating": [
                1
            ],
            "address": [
                "Fortune Mineral Products, Regs. Office & Works : I/33, G.I.D.C, Kalupur, Balasinor, Gujarat 388255, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "KGN Raaj Fry",
            "rating": [
                2.3
            ],
            "address": [
                "W8WG+MX4, Kalupur, Balasinor, Gujarat 388235, India"
            ],
            "reviews": [
                {
                    "text": "This restaurent is closed",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                },
                {
                    "text": "Awesome",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "restaurent closed",
                "awesome"
            ]
        }
    ]
}