{
    "places_with_reviews": [
        {
            "name": "Hotel Balaji Prakash",
            "rating": [
                4.1
            ],
            "address": [
                "RQ57+593, Basti Khas, Basti, Uttar Pradesh 272002, India"
            ],
            "reviews": [
                {
                    "text": "Nice . I am satisfied with their staff and hotel to",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Poor services. I stayed there few days back - AC was not working, no proper food or tea, etc",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "its near railway station\nit has a huge marriage hall\nA banquet hall, function hall, or reception hall, is a special purpose room, or a building, used for hosting large social and business events. Typically a banquet hall is capable of serving dozens to hundreds of people a meal in a timely fashion. People and organizations rent them to hold parties, banquets, wedding receptions, or other social events. Businesses rent them to hold sales meetings, employee training events, employee awards events, and corporate celebrations and parties.\n\nBanquet halls are often found within pubs, nightclubs, hotels, or restaurants.\n\nThe first recorded mention of \"function rooms\" is in 1922. [1][2]\n\nThey are distinct from other halls, in that they have no religious of government affiliation. Most are run by commercial enterprises, though are run by fraternal organizations and are part of their building, available for rent by the general public, for example Masonic Halls.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We visited the restaurant. The food served here is only Veg. Awesome food , awesome ambience",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Perfect venue to host a party gathering of 250 plus people.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice satisfied staff hotel",
                "poor services stayed days back ac working proper food tea etc",
                "near railway station huge marriage hall banquet hall function hall reception hall special purpose room building used hosting large social business events typically banquet hall capable serving dozens hundreds people meal timely fashion people organizations rent hold parties banquets wedding receptions social events businesses rent hold sales meetings employee training events employee awards events corporate celebrations parties banquet halls often found within pubs nightclubs hotels restaurants first recorded mention function rooms distinct halls religious government affiliation run commercial enterprises though run fraternal organizations part building available rent general public example masonic halls",
                "visited restaurant food served veg awesome food awesome ambience",
                "perfect venue host party gathering plus people"
            ]
        },
        {
            "name": "Hotel Prakash",
            "rating": [
                3.9
            ],
            "address": [
                "Tiwari Tola, Basti, Uttar Pradesh 272002, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is located at a convenient place.\nI used to stay only here whenever I would visit Basti which is my native district.\nDuring 2011-12, I had stayed here in a AC fitted room 101 for about 6 months together ie Oct '11 to March 2012.\nI liked everything except Food . I would take breakfast regularly here and teas whenever required but not the Lunch and Dinner since there was not at all any change in the menu. One cannot get anything else on order other than what is prepared daily. Even for Breakfast, evening snacks, etc, only few certain things are prepared daily. So, if one stays for more than one day, he will have to search something out of the hotel.\nSo for food, I was going about 2 km away to a different hotel.\n\n2. Tea: Tea is not available in the morning when one really wants it after getting up and I had to go out for morning tea. I think, tea makers come from their own residence to the hotel quite late.\n\n2(1): While tea was earlier served in a pot accompanied with 2 proper sized cups and saucers, this practice was snapped when I stayed after first long stay.  This time, they supplied tea in a cup which means one has to finish it immediately after its served.\nI disliked this manner of service very much.\nNot only this, cup size was so much reduced that it could be called \"cutting tea\".  How can a few spoonful of tea be sufficient in the morning and with the breakfast!\nThis miserliness was really big irritant.\nI used to suggest and give feedback but owner was probably too much conscious of cost cutting and gaining more income through such means. I remember, price of tea had been increased.\n\nLast Visit on 13 March 2019:  During this period ie from 2011 to March 2019, I used to ring the reception person while starting for Basti about my intent to stay and they would always book the same room 101 for me.\nThis room as well as other rooms had had geyser in the bathroom.\nHowever, on 14 March '19 morning I got no hot water, no geyser.\nThen on calling reception some one told that hot water supply was on till 7 am or 8 am through boiler and that they will arrange a bucket of hot water separately.\nThey were giving  completely false information and deliberately. What is use of such a miserly hotel which makes stories and dodge the clients?\nI cannot stay in such a hotel which thinks of maximizing it's income alone  without thinking of clients' comforts.\nI immediately left the hotel without taking bath and went to my house in my another village that is located 94 km away from Basti.\nSince then,ie last 5 years I have not stayed in this hotel.\nThis is my feedback which I am sure hotel will find correct.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Highly professional...good food.. cleanliness can be better...best hotel for staying in Basti ...negotiation is minimum..good support of generator in case of power cut ..newly renovated rooms..easily accessible to roadways and trains",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Pro:\n👉🏻They have their own\" khana khazana restaurant\" and the food is amazing, Delicious, tasty, wonderful.\n👉🏻Good sun face location.\n\nCons:\n👉🏻Hot water is not available for bathing, neither staff nor anyone cares. They will tell you to just wait and you will remain waiting for the whole day.\n👉🏻Regular drinking water is hard to get.\n\nOverall you can book this hotel, it's good for both couples and families",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good Hotel and Restaurant in Basti on Station Road. The food Quality is Good and Room facilities are also very good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Food is good but service is too slow it took 1 hour to just serve the starters if you have too much free time u can come",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel located convenient place used stay whenever would visit basti native district stayed ac fitted room months together ie oct march liked everything except food would take breakfast regularly teas whenever required lunch dinner since change menu one get anything else order prepared daily even breakfast evening snacks etc certain things prepared daily one stays one day search something hotel food going km away different hotel tea tea available morning one really wants getting go morning tea think tea makers come residence hotel quite late tea earlier served pot accompanied proper sized cups saucers practice snapped stayed first long stay time supplied tea cup means one finish immediately served disliked manner service much cup size much reduced could called cutting tea spoonful tea sufficient morning breakfast miserliness really big irritant used suggest give feedback owner probably much conscious cost cutting gaining income means remember price tea increased last visit march period ie march used ring reception person starting basti intent stay would always book room room well rooms geyser bathroom however march morning got hot water geyser calling reception one told hot water supply till boiler arrange bucket hot water separately giving completely false information deliberately use miserly hotel makes stories dodge clients stay hotel thinks maximizing income alone without thinking clients comforts immediately left hotel without taking bath went house another village located km away basti since thenie last years stayed hotel feedback sure hotel find correct",
                "highly professionalgood food cleanliness betterbest hotel staying basti negotiation minimumgood support generator case power cut newly renovated roomseasily accessible roadways trains",
                "pro ð\u009f\u0091\u0089ð\u009f\u008f » khana khazana restaurant food amazing delicious tasty wonderful ð\u009f\u0091\u0089ð\u009f\u008f » good sun face location cons ð\u009f\u0091\u0089ð\u009f\u008f » hot water available bathing neither staff anyone cares tell wait remain waiting whole day ð\u009f\u0091\u0089ð\u009f\u008f » regular drinking water hard get overall book hotel good couples families",
                "good hotel restaurant basti station road food quality good room facilities also good",
                "food good service slow took hour serve starters much free time u come"
            ]
        },
        {
            "name": "Hotel Suyash Palace & Tarana Bar",
            "rating": [
                4.1
            ],
            "address": [
                "Station road, Basti Khas, Basti, Uttar Pradesh 272002, India"
            ],
            "reviews": [
                {
                    "text": "Last time I had visiten here on the occasion of my friend birthday party on the roof named moon cafe. Best place for photoshoot and feels like you are in the best hotel.  Food quality was best , service was also best but it's too expensive according to quantity. Should visit with friends or family.\nNamed in Best hotel of basti...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Went on 26th night after confirming the timing on call that restaurant is open till 11pm . We reached around 10.20 pm red chilli restaurant's ac was getting serviced so the waiter asked us to go upstairs wen went upstairs the moon cafe the manager says service is closed my husband called that waiter after arguing with my husband they agreed to serve us bt told us ( ki thoda tym lagega ) we ordered Chinese the service was too slow thoda nhi bahot tym laga . The food is good bt the service is worst 🤢. The prices are very high.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very neat and clean rooms with all modern amenities. Quality of food and service were good too.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very Very nice place and laugh best quality vegetarian and nonvegetarian hygienic foods and so good management good behavior stuff and manager 👌.......thanks 👍",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice experience with the Hotel\n\nEasy accessible and good service\n\nRooms are well maintained by the Hotel staff\n\nHighly recommended",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "last time visiten occasion friend birthday party roof named moon cafe best place photoshoot feels like best hotel food quality best service also best expensive according quantity visit friends family named best hotel basti",
                "went th night confirming timing call restaurant open till pm reached around pm red chilli restaurants ac getting serviced waiter asked us go upstairs wen went upstairs moon cafe manager says service closed husband called waiter arguing husband agreed serve us bt told us ki thoda tym lagega ordered chinese service slow thoda nhi bahot tym laga food good bt service worst ð\u009f¤¢ prices high",
                "neat clean rooms modern amenities quality food service good",
                "nice place laugh best quality vegetarian nonvegetarian hygienic foods good management good behavior stuff manager ð\u009f\u0091\u008cthanks ð\u009f\u0091\u008d",
                "nice experience hotel easy accessible good service rooms well maintained hotel staff highly recommended"
            ]
        },
        {
            "name": "Hotel maharaja | Best Hotel in Basti | Hotel in Basti",
            "rating": [
                3.5
            ],
            "address": [
                "pikura shiv gulam, Malviya Rd, Pach Pedia, Basti, Uttar Pradesh 272001, India"
            ],
            "reviews": [
                {
                    "text": "Higher priced rooms are good. Air conditioner is in good condition and working. If there is no power, generator will be turned on lately in day time. Room service boys enters forcefully immediately after pressing Bell. I am not satisfied with my stay because hotel management allowed SET TOP BOX repair person at night 10.00 pm. I don't know whether they come for set top box repair or to check what I am doing. I am doing work in my laptop. Worst fellows.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Best hotel in basti city available service, rooms AC/ Non AC both and banquet hall for meeting, kitty party etc.\nEnvironment very good 👍 co-operative staff rooms are very clean and high genic.\nRestaurant are available.\nLocated at Malveey Road basti just before 1 km form basti roadways bus station 🚉 when comming from badeban side.\nMain entrance on Malveey Road",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The hotel here is near the bus stand and railway station and you can get a good room in very low rupees",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The hotel is self proclaimed as beautiful, modern, and spacious. The hotel also claims to be rated as a “Four Diamond” hotel. The hotel offers some great amenities like, family rooms, room service, free breakfast, a fitness center, a swimming pool, a restaurant, meeting rooms, non-smoking rooms, etc. I stayed at this hotel about two years ago, and the appearance of the hotel is nice but if you look a little harder you will find some major flaws. Although claimed as a great hotel and with abundant., my experience at this hotel was horrible because the hotel has a bug infestation, mechanical problems throughout the building, and the management and service they provided was poor.\n\nWhile visiting this hotel with my family , I came across some problems. First I was in my hotel room when I discovered a small cockroach, and after bringing this to the manager’s attention, she plead I did not tell the rest of the team member and their families. The management agreed to wash all of our belongings and give us a new room because the surrounding hotels were all booked out. So we agreed, we returned from a hockey game only to find we were not move to a new room yet. The manager apologized and were only able to give us a room two doors down from the original one. When we arrived at our new room we opened the door, clicked the light on and there were two, large cockroaches on the ceiling. We contacted the manager once again, this time she was in tears apologizing and due to the other local hotels being so full we had to stay. The manager moved us again, this time five rooms in the other direction, this room had no cockroaches but the heat didn’t work. We just wanted extra blankets, so we called to the front desk for them and they sent us blankets and some food\n. Next morning , we are left this hotel....\nGood byee....",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Service is good everything you will get on time. Ac rooms having window ac are seriously noisy.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "higher priced rooms good air conditioner good condition working power generator turned lately day time room service boys enters forcefully immediately pressing bell satisfied stay hotel management allowed set top box repair person night pm dont know whether come set top box repair check work laptop worst fellows",
                "best hotel basti city available service rooms ac non ac banquet hall meeting kitty party etc environment good ð\u009f\u0091\u008d cooperative staff rooms clean high genic restaurant available located malveey road basti km form basti roadways bus station ð\u009f\u009a\u0089 comming badeban side main entrance malveey road",
                "hotel near bus stand railway station get good room low rupees",
                "hotel self proclaimed beautiful modern spacious hotel also claims rated â\u0080\u009cfour diamondâ\u0080\u009d hotel hotel offers great amenities like family rooms room service free breakfast fitness center swimming pool restaurant meeting rooms nonsmoking rooms etc stayed hotel two years ago appearance hotel nice look little harder find major flaws although claimed great hotel abundant experience hotel horrible hotel bug infestation mechanical problems throughout building management service provided poor visiting hotel family came across problems first hotel room discovered small cockroach bringing managerâ\u0080\u0099s attention plead tell rest team member families management agreed wash belongings give us new room surrounding hotels booked agreed returned hockey game find move new room yet manager apologized able give us room two doors original one arrived new room opened door clicked light two large cockroaches ceiling contacted manager time tears apologizing due local hotels full stay manager moved us time five rooms direction room cockroaches heat didnâ\u0080\u0099t work wanted extra blankets called front desk sent us blankets andâ food next morning left hotel good byee",
                "service good everything get time ac rooms window ac seriously noisy"
            ]
        },
        {
            "name": "Hotel Maharani",
            "rating": [
                3.7
            ],
            "address": [
                "Bairihawa, Block Rd, Gandhi Nagar, Basti, Uttar Pradesh 272001, India"
            ],
            "reviews": [
                {
                    "text": "A good place to stay in Basti (UP)\nRooms are spacious location is good\nStaffs are good .....survice is good .\nIn terms of money it is a budget friendly.\n\nEspecially  Saurabh is very helpful guy  who is on the reception .......💚",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The mutton biryani was fabulous. I liked the quality of service as well.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Pathetic Reception. Took a safe escape before checking in.\nBooked room on call which got confirmed. Reached location asked for booking. The staff was behaving very rude like he is the saviour for me. Asking silly questions who, why, don't know like we are in need. Also quoted a high price in very arrogant manner. On the same moment I moved back.\nPlease don't prefer until there is an emergency.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Rooms are good. Location is okay okay. But service is very poor. But quite economical. Can't expect much at this price.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Is a very gopd hotel the interior and the waiters here are very good. The hotel allows for a noght stay for whole family or 1person. This hotel is having a variety of dishes and food. Starters ,afternoons and dinner are easily available any time.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay basti rooms spacious location good staffs good survice good terms money budget friendly especially saurabh helpful guy reception ð\u009f\u0092\u009a",
                "mutton biryani fabulous liked quality service well",
                "pathetic reception took safe escape checking booked room call got confirmed reached location asked booking staff behaving rude like saviour asking silly questions dont know like need also quoted high price arrogant manner moment moved back please dont prefer emergency",
                "rooms good location okay okay service poor quite economical cant expect much price",
                "gopd hotel interior waiters good hotel allows noght stay whole family person hotel variety dishes food starters afternoons dinner easily available time"
            ]
        },
        {
            "name": "The Asha Basti",
            "rating": [
                4
            ],
            "address": [
                "Mishrauliya, Mahson Mahuli Rd, Civil Lines, Basti, Uttar Pradesh 272001, India"
            ],
            "reviews": [
                {
                    "text": "It is the best hotel in the basti .\nBest food quality and quantity as per cost .\nLast time I had visiten here with my family member and next day with my friend.\nBut I was dissatisfied with the staff behavior,  they never attend guest in the good manner. They give smile like they're making joke of guests and they are not treating a particular person, They are treating everyone in this way. And as it is the new and  reputative hotel in the basti ,it was the bad impression for the guest and it will always affect your reviews. Should suggest to improve your staff behavior and teach them how to attend the guest in the hotels.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Couldn't set up the room till 1 o'clock in the night\n\nIt looks like they are hiring daily wage laborers, not hotel staff.\n\nIf the AC breaks down then they do not have any staff available even the fan is not available in the room\n\nThe intercom of the room is out of order\n\nMy room number is 112 & after 1 am it's 209\n\nAt the time of check out, there was no staff present who could bill or who knew how to bill.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Beautiful place  and awesome location  and food  so delicious and also staff  behavior is very good  and nice  person in this hotel",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "They don't payment, who supply in hotel, no of vendor always complaint, they keep mo. Off or dont pick call",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I am staying room no. 106,Very nice clean and staff are very gentle & helpful and skilled in welcoming gests.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best hotel basti best food quality quantity per cost last time visiten family member next day friend dissatisfied staff behavior never attend guest good manner give smile like theyre making joke guests treating particular person treating everyone way new reputative hotel basti bad impression guest always affect reviews suggest improve staff behavior teach attend guest hotels",
                "couldnt set room till oclock night looks like hiring daily wage laborers hotel staff ac breaks staff available even fan available room intercom room order room number time check staff present could bill knew bill",
                "beautiful place awesome location food delicious also staff behavior good nice person hotel",
                "dont payment supply hotel vendor always complaint keep mo dont pick call",
                "staying room nice clean staff gentle helpful skilled welcoming gests"
            ]
        },
        {
            "name": "Hotel Aura inn-marriage lawn/banquet hall/couple rooms/party place in basti",
            "rating": [
                3.8
            ],
            "address": [
                "Bargadwa, Habeli Khas, Uttar Pradesh 272002, India"
            ],
            "reviews": [
                {
                    "text": "Best management..  There behavior are very polite. Food are freshh",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "On highway not safe for old age people recently I saw accident occur on road",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Been with family on a staycation trip...it was a nice experience....the working staff was very nice..and we were given clean rooms with option of ac rooms and non AC rooms...free wifi availablity..responsive working staff and reception table.the receptionist was very nice to us..the rooms were value for money and the included cafe was also good.. it is in the range of 200-400 metres from basti flyover brigde ,badeban...very close bus stop area... excellent for travelling....\nThe hotel is situated at the main highway from basti to bansi.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice room good ambience, Inhouse food facilities but slow delivery, Rooms are clean and good with AC & TV perfectly working. Big small both types hall available for functions & programs with garden and party Lawn. Big and recommended property",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best hotel in Basti city",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best management behavior polite food freshh",
                "highway safe old age people recently saw accident occur road",
                "family staycation tripit nice experiencethe working staff niceand given clean rooms option ac rooms non ac roomsfree wifi availablityresponsive working staff reception tablethe receptionist nice usthe rooms value money included cafe also good range metres basti flyover brigde badebanvery close bus stop area excellent travelling hotel situated main highway basti bansi",
                "nice room good ambience inhouse food facilities slow delivery rooms clean good ac tv perfectly working big small types hall available functions programs garden party lawn big recommended property",
                "best hotel basti city"
            ]
        },
        {
            "name": "Hotel Simran Paradise",
            "rating": [
                3.8
            ],
            "address": [
                "Badaban, Basti, Habeli Khas, Uttar Pradesh 272002, India"
            ],
            "reviews": [
                {
                    "text": "TV was not functional. Blower was not present neither in room nor in hall.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Lovely decoration and service provide too good",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "🚫 WARNING! 🚫\nI have CCTV photos showing someone entering the room and stealing my belongings.\nHotel does not support! No enquiries, No complaints registered, Nothing. Moving ahead with Legal formalities. They'll soon receive the notice.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "11-5-2023 i attend marriage stay in room in night i lost my valuable or cash in room by unnoun person in hotel cctv see face that person but banquet management no any desirable  response",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best place to stay at Basti. Limited accommodation available but have a good Service with limited dine in menu.\nThis is a banquet but rooms are also available for stay.\nBest price stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "tv functional blower present neither room hall",
                "lovely decoration service provide good",
                "ð\u009f\u009a « warning ð\u009f\u009a « cctv photos showing someone entering room stealing belongings hotel support enquiries complaints registered nothing moving ahead legal formalities theyll soon receive notice",
                "attend marriage stay room night lost valuable cash room unnoun person hotel cctv see face person banquet management desirable response",
                "best place stay basti limited accommodation available good service limited dine menu banquet rooms also available stay best price stay"
            ]
        },
        {
            "name": "Hotel Shivoy Palace & V2 resaturant-Hotels/ac rooms/delux rooms in basti",
            "rating": [
                3.4
            ],
            "address": [
                "ROADWAYS TIRAHA, JAIPURWA, Jaipurwa, Basti, Uttar Pradesh 272001, India"
            ],
            "reviews": [
                {
                    "text": "Room is not in good condition.\nStaff was very rude.\nProperty needs maintenance work.\nWater does not come at some times in wash room for 1 to 2 hours.\nThey have also denied to give GST bill after paying GST amount.\nWorst experience.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "This is a pathetic place to stay. The rooms are extremely dirty and the manager does not have any manners. Extremely bad ambience and poorly kept. This is more of a lavatory than a hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Couple ka liya room nhi deta ya log very bad experience...don't go there",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "It was the worst hotel. Receptionists were very rude and unprofessional. They don't know how to treat guests. Seems like a 10th pass staff. Rooms were dirty and in poor condition. Walls were rotten and ceiling had the seapage. AC was not working and they don't provide AC remote to guests to control it. And you can't use AC during the city power cut as they don't have power backup or budget for it. But they are charging full for it. Images shown in website and Google are old and misleading. Don't ever think about to use this hotel. Go to some dharamshala instead of it, they may have better facilities and staff. Very rude behaviour by the staff.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Disgusting place to be please avoid this property manager doesn't know how to talk and the owner doesn't even care about guests.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room good condition staff rude property needs maintenance work water come times wash room hours also denied give gst bill paying gst amount worst experience",
                "pathetic place stay rooms extremely dirty manager manners extremely bad ambience poorly kept lavatory hotel",
                "couple ka liya room nhi deta ya log bad experiencedont go",
                "worst hotel receptionists rude unprofessional dont know treat guests seems like th pass staff rooms dirty poor condition walls rotten ceiling seapage ac working dont provide ac remote guests control cant use ac city power cut dont power backup budget charging full images shown website google old misleading dont ever think use hotel go dharamshala instead may better facilities staff rude behaviour staff",
                "disgusting place please avoid property manager doesnt know talk owner doesnt even care guests"
            ]
        },
        {
            "name": "Hotel Grand Bhavya Palace",
            "rating": [
                4
            ],
            "address": [
                "Station Road, Basti Khas, Basti, Uttar Pradesh 272001, India"
            ],
            "reviews": [
                {
                    "text": "If possible i gave this hotel in minus(-5). Very bad experience of my entire life. You have to wait at least 3 hrs for drinking water, 4 hrs for cleaning, although contact to reception continuously. No any hospitality provided by the staff, very rude staff, doesn't have any manner to conversation with customer. I request to you all that naver come in this worst hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Everything is fine and the hospitality is great. Also the food is mouth-watering and the preparation is excellent. Specially hotel receptionist behaviour is too good\nReception",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "One of the Best Hotels of Basti. Located at prime location very close to Basti Railway. So a very good place to come and rest after a long flight. One of the highlights of this place is long walking payements with side trees. Very broad drive ways.\n2 Banquet Halls for Meeting or Wedding etc.\nDinning Area\n-Amazing Rooms starting with very pocket friendly rates.\n-Very Big Parking Space",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We were happy to find this place because rooms are good and not that expensive, but not so clean.\n\nBut what a horrible night we had because of noise. Staff just ignored us, and our complaints, all the night. Honestly, avoid this hotel.\n\nWe had a tent. I guess we would had a better night if we camped in the parking...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Had to give this Hotel One Star because there's no option for zero star.\nThe worst hotel I have ever stayed in. A hotel with the worst...the worst room service. The worst staff. No preference to customer comfortability. Even after complimentary breakfast added to my booking the receptionist lied to me that there's no.complimentary breakfast and I will have to pay for the breakfast.\nA simple order for food takes at least 40 to 45 minutes to reach your house. The rooms are not well maintained.\nThe hotel staff will do nothing to resolve your issue they will just simply neglect saying \"sir ab sab insaan hai\".\nMy worst experience. No at all happy. Won't recommend this hotel to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "possible gave hotel minus bad experience entire life wait least hrs drinking water hrs cleaning although contact reception continuously hospitality provided staff rude staff doesnt manner conversation customer request naver come worst hotel",
                "everything fine hospitality great also food mouthwatering preparation excellent specially hotel receptionist behaviour good reception",
                "one best hotels basti located prime location close basti railway good place come rest long flight one highlights place long walking payements side trees broad drive ways banquet halls meeting wedding etc dinning area amazing rooms starting pocket friendly rates big parking space",
                "happy find place rooms good expensive clean horrible night noise staff ignored us complaints night honestly avoid hotel tent guess would better night camped parking",
                "give hotel one star theres option zero star worst hotel ever stayed hotel worstthe worst room service worst staff preference customer comfortability even complimentary breakfast added booking receptionist lied theres nocomplimentary breakfast pay breakfast simple order food takes least minutes reach house rooms well maintained hotel staff nothing resolve issue simply neglect saying sir ab sab insaan hai worst experience happy wont recommend hotel anyone"
            ]
        }
    ]
}