{
    "places_with_reviews": [
        {
            "name": "Piyush Inn",
            "rating": [
                4
            ],
            "address": [
                "Mondha Rd, Prashant Nagar, Morewadi, Ambajogai, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Surprisingly good hotel for a small town. The room and washroom were clean. The bed and covers were spotless. The Air conditioner was adequate for us but might not be for some. The food was great and taste was very much to our liking.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We were coming back to Mumbai after Parli vaijnath darshan and were not getting good hotel in Parli . Finally found  hotel Piyush inn in Ambajogai .Getting such hotel in such a small town was big surprise.Room size was not very spacious but clean , bed sheet were clean white . Air conditioning was excellent, wash room was very  clean. It also has restaurant in ground floor. Also staff were humble and soft spoken. Overall, We had good experience .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotel in Ambejogai city which is centrally located.\nRooms are good, neat and clean just room size is small even washrooms are also very clean\nThey have parking space for cars and 2 wheelers\nBreakfast options are also good and taste is good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Located at just a kilometer away from the main mandir, Piyush Inn is a beautiful stay. The staff was friendly, the room service was great and food was excellent. Definitely recommend it at a very good cost. Forwarded the word to all my relatives taking a trip to Ambajogai.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very cooperative staff Akshay and Pooja very disciplined and good behavior restaurant food very good cleanliness very good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "surprisingly good hotel small town room washroom clean bed covers spotless air conditioner adequate us might food great taste much liking",
                "coming back mumbai parli vaijnath darshan getting good hotel parli finally found hotel piyush inn ambajogai getting hotel small town big surpriseroom size spacious clean bed sheet clean white air conditioning excellent wash room clean also restaurant ground floor also staff humble soft spoken overall good experience",
                "good hotel ambejogai city centrally located rooms good neat clean room size small even washrooms also clean parking space cars wheelers breakfast options also good taste good",
                "located kilometer away main mandir piyush inn beautiful stay staff friendly room service great food excellent definitely recommend good cost forwarded word relatives taking trip ambajogai",
                "cooperative staff akshay pooja disciplined good behavior restaurant food good cleanliness good"
            ]
        },
        {
            "name": "Hotel Sai Palace",
            "rating": [
                3.9
            ],
            "address": [
                "Ambedkar Chowk, Parli - Ambajogai Rd,Chousalkar Colony, P9HW+VGX Sawta Mali Chowk, Anand Nagar, Ambajogai, Ambajogai Rural, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "This is good hotel for the vegetarian people. While searching for the vegetarian restaurant this is the good hotel for the all vegan people. This is good 💯😊 for the all types of program like birthday, engagement, small wedding, get together, bc, bachlors party and the many more function. This is quite friendly for all the people. Service and the all staff are too supportive while we are celebrating birthdays and anniversaries they are supportive for the our function. There is good space for the 30 people approximately. Food also too good in test . Worth it visit to the hotel. And the rooms and the area are also too much good and the view from the rooms are also good 👍😊 must visit to this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Sai Palace is a comfortable and affordable hotel for the entire family. The rooms are neat and clean with very basic amenities. Hot water can be an issue as well as TV since they have only free channels.\n\nThe staff is very polite and will help you 24/7. The hotel has inhouse restaurant which serves pure veg food which is very delicious.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Located in the heart of Ambejogai, Sai Palace is the perfect accommodation choice for those embarking on a spiritual journey to the revered Yogeshwari temple. The hotel's proximity to the temple ensures easy access for devotees seeking a tranquil retreat.\n\nUpon entering Sai Palace, guests are greeted with a sense of warmth and hospitality. The lobby exudes a welcoming ambiance, setting the tone for a pleasant stay. The staff members are courteous and attentive, ensuring that guests' needs are met promptly.\n\nThe rooms at Sai Palace are a haven of comfort and cleanliness. Each room is meticulously maintained, offering a serene environment for relaxation after a day of spiritual exploration. The beds are adorned with crisp linens, guaranteeing a restful night's sleep. Additionally, all necessary amenities are provided to ensure guests' convenience throughout their stay.\n\nOne of the highlights of Sai Palace is its proximity to the Yogeshwari temple. Guests can easily walk to the temple, immersing themselves in the spiritual aura that surrounds it. Whether attending a morning prayer ceremony or participating in evening rituals, guests can experience the sanctity of the temple at their leisure.\n\nAfter a day of spiritual rejuvenation, guests can indulge in delicious meals at the hotel's onsite restaurant. The menu features a variety of local and international dishes, prepared with fresh ingredients and served with care. Whether enjoying a hearty breakfast before heading to the temple or savoring a leisurely dinner with loved ones, guests are sure to delight in the culinary offerings at Sai Palace.\n\nIn conclusion, Sai Palace Ambejogai offers a delightful blend of comfort, convenience, and spirituality. With its clean and tidy rooms, attentive staff, and proximity to the Yogeshwari temple, it is the ideal choice for travelers seeking a memorable and enriching experience in Ambejogai.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are clean and hygienic, specially considering the cost.Service and hospitality are very good.Food- breakfast poori bhaji, aloo paratha were very good, dinner- dal khichadi, paneer65, tomato soup were good.Chinese hakka noodles and veg biryani were average.\nDefinitely a place one should opt for when in Ambajogai",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good Rooms are clean and hygienic, specially considering the cost.Service and hospitality are very good.Food- breakfast poori bhaji, aloo paratha were very good, dinner- dal khichadi, paneer65, tomato soup were good.Chinese hakka noodles and veg biryani were average.\nDefinitely a place one should opt for when in अंबाजोगाई If anybody looking for clean and healthy atmosphere in hotel then plz visit this hotel. There is  anniversary celebration of my uncle and aunt wonderful✨😍 celebration had done there  we had ate palak puri, paneer pulao, gulab jamun, pudina chutney, and potato 🥦🥕🌽Veggies overall hotel is so good and atmosphere is nice",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel vegetarian people searching vegetarian restaurant good hotel vegan people good ð\u009f\u0092¯ð\u009f\u0098\u008a types program like birthday engagement small wedding get together bc bachlors party many function quite friendly people service staff supportive celebrating birthdays anniversaries supportive function good space people approximately food also good test worth visit hotel rooms area also much good view rooms also good ð\u009f\u0091\u008dð\u009f\u0098\u008a must visit hotel",
                "sai palace comfortable affordable hotel entire family rooms neat clean basic amenities hot water issue well tv since free channels staff polite help hotel inhouse restaurant serves pure veg food delicious",
                "located heart ambejogai sai palace perfect accommodation choice embarking spiritual journey revered yogeshwari temple hotels proximity temple ensures easy access devotees seeking tranquil retreat upon entering sai palace guests greeted sense warmth hospitality lobby exudes welcoming ambiance setting tone pleasant stay staff members courteous attentive ensuring guests needs met promptly rooms sai palace comfort cleanliness room meticulously maintained offering serene environment relaxation day spiritual exploration beds adorned crisp linens guaranteeing restful nights sleep additionally necessary amenities provided ensure guests convenience throughout stay one highlights sai palace proximity yogeshwari temple guests easily walk temple immersing spiritual aura surrounds whether attending morning prayer ceremony participating evening rituals guests experience sanctity temple leisure day spiritual rejuvenation guests indulge delicious meals hotels onsite restaurant menu features variety local international dishes prepared fresh ingredients served care whether enjoying hearty breakfast heading temple savoring leisurely dinner loved ones guests sure delight culinary offerings sai palace conclusion sai palace ambejogai offers delightful blend comfort convenience spirituality clean tidy rooms attentive staff proximity yogeshwari temple ideal choice travelers seeking memorable enriching experience ambejogai",
                "rooms clean hygienic specially considering costservice hospitality goodfood breakfast poori bhaji aloo paratha good dinner dal khichadi paneer tomato soup goodchinese hakka noodles veg biryani average definitely place one opt ambajogai",
                "good rooms clean hygienic specially considering costservice hospitality goodfood breakfast poori bhaji aloo paratha good dinner dal khichadi paneer tomato soup goodchinese hakka noodles veg biryani average definitely place one opt à¤ à¤\u0082à¤¬à¤¾à¤\u009cà¥\u008bà¤\u0097à¤¾à¤\u0088 anybody looking clean healthy atmosphere hotel plz visit hotel anniversary celebration uncle aunt wonderfulâ\u009c¨ð\u009f\u0098\u008d celebration done ate palak puri paneer pulao gulab jamun pudina chutney potato ð\u009f¥¦ð\u009f¥\u0095ð\u009f\u008c½veggies overall hotel good atmosphere nice"
            ]
        },
        {
            "name": "Hotel Raj",
            "rating": [
                4.9
            ],
            "address": [
                "Sawarkar chowk, near bus stand, Prashant Nagar, Jaywanti Nagar, Ambajogai, Ambajogai Rural, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Be Aware and take Safety precautions before u leave your room without bags...  Carry your bags and all always when u go outside; because When I was go outside then come back I feel someone checked my bag and Room, So be aware for this.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Overall experience was really nice. Would love to come back.\n1. Rooms ware clean and specious.\n2. Service is very prompt and staff is very kind and helpful.\n3. Hot water is available 24 hours\n4. Hotel is just next to Bus stand.\n5.Car parking available.\n\nArea of improvement :\n1. Hotel toiletries could be provided before time.\n2. Lighting in lobby could be improved.\n3. Kettle and tea/coffee could be provided in the room",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "I had a great experience in this hotel during my first visit. I would like to share that staff in this hotel were very  friendly and helpful. The rooms clean and well maintained. I would really like to thanks to the staff and management for making my stay memorable. I would again like to visit and stay here during my next visit planned in May 2024..",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "It is a very nice and peaceful place. rooms and service are likely good. there staff is also supportive I am very impress after visiting here.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "the hotel, staff and services ever excellent\nEnjoyed my stay here\nWould love to come back again\nThank you\nDeepanshu",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "aware take safety precautions u leave room without bags carry bags always u go outside go outside come back feel someone checked bag room aware",
                "overall experience really nice would love come back rooms ware clean specious service prompt staff kind helpful hot water available hours hotel next bus stand car parking available area improvement hotel toiletries could provided time lighting lobby could improved kettle teacoffee could provided room",
                "great experience hotel first visit would like share staff hotel friendly helpful rooms clean well maintained would really like thanks staff management making stay memorable would like visit stay next visit planned may",
                "nice peaceful place rooms service likely good staff also supportive impress visiting",
                "hotel staff services ever excellent enjoyed stay would love come back thank deepanshu"
            ]
        },
        {
            "name": "Hotel Parichay",
            "rating": [
                3.9
            ],
            "address": [
                "Parli - Ambajogai Rd, Ambajogai, Shepwadi, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Nice place to stay.\nWell maintained Hygiene and cooperative staff.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are good but service needs improvement. Need to tell that person at reception is good but other staff not at all supportive. No running hot water. Hot water not available till 6:30. Person staying in highway hotel will start onwards journey early till that time no service available. Not even regular drinking water is provided",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Courteous staff, excellent rooms, ample parking, best vegetarian food available..\nWhat else do you need in religious tourism?! Highly recommended..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Food quality quite good.excellent service. Rates are reasonable. ..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Room was nice. Bed is comfortable with good Linen. But AC was not at all working properly inspite of booking AC room. No water in Wash basin tap . We raised the complain to hotel staff and manager but the issue wasn't resolved. Lunch options were good but breakfast was a big disappointment. We had told a night in advance but still it wasn't ready. Location of the hotel is perfect as it's very much accessible to Parali Vaijanath (approx 20 minutes) and Ambejogai Mandir (5/10 minutes). If these minor complaints are taken care of than it's definitely a good place to stay. Rates are reasonable.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place stay well maintained hygiene cooperative staff",
                "rooms good service needs improvement need tell person reception good staff supportive running hot water hot water available till person staying highway hotel start onwards journey early till time service available even regular drinking water provided",
                "courteous staff excellent rooms ample parking best vegetarian food available else need religious tourism highly recommended",
                "food quality quite goodexcellent service rates reasonable",
                "room nice bed comfortable good linen ac working properly inspite booking ac room water wash basin tap raised complain hotel staff manager issue wasnt resolved lunch options good breakfast big disappointment told night advance still wasnt ready location hotel perfect much accessible parali vaijanath approx minutes ambejogai mandir minutes minor complaints taken care definitely good place stay rates reasonable"
            ]
        },
        {
            "name": "Hotel Eat N Stay",
            "rating": [
                3.4
            ],
            "address": [
                "Dada complex, opp. Mondha, Main Road, Ambajogai, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "It's not a hotel, dharmshalas and bhakt nivas are giving better facilities, no hot water on the entire floor and as a result the entire floor asked to take a bath in one and only room where it is working. Extra mattress given but nothing to cover it, average hygienic toilet. No proper parking",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Worst place stay!! Stay away from this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "The location is almost central, very close to Yogeshawari temple. The staff/management is very polite and accommodative. The rooms are good value for money though don't expect too much from the restaurant, they have a large menu but the taste is average. Don't opt for breakfast.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Economy Hotel in Town . Hotel having it's own vegetarian restaurant.  Food quality is average.  No parking area is available for your car. Hotel have no reception area. Staff is local and untrained.  Good for solo or batchelor travelers.  Not for family and solo women travelers.  Location is good. Please try to book through GOibibo first  , makemytrip and last OYO. Please do your booking online.  It will cost around  600 to 1000/- . Hotel have surrounded by SBI and Bank of baroda ATM. Don't opt for breakfast during the booking.  Breakfast is limited and not up to the mark.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Hotel is lodge but good, but not parking available and there workers boy very 3rd class service, very cheap. Don't go.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel dharmshalas bhakt nivas giving better facilities hot water entire floor result entire floor asked take bath one room working extra mattress given nothing cover average hygienic toilet proper parking",
                "worst place stay stay away hotel",
                "location almost central close yogeshawari temple staffmanagement polite accommodative rooms good value money though dont expect much restaurant large menu taste average dont opt breakfast",
                "economy hotel town hotel vegetarian restaurant food quality average parking area available car hotel reception area staff local untrained good solo batchelor travelers family solo women travelers location good please try book goibibo first makemytrip last oyo please booking online cost around hotel surrounded sbi bank baroda atm dont opt breakfast booking breakfast limited mark",
                "hotel lodge good parking available workers boy rd class service cheap dont go"
            ]
        },
        {
            "name": "Hotel Krushnai",
            "rating": [
                3.8
            ],
            "address": [
                "Opp.Reliance Petrol Pump,Ambedkar Chowk, Ambedkar Chowk, Parli Rd, opp. Reliance Petrol Pump, Jaywanti Nagar, Ambajogai, Ambajogai Rural, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Good for family trip - clean - 24 hours hot water - affordable rates",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "At walkable distance from bus stand. They have restaurant which has the good quality food. Staff is cooperative. Rooms are recently repainted. Hot water is available, only minus is the washroom which requires upgradation and need to maintain the cleanliness.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Yesterday I stayed at this hotel. The service is very good also this hotel.is having dining facility. This is pure veg restrorent. The lodging is very good facility for stay. Good clean rooms well maintained also provide the additional beds if required. Room. size is also very good and huge. The dining hall needs some improvement. The hotel is clean but when I sit for snacks I found cockroaches moving on each tables this needs to be take care. Food quality is not up to the mark.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Entire hotel needs to renovate.  Lift is very old stops working some time. Bathroom fitting is in very nad shape. Even bucket is not cleaned properly.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The food was good. The room service was not good. The fan was not working, it worked only on number 5. Air conditioning was also not that powerful. Also, the weird thing about this hotel was there was no commode in non-ac room. If there are any elderly people with you you'll have to take an AC room to have a commode in it.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good family trip clean hours hot water affordable rates",
                "walkable distance bus stand restaurant good quality food staff cooperative rooms recently repainted hot water available minus washroom requires upgradation need maintain cleanliness",
                "yesterday stayed hotel service good also hotelis dining facility pure veg restrorent lodging good facility stay good clean rooms well maintained also provide additional beds required room size also good huge dining hall needs improvement hotel clean sit snacks found cockroaches moving tables needs take care food quality mark",
                "entire hotel needs renovate lift old stops working time bathroom fitting nad shape even bucket cleaned properly",
                "food good room service good fan working worked number air conditioning also powerful also weird thing hotel commode nonac room elderly people youll take ac room commode"
            ]
        },
        {
            "name": "Hotel Radheshyam Inn हॉटेल राधेश्याम ईन",
            "rating": [
                3.9
            ],
            "address": [
                "Hotel Radheshyam Inn, 2nd Floor, R.R. Complex, mandi bazar Road, near, Yogeshwari Mandir Marg, above Shreehari Sari Depo, Mandi Bazaar, Ambajogai, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Best place to stay if you want a one or two day stay. Good, clean rooms with individual geyser available so no dependency on solar water.\n\nThey need to work just a little on their washroom cleanliness, needs more regular maintenance. Also, option for morning tea/coffee would be nice, instead of us asking for it.\n\nOverall, would recommend.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We met Radheshyam Lodging which is an excellent and good quality lodging facility to stay in Ambejogai cities and the speaking manner of the owner and the speaking manner of the staff is good and good. We booked this hotel for two days and the rooms of the hotel are good and clean.  🙏🙏",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Horrible experience ever. Rooms are not at all cleaned and full of mosquitoes, bed sheets were so dirty… though we booked it 4 days ago and it was confirmed but after arriving there at night they were saying we don’t have booking with your name then we had to show them that we did book it … had to wait at least for an hour to get washroom and room cleaned. Even the staff was very rude and behaved like we were staying for free of cost… they don’t provide basic amenities also.. parking isn’t available … had ordered tea that too was pathetic..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Worst Experience Ever\nDirty Rooms, Dirty Bedsheets, Dirty Bathrooms, arrogant Staff\nWe booked it 4-5 days before Arrival\nStill on Arrival at 10pm they kept us on waiting for Half n Hour & they Cleaned Room after Our Complaint\nStaff is behaving like we are Staying there for Free\nRoom is full of Mosquitoes\nNo basic amenities Provided by Hotel\nLike Soap, towels, No Parking available to this Hotel you have to park your cars on that small roads\nThe Owner is not there in Hotel still without seeing anything he is saying from phone that Rooms are Good no issues in it so do not Complain.\nI am not going to Recommend this hotel to anyone",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "All room large and clean 100%👍🔝\nNice room🥰👍",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place stay want one two day stay good clean rooms individual geyser available dependency solar water need work little washroom cleanliness needs regular maintenance also option morning teacoffee would nice instead us asking overall would recommend",
                "met radheshyam lodging excellent good quality lodging facility stay ambejogai cities speaking manner owner speaking manner staff good good booked hotel two days rooms hotel good clean ð\u009f\u0099\u008fð\u009f\u0099\u008f",
                "horrible experience ever rooms cleaned full mosquitoes bed sheets dirtyâ\u0080¦ though booked days ago confirmed arriving night saying donâ\u0080\u0099t booking name show book â\u0080¦ wait least hour get washroom room cleaned even staff rude behaved like staying free costâ\u0080¦ donâ\u0080\u0099t provide basic amenities also parking isnâ\u0080\u0099t available â\u0080¦ ordered tea pathetic",
                "worst experience ever dirty rooms dirty bedsheets dirty bathrooms arrogant staff booked days arrival still arrival pm kept us waiting half n hour cleaned room complaint staff behaving like staying free room full mosquitoes basic amenities provided hotel like soap towels parking available hotel park cars small roads owner hotel still without seeing anything saying phone rooms good issues complain going recommend hotel anyone",
                "room large clean ð\u009f\u0091\u008dð\u009f\u0094\u009d nice roomð\u009f¥°ð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "OYO 60623 Shree Shalini Lodge",
            "rating": [
                4
            ],
            "address": [
                "1, Parli Rd, Gandhinagar, Jaywanti Nagar, Ambajogai, Ambajogai Rural, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "It was the dirtiest hotel room I've seen in my entire life. It's cheap and the cost is as low as 500 Rupees. But the quality of the room is very bad. The toilets stink. The rooms looked like they were never cleaned since they started the hotel. It's my kind of request to only stay when you are in extreme need of accommodation. Never take your family there.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are good hot water available at morning  toilet 🚽 has stain marks also to bucket just check the room and bathroom before book\nStaff is good 👍\nBe care full as staircase don't have railings",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Newly opened place. Available rooms at affordable rates.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice food  and very good room service",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Better than your location currently",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dirtiest hotel room ive seen entire life cheap cost low rupees quality room bad toilets stink rooms looked like never cleaned since started hotel kind request stay extreme need accommodation never take family",
                "rooms good hot water available morning toilet ð\u009f\u009a½ stain marks also bucket check room bathroom book staff good ð\u009f\u0091\u008d care full staircase dont railings",
                "newly opened place available rooms affordable rates",
                "nice food good room service",
                "better location currently"
            ]
        },
        {
            "name": "Sai Krishna hotel and lodge",
            "rating": [
                4.7
            ],
            "address": [
                "Sai krishna lodge annabhau Sathe Chowk, Mali Nagar, Ambajogai, Ambajogai Rural, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Room service is too bad, reception person with drink, and not providing the accessories, no hot water disappointing",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Rooms are clean and neat , hygiene is maintained, staff is very polite and service is good.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good Place very Clean and sufficient Rooms",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Rooms are clean & friendly staff. Will definitely recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It's amazing place I love it service is so nice nd beautiful",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room service bad reception person drink providing accessories hot water disappointing",
                "rooms clean neat hygiene maintained staff polite service good",
                "good place clean sufficient rooms",
                "rooms clean friendly staff definitely recommend",
                "amazing place love service nice nd beautiful"
            ]
        },
        {
            "name": "Shiv sai Lodge",
            "rating": [
                3.9
            ],
            "address": [
                "Yashwant Rao Chouk, Bank Colony, Ambajogai, Maharashtra 431517, India"
            ],
            "reviews": [
                {
                    "text": "Not a good place for family. No dedicated parking. High rates compared to other. Bar is below lodge which give bad smell throughout your stay. Not recommended",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Maintain well, Good service, All area under cc camera surveillance, AC / NON AC with affordable rent rates.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "ok",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Newly renovated. Neat and clean. Good service",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good service And excellent environment",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place family dedicated parking high rates compared bar lodge give bad smell throughout stay recommended",
                "maintain well good service area cc camera surveillance ac non ac affordable rent rates",
                "ok",
                "newly renovated neat clean good service",
                "good service excellent environment"
            ]
        }
    ]
}