{
    "places_with_reviews": [
        {
            "name": "The River Park Resort",
            "rating": [
                4.5
            ],
            "address": [
                "Ghat Lohanga, Chhattisgarh 494001, India"
            ],
            "reviews": [
                {
                    "text": "The location and ambience is awesome.  During our stay of 4 days, we stayed in  all the rooms. Some rooms, the lock doesn't work. Geyser does not work. Complaints made at the reception never heard of. Coming to Cave Rooms, from outside, they look good. But, not inside. Cave Rooms as said to be the expensive rooms are not provided with kettle, in spite of repeated requests.\n\nFood for one day stay is ok",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It was good experience food, location, geyser facility,surroundings are good.. but security is questionable. Its easier to open the locked cave room even from outside and normal rooms donot have extra lock facility from inside. Anyone with extra spare key can enter.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Worst resort i have ever seen and visited the management is very bad even the footpath is so clean then the resort swimming pool is not clean at all and staff members don't have any manners and behaviour is too bad don't ever go to this resort saanvi resort is far more better.. resort is good but staff members and resturant and far others things is not good",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "An excellent option to hangout with your friends and family.\nDelicious food served in restaurant. Awesome view of Indravati rever bank.\nOverall a good deal for residents & tourists of Bastar.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The staff seemed unprofessional, lacking manners and knowledge. The rooms don’t have proper facilities like towel, Mirror & land line. The most pathetic was their billing process was unclear, resulting in surprise charges post-checkout. The slow service and delayed billing made for a rather frustrating stay. I specially recommend not to opt for this property at any circumstances.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location ambience awesome stay days stayed rooms rooms lock doesnt work geyser work complaints made reception never heard coming cave rooms outside look good inside cave rooms said expensive rooms provided kettle spite repeated requests food one day stay ok",
                "good experience food location geyser facilitysurroundings good security questionable easier open locked cave room even outside normal rooms donot extra lock facility inside anyone extra spare key enter",
                "worst resort ever seen visited management bad even footpath clean resort swimming pool clean staff members dont manners behaviour bad dont ever go resort saanvi resort far better resort good staff members resturant far others things good",
                "excellent option hangout friends family delicious food served restaurant awesome view indravati rever bank overall good deal residents tourists bastar",
                "staff seemed unprofessional lacking manners knowledge rooms donâ\u0080\u0099t proper facilities like towel mirror land line pathetic billing process unclear resulting surprise charges postcheckout slow service delayed billing made rather frustrating stay specially recommend opt property circumstances"
            ]
        },
        {
            "name": "Bajaj's Karwan Inn",
            "rating": [
                4.2
            ],
            "address": [
                "Chitrakote Rd, Jagdalpur, Dharmaur, Chhattisgarh 494442, India"
            ],
            "reviews": [
                {
                    "text": "I had an excellent experience at this hotel! The staff's politeness and helpfulness truly stood out, making my stay enjoyable. The food was delicious, exceeding my expectations, and the overall ambience created a pleasant atmosphere. Everything about this hotel was top-notch, and I highly recommend it for a fantastic stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Staff is good and fast in service. Place is quiet and cozy. Food is tasty. Rooms are clean and hygienic. Ambience is superb of both hotel and restaurant. Totally recommended for stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at, Bajaj's Karwan Inn. This charming hotel nestled in the heart of nature, and it truly exceeded all my expectations. The location is simply beautiful, surrounded by lush greenery and offering a serene escape from the hustle and bustle of city life.\n\nThe services provided were top-notch, with the staff going above and beyond to ensure a comfortable stay. They were not only friendly but also incredibly helpful, offering excellent recommendations for local attractions and ensuring all our needs were met promptly.\n\nBut what truly stood out for me was the food. The hotel's restaurant served up some of the most amazing dishes I've ever had. From delicious breakfasts to delectable dinners, every meal was a culinary delight.\n\nAnd for pet lovers like me, the fact that this hotel is pet-friendly was a huge plus. My furry friend had a blast exploring the nearby trails and parks.\n\nIn terms of location, this hotel is strategically situated close to all the major tourist spots, making it the perfect base for exploring the area. I can't recommend this place enough – it's a little slice of paradise in the midst of nature.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Couldn't expect any better than this at a reasonable rate. Service I receive there was exceptional. I made good relations with staff. It's a friendly, into the nature and cozy place to stay at.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Best place to stay when u r visiting Chitrakote waterfalls. Excellent service, clean rooms, Parking and Tasty food:-)",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent experience hotel staffs politeness helpfulness truly stood making stay enjoyable food delicious exceeding expectations overall ambience created pleasant atmosphere everything hotel topnotch highly recommend fantastic stay",
                "staff good fast service place quiet cozy food tasty rooms clean hygienic ambience superb hotel restaurant totally recommended stay",
                "recently pleasure staying bajajs karwan inn charming hotel nestled heart nature truly exceeded expectations location simply beautiful surrounded lush greenery offering serene escape hustle bustle city life services provided topnotch staff going beyond ensure comfortable stay friendly also incredibly helpful offering excellent recommendations local attractions ensuring needs met promptly truly stood food hotels restaurant served amazing dishes ive ever delicious breakfasts delectable dinners every meal culinary delight pet lovers like fact hotel petfriendly huge plus furry friend blast exploring nearby trails parks terms location hotel strategically situated close major tourist spots making perfect base exploring area cant recommend place enough â\u0080\u0093 little slice paradise midst nature",
                "couldnt expect better reasonable rate service receive exceptional made good relations staff friendly nature cozy place stay",
                "best place stay u r visiting chitrakote waterfalls excellent service clean rooms parking tasty food"
            ]
        },
        {
            "name": "Naman Bastar",
            "rating": [
                3.7
            ],
            "address": [
                "Chitrakote Rd, Palli, Chhattisgarh 494005, India"
            ],
            "reviews": [
                {
                    "text": "Service Quality: The resort's service is impeccable, with staff always ready to assist promptly and efficiently.\n\nStaff Behavior: The staff's behavior is exemplary, characterized by warmth, courtesy, and a traditional hospitality that adds a personal touch to the experience.\n\nResort Ambience: The ambience of the resort is enchanting, boasting picturesque surroundings and well-maintained facilities that create a serene and inviting atmosphere.\n\nLush Greenery: The resort is nestled amidst lush greenery, offering a tranquil retreat from the hustle and bustle of city life. The verdant surroundings enhance the overall appeal of the resort.\n\nPeaceful Atmosphere: The resort exudes a peaceful atmosphere, providing guests with a sanctuary to unwind and rejuvenate. Whether lounging by the pool or strolling through the gardens, tranquility permeates every corner of the property.\n\nOverall, the resort delivers an exceptional experience characterized by top-notch service, genuine hospitality, captivating ambience, lush surroundings, and a peaceful atmosphere that leaves guests feeling refreshed.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "1. No electric geyser in rooms. Only solar heater so forget luke warm water before 11 am in chilled winter.No hot water at night also.\n2. No electric kettle at room for heating water for drinking/tea making.\n3.Want tea before 7 am? Forget as kitchen is closed.\n4.No body lotion/shampoo/dental kit provided in this luxurious resort.\n5.Towel is very dirty and soiled.\n6.So much salt in all food. Only deep fried starters are available.\nNo evening snacks availability.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nice comfortable property for 2-3 days stay in Bastar... Good hospitality by staff with wonderful location. Good parking space, WiFi coverage, lots of greenery within premises, tasty food.\nLittle expensive regard to room charges.\nOverall good experience.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It's been an amazing experience, the staff, the food and the location is literally top notch... I'll highly recommend to come and have a safe space to chill with your friends....\nAnd the staff were so polite especially Sushmita, Phoolmati, Demaati, Bhuvneshwari, Fugno were so helping, answered all my queries politely....\nHygiene was top notch\nIn single words - phenomenal... ❤️",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very cooperative staff. Neat and clean room. Nice hospitality with delicious food value for money.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service quality resorts service impeccable staff always ready assist promptly efficiently staff behavior staffs behavior exemplary characterized warmth courtesy traditional hospitality adds personal touch experience resort ambience ambience resort enchanting boasting picturesque surroundings wellmaintained facilities create serene inviting atmosphere lush greenery resort nestled amidst lush greenery offering tranquil retreat hustle bustle city life verdant surroundings enhance overall appeal resort peaceful atmosphere resort exudes peaceful atmosphere providing guests sanctuary unwind rejuvenate whether lounging pool strolling gardens tranquility permeates every corner property overall resort delivers exceptional experience characterized topnotch service genuine hospitality captivating ambience lush surroundings peaceful atmosphere leaves guests feeling refreshed",
                "electric geyser rooms solar heater forget luke warm water chilled winterno hot water night also electric kettle room heating water drinkingtea making want tea forget kitchen closed body lotionshampoodental kit provided luxurious resort towel dirty soiled much salt food deep fried starters available evening snacks availability",
                "nice comfortable property days stay bastar good hospitality staff wonderful location good parking space wifi coverage lots greenery within premises tasty food little expensive regard room charges overall good experience",
                "amazing experience staff food location literally top notch ill highly recommend come safe space chill friends staff polite especially sushmita phoolmati demaati bhuvneshwari fugno helping answered queries politely hygiene top notch single words phenomenal â\u009d¤ï¸\u008f",
                "cooperative staff neat clean room nice hospitality delicious food value money"
            ]
        },
        {
            "name": "EVERGREEN RESORT",
            "rating": [
                4.1
            ],
            "address": [
                "Infront of Agriculture College, Kumarawand, Chitrakote Rd, Jagdalpur, Kumarawand, Chhattisgarh 494223, India"
            ],
            "reviews": [
                {
                    "text": "Best location for tourists. The rooms are budget friendly and food is tasty as well. Only one drawback of this place is that they don't have geysers installed in the rooms.\nEverything else is good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Grate experience I was surprised to this resort facilities in jagdalpur I have expended only one day but my teem was 2 day expand in evergreen resort grate food nice dining in night and grate price for rooms are clean food are highenic good for all jagdalpur trip was grate ... for rest I. This resort",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Poor service but food is good\n\nI want to check out 8 am nd gate is lock no.one os there. . no one recive the call.\nVery bad service",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place and good food\nNice behaviour of staff",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice resturant with varieties of food options",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best location tourists rooms budget friendly food tasty well one drawback place dont geysers installed rooms everything else good",
                "grate experience surprised resort facilities jagdalpur expended one day teem day expand evergreen resort grate food nice dining night grate price rooms clean food highenic good jagdalpur trip grate rest resort",
                "poor service food good want check nd gate lock noone os one recive call bad service",
                "nice place good food nice behaviour staff",
                "nice resturant varieties food options"
            ]
        },
        {
            "name": "OYO HOME 84310 Individual Homes",
            "rating": [
                4.3
            ],
            "address": [
                "Kumhrawand, Chitrakote Rd, Palli, Jagdalpur, Palli, Chhattisgarh 494001, India"
            ],
            "reviews": [
                {
                    "text": "Great place, good rooms, fantastic location,",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great place good rooms fantastic location"
            ]
        },
        {
            "name": "Royal Bastar Farm",
            "rating": [
                3.5
            ],
            "address": [
                "3XRP+75M, Tetarkhuti, Jagdalpur, Chhattisgarh 494001, India"
            ],
            "reviews": [
                {
                    "text": "One of the most comfortable resort at Jagdalpur city",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "No, it's great respect humanity",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Someone can share contact no.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "amazing",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one comfortable resort jagdalpur city",
                "great respect humanity",
                "someone share contact",
                "good",
                "amazing"
            ]
        },
        {
            "name": "Sushma Sahu",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Dongripara,kangoli, infront of kangoli, wine shop, Jagdalpur, Chhattisgarh 494001, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Sadhan Hotel",
            "rating": [
                "Unknown"
            ],
            "address": [
                "3XWM+MXF, Tetarkhuti, Dharmapur, Chhattisgarh 494001, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}