{
    "places_with_reviews": [
        {
            "name": "Landmark Hotel Bhilwara",
            "rating": [
                4
            ],
            "address": [
                "Chittorgarh Rd, near Circuit House, Basant Vihar Colony, Santosh Colony, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Location best suits me, it's just walking distance from bhilwara station, Rooms are clean, suite are spacious, value for Money, only buffet breakfast was not available as occupancy was low.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst place to stay in bhilwara. They mistreat women. They declined women passenger to use their washroom and misbehaved with them. Even asked for money to use their washroom.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Courteous staff... Receptionist is too professional which was really great... perfect hygiene, cleanliness...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel location is good... Rooms size is also good enough... Staff behaviour is polite and humble... Food quality is also good.. I would rate 7/10",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best hotel if you are commuting via private buses , it’s in front on Bhilwara private bus parking.\nFood & staff was also good.\nMr Yadav gave me early check in around 7 am which was unexpected but I appreciate that.\nI travelled from Delhi and bus dropped me in front of this hotel.\nIt’s next to hotel landmark & you can visit rock bar terrace cafe which is at backside of this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location best suits walking distance bhilwara station rooms clean suite spacious value money buffet breakfast available occupancy low",
                "worst place stay bhilwara mistreat women declined women passenger use washroom misbehaved even asked money use washroom",
                "courteous staff receptionist professional really great perfect hygiene cleanliness",
                "hotel location good rooms size also good enough staff behaviour polite humble food quality also good would rate",
                "best hotel commuting via private buses itâ\u0080\u0099s front bhilwara private bus parking food staff also good mr yadav gave early check around unexpected appreciate travelled delhi bus dropped front hotel itâ\u0080\u0099s next hotel landmark visit rock bar terrace cafe backside hotel"
            ]
        },
        {
            "name": "The Imperial Prime Clarks Inn Suites Bhilwara",
            "rating": [
                4.3
            ],
            "address": [
                "200 Feet, Ring Rd, Gokul Vihar, Haled, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Location: Situated amidst the lush Desert of Rajasthan, The Imperial Prime Clarks Inn Suites Bhilwara offers a serene escape from the hustle and bustle of city life.\n\nAmbiance: The moment you step into the lobby, you are greeted by an ambiance of relaxation and luxury. The décor is tastefully appointed, with earthy tones and contemporary furnishings that complement the natural surroundings. The soothing sounds of flowing water from nearby fountains further enhance the peaceful atmosphere.\n\nAccommodation: The rooms at The Imperial Prime Clarks Inn Suites Bhilwara are a haven of comfort and style. Each room is thoughtfully designed with modern amenities and plush furnishings to ensure a restful stay. The beds are incredibly comfortable, guaranteeing a good night's sleep, while the spacious bathrooms are equipped with luxurious toiletries and rainfall showers.\n\nDining: The hotel's restaurant offers a culinary journey that delights the senses. From gourmet breakfast spreads to delectable dinner menus featuring locally sourced ingredients, every meal is a treat for the taste buds. Guests can also enjoy alfresco dining on the terrace, surrounded by the beauty of nature.\n\nFacilities: The Imperial Prime Clarks Inn Suites Bhilwara boasts a range of facilities to cater to every guest's needs. Whether you want to unwind with a massage at the spa, take a refreshing dip in the infinity pool, or stay active at the fitness center, there's something for everyone. Additionally, the hotel offers concierge services to assist with any requests or arrangements during your stay.\n\nService: The service at The Imperial Prime Clarks Inn Suites Bhilwara is exemplary, with staff members who are attentive, friendly, and always willing to go the extra mile to ensure a memorable experience for guests. From the warm welcome upon arrival to the personalized assistance throughout your stay, every interaction with the staff is marked by professionalism and hospitality.\n\nOverall Experience: The Imperial Prime Clarks Inn Suites Bhilwara offers a perfect blend of luxury, tranquility, and hospitality, making it an ideal destination for those seeking a rejuvenating getaway. Whether you're looking to reconnect with nature, indulge in culinary delights, or simply unwind in a peaceful setting, this hotel exceeds expectations on every front. A stay at The Imperial Prime Clarks Inn Suites Bhilwara is not just a vacation—it's an unforgettable experience that leaves you feeling refreshed, revitalized, and eager to return.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The Imperial Prime Clarks Inn Suites in Bhilwara is an excellent choice, whether for weddings, business trips, or holidays. The luxurious ambiance and well-designed architecture create a perfect setting. Comfortable rooms, a beautiful garden, and a refreshing swimming pool enhance the overall experience. The positive vibes of the environment make it an ideal destination. With the reputable Clarks brand, it stands out as a top-notch place for various occasions.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel is good and the behavior of the staff is also good, guests of both bride and groom can stay here, it has around 100 rooms available. This hotel is about 8 kilometers from the city",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great !! #most popular n liked wedding destination in Bhilwara city with great view front and reception with large garden area with romantic smiming pool site with clean water.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Large parking outside hotel wall but its fenced and is for marriage parties. Also 10-15 car parking inside the concrete walls of hotel. Food is average. Washroom was adequately functional. Plenty ie 10-15 hairs on pillow. 3 hairs on bedsheet. The linen was used one and not changed. The kettle was not working. Lift makea sudden strange noises. Staff is helpful and sorted out all problems. Washroom gives small bottles of shampoo and body wash only.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location situated amidst lush desert rajasthan imperial prime clarks inn suites bhilwara offers serene escape hustle bustle city life ambiance moment step lobby greeted ambiance relaxation luxury dã©cor tastefully appointed earthy tones contemporary furnishings complement natural surroundings soothing sounds flowing water nearby fountains enhance peaceful atmosphere accommodation rooms imperial prime clarks inn suites bhilwara comfort style room thoughtfully designed modern amenities plush furnishings ensure restful stay beds incredibly comfortable guaranteeing good nights sleep spacious bathrooms equipped luxurious toiletries rainfall showers dining hotels restaurant offers culinary journey delights senses gourmet breakfast spreads delectable dinner menus featuring locally sourced ingredients every meal treat taste buds guests also enjoy alfresco dining terrace surrounded beauty nature facilities imperial prime clarks inn suites bhilwara boasts range facilities cater every guests needs whether want unwind massage spa take refreshing dip infinity pool stay active fitness center theres something everyone additionally hotel offers concierge services assist requests arrangements stay service service imperial prime clarks inn suites bhilwara exemplary staff members attentive friendly always willing go extra mile ensure memorable experience guests warm welcome upon arrival personalized assistance throughout stay every interaction staff marked professionalism hospitality overall experience imperial prime clarks inn suites bhilwara offers perfect blend luxury tranquility hospitality making ideal destination seeking rejuvenating getaway whether youre looking reconnect nature indulge culinary delights simply unwind peaceful setting hotel exceeds expectations every front stay imperial prime clarks inn suites bhilwara vacationâ\u0080\u0094its unforgettable experience leaves feeling refreshed revitalized eager return",
                "imperial prime clarks inn suites bhilwara excellent choice whether weddings business trips holidays luxurious ambiance welldesigned architecture create perfect setting comfortable rooms beautiful garden refreshing swimming pool enhance overall experience positive vibes environment make ideal destination reputable clarks brand stands topnotch place various occasions",
                "hotel good behavior staff also good guests bride groom stay around rooms available hotel kilometers city",
                "great popular n liked wedding destination bhilwara city great view front reception large garden area romantic smiming pool site clean water",
                "large parking outside hotel wall fenced marriage parties also car parking inside concrete walls hotel food average washroom adequately functional plenty ie hairs pillow hairs bedsheet linen used one changed kettle working lift makea sudden strange noises staff helpful sorted problems washroom gives small bottles shampoo body wash"
            ]
        },
        {
            "name": "Orica Resort",
            "rating": [
                4.3
            ],
            "address": [
                "200 Feet Ring Road Near Hanuman Circle, Eras, Road, Bhilwara, Eras, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Orica Resort could be considered as a good choice only for wedding functions or large parties. There are 2 spacious lawn area where large gatherings can be enjoyed the function. Rooms are spacious and equipped with all the basic facilities. Total 90 rooms are there in this resort. A huge spacious hall fir parties is available at the basement of the hotel area. Spacious kitchen area is there where the host can make arrangements for their food preparation.\n\nThe major negative point is that there is no restaurant inside the resort. Hence this resort only becomes good choice if you have large gatherings or you have your own arrangement for food and all. Otherwise thinking of this resort will be too harsh on pocket and will be meaning less.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The perfect wedding destination. We recently had my brother's wedding out there & I just totally loved it. Everything was good from big spacious garden to good sizable banquet hall, pool, well-quality rooms & the staff behavior was really helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The resort is perfect to go for any wedding or outing with your loved ones. The thing which I want to suggest is that the mirrors in the room are behind the door so it is very difficult to use the mirror along with the door's disturbance. It is suggested to change the mirror's location in the rooms.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Orika Resort is located near Iras Crossroads, 5 km from Roadways Bus Stand. There is a huge garden here where many types of functions can be organized and there is also a swimming pool.The rooms here are quite nice and well furnished. It is a very suitable resort for wedding ceremonies.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Awesome resort. We attended a marriage function there. Nice rooms and banquet.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "orica resort could considered good choice wedding functions large parties spacious lawn area large gatherings enjoyed function rooms spacious equipped basic facilities total rooms resort huge spacious hall fir parties available basement hotel area spacious kitchen area host make arrangements food preparation major negative point restaurant inside resort hence resort becomes good choice large gatherings arrangement food otherwise thinking resort harsh pocket meaning less",
                "perfect wedding destination recently brothers wedding totally loved everything good big spacious garden good sizable banquet hall pool wellquality rooms staff behavior really helpful",
                "resort perfect go wedding outing loved ones thing want suggest mirrors room behind door difficult use mirror along doors disturbance suggested change mirrors location rooms",
                "orika resort located near iras crossroads km roadways bus stand huge garden many types functions organized also swimming poolthe rooms quite nice well furnished suitable resort wedding ceremonies",
                "awesome resort attended marriage function nice rooms banquet"
            ]
        },
        {
            "name": "Delice Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "Old RTO Rd, Gandhi Nagar, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "This is my first time in Bhilwara. I chose to go for lunch at the Delice Hotel based on feedback from my friend.\n\nMy family and I went for lunch, and we were pleasantly surprised by the high-tech environment, cleanliness, and excellent service. Every dish we ordered had a unique and delightful flavor.\n\nThe food looked delicious, and we were so hungry that we forgot to take pictures. Nevertheless, you can get an idea of how great the taste was.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "My stay at Hotel Dlice in Bhilwara was delightful. The room I stayed in was conveniently located and impeccably clean. It had all the basic amenities I needed, including a tea kettle, fridge, and wardrobe, making my stay comfortable and convenient. The attention to detail in ensuring these amenities were provided was impressive. Overall, I had a pleasant experience and would highly recommend Hotel Dlice to anyone visiting Bhilwara.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's a beautiful Property. All important  places are  nearby. Huge property with good rooms. Natural beauty. Good Horticulture work and lawns. The food is quite good and the staff is attentive. The prices are cheaper in non-seasonal time. Very peaceful and serene place. Business area. Parking is available. Roof top restaurant and bar",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Everything seemed perfect, as we stayed for a night. Bhavika and Muskan were amazing in hosting us at the hotel as well as the restaurant. If you are traveling from abroad, like US, you will like staying here for its cleanliness and hospitality! True to India and Bhilwara!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel has a very nice rooftop restaurant. the decor and feel of the restaurant is good. Food is also decent. The staff is very cooperwtive and they would go out of their way to help you. Would definitely recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "first time bhilwara chose go lunch delice hotel based feedback friend family went lunch pleasantly surprised hightech environment cleanliness excellent service every dish ordered unique delightful flavor food looked delicious hungry forgot take pictures nevertheless get idea great taste",
                "stay hotel dlice bhilwara delightful room stayed conveniently located impeccably clean basic amenities needed including tea kettle fridge wardrobe making stay comfortable convenient attention detail ensuring amenities provided impressive overall pleasant experience would highly recommend hotel dlice anyone visiting bhilwara",
                "beautiful property important places nearby huge property good rooms natural beauty good horticulture work lawns food quite good staff attentive prices cheaper nonseasonal time peaceful serene place business area parking available roof top restaurant bar",
                "everything seemed perfect stayed night bhavika muskan amazing hosting us hotel well restaurant traveling abroad like us like staying cleanliness hospitality true india bhilwara",
                "hotel nice rooftop restaurant decor feel restaurant good food also decent staff cooperwtive would go way help would definitely recommend place"
            ]
        },
        {
            "name": "Ranbanka Heritage Resort Bhilwara",
            "rating": [
                4
            ],
            "address": [
                "8JWG+27Q Khamore House, Old RTO Rd, Gandhi Nagar, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "This hotel offers an exceptional experience with its inviting ambience and delicious breakfast options. The social house restaurant provides a vibrant atmosphere for guests to unwind, complemented by a picturesque pool area. Impeccable service and a variety of amenities make it a top choice for travelers seeking comfort and relaxation.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Poor on service and lack basic sense of hospitality.\n\nThe design and feel of the hotel is great along with the food taste.\n\nHot water needs to be asked on reception even in the peak hour of morning\n\nBasic toiletries and towels, bottles water needs to be asked multiple times\n\nWould expect to improve on service and basic services to match the food and ambience quality",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Dear Management,\n\nI regret to inform you that my recent stay at your establishment was highly unsatisfactory due to several glaring issues with the management and facilities provided. I feel compelled to provide feedback to ensure improvements are made for future guests.\n\nFirstly, the condition of the room was unacceptable. Wires were visibly protruding from the walls and sockets, posing a safety hazard. Additionally, the bed mattress was worn out and uncomfortable, hindering any chance of a restful sleep.\n\nMoreover, the inconvenience of being asked to pay in cash only, with no option for online or card payments, especially late at night, was highly inconvenient and outdated. This lack of flexibility is unacceptable in today’s digital age.\n\nFurthermore, the absence of basic amenities such as water bottles, with only RO water available, was disappointing. Guests should have easy access to essentials for their comfort and convenience.\n\nThe lack of attentiveness and professionalism from the staff further added to the dissatisfaction. Chewing gutkha at the reception and during service interactions is not only unhygienic but also reflects poorly on the establishment’s standards.\n\nOverall, my experience was so subpar that I would advise others to avoid staying at your hotel altogether. It is disheartening to say that I would have received better service and accommodations at a roadside hotel.\n\nI hope you take this feedback seriously and implement necessary changes to improve the quality of your establishment for future guests.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Our dinner experience at Hotel Ran Bakura was delightful. We started with refreshing drinks - a strawberry shake and lime water, both of which were refreshing and well-prepared. For our main course, we enjoyed paneer tikka masala, yellow dal tadka, and mixed vegetables accompanied by garlic naan and lachha paratha. The food was delicious, with each dish bursting with flavor and prepared to perfection. The ambiance near the swimming pool added to the overall dining experience, creating a beautiful and relaxing atmosphere. The service was prompt and attentive, ensuring a pleasant dining experience from start to finish. I would highly recommend Hotel Ran Bakura to anyone looking for delicious food and a lovely ambiance in Bhilwara.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "They call themselves Heritage property, but it's the worst I had ever stayed after paying for a luxury stay. Their rooms stink, not at all maintained. Poor room service. Surrounding is so unhygienic and dirty. Only one thing positive was, their breakfast was tasty inspite of having very less options.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel offers exceptional experience inviting ambience delicious breakfast options social house restaurant provides vibrant atmosphere guests unwind complemented picturesque pool area impeccable service variety amenities make top choice travelers seeking comfort relaxation",
                "poor service lack basic sense hospitality design feel hotel great along food taste hot water needs asked reception even peak hour morning basic toiletries towels bottles water needs asked multiple times would expect improve service basic services match food ambience quality",
                "dear management regret inform recent stay establishment highly unsatisfactory due several glaring issues management facilities provided feel compelled provide feedback ensure improvements made future guests firstly condition room unacceptable wires visibly protruding walls sockets posing safety hazard additionally bed mattress worn uncomfortable hindering chance restful sleep moreover inconvenience asked pay cash option online card payments especially late night highly inconvenient outdated lack flexibility unacceptable todayâ\u0080\u0099s digital age furthermore absence basic amenities water bottles ro water available disappointing guests easy access essentials comfort convenience lack attentiveness professionalism staff added dissatisfaction chewing gutkha reception service interactions unhygienic also reflects poorly establishmentâ\u0080\u0099s standards overall experience subpar would advise others avoid staying hotel altogether disheartening say would received better service accommodations roadside hotel hope take feedback seriously implement necessary changes improve quality establishment future guests",
                "dinner experience hotel ran bakura delightful started refreshing drinks strawberry shake lime water refreshing wellprepared main course enjoyed paneer tikka masala yellow dal tadka mixed vegetables accompanied garlic naan lachha paratha food delicious dish bursting flavor prepared perfection ambiance near swimming pool added overall dining experience creating beautiful relaxing atmosphere service prompt attentive ensuring pleasant dining experience start finish would highly recommend hotel ran bakura anyone looking delicious food lovely ambiance bhilwara",
                "call heritage property worst ever stayed paying luxury stay rooms stink maintained poor room service surrounding unhygienic dirty one thing positive breakfast tasty inspite less options"
            ]
        },
        {
            "name": "Hotel BMD The Grand Bhilwara - Best Hotel & Restaurants In Bhilwara",
            "rating": [
                4.2
            ],
            "address": [
                "Chandrashekar Azad Nagar, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Had dinner here twice. Menu is all vegetarian. Found the quality of food is very good as per a city like Bhilwara. We ordered Indian food, and it turned out to be quite delicious. The location of the hotel is also excellent. Hope they maintain the quality in the near future.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It used to be a good hotel. But not now. No hospitality, cleanliness compromised. Washrooms were stinking.\nLocation is far away from station. no sense of staying at such hotel. There are some far better options in main city.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A good hotel with to stay at chandreshekhar Azad Nagar Bhilwara having all amenities. Staff are friendly and courteous. Rooms are clean and spacious and beds are comfortable. There are having good parking also. Restaurant is available on the terrace both open and closed. Birthday party are organised here. Food is good. Service is excellent. Overall a good stay experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Dined at the restaurant, and the experience fell in the middle ground. The ambiance was comfortable, but the menu lacked the excitement expected for a memorable meal. The service was adequate, though not outstanding. Flavors were decent, yet some dishes left room for improvement. With a few tweaks, this place has the potential to rise above mediocrity. A fair choice, but there are better options in town.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The birthday celebration at the restaurant was spoiled by a spicy sizzler that was too hot to handle. The mood soured when our request to replace the dish was dismissed with a curt, “the dish is made like this only.” The manchow soup and vanilla shake were average, and the mix fresh lime soda was excessively sweet.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dinner twice menu vegetarian found quality food good per city like bhilwara ordered indian food turned quite delicious location hotel also excellent hope maintain quality near future",
                "used good hotel hospitality cleanliness compromised washrooms stinking location far away station sense staying hotel far better options main city",
                "good hotel stay chandreshekhar azad nagar bhilwara amenities staff friendly courteous rooms clean spacious beds comfortable good parking also restaurant available terrace open closed birthday party organised food good service excellent overall good stay experience",
                "dined restaurant experience fell middle ground ambiance comfortable menu lacked excitement expected memorable meal service adequate though outstanding flavors decent yet dishes left room improvement tweaks place potential rise mediocrity fair choice better options town",
                "birthday celebration restaurant spoiled spicy sizzler hot handle mood soured request replace dish dismissed curt â\u0080\u009cthe dish made like onlyâ\u0080\u009d manchow soup vanilla shake average mix fresh lime soda excessively sweet"
            ]
        },
        {
            "name": "The Palm Resorts",
            "rating": [
                4
            ],
            "address": [
                "Mangrop Road, Near Harni Mahadev Mandir, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "The room was just ok, there was a lack of maintenance in the kids play area and most of the rides were broken.\nWent to attend marriage so not use much on room service except some items for toddler.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The resort is overall good. The things I don't like about was the tea and the coffee they serve which was Tasteless especially the tea, which was worst. I was a little surprised how they can provide such kind of tea , lthe food was amazing though. Also the thing I didn't like was the sheets and bed sheets they provide. Anyone can tell that they were not washed for quite a while. That's it. The room was good. The surrounding was amazing but I didn't like the sheets and the bed sheets which were very old and haven't been washed for a long time",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are really good compare to price, it's outside the city so there is no city rush and all, rooms are quite big and there are lots of rooms available,\nStaff was really nice. lots of place for parking also.\ngood for weddings and all they have pool also so can have party, also have big hall.\nwill suggest definitely for weddings.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice place for party , function and enjoy.\nFood is also good.\n\nAlso having swimming pool but due to rain I didn't used\nBut it's good place overall.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good location but average maintenance of infrastructure and services",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room ok lack maintenance kids play area rides broken went attend marriage use much room service except items toddler",
                "resort overall good things dont like tea coffee serve tasteless especially tea worst little surprised provide kind tea lthe food amazing though also thing didnt like sheets bed sheets provide anyone tell washed quite thats room good surrounding amazing didnt like sheets bed sheets old havent washed long time",
                "rooms really good compare price outside city city rush rooms quite big lots rooms available staff really nice lots place parking also good weddings pool also party also big hall suggest definitely weddings",
                "nice place party function enjoy food also good also swimming pool due rain didnt used good place overall",
                "good location average maintenance infrastructure services"
            ]
        },
        {
            "name": "Gulab Bagh Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "200 Feet Ring Road, 9M55+5WM, Kuwada Road, near by Noble International School, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Attend the Marriage function of my friend's son on 7th of March 24. The hotel cum marriage resort is closed to the city. Very nice place",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Located near Bhilwara city, this resort is very luxurious. All types of rooms are available here. There is also a huge garden here which is suitable for any kind of function. There is also a swimming pool here.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It is a very nice place to stay and the staff is also very supportive, the services regarding anything are also very good here.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good for family functions as it has a large space, service is also ok not that much appreciated but according to Bhilwara it's okk.\nIf you have a good budget you are welcome.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This marriage garden is very great for wedding and other big party. There is a big ground which is quite right for dinner and other activities, here the rooms are very big with every facility and the nature of the staff here is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "attend marriage function friends son th march hotel cum marriage resort closed city nice place",
                "located near bhilwara city resort luxurious types rooms available also huge garden suitable kind function also swimming pool",
                "nice place stay staff also supportive services regarding anything also good",
                "good family functions large space service also ok much appreciated according bhilwara okk good budget welcome",
                "marriage garden great wedding big party big ground quite right dinner activities rooms big every facility nature staff also good"
            ]
        },
        {
            "name": "Flora Park",
            "rating": [
                4.2
            ],
            "address": [
                "Flora Park, Shivaji Nagar, Kawa Kheda, Shastri Nagar, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "I'm happy to provide feedback on Flora Park. Based on my experience, I'd rate it 4 stars. The reason for this rating is the beautiful and well-maintained gardens, friendly staff, and convenient location. However, there's always room for improvement, perhaps enhancing the variety of activities and amenities would make it a 5-star destination.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "@flora park\nBhilwara is famous garden and biggest event in garden all pictures and good staf....",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Awesome place. As name implies best combination of comfort and luxury.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Flora park hotel is best place for wedding and parties in Bhilwara",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good Venue for marriage and other social functions in the city.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "im happy provide feedback flora park based experience id rate stars reason rating beautiful wellmaintained gardens friendly staff convenient location however theres always room improvement perhaps enhancing variety activities amenities would make star destination",
                "flora park bhilwara famous garden biggest event garden pictures good staf",
                "awesome place name implies best combination comfort luxury",
                "flora park hotel best place wedding parties bhilwara",
                "good venue marriage social functions city"
            ]
        },
        {
            "name": "The Navkar Hotel Bhilwara",
            "rating": [
                4.1
            ],
            "address": [
                "near Aashika Hotel, Bhilwara, Rajasthan 311001, India"
            ],
            "reviews": [
                {
                    "text": "Wedding destination property.\nToo huge for a big fat Indian wedding\n2 floors with ground floor.\nRooms are too spacious.\nBeautiful constructed.\nIndoor and outdoor space is too big.\nRainy season can’t destroy your functions.\n\nOverall a great place to organise your functions.\nIt’s near by Bhilwara from the way from atun village.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This place is awesome for marriage function and parties, nicely maintained and organised.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I recently had the pleasure of attending a wedding at Navkar Hotel in Bhilwara, Rajasthan and I must say, it was an incredible experience! The hotel's spacious and well-designed banquet halls are perfect for hosting grand weddings and can accommodate a large number of guests with ease.\n\nThe staff at Navkar Hotel were incredibly attentive and accommodating, making sure that every detail of the wedding was executed flawlessly.\n\nThe hotel's location is also a major plus point, as it is easily accessible from all parts of the city. Additionally, ample parking is available on-site, which is a big advantage for guests who are driving.\n\nThe rooms were spacious and well-appointed, ensuring that all guests had a comfortable stay. Overall, I highly recommend Navkar Hotel as a wedding venue. If you're looking for a luxurious and memorable wedding experience, this hotel is definitely worth considering!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Perfect for organising functions and even weddings.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "rooms are good but the service is so so. Flush doesnt work some times. reachable destination. Nearby city. nice pool. maximum depth 4.5 ft.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wedding destination property huge big fat indian wedding floors ground floor rooms spacious beautiful constructed indoor outdoor space big rainy season canâ\u0080\u0099t destroy functions overall great place organise functions itâ\u0080\u0099s near bhilwara way atun village",
                "place awesome marriage function parties nicely maintained organised",
                "recently pleasure attending wedding navkar hotel bhilwara rajasthan must say incredible experience hotels spacious welldesigned banquet halls perfect hosting grand weddings accommodate large number guests ease staff navkar hotel incredibly attentive accommodating making sure every detail wedding executed flawlessly hotels location also major plus point easily accessible parts city additionally ample parking available onsite big advantage guests driving rooms spacious wellappointed ensuring guests comfortable stay overall highly recommend navkar hotel wedding venue youre looking luxurious memorable wedding experience hotel definitely worth considering",
                "perfect organising functions even weddings",
                "rooms good service flush doesnt work times reachable destination nearby city nice pool maximum depth ft"
            ]
        }
    ]
}