{
    "places_with_reviews": [
        {
            "name": "Morickap Resort",
            "rating": [
                4.6
            ],
            "address": [
                "Banasura Sagar Dam Road Pinangode P O, Vengapally Village Vythiri, Pinangode, Kalpetta, Vengapally, Kerala 673122, India"
            ],
            "reviews": [
                {
                    "text": "The stay at Morickap was really good. The food was exceptional, and so was the experience. The resort is nestled between a coffee estate and is nature at its best. There are activities for kids like zip lines, Burma bridge, Rick climbing, football court, swimming pool, etc.  The resort also gives you the opportunity to trek in the vicinity. There is a bonfire with live music. We got a bonus as there were some additional musicians among the guests. A great experience. Spoilers, there were a few monkeys in the area. Also, the area in front of the room was a bit cluttered. I recommend the stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "During our stay their hospitality  was excellent.night music&campfire was enjoyable. Professional and courteous staffs.property was clean and stylish with excellent room service. Adventurous activities were good but they charge 500rs per persons.location of the resort was easily accessible. Food was good can include more non veg items to the menu as well as for the breakfast also they can add few more dishes. Overall its an awesome stay and special thanks to all the staffs for an excellent hospitality",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The Morickap Resort offers a serene escape nestled in nature's embrace. From the moment you arrive, you're greeted with warm hospitality and a breathtaking view of the surrounding landscape. The resort's accommodations are cozy yet luxurious, providing the perfect balance of comfort and rustic charm. Whether you're lounging by the pool, exploring nearby hiking trails, or indulging in delicious local cuisine at the on-site restaurant, every moment at Morickap Resort is a delight. With attentive staff and a tranquil atmosphere, it's the ideal destination for relaxation and rejuvenation.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "It's a beautiful property with great hospitality. There are many activities you can do, your kids can do. Swimming pool is well maintained. Food is really nice...Spa was a nice experience. Evening live music concert was also entertaining. It was a good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good place and well maintained.  Food was good. Need to add more authentic Kerala dishes along with the other choices. Staff was very helpful and kind. Good parking. Rooms are well maintained and good singers in the evening program.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay morickap really good food exceptional experience resort nestled coffee estate nature best activities kids like zip lines burma bridge rick climbing football court swimming pool etc resort also gives opportunity trek vicinity bonfire live music got bonus additional musicians among guests great experience spoilers monkeys area also area front room bit cluttered recommend stay",
                "stay hospitality excellentnight musiccampfire enjoyable professional courteous staffsproperty clean stylish excellent room service adventurous activities good charge rs per personslocation resort easily accessible food good include non veg items menu well breakfast also add dishes overall awesome stay special thanks staffs excellent hospitality",
                "morickap resort offers serene escape nestled natures embrace moment arrive youre greeted warm hospitality breathtaking view surrounding landscape resorts accommodations cozy yet luxurious providing perfect balance comfort rustic charm whether youre lounging pool exploring nearby hiking trails indulging delicious local cuisine onsite restaurant every moment morickap resort delight attentive staff tranquil atmosphere ideal destination relaxation rejuvenation",
                "beautiful property great hospitality many activities kids swimming pool well maintained food really nicespa nice experience evening live music concert also entertaining good experience",
                "good place well maintained food good need add authentic kerala dishes along choices staff helpful kind good parking rooms well maintained good singers evening program"
            ]
        },
        {
            "name": "GReaT trails Wayanad by GRT Hotels",
            "rating": [
                4.7
            ],
            "address": [
                "Puzhakkal, Padinjarathara Road, Post, Pinangode, Vengapally, Kerala 673122, India"
            ],
            "reviews": [
                {
                    "text": "Visited the property with my husband and 7 months old baby. The property is amazing with mesmerizing lush green surrounded nearby the rooms hotel and everywhere. There are many activities for kids and adults . They arrange campfire cultural dance nature walks etc which really adds up to the memorable experience. The hospitality of all the staff members is worth talking about, they keep checking with you often about your experience and if everything is going well during your stay.  All the staff members are very kind and greet the customers very well. There was a foot massage provided by the resort as complimentary however the person didn't seem to be interested since it was just complimentary service, didn't even have an ok experience with the foot massage, apart from it i recommend visiting this resort for your quick vacation from Bangalore.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It was a wonderful experience had courtesy great trails resort. Apart from the mesmerizing location the hospitality was super excellent. Foods was very taste, It was the best resort. Me and my husband had very nice time. Thank you team Great trails Wayanad.\nAnd special thanks too Mr.Albin",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We had a superb stay here in India's one of the best 5 star resorts. What a great hospitality we had here from the resort staff. Property was very clean, stylish with excellent service while we  had dinner. Food was good and great value for money and service was attentive and efficient.\n\nThe rooms ,halls,  food, pool, sports area, the greenery , the staff, the manager, guards -everything was so terrific and fantastic. I have no words to explain. We enjoyed a lot and stay was super comfortable.  Infinity pool was just WOW with such an amazing view\n\nFrom the moment we arrived until departure, the staff exceeded expectations.\" \"Exceptional customer service, with a commitment to making our stay comfortable. Rooms were spotless, and the facilities were well-maintained. The hotel's cleanliness surpassed my expectations. The hotel restaurant offered delicious meals with a diverse menu.\" \"Prompt room service and food that surpassed our expectations.\" Rooms washrooms were the best .We haven't had seen such cleanliness and ambience in washrooms. They were so big in size.\n\nOur welcome was the BEST OF all the time!!\n\nA big and special thanks to Chef Vishnu, Manager Subhash ji, Guard Ramcharan and Massage Girl-MPI. They are so excellent human beings and took care of us like family members\n\nI will surely come again to this beautiful resort .",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "checked out from the property today, had booked 5 rooms in total as i was travelling with my family.\nThe property is very beautiful with good rooms (the ceiling fans are squeaky)and good food but unfortunately the front office/ reception staff were very rude and seemed to be least interested in serving their clients, seemed as if they where forced to work there and looked irritated most of the time.The hotel provided us 15 minutes foot massage but the therapist finished it with just  5-7 min and  wanted to somehow get over with it.\n\nwe had booked 3 rooms for two nights and after this experience ,were thinking of cancelling the booking .Why should we pay our money for this pathetic treatment, it was only because we had no other choice as we couldn’t find any accommodation nearby, so we dropped the plan.\nThe security/bellboys and the lady staff taking orders at the restaurant were really friendly on the other hand, and did their job properly.\nWould recommend the property for the rooms, ambience and not for their service.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very nice resort. Good food, very hospitable staff. They offer bunch of activities during the stay. Very kid friendly. My kid loved the stay. Special thanks to Staff who made our stay so special",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited property husband months old baby property amazing mesmerizing lush green surrounded nearby rooms hotel everywhere many activities kids adults arrange campfire cultural dance nature walks etc really adds memorable experience hospitality staff members worth talking keep checking often experience everything going well stay staff members kind greet customers well foot massage provided resort complimentary however person didnt seem interested since complimentary service didnt even ok experience foot massage apart recommend visiting resort quick vacation bangalore",
                "wonderful experience courtesy great trails resort apart mesmerizing location hospitality super excellent foods taste best resort husband nice time thank team great trails wayanad special thanks mralbin",
                "superb stay indias one best star resorts great hospitality resort staff property clean stylish excellent service dinner food good great value money service attentive efficient rooms halls food pool sports area greenery staff manager guards everything terrific fantastic words explain enjoyed lot stay super comfortable infinity pool wow amazing view moment arrived departure staff exceeded expectations exceptional customer service commitment making stay comfortable rooms spotless facilities wellmaintained hotels cleanliness surpassed expectations hotel restaurant offered delicious meals diverse menu prompt room service food surpassed expectations rooms washrooms best havent seen cleanliness ambience washrooms big size welcome best time big special thanks chef vishnu manager subhash ji guard ramcharan massage girlmpi excellent human beings took care us like family members surely come beautiful resort",
                "checked property today booked rooms total travelling family property beautiful good rooms ceiling fans squeakyand good food unfortunately front office reception staff rude seemed least interested serving clients seemed forced work looked irritated timethe hotel provided us minutes foot massage therapist finished min wanted somehow get booked rooms two nights experience thinking cancelling booking pay money pathetic treatment choice couldnâ\u0080\u0099t find accommodation nearby dropped plan securitybellboys lady staff taking orders restaurant really friendly hand job properly would recommend property rooms ambience service",
                "nice resort good food hospitable staff offer bunch activities stay kid friendly kid loved stay special thanks staff made stay special"
            ]
        },
        {
            "name": "LetStay Adithya Nature Resort & Spa",
            "rating": [
                4
            ],
            "address": [
                "12th bridge, Pookode, lake link road, Jubilee hills, Vythiri, Kerala 673576, India"
            ],
            "reviews": [
                {
                    "text": "I really hated everything about the place. First of all the pool wasn't cleaned. The water was green in colour. The road to it is very steep. Nothing was cleaned and there was also paint ripping off the wall. The food took 2 hours to reach our room and the dirty plates weren't even cleaned untill we checked out. The food was also a letdown and I expected more. Overall the experience was not good. I don't recommend.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Located in a scenic location with many facilities available, the resort gives you an okay-ish experience. The resort has a lot of scope to improve. The villas had very poor lighting even inside the bathroom which surely could be maintained properly. The washbasin inside the bathroom also had poor flow of water with the presence of spider webs inside the rooms as well, as well as the frequent visits by ants and other bugs as part of nature's visitors. The water heater in some of the villas seldom work, and the sheets smell very bad. The blankets provided for extra beds also smelled bad and was very dusty. But the services provided were very good as they did provide fresh sheets after complaining and cleaned the rooms daily. The food was great and so was the entire ambience. The workers helped us with our luggage and with all our necessities. There's plenty of parking available, and the security men and staff were very friendly plus the resort is located away from all the traffic jammed roads ensuring peace for all the visitors.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Adithya Resort and Spa is one of the best hotels/resorts that i ever visited . The staffs/receptionists were really helpful and friendly. The location of the said spot is absolutely perfect. The rooms are well equipped and properly maintained.Food prepared is average . Housekeeping is not upto the mark . Overall ⭐⭐⭐⭐",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The resort is built in a good area with forest like feeling but the rooms need lots of maintenance. Heater not working, steps are broken  in villa. Lots of monkeys in the property so have to be careful with closing window etc. toilets average too much insects inside the rooms like ants.\nFood is very average with limited choices\nParking facility is good and they have place for driver stay and food\n\nIt’s more suited for budget family holiday with kids. The villas are medium expensive",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The morning view from balcony in Nov end with all the mist was worth it. There are different caregories of rooms. Went as a team and got to explore more than 1. The electrical appliances in my room were not functioning intially, which was resolved.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "really hated everything place first pool wasnt cleaned water green colour road steep nothing cleaned also paint ripping wall food took hours reach room dirty plates werent even cleaned untill checked food also letdown expected overall experience good dont recommend",
                "located scenic location many facilities available resort gives okayish experience resort lot scope improve villas poor lighting even inside bathroom surely could maintained properly washbasin inside bathroom also poor flow water presence spider webs inside rooms well well frequent visits ants bugs part natures visitors water heater villas seldom work sheets smell bad blankets provided extra beds also smelled bad dusty services provided good provide fresh sheets complaining cleaned rooms daily food great entire ambience workers helped us luggage necessities theres plenty parking available security men staff friendly plus resort located away traffic jammed roads ensuring peace visitors",
                "adithya resort spa one best hotelsresorts ever visited staffsreceptionists really helpful friendly location said spot absolutely perfect rooms well equipped properly maintainedfood prepared average housekeeping upto mark overall â­\u0090â­\u0090â­\u0090â­\u0090",
                "resort built good area forest like feeling rooms need lots maintenance heater working steps broken villa lots monkeys property careful closing window etc toilets average much insects inside rooms like ants food average limited choices parking facility good place driver stay food itâ\u0080\u0099s suited budget family holiday kids villas medium expensive",
                "morning view balcony nov end mist worth different caregories rooms went team got explore electrical appliances room functioning intially resolved"
            ]
        },
        {
            "name": "Windflower Resorts & Spa Vythiri Wayanad",
            "rating": [
                4.2
            ],
            "address": [
                "Annapoorna Estate, Survey No. 40/ 2B, Resurvey No. 330/1, Vythiri Taluk, Achoornam, Kerala 673575, India"
            ],
            "reviews": [
                {
                    "text": "Stayed there with my family for 5 days and had the fantastic time.\nThe villa we stayed at windflower was very spacious with a living room, bedroom, big glass covered bathroom and a balcony with jacuzzie. Entire villa was Extremely clean with all the luxury amenities including Bedsheets and towels were maintained really well.\nRoom Service and in-room dinning was phenomenal. The staffs were friendly and all just a phone call away and easy to reach all services and they have showed up without any delay. Food is all good with what they had and needs some more different varieties in vegetarian. 😄",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Windflower Resort & spa is located in a quiet place in wayanad, surrounded by a tea estate. The resort is so big and cool, the rooms are so big and have a luxurious look, especially the bathroom. The balcony and hall are also so good. It is located at the top of the hill, where the view is so good. Spa service is good, valet parking is there. A morning tea estate wall is also offered.  The negative point is the taste of food should be improved and the swimming pool is not so good. Must try resort for relaxation.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Pampered by the hospitality.great room with splendid view. Bathroom was very spacious and clean. Right from day one to the last day of our journey - the service folks were always there to help with a big smile.food was too good- enjoyed by kids also-  the spread was  varied each day and enjoyable.Firecamp on request.Kids had games to play- carrom swimming pool,snake and ladder,chess,badminton,basket ball etc....enjoyed a well spent family time with family and friends in the resort",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Overall Moderate experience.\nRooms are big and decent view of mountains.\nVillas have quite big jacuzzi.\nNeeds to improve on service and hospitality, doesnt feel the luxury for cost you pay. Similar resorts have a better hospitality.\nFood options are minimal but kind of just enough as it has what you need. Only beer available.\nBreakfast spread is good enough.\nHi-tea is paid.\nFood service was late.\nStaff are friendly, quite are few can speak English.\nThey have good swimming pool, spa. Kids play area needs improvement and also indoor games needs maintenance.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms are big but lack luxury for the amount you pay. TV is kept opposite the bed and you cannot watch sitting on the bed. Room flooring is very old and tiles are loose. The bathroom is very big but the cleanliness is ok. Kindly check other resorts before booking. There are no activities at all such as the play area / games are very old and broken.\nFood is good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed family days fantastic time villa stayed windflower spacious living room bedroom big glass covered bathroom balcony jacuzzie entire villa extremely clean luxury amenities including bedsheets towels maintained really well room service inroom dinning phenomenal staffs friendly phone call away easy reach services showed without delay food good needs different varieties vegetarian ð\u009f\u0098\u0084",
                "windflower resort spa located quiet place wayanad surrounded tea estate resort big cool rooms big luxurious look especially bathroom balcony hall also good located top hill view good spa service good valet parking morning tea estate wall also offered negative point taste food improved swimming pool good must try resort relaxation",
                "pampered hospitalitygreat room splendid view bathroom spacious clean right day one last day journey service folks always help big smilefood good enjoyed kids also spread varied day enjoyablefirecamp requestkids games play carrom swimming poolsnake ladderchessbadmintonbasket ball etcenjoyed well spent family time family friends resort",
                "overall moderate experience rooms big decent view mountains villas quite big jacuzzi needs improve service hospitality doesnt feel luxury cost pay similar resorts better hospitality food options minimal kind enough need beer available breakfast spread good enough hitea paid food service late staff friendly quite speak english good swimming pool spa kids play area needs improvement also indoor games needs maintenance",
                "rooms big lack luxury amount pay tv kept opposite bed watch sitting bed room flooring old tiles loose bathroom big cleanliness ok kindly check resorts booking activities play area games old broken food good"
            ]
        },
        {
            "name": "Amrezy Resort and Spa by StrideHotels",
            "rating": [
                4.7
            ],
            "address": [
                "Amrezy Resort Rd, Chelode, Kerala 673576, India"
            ],
            "reviews": [
                {
                    "text": "Amrezy Spa and resorts by Strides is really good. The service was good and the rooms are spic and span. Food quantity could be a little better, but is definitely served hot and nice. The location is not very interior, quite close to Wayanad bus station. The view from the balcony is beautiful!!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "One of the best resort to stay with family. Calm atmosphere, well maintained places. The views from balcony were fantastic. They only need to improve their response and timing. For everything we need to wait for a long!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Amrezy is a great place, which offers a amazing holiday destination. Me and my wife stayed here for 5days and 4 nights - Not even one day we felt the food was okay or not that great.\nFood is top notch and a great hospitality. Snacks in the evening with Kerala style menu gives a glimpse of authentic Kerala food - 5/5\nRooms - Panaroma view rooms are great with an amazing view once you wake up, but the rooms are not like a suite. Hence people preferring to have a bigger space, might feel little crushed- 4/5.\nServices - Dnt use much of indoor games but outdoor games like football, cricket and badminton place is good. Swimming pool is open from 8.00am to 8.00pm, the pool is very small and the max depth is 4’ feet. Which means pool is meant for kids play and not for adult - 3/5.\nOverall a great place to visit during monsoon and during summer too. During summer mornings are misty but later the day it’s a bit hot. But if you’re staying in the room with AC on, you will feel pleasant and with an amazing view from the room glazing or balcony space - 5/5",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Stayed with family for 2days, it was a very wonderful experience with nature. It is located in such a place. Very neatly maintained and very friendly staff. I recommend this resort for the wonderful stay with your family. Food is very good and clean.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Had an awesome stay! The staff was super helpful and their smiles made us feel at home. They let us check in early and check out late. The resort is nestled in a serene hill area, surrounded by trees. Rooms are well-kept, and the balcony view is lovely. The food was delicious, especially the pre-booked dinner with a set menu and the tasty buffet breakfast. The juices was very fresh and tasty. Perfect spot for a relaxing getaway with your special ones.\n\nTwo suggestions for the management:\n\n1) Consider adding a manual lock inside the rooms to enhance security. During our early check-in, a staff member accidentally opened the door, possibly for room inspection before the next check-in. A manual lock would prevent such instances.\n2) Instead of two beds placed together, consider having one king bed for better sleeping comfort. This adjustment would significantly improve the overall sleeping experience for guests.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amrezy spa resorts strides really good service good rooms spic span food quantity could little better definitely served hot nice location interior quite close wayanad bus station view balcony beautiful",
                "one best resort stay family calm atmosphere well maintained places views balcony fantastic need improve response timing everything need wait long",
                "amrezy great place offers amazing holiday destination wife stayed days nights even one day felt food okay great food top notch great hospitality snacks evening kerala style menu gives glimpse authentic kerala food rooms panaroma view rooms great amazing view wake rooms like suite hence people preferring bigger space might feel little crushed services dnt use much indoor games outdoor games like football cricket badminton place good swimming pool open pm pool small max depth â\u0080\u0099 feet means pool meant kids play adult overall great place visit monsoon summer summer mornings misty later day itâ\u0080\u0099s bit hot youâ\u0080\u0099re staying room ac feel pleasant amazing view room glazing balcony space",
                "stayed family days wonderful experience nature located place neatly maintained friendly staff recommend resort wonderful stay family food good clean",
                "awesome stay staff super helpful smiles made us feel home let us check early check late resort nestled serene hill area surrounded trees rooms wellkept balcony view lovely food delicious especially prebooked dinner set menu tasty buffet breakfast juices fresh tasty perfect spot relaxing getaway special ones two suggestions management consider adding manual lock inside rooms enhance security early checkin staff member accidentally opened door possibly room inspection next checkin manual lock would prevent instances instead two beds placed together consider one king bed better sleeping comfort adjustment would significantly improve overall sleeping experience guests"
            ]
        },
        {
            "name": "Hipnoetic Stays",
            "rating": [
                4.8
            ],
            "address": [
                "Hipnoetic Tea Planters Bungalow, Achoor Estate Road, Peringoda, Pozhuthana, Kerala 673575, India"
            ],
            "reviews": [
                {
                    "text": "My experience was nothing short of magical, and can confidently say that this establishment has set a new standard for hospitality in Wayanad. If you're looking for an unforgettable stay,Hipnoetic stay is the place to be.\n\nWhat truly stood out was the warmth and hospitality of the staff. From the moment i arrived, were greeted with genuine smiles and a level of courtesy that made me feel truly welcome. Each staff member went above and beyond to ensure our comfort, making our stay a memorable one.\n\nThe meals were a culinary journey through Kerala, with an impressive array of dishes that showcased the best of local cuisine. Every bite was a celebration of taste.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "This was an amazing stay for us in the geodesic domes. It’s a one of a kind property set out in a tea plantation with lots of nooks to just laze around and enjoy the surrounds. The dome itself is well equipped and aesthetically designed, along with the deck chairs and a small framed hammock jutting out overlooking the plantation. The staff was also very warm and welcoming.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I visited with my family just for a night mainly to experience a dome styled stay. Glad we chose Hipnoetic stays. Every aspect about this property is very thoughtfully planned. Right from no desk concept at the reception till the many many outdoor seating areas and many many swings and huts. The property owner and her team are wonderful people. We can't forget our conversation with the owner mam who was very much willing to offer any kind of support even after we check out. Kudos to the entire team.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Had stayed for 2 nights at the property, lovely dome rooms with a great view. Even the rooms inside the bungalow were equally good , super spacious, and had a good vintage vibe.\nThe property had cute little outdoor corners everywhere to sit and relax! Great property to go with your family friends or with your spouse.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "We recently stayed here nestled in the serene hills, and it was an unforgettable experience. The breathtaking scenery truly took our breath away. Our accommodation was cozy and well-equipped, providing a comfortable retreat. We enjoyed both  Dome and Bungalow. I liked the Bungalow more though -)\n\nThe staff were exceptionally friendly and attentive, ensuring that every aspect of our stay was enjoyable. Dining options were limited but delicious, with fresh, locally sourced ingredients shining in every dish.\n\nWhile the resort was on the pricier side, the exceptional quality and service made it worth every penny. The journey to the resort was straightforward, with ample parking available. Additionally, I appreciated the resort's commitment to sustainability, evident in their eco-friendly practices. Overall, our stay was a perfect escape from the hustle and bustle of city life, and I would highly recommend it to anyone seeking a rejuvenating retreat in the hills.\n\nThanks to Aashiq (which mean lover in Hindi :P), Jaison, Henna for making this stay memorable.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience nothing short magical confidently say establishment set new standard hospitality wayanad youre looking unforgettable stayhipnoetic stay place truly stood warmth hospitality staff moment arrived greeted genuine smiles level courtesy made feel truly welcome staff member went beyond ensure comfort making stay memorable one meals culinary journey kerala impressive array dishes showcased best local cuisine every bite celebration taste",
                "amazing stay us geodesic domes itâ\u0080\u0099s one kind property set tea plantation lots nooks laze around enjoy surrounds dome well equipped aesthetically designed along deck chairs small framed hammock jutting overlooking plantation staff also warm welcoming",
                "visited family night mainly experience dome styled stay glad chose hipnoetic stays every aspect property thoughtfully planned right desk concept reception till many many outdoor seating areas many many swings huts property owner team wonderful people cant forget conversation owner mam much willing offer kind support even check kudos entire team",
                "stayed nights property lovely dome rooms great view even rooms inside bungalow equally good super spacious good vintage vibe property cute little outdoor corners everywhere sit relax great property go family friends spouse",
                "recently stayed nestled serene hills unforgettable experience breathtaking scenery truly took breath away accommodation cozy wellequipped providing comfortable retreat enjoyed dome bungalow liked bungalow though staff exceptionally friendly attentive ensuring every aspect stay enjoyable dining options limited delicious fresh locally sourced ingredients shining every dish resort pricier side exceptional quality service made worth every penny journey resort straightforward ample parking available additionally appreciated resorts commitment sustainability evident ecofriendly practices overall stay perfect escape hustle bustle city life would highly recommend anyone seeking rejuvenating retreat hills thanks aashiq mean lover hindi p jaison henna making stay memorable"
            ]
        },
        {
            "name": "Indeevara Retreat- Vythiri, Eco Friendly Luxury Resort",
            "rating": [
                4.4
            ],
            "address": [
                "Pookkode Lake Banasura Sagar Cross Road 16 Kolichal, Vythiri, Kerala 673576, India"
            ],
            "reviews": [
                {
                    "text": "Very Good Experience!! Stayed for 4 nights and the experience across room cleanliness, food, activities, service and spa was amazing.\n\nBreakfast Buffet Spread is pretty decent. We took package of dinner as well and it was good.\n\nRoom were spacious and clean.\n\nActivities include indoor games, pool, badminton etc.,\n\nDon’t miss their Kerala ayurvedic spa. I went for their signature spa and was worth the price.\n\nOverall value for money.\n\nElderly people may find it little difficult for ascend and descend as the rooms are on top of a cliff.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "From the moment we stepped foot onto the grounds of this resort, we were greeted with warmth and hospitality. The amenities were top-notch, the food was exquisite, and the accommodations were luxurious and also treat yourself to a massage or spa - you won't regret it. Truly an unforgettable experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The resort as a whole is awesome. With superb views and a lot of fun stuff to enjoy. Had a great time here. We took the pool villa and the stay here was so much relaxing. They even have spa but we did not get enough time to explore it. As a whole good place for a relaxing weekend.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had a nice and pleasant stay here. Staff is very co-operative and professional. Food served is tasty, however, there is lack of variety in food. That is the only feedback we can think of.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "It was a calm and peaceful stay. Complete nature. Special thanks to Mr.Sasikumar for his friendly guidance. A special mention about Mr. Fazil, Ms.Anju and Mr.Abimanyu for their hospitality, patience,  politeness and outstanding food served over there. Almost all the staff make us feel homely. I highly recommend this resort. Thank you.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good experience stayed nights experience across room cleanliness food activities service spa amazing breakfast buffet spread pretty decent took package dinner well good room spacious clean activities include indoor games pool badminton etc donâ\u0080\u0099t miss kerala ayurvedic spa went signature spa worth price overall value money elderly people may find little difficult ascend descend rooms top cliff",
                "moment stepped foot onto grounds resort greeted warmth hospitality amenities topnotch food exquisite accommodations luxurious also treat massage spa wont regret truly unforgettable experience",
                "resort whole awesome superb views lot fun stuff enjoy great time took pool villa stay much relaxing even spa get enough time explore whole good place relaxing weekend",
                "nice pleasant stay staff cooperative professional food served tasty however lack variety food feedback think",
                "calm peaceful stay complete nature special thanks mrsasikumar friendly guidance special mention mr fazil msanju mrabimanyu hospitality patience politeness outstanding food served almost staff make us feel homely highly recommend resort thank"
            ]
        },
        {
            "name": "Jeevess Ayurveda Resort",
            "rating": [
                4.8
            ],
            "address": [
                "JEEVESS AYURVEDIC HOSPITAL AND RESEARCH PVT LTD, PO, Vythiri, Kerala 673575, India"
            ],
            "reviews": [
                {
                    "text": "Lush property with plenty to do and amazing staff. This is ideal for a relaxing vacation.\nThe in house kitchen is very good. Yoga and Kalaripayattu trainer were very helpful\nThis resorts sits on top of a hill with great views; to get to these views you have to cover a little over 1km on mud road. The hotel staff informed us beforehand and were always available to help",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I stayed a week at Jeevess. I had a lovely time. The location is amazing, in the forest, and  surrounded only by nature. The design of the resort with the rooms and all is great as well, with beautiful views. The staff is very kind, they are very genuine, nurturing and caring. My treatments were great and I truly enjoyed the yoga and kalari sessions. I will definitely come back.\n\nSuggestion: the food is very limited for an expat, also no diversity . For someone that is not used to indian spices and flavors it was a bit difficult. Some international healthy diet dishes cooked without spices and curries will be great.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Stayed 6 nights here it was pleasant and wonderful stay. It is peaceful, close to nature and great ambiance. Nice staff and their service.\nEn Ooru Tribal Village, Pookode Lake, Vythiri Park, Lakkidi View Point and Chain tree are nearer to Resort.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The resort ambience was lovely & very serene. We thoroughly enjoyed our stay. The staffs were always motivated to help us. The food was excellent, We Would like to thank the entire team for making our stay very cozy and comfortable",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Blissful experience. Was so calming to wake up to the misty views from balcony and hear the dripping sounds of water drops dropping from the trees due to the mist. Liked the peaceful vibe of the small library, morning/evening walks in the resort around the fish pond, tea plants etc.\n\nFood is decent but do not expect a wide spread like a traditional 4/5 star hotels.\n\nGreat staff, always welcoming and greeting.\n\nOnly issue is the off-road that spawns over 1-2 kms before the resort. While smaller cars can also get through, it would be great to have a better road as we might visit one another time if we plan for a trip around Wayanad.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "lush property plenty amazing staff ideal relaxing vacation house kitchen good yoga kalaripayattu trainer helpful resorts sits top hill great views get views cover little km mud road hotel staff informed us beforehand always available help",
                "stayed week jeevess lovely time location amazing forest surrounded nature design resort rooms great well beautiful views staff kind genuine nurturing caring treatments great truly enjoyed yoga kalari sessions definitely come back suggestion food limited expat also diversity someone used indian spices flavors bit difficult international healthy diet dishes cooked without spices curries great",
                "stayed nights pleasant wonderful stay peaceful close nature great ambiance nice staff service en ooru tribal village pookode lake vythiri park lakkidi view point chain tree nearer resort",
                "resort ambience lovely serene thoroughly enjoyed stay staffs always motivated help us food excellent would like thank entire team making stay cozy comfortable",
                "blissful experience calming wake misty views balcony hear dripping sounds water drops dropping trees due mist liked peaceful vibe small library morningevening walks resort around fish pond tea plants etc food decent expect wide spread like traditional star hotels great staff always welcoming greeting issue offroad spawns kms resort smaller cars also get would great better road might visit one another time plan trip around wayanad"
            ]
        },
        {
            "name": "Tea Terrace Vythiri Resort",
            "rating": [
                4.7
            ],
            "address": [
                "near Mount Abu, 13/250B, POST, VALIYAPARA, Achooranam, Kerala 673575, India"
            ],
            "reviews": [
                {
                    "text": "Our stay at the resort was incredibly peaceful and serene, with breathtaking views from every corner. We recently spent a few days there, welcoming the new year in 2024, and had an amazing time with our best friends! A special thanks to Mr. Owner and the entire staff, with a special mention to Ubaid/Ubair.\n\nThey went above and beyond to ensure our comfort in every possible way. The food they served was not only delectable but also surpassed our expectations. We found ourselves spending most of our time in the dining area, where the atmosphere was delightful. The trampoline was a big hit with the kids. Overall, we were delightfully pleased with our stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This is my second time visiting tea terrace vythiri  and I can say undoubtedly say they do an absolutely wonderful job everytime. The cottages have a very quaint charm about them while being spotless. The place itself is a very unique experience to be staying amidst a tea garden overlooking the hills. The Sunsets and sunrises from the rooms were absolute stunners. Service was prompt and Ubaid has  been a huge help during both my visits. The food tastes very home like and not restaurant types, which is what I personally prefer and I just loved that too. They're also expanding everytime with something new like rain dance and a pool wishing all the best to tea terrace for their future endeavours.\nA personal suggestion would be to fix the approach road the last 1km is not an easy drive. And the food is on a slightly expensive side.\nOtherwise a great experience,  Sure to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The tea terrace vythiri resort location was unbeatable, with stunning views of tea plantations and mountains from every room and cottage .large spacious rooms that  front and rear sitting decks to soak into the nature . All cottages are surrounded with lush green plantations and varieties of floras for a perfect beautiful view all around the property. There is an internal short trail that leads  to forest for the lovely exotic forest walks . I loved their authentic ayurvedic spa therapy that was relaxing and therapeutic.\nThe property is located in a quiet and serene place further of Vythiri. However the access road leading to hotel is not in a good condition and public transportation or other facilities are not nearby. Good to have own vehicle or hire transport , but at slightly high charges.\nNevertheless, the attention to detail in every corner of room and property , quality service, and adequate facilities make it the perfect choice for any traveler.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Amazing Resort and Amazing People!!👌🏻👌🏻😊 Few places inspire you to write a review…Tea Resort Vythiri, Wayanad is one such place.  Had a memorable family vacation at this enchanting resort built right within a tea estate.  Everyone including the children and senior citizens enjoyed the warm hospitality as the people at this resort go out of their way to ensure that everyone is well taken care of. The kids were busy enjoying the recreation room with books, table tennis, carrom, golf etc. There are hammocks and a trampoline too. Had a relaxing Kerala Ayurveda massage at the spa. The restaurant serves fresh and delicious food.  The Spanish themed villas are so cozy, clean and comfortable that you will not want to step out of this place.  It’s that beautiful.  Special thanks to Rafic and Ubaid who were so generous and caring.  Surreal experience.🙏🏻😊\nWant to pamper your mind, body and soul? Then reserve this place for your next vacation……",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Awesome place for calm and serene beauty of tea gardens. Staff is very courteous. The last 1 km drive to reach  resort is very stiff.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay resort incredibly peaceful serene breathtaking views every corner recently spent days welcoming new year amazing time best friends special thanks mr owner entire staff special mention ubaidubair went beyond ensure comfort every possible way food served delectable also surpassed expectations found spending time dining area atmosphere delightful trampoline big hit kids overall delightfully pleased stay",
                "second time visiting tea terrace vythiri say undoubtedly say absolutely wonderful job everytime cottages quaint charm spotless place unique experience staying amidst tea garden overlooking hills sunsets sunrises rooms absolute stunners service prompt ubaid huge help visits food tastes home like restaurant types personally prefer loved theyre also expanding everytime something new like rain dance pool wishing best tea terrace future endeavours personal suggestion would fix approach road last km easy drive food slightly expensive side otherwise great experience sure visit",
                "tea terrace vythiri resort location unbeatable stunning views tea plantations mountains every room cottage large spacious rooms front rear sitting decks soak nature cottages surrounded lush green plantations varieties floras perfect beautiful view around property internal short trail leads forest lovely exotic forest walks loved authentic ayurvedic spa therapy relaxing therapeutic property located quiet serene place vythiri however access road leading hotel good condition public transportation facilities nearby good vehicle hire transport slightly high charges nevertheless attention detail every corner room property quality service adequate facilities make perfect choice traveler",
                "amazing resort amazing peopleð\u009f\u0091\u008cð\u009f\u008f » ð\u009f\u0091\u008cð\u009f\u008f » ð\u009f\u0098\u008a places inspire write reviewâ\u0080¦tea resort vythiri wayanad one place memorable family vacation enchanting resort built right within tea estate everyone including children senior citizens enjoyed warm hospitality people resort go way ensure everyone well taken care kids busy enjoying recreation room books table tennis carrom golf etc hammocks trampoline relaxing kerala ayurveda massage spa restaurant serves fresh delicious food spanish themed villas cozy clean comfortable want step place itâ\u0080\u0099s beautiful special thanks rafic ubaid generous caring surreal experienceð\u009f\u0099\u008fð\u009f\u008f » ð\u009f\u0098\u008a want pamper mind body soul reserve place next vacationâ\u0080¦â\u0080¦",
                "awesome place calm serene beauty tea gardens staff courteous last km drive reach resort stiff"
            ]
        },
        {
            "name": "Pranavam Resort",
            "rating": [
                4.6
            ],
            "address": [
                "Vasudeva Edom Pozhuthana, P.O, Peringoda, Vythiri, Pozhuthana, Kerala 673575, India"
            ],
            "reviews": [
                {
                    "text": "A must stay if any is planning to visit Wayanad.\nWe really enjoyed our stay. I had my pet GSD with me and they boarder her without any hassle. Loved the food and it was prepared fresh. View from the cottage was an absolute beauty. A bit shout out for room cleanliness.\nBut, I would recommend the management to install bigger AC in the cottage.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We had a reunion of old friends at Pranavam last week. The experience was memorable because of the scenic location and wonderful service. The rooms were large, well appointed and very comfortable. The common areas are ideal for group activities. Value for money!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best resort in Vythiri.\n\nRooms : Spacious, clean, and with a magnificent view from the balcony.\n\nStaff : very much helpful and supportive.\n\nLocation  : Right in the middle of nature.\n\nAmenities: Clean swimming pool, snooker table, swings, and some children games.\n\nFood: Hygienic but average in taste.\n\nPrice : It is value for money for sure.\n\nOverall experience: Wonderful. I would definitely love to visit again 💕 ☺️",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I stayed at this property for 4 nights with family and friends in March 2023. Room was clean and vary large. Stay was very comfortable, staff was helpful and cooperative, they provided lovely local cuisine. Pool gave us opportunity to enjoy swimming and games.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We stayed at Pranavam for four days during our Veteran Air Force Officers reunion. Our stay was comfortable and enjoyable. Excellent response from the Owner and his entire staff. Excellent location. Great stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "must stay planning visit wayanad really enjoyed stay pet gsd boarder without hassle loved food prepared fresh view cottage absolute beauty bit shout room cleanliness would recommend management install bigger ac cottage",
                "reunion old friends pranavam last week experience memorable scenic location wonderful service rooms large well appointed comfortable common areas ideal group activities value money",
                "best resort vythiri rooms spacious clean magnificent view balcony staff much helpful supportive location right middle nature amenities clean swimming pool snooker table swings children games food hygienic average taste price value money sure overall experience wonderful would definitely love visit ð\u009f\u0092\u0095 â\u0098ºï¸\u008f",
                "stayed property nights family friends march room clean vary large stay comfortable staff helpful cooperative provided lovely local cuisine pool gave us opportunity enjoy swimming games",
                "stayed pranavam four days veteran air force officers reunion stay comfortable enjoyable excellent response owner entire staff excellent location great stay"
            ]
        }
    ]
}