{
    "places_with_reviews": [
        {
            "name": "Hotel Rays Inn Boarding & Lodging",
            "rating": [
                4.7
            ],
            "address": [
                "Junction, Guruvayankere, Belthangady, Karnataka 574217, India"
            ],
            "reviews": [
                {
                    "text": "The lodge is bang on the Guruvayunkere main road. A good location, clean and well ventilated, well connected. Good eatery options nearby.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Room cost is only 1800 rs per day but it feels like a start hotel and the amenities are excellent.\nRooms are very clean and hygiene,  very friendly staffs. I strongly recommend this place and i would like to give 5 star rating",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Most friendly and helpul receptionists and staffs ever, lovely impression of Hotel Rays Inn. Everything about the lodge was exceptional. It was clean, stylish with excellent service.\nFood was good and great value for money and service was attentive.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The rooms were very good , the staffs were also very friendly and responsive , car parking space was also there , there is the restaurant beside this building in the same premises . I searched this rooms online , contacted through phonecall  and paid online , it was worth it staying here .",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best rooms and affordable prices. Great staff and service",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "lodge bang guruvayunkere main road good location clean well ventilated well connected good eatery options nearby",
                "room cost rs per day feels like start hotel amenities excellent rooms clean hygiene friendly staffs strongly recommend place would like give star rating",
                "friendly helpul receptionists staffs ever lovely impression hotel rays inn everything lodge exceptional clean stylish excellent service food good great value money service attentive",
                "rooms good staffs also friendly responsive car parking space also restaurant beside building premises searched rooms online contacted phonecall paid online worth staying",
                "best rooms affordable prices great staff service"
            ]
        },
        {
            "name": "NavaShakthi Residency",
            "rating": [
                4.6
            ],
            "address": [
                "X7P3+F69, Guruvayankere, Karnataka 574217, India"
            ],
            "reviews": [
                {
                    "text": "Surprisingly neat and beautiful for a small town like Guruvaynkere.. very spacious air conditioned rooms with bath facility. Had a very pleasant stay here..",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Decent rooms at decent price. Good costumer services. Toilet, room bed,bed sheet, towels every thing is clean. All the employees are costumer friendly. I will recommend this residency to everyone who is searching for a place to stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good lodge with good amneties but Room rent is on higher side for a place like Guruvayana kere",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Visited for a lunch , best ambience, must try egg ghee roast and egg curry which was too good. The staff who served was very kind.\nMust visit resto near guruvayankere.\nU can eat listening to music here which is speciality of this place.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Excellent rooms,\nWorthy\nValue for money",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "surprisingly neat beautiful small town like guruvaynkere spacious air conditioned rooms bath facility pleasant stay",
                "decent rooms decent price good costumer services toilet room bedbed sheet towels every thing clean employees costumer friendly recommend residency everyone searching place stay",
                "good lodge good amneties room rent higher side place like guruvayana kere",
                "visited lunch best ambience must try egg ghee roast egg curry good staff served kind must visit resto near guruvayankere u eat listening music speciality place",
                "excellent rooms worthy value money"
            ]
        },
        {
            "name": "PARIKRAMA Lodging",
            "rating": [
                3.4
            ],
            "address": [
                "ramakrishna nivas main road, X7RM+H2C, Belthangady, Karnataka 574214, India"
            ],
            "reviews": [
                {
                    "text": "Very worst place,beds n room condition is very bad n no hot water facility,even after booking the room before 3 to 4 days they will give our room to a different customers n ask us to stay in a worst room never visit",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Horrible rooms and worst owner attitude.\n1. First the owner didn't remember our booking, we had to wait for good 20 min to get our room.\n2. Finally after getting our room, entered into stinky room and unhygienic bathrooms. The ac was stuck at 27degrees and could not be operated.\n3. There were cockroaches to greet us in the room.\n4. When we said 1500 is highly overrated for such poorly maintained room, the owner was so stubborn to say that for such price you get only such rooms! Previous day we stayed in Mahamaya residency (Subrahmanya) for the same price where the rooms were super clean and service was awesome.\n5. The owner was not willing to agree that the rooms are not at all clean.\n6. Only good thing was the room service guy who tried his best to help us with the ac and luggage.\nPLEASE AVOID THIS PLACE AS THE OWNER IS HIGHLY UNGRATEFUL AND THE PLACE IS YUCK!",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Bathroom was very old it was not nice overall room was desent",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Don't come here at any cost even if hygine matters even 1% to you. Worst place that I have ever stayed. Washrooms are really bad. They have one good room in first floor and it's photos have been used everywhere. Lot of musquitos. Even public washrooms are better than this :(\nI wish there was 0 star",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Very Bad experience and worst maintenance of washroom. price also increased than discussed in phone contact. They people even don't how to deal with client. Moreover very bad experiences and rubbish people",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst placebeds n room condition bad n hot water facilityeven booking room days give room different customers n ask us stay worst room never visit",
                "horrible rooms worst owner attitude first owner didnt remember booking wait good min get room finally getting room entered stinky room unhygienic bathrooms ac stuck degrees could operated cockroaches greet us room said highly overrated poorly maintained room owner stubborn say price get rooms previous day stayed mahamaya residency subrahmanya price rooms super clean service awesome owner willing agree rooms clean good thing room service guy tried best help us ac luggage please avoid place owner highly ungrateful place yuck",
                "bathroom old nice overall room desent",
                "dont come cost even hygine matters even worst place ever stayed washrooms really bad one good room first floor photos used everywhere lot musquitos even public washrooms better wish star",
                "bad experience worst maintenance washroom price also increased discussed phone contact people even dont deal client moreover bad experiences rubbish people"
            ]
        },
        {
            "name": "OYO 72877 Fanateer Lodge",
            "rating": [
                4.5
            ],
            "address": [
                "01, mangalore, Mangalore - Dharmastala Hwy, Guruvayankere, Karnataka 574217, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are nice big & Parking Space. But they lack lots services, waste of money to be honest if you staying there.\n1. Rooms are dusty and smells like a dust,\n2. No toiletries, bath towel provided.\n3. Bed covers are used, you will find lots hair and dust. Rooms are not REFRESHING\n4. No WIFI\n5. Breakfast/Tea/Coffee not provided, (they should at least provide tea/coffee for the guest with payment).\n6. No Guest Service, no one will come to clean room or pick your garbage\n7. No Water or Tea Kettle for drinking hot water\n8. AC Cooling is not that great\n9. No Taxi Service, they are least bothered to arrange too (below you will find tours and travels office but they were the MOST LOUSY staff, they couldn’t guide or book any tickets for our family). If you staying here, make sure you have car or other options to return to hotel etc, you wont find OLA and other taxi service there.\n\nInstead, Pls find other place to stay, if you want to stay for night and leave next day then it’s ok to adjust but still not justified if you paying good amount!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Never thought a remote location could have such a well maintained place. Rooms were spacious, a bit of dusting was needed in the bathroom as i found a couple of spider web and a spider 😅.\n\nThey have an online UPI payment method too if just in case we run short of cash. Drinks such as water or cold drinks can be procured from the reception at additional standard cost. Food is one main concern in the hotel or surrounding as there are no proper restaurants which I can suggest.\n\nIt's pretty close to the main guruvenkere busstand so it hardly takes 5-10mins walking.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The rooms were big enough. However it needs proper maintenance. Rooms were not cleaned properly before handing it over to us. Price was on the higher side.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We went there without a booking as the number and link provided here was from OYO but they have withdrawn from Oyo. There was only a suite available and we had to take the larger room instead of a double room. Very good and big rooms. Slightly premium cost but the rooms are worth it. Would recommend staying here if cost is not a concern and comfort is important. They have parking space for about 5-6 4 wheelers.\nThere's a couple of clothing stores below and a gym (not part of the hotel).\nThe town center is walkable and there are multiple restaurants in walkable distance.\nThe staff at the hotel were very courteous. Even though they don't have a restaurant of their own they provided room service by ordering and picking up the food and delivering it to us at the room.\nThe best part was they have 24 hours checkout. It is particularly important if you are driving here and reach at odd hours.\nTowels were provided, the bathroom was clean and has all modern fittings. There was a TV but didn't seem like there was a set top box. Didn't matter to us but if you need it better confirm with the front desk.\nWe got a suite that had a front living area and a bedroom separated by a door. Can easily accommodate 4-5 members if they allow extra beds.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Well maintained, clean rooms unexpected in a town near Dharmasthala. Good location, 24hrs check in-out facility. Families, Friends can use this.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms nice big parking space lack lots services waste money honest staying rooms dusty smells like dust toiletries bath towel provided bed covers used find lots hair dust rooms refreshing wifi breakfastteacoffee provided least provide teacoffee guest payment guest service one come clean room pick garbage water tea kettle drinking hot water ac cooling great taxi service least bothered arrange find tours travels office lousy staff couldnâ\u0080\u0099t guide book tickets family staying make sure car options return hotel etc wont find ola taxi service instead pls find place stay want stay night leave next day itâ\u0080\u0099s ok adjust still justified paying good amount",
                "never thought remote location could well maintained place rooms spacious bit dusting needed bathroom found couple spider web spider ð\u009f\u0098 online upi payment method case run short cash drinks water cold drinks procured reception additional standard cost food one main concern hotel surrounding proper restaurants suggest pretty close main guruvenkere busstand hardly takes mins walking",
                "rooms big enough however needs proper maintenance rooms cleaned properly handing us price higher side",
                "went without booking number link provided oyo withdrawn oyo suite available take larger room instead double room good big rooms slightly premium cost rooms worth would recommend staying cost concern comfort important parking space wheelers theres couple clothing stores gym part hotel town center walkable multiple restaurants walkable distance staff hotel courteous even though dont restaurant provided room service ordering picking food delivering us room best part hours checkout particularly important driving reach odd hours towels provided bathroom clean modern fittings tv didnt seem like set top box didnt matter us need better confirm front desk got suite front living area bedroom separated door easily accommodate members allow extra beds",
                "well maintained clean rooms unexpected town near dharmasthala good location hrs check inout facility families friends use"
            ]
        },
        {
            "name": "D.K. Lodge",
            "rating": [
                2.3
            ],
            "address": [
                "X7QG+MCH, Belthangady, Karnataka 574214, India"
            ],
            "reviews": [
                {
                    "text": "Wash room cold water was not come. Lodge mangement  not rospond properly.  TV also notworkin\n\nComenacation.And",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                },
                {
                    "text": "I visited DK lodge, that staff behaviour is very rude and spoked bad language i just asked to want to see rooms how it is. \"He replied why you want to see room and all, if u want room just book and stay otherwise u go back\" he used very bad language. Pls take action about this",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                },
                {
                    "text": "Not suggested at all. They dont have any cleaning and hygiene concept. Pillows were full of fungus wash basins are not cleaning at least for months. Similarly any other parts in the room.",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                },
                {
                    "text": "One off the best lodge ever",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                },
                {
                    "text": "Worst service.. Staff behave like their boss",
                    "languageCode": "en",
                    "rating": [
                        2.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wash room cold water come lodge mangement rospond properly tv also notworkin comenacationand",
                "visited dk lodge staff behaviour rude spoked bad language asked want see rooms replied want see room u want room book stay otherwise u go back used bad language pls take action",
                "suggested dont cleaning hygiene concept pillows full fungus wash basins cleaning least months similarly parts room",
                "one best lodge ever",
                "worst service staff behave like boss"
            ]
        },
        {
            "name": "SUNROCK BALIPA RESORT",
            "rating": [
                4.9
            ],
            "address": [
                "Chandkuru Road, Kuthrottu Rd, Nadu, Belthangady, Karnataka 574214, India"
            ],
            "reviews": [
                {
                    "text": "I recently stayed at this incredible resort, and it exceeded all my expectations. The breathtaking scenery, luxurious accommodations, and impeccable service made for an unforgettable experience. The staff was not only friendly but also went above and beyond to ensure every detail was perfect. The diverse range of amenities, from facilities to gourmet dining options, catered to all preferences. I highly recommend this resort to anyone seeking a blissful retreat and can't wait to return for another memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "The resort offers a picturesque escape with breathtaking views of both the serene river and the Jamalabad fort, adding cultural charm to the stay. The swimming pool provides a refreshing retreat amidst nature's beauty. The food is delicious, reflecting local flavors, and the ambience is inviting, creating a sense of tranquility. The resort maintains a clean environment, enhancing the overall experience for guests seeking relaxation and immersion in natural surroundings.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very good resort. Amazing scenery, good service, staffs are friendly. Many games are available to play,even swimming pool is available. It is clean and good. I was really happy during the visit",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "\"My recent visit to Sunrock Balipa Resort was nothing short of spectacular! From the moment I arrived, I was greeted with warmth and hospitality that made me feel right at home. The resort's stunning location amidst the serene beauty of nature provided the perfect backdrop for a relaxing getaway.\nThe accommodations were not only luxurious but also impeccably clean and well-maintained. I particularly enjoyed waking up to the breathtaking views of the surrounding landscape every morning. The attention to detail in the room amenities truly exceeded my expectations.\nOne of the highlights of my stay was the exceptional service provided by the staff. They went above and beyond to ensure that every aspect of my experience was perfect, from assisting with activities to recommending the best local attractions to explore.\nThe dining options at Sunrock Balipa Resort were equally impressive. The diverse menu offered a delightful array of culinary delights, each dish bursting with flavor and prepared with the freshest ingredients. Enjoying a meal by the poolside, every bite was a culinary delight.\nFurthermore, the resort's facilities were top-notch, providing ample opportunities for both relaxation and recreation. Whether lounging by the pool, or participating in the various outdoor activities offered, there was never a dull moment during my stay.\nOverall, my experience at Sunrock Balipa Resort surpassed all expectations. I left feeling rejuvenated, refreshed, and already planning my next visit. I highly recommend this resort to anyone seeking a luxurious and unforgettable getaway. Thank you to the entire team for making my stay truly memorable!\"",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "One of the best resort I can say. They have various packages I have tried the waterfalls package it was extremely awesome 😍.in the next month or sometime I want to try other packages too.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently stayed incredible resort exceeded expectations breathtaking scenery luxurious accommodations impeccable service made unforgettable experience staff friendly also went beyond ensure every detail perfect diverse range amenities facilities gourmet dining options catered preferences highly recommend resort anyone seeking blissful retreat cant wait return another memorable stay",
                "resort offers picturesque escape breathtaking views serene river jamalabad fort adding cultural charm stay swimming pool provides refreshing retreat amidst natures beauty food delicious reflecting local flavors ambience inviting creating sense tranquility resort maintains clean environment enhancing overall experience guests seeking relaxation immersion natural surroundings",
                "good resort amazing scenery good service staffs friendly many games available playeven swimming pool available clean good really happy visit",
                "recent visit sunrock balipa resort nothing short spectacular moment arrived greeted warmth hospitality made feel right home resorts stunning location amidst serene beauty nature provided perfect backdrop relaxing getaway accommodations luxurious also impeccably clean wellmaintained particularly enjoyed waking breathtaking views surrounding landscape every morning attention detail room amenities truly exceeded expectations one highlights stay exceptional service provided staff went beyond ensure every aspect experience perfect assisting activities recommending best local attractions explore dining options sunrock balipa resort equally impressive diverse menu offered delightful array culinary delights dish bursting flavor prepared freshest ingredients enjoying meal poolside every bite culinary delight furthermore resorts facilities topnotch providing ample opportunities relaxation recreation whether lounging pool participating various outdoor activities offered never dull moment stay overall experience sunrock balipa resort surpassed expectations left feeling rejuvenated refreshed already planning next visit highly recommend resort anyone seeking luxurious unforgettable getaway thank entire team making stay truly memorable",
                "one best resort say various packages tried waterfalls package extremely awesome ð\u009f\u0098\u008din next month sometime want try packages"
            ]
        },
        {
            "name": "ಸಮುದಾಯ ಭವನ Jumma Masjid Guruvayanakere Belthangadi",
            "rating": [
                3
            ],
            "address": [
                "X7R4+98G, Melanthabettu Rd, Melanthabettu, Karnataka 574214, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL SHANUM",
            "rating": [
                5
            ],
            "address": [
                "Karnataka 574217, India"
            ],
            "reviews": [
                {
                    "text": "Famous for evening snacks...",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "famous evening snacks"
            ]
        },
        {
            "name": "Guruvayanakere",
            "rating": [
                "Unknown"
            ],
            "address": [
                "X7M2+PRQ, Guruvayankere, Karnataka 574217, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Food court",
            "rating": [
                5
            ],
            "address": [
                "X7VX+8J5, Belthangady, Karnataka 574214, India"
            ],
            "reviews": [
                {
                    "text": "South Indian food\nNorth Indian food\nSea food\nChinese and chats\nJuice and icecream\nHygienic area\nSo many tables chairs here\nChocolate also available\nImportance for cleaning",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "south indian food north indian food sea food chinese chats juice icecream hygienic area many tables chairs chocolate also available importance cleaning"
            ]
        }
    ]
}