{
    "places_with_reviews": [
        {
            "name": "Hindustan Resort",
            "rating": [
                4.6
            ],
            "address": [
                "Hindustan resort, At post, near modi green house, Guhagar, Are, Maharashtra 415703, India"
            ],
            "reviews": [
                {
                    "text": "Decent stay, stayed here for 2 nights.\nReasonably prices,\nRoom and washroom were clean,\nFood was tasty and Reasonably priced.\nThe plantation in the resort is very nice, very nice for morning and evening walks.\nOverall Nice place for couple and family,\nHighly Recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Too good for the price, just 5 cottages ample space, awesome food and customized order. Rohit the host just 21 yr old kid but what a experience we had.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "The location is 15 mins away from Guhagar beach.\n\nThe most affordable and calm place to live around. The service is top notch & food is really good.\n\nQuite spacious rooms to relax and spend time with your loved ones.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Well maintain Resort, clean and neat rooms.location is awesome. If you want peace then this is perfect destination for you. Staff is very much helpful. Owner Rohit is so humbled. Food quality is superb and rate also reasonable. No network issue. Wifi is available. Blindly go for it.\n\nRooms 5/5\nFood 5/5\nLocation 5/5\nHospitality 5/5\n\nThanks Rohit and Abhijit sir for making our stay memorable.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I would highly highly recommend this place as everything from service to private room stay with a private porch and greenary and service provided by Rohit was perfectly A class. We enjoyed the homemade food for dinner and breakfast and the staff are very cordial and friendly and the added feature of animals around makes the place more homely and beautiful.\nSpecial thanks to Rohit for being so hospitable.\nThe stay was amazing.\nHighly recommend",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent stay stayed nights reasonably prices room washroom clean food tasty reasonably priced plantation resort nice nice morning evening walks overall nice place couple family highly recommended",
                "good price cottages ample space awesome food customized order rohit host yr old kid experience",
                "location mins away guhagar beach affordable calm place live around service top notch food really good quite spacious rooms relax spend time loved ones",
                "well maintain resort clean neat roomslocation awesome want peace perfect destination staff much helpful owner rohit humbled food quality superb rate also reasonable network issue wifi available blindly go rooms food location hospitality thanks rohit abhijit sir making stay memorable",
                "would highly highly recommend place everything service private room stay private porch greenary service provided rohit perfectly class enjoyed homemade food dinner breakfast staff cordial friendly added feature animals around makes place homely beautiful special thanks rohit hospitable stay amazing highly recommend"
            ]
        },
        {
            "name": "Sea bliss resort",
            "rating": [
                4.9
            ],
            "address": [
                "At post, taluka, guhagar, Anjanwel, Maharashtra 415634, India"
            ],
            "reviews": [
                {
                    "text": "Very close to sea water that you can hear voice of waves . Authentic food served by owner was delicious.  Rooms were so clean and fresh feeling inside.  You can get to see some points very close to Hitel . Must visit atheist once with. Friends for chill- out.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Perfect stay to enjoy sea view and authentic Konkani food . Many places to visit like Light house, Fort etc are also very close by.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "A charming and cosy family-run hotel situated in a scenic coastal village right by the sea. All rooms have a sea view and it’s an idyllic place to relax. The food is just too good! The family cooks proper authentic Konkani meals that will leave you wanting for more. I stayed for a long weekend and couldn’t have been more relaxed and well-fed than here.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very nice place, beutiful and clean rooms,the quality of food is too good and very fast service,you should visit once.....",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "A nice hotel run by a family, situated very close to sea in picturesque village atmosphere. The hotel is maintained well and still being improved. Homely meals is something we truly enjoyed. The hotel is also situated fairly close to Dhopave Ferry crossing from where one can easily go towards Dapoli, Murud, Shree Harihareshwar, Mumbai etc on one side and of course Chiplun and Ratnagiri exits are very close from the other side. We enjoyed our stay and recommend the same for families.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "close sea water hear voice waves authentic food served owner delicious rooms clean fresh feeling inside get see points close hitel must visit atheist friends chill",
                "perfect stay enjoy sea view authentic konkani food many places visit like light house fort etc also close",
                "charming cosy familyrun hotel situated scenic coastal village right sea rooms sea view itâ\u0080\u0099s idyllic place relax food good family cooks proper authentic konkani meals leave wanting stayed long weekend couldnâ\u0080\u0099t relaxed wellfed",
                "nice place beutiful clean roomsthe quality food good fast serviceyou visit",
                "nice hotel run family situated close sea picturesque village atmosphere hotel maintained well still improved homely meals something truly enjoyed hotel also situated fairly close dhopave ferry crossing one easily go towards dapoli murud shree harihareshwar mumbai etc one side course chiplun ratnagiri exits close side enjoyed stay recommend families"
            ]
        },
        {
            "name": "White Sand Retreat",
            "rating": [
                4.7
            ],
            "address": [
                "Are Village, Guhagar-Veldur Road, Taluka, near Dhardevi Temple, Guhagar, Mouje Anjanvel, Maharashtra 415703, India"
            ],
            "reviews": [
                {
                    "text": "The rooms and services are very good, only the location is far away from main area, beach or village. The transport not available here, You must be book private vehicles, taxis or auto's to go there.They are expensive.\nThe sunset or sunrise are shown from room.The jio network is available here but internet work slowly. The food is also good in taste. They serve Thali having variety of vegatebles, sweet, roti, dal rice, salad and papad.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great host Mr. Chaitanya, great on property staff - Mr. Jadhav. Nice clean cozy rooms.\nSituated on a small hillock away from the hustle and bustle of Guhagar town.\nOnly issue could be beach is at 20 - 25 mins walking distance and Vyadeshwar temple is 15 mins ride.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best rooms and room service\nGood food and ambiance\nThank you Santosh kaka for good food as well....\nWill definitely coming back",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "White Sand Retreat is a perfect home away from home. Right from the booking stage till we vacate, there is a touch of professionalism.\nThe resort is located just off the SH4 and has multiple row houses.  There is adequate Parking space infront of the row house. As soon as you reach, the host Santosh Jadhav is ready to receive you and ensure guests are comfortably checked into the row house.\nThe interior design of the row house is exquisite, fabulous. Within an area of 250sq.ft, the row house has everything you need or look for. It can comfortably accommodate a family of 4. Each  row house has 2 rooms one on the ground floor and another on 1st floor with internal staircase to reach. Both rooms have independent Washroom ( hot water geyser), Split AC, fans, TV, balcony for sit out etc. First floor room has Master Bed ( with ward robe) while ground floor room has sofa cum extendable double bed.\nRooms are sparkling clean, with cleaner linen, towels etc. They do provide soaps and dental kit.  Each row house has a small lawn at the front for sitting out and each row house has fencing for privacy. Salute to the person who has designed and organised the row houses, perfect for family of 4. And all above is pocket friendly too.\nThe resort has inbuilt Kitchen Serving variety of veg & non veg food. Taste is superb. There is a foldable dining table with 4 chairs inside the room for comfortable and relaxed dining experience. Santosh and his team are avaible at the premises 24x7 to cater to every need of the guests. Service is outstanding.\nAll in all, it is truly an exhilarating experience to spend a brief vacation with family at White Sand Resort. Would love to go back once more.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Each and every aspect of the resort be it the ambience, the staff and location is just amazing. Especially, the food you get to eat is so delicious. Totally worth spending the time and money here. Our team had a good time here and would love to come again.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms services good location far away main area beach village transport available must book private vehicles taxis autos go therethey expensive sunset sunrise shown roomthe jio network available internet work slowly food also good taste serve thali variety vegatebles sweet roti dal rice salad papad",
                "great host mr chaitanya great property staff mr jadhav nice clean cozy rooms situated small hillock away hustle bustle guhagar town issue could beach mins walking distance vyadeshwar temple mins ride",
                "best rooms room service good food ambiance thank santosh kaka good food well definitely coming back",
                "white sand retreat perfect home away home right booking stage till vacate touch professionalism resort located sh multiple row houses adequate parking space infront row house soon reach host santosh jadhav ready receive ensure guests comfortably checked row house interior design row house exquisite fabulous within area sqft row house everything need look comfortably accommodate family row house rooms one ground floor another st floor internal staircase reach rooms independent washroom hot water geyser split ac fans tv balcony sit etc first floor room master bed ward robe ground floor room sofa cum extendable double bed rooms sparkling clean cleaner linen towels etc provide soaps dental kit row house small lawn front sitting row house fencing privacy salute person designed organised row houses perfect family pocket friendly resort inbuilt kitchen serving variety veg non veg food taste superb foldable dining table chairs inside room comfortable relaxed dining experience santosh team avaible premises x cater every need guests service outstanding truly exhilarating experience spend brief vacation family white sand resort would love go back",
                "every aspect resort ambience staff location amazing especially food get eat delicious totally worth spending time money team good time would love come"
            ]
        },
        {
            "name": "Aaditaal",
            "rating": [
                4.6
            ],
            "address": [
                "Baji road, Bramhanwadi, Arey, Guhagar, G5CW+XHW, Are, Maharashtra 415719, India"
            ],
            "reviews": [
                {
                    "text": "The best place to relax amidst lush green trees combined with very humble host couple Mr n Mrs Dixit. YOU WILL NOT FEEL LIKE GOING BACK.\n\nGuhaghar beach is close",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very awesome place. I would love to stay here.\nPeaceful. In the lap of nature. Must visit request to every nature lover. No TV, No internet. Njoy your stay",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nice place amidst lush green nature. Place is near guhagar beach. Awesome host and nice food. It was peaceful and serene. Surely stay again !!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good stay, spacious rooms.., Authentic Traditional food served at breakfast and dinner..",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nice, cosy place away from hustle and bustle of the city. Good to relax with family and eat home made food. Fish served on request.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place relax amidst lush green trees combined humble host couple mr n mrs dixit feel like going back guhaghar beach close",
                "awesome place would love stay peaceful lap nature must visit request every nature lover tv internet njoy stay",
                "nice place amidst lush green nature place near guhagar beach awesome host nice food peaceful serene surely stay",
                "good stay spacious rooms authentic traditional food served breakfast dinner",
                "nice cosy place away hustle bustle city good relax family eat home made food fish served request"
            ]
        },
        {
            "name": "Suyash Beach Resort",
            "rating": [
                3.6
            ],
            "address": [
                "At Post Dabhol, Taluka Dapoli, Dabhol, Maharashtra 415706, India"
            ],
            "reviews": [
                {
                    "text": "Location is good but place needs renovation.\nOnly good about my stay was AC in working condition.\nImprovements needed on - Room cleanliness, Windows, Bathroom (WC) leakage, bathroom window glasses, Curtains.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Place is very beautiful, it's 5 minutes walkable from dabhol jetty port and manger is kind and humble, maintenance and service was awesome, nice place to stay and roam.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Best resort I have visited today.The receptionist were really helpful & friendly.very Good place.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "It was a nice experience to stay in Suyash Resort. Excellent service...👌👌👌",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Nice place to visit",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location good place needs renovation good stay ac working condition improvements needed room cleanliness windows bathroom wc leakage bathroom window glasses curtains",
                "place beautiful minutes walkable dabhol jetty port manger kind humble maintenance service awesome nice place stay roam",
                "best resort visited todaythe receptionist really helpful friendlyvery good place",
                "nice experience stay suyash resort excellent serviceð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008c",
                "nice place visit"
            ]
        },
        {
            "name": "Janki Farm Veldur",
            "rating": [
                4.6
            ],
            "address": [
                "H5F8+RXP, Peth Anjanwel, Maharashtra 415634, India"
            ],
            "reviews": [
                {
                    "text": "I've never been here; however, Veldur is a beauty! Along with its nearby neighbour Anjanvel which is home to Gopalgad Fort. Veldur has scemic views and boat rides. Highly recommended. 😇 😇",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nice place to hangout with family and friends....very spacious rooms and halls, network is easily accessible,one down point is its very far and no nearby houses or market",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nature loving place...\nSea viewing......\nAt top of mountain having very nice view to all sides",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best nature and near to sea...Very nice place",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best place",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ive never however veldur beauty along nearby neighbour anjanvel home gopalgad fort veldur scemic views boat rides highly recommended ð\u009f\u0098\u0087 ð\u009f\u0098\u0087",
                "nice place hangout family friendsvery spacious rooms halls network easily accessibleone point far nearby houses market",
                "nature loving place sea viewing top mountain nice view sides",
                "best nature near seavery nice place",
                "best place"
            ]
        },
        {
            "name": "Hotel Shree krushna",
            "rating": [
                "Unknown"
            ],
            "address": [
                "fata, Enron LNG Area, Anjanwel, Guhagar, Maharashtra 415703, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Anniviola jungle resort",
            "rating": [
                5
            ],
            "address": [
                "near sidheshwar temple, Navanagar, Peth Anjanwel, Anjanwel, Maharashtra 415703, India"
            ],
            "reviews": [
                {
                    "text": "Best Weekend.. gateway in Konkan.",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best weekend gateway konkan"
            ]
        },
        {
            "name": "Ashwamedh Resort",
            "rating": [
                3.7
            ],
            "address": [
                "H5QG+6W4, Dabhol, Maharashtra 415706, India"
            ],
            "reviews": [
                {
                    "text": "Poor quality",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Uuuii oi9iii iiiiiiiooi ioiioiiioio9o9ooooo9ooooooooool9olo oooooooooooooooooooooooooooooooooooooooo",
                    "languageCode": "en-US",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "poor quality",
                "uuuii oiiii iiiiiiiooi ioiioiiioiooooooooooooooooololo oooooooooooooooooooooooooooooooooooooooo"
            ]
        },
        {
            "name": "Dabhol Caterers And Allied Services",
            "rating": [
                "Unknown"
            ],
            "address": [
                "G5VC+F4M, MH SH4, Enron LNG Area, Peth Anjanwel, Anjanwel, Maharashtra 415634, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}