{
    "places_with_reviews": [
        {
            "name": "Iscon The Fern Resort & Spa, Bhavnagar",
            "rating": [
                4.5
            ],
            "address": [
                "P4RF+4FW, near Sundarvas Bungalow, Kaliyabid, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "\"Iscon The Fern Resort and Spa in Bhavnagar offers spacious and clean rooms with modern amenities, ensuring a comfortable stay. The friendly staff provides excellent service, and the resort boasts a range of facilities including a swimming pool and spa. Guests appreciate its serene location and delicious dining options. Overall, it offers great value for money.\"",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Wonderful rooms.\nTheir amenities are very nice. We played a lot. They had kids zone, squash court, badminton court, indoor games and an awesome swimming pool. The food was also brilliant. Loved the stay over all.\nThere were no much stays in Bhavnagar. This was the only good one which we could see when booked. Didn't expect it to be this good!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Rooms are spacious and clean. However, the free dinner offered with the package was a disappointment. We went to have dinner on 6 Mar 24 at 8:30pm and food was not ready. Dinner time communicated to us during checkin was 7-10pm. It was ready at 9pm apparently because a wedding group was the priority. The customers in the hotel were left waiting until the wedding group was ready for dinner. Ridiculous planning. If you are a couple, good luck.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This is really nice place to stay in Bhavnagar. Location is good and food  quality also very good. Service is at the top notch. Even we checked-in late we didn't have any problem. Also left the room early morning but we have not faced any problem. Only thing is we could not get the chance to explore other things. Such as Swimming pool, Jim etc. We had dinner there and food quality is good as well as service. Staff is very cooperative. Overall nice place to stay with family.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Old proparty iscorn. Name by fern but sarvish not good. Local pablic memarship by club . Vistar not comfartebal use swimingpool and gym by local pablic membarship. Rooms not good . I think farn name bad experience this property.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "iscon fern resort spa bhavnagar offers spacious clean rooms modern amenities ensuring comfortable stay friendly staff provides excellent service resort boasts range facilities including swimming pool spa guests appreciate serene location delicious dining options overall offers great value money",
                "wonderful rooms amenities nice played lot kids zone squash court badminton court indoor games awesome swimming pool food also brilliant loved stay much stays bhavnagar good one could see booked didnt expect good",
                "rooms spacious clean however free dinner offered package disappointment went dinner mar pm food ready dinner time communicated us checkin pm ready pm apparently wedding group priority customers hotel left waiting wedding group ready dinner ridiculous planning couple good luck",
                "really nice place stay bhavnagar location good food quality also good service top notch even checkedin late didnt problem also left room early morning faced problem thing could get chance explore things swimming pool jim etc dinner food quality good well service staff cooperative overall nice place stay family",
                "old proparty iscorn name fern sarvish good local pablic memarship club vistar comfartebal use swimingpool gym local pablic membarship rooms good think farn name bad experience property"
            ]
        },
        {
            "name": "Efcee Sarovar Premiere, Bhavnagar",
            "rating": [
                4.4
            ],
            "address": [
                "Opposite, Victoria Park Rd, near Vidhyanagar, ISCON Mega City, Vidhyanagar, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "We stayed here 2 nights . This is a lovely hotel. The pastries in the lobby are very good as is the restaurant Victoria. We did not try the other. We had the buffet which was a nice selection. The room was excellent, very clean. Comfortable beds, choice of pillows and a nice shower (Americans are obsessed with good plumbing). They arranged transportation to the temple and box breakfasts. Very efficient. Our only problem was at check out. We were leaving at 0500. Their payment systems were all down.  It was not our card as I checked with the credit card company. There seemed to be no back up system except a direct wire transfer from our bank in the USA which would not be possible. They wanted us to pay cash. In short I would say if you are leaving at an odd time, settle the account the prior evening when there are options. The poor guy at the desk had no authority though he tried to help. We finally left dollars at a normal exchange rate not the poor rate they were offering us as our ride was waiting and we would miss out connection.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Efcee Sarovar Premiere in Bhavnagar, and it was an experience that left a lasting impression. From the moment I arrived, the hotel exuded a sense of elegance and tranquility that one would hope to find at a top-tier hospitality destination.\n\nThe rooms at Efcee Sarovar are a retreat in themselves, with plush bedding, modern decor, and all the amenities needed for a comfortable stay. The large windows offered a picturesque view of the city, which added to the charm and serenity of the room.\n\nDining at the hotel was a highlight with multiple options to choose from. The chefs clearly take pride in their culinary creations, and every dish I tried was delicious and presented with care. The local Gujarati cuisine was especially delightful and gave me a taste of the region’s rich flavors.\n\nEfcee Sarovar’s commitment to service was evident in the staff's attentiveness. Whether it was the front desk, room service, or the restaurant staff, everyone went out of their way to ensure my needs were met with a smile. The warmth and professionalism of the team truly made my stay comfortable.\n\nThe hotel's amenities, including the well-equipped fitness center and the soothing spa, were the cherries on top of an already luxurious stay. Even the location was convenient, being close enough to local attractions and the business district, yet away from the hustle and bustle.\n\nI would recommend Efcee Sarovar Premiere to anyone visiting Bhavnagar, be it for business or pleasure. It stands as a testament to the perfect blend of traditional hospitality and modern luxury.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The hotel is conveniently located at Victoria Park Road,  and one of the two five stars in Bhavnagar. The facility is well maintained,  and offers pure veg food. They have a choice of premiere, deluxe, executive rooms and suites to offer. The food is good and reasonably priced, as are the rooms. Overall a positive experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Staying at this hotel was nothing short of a luxurious escape. From the moment I entered, the impeccable service and attention to detail exceeded my expectations. The elegantly designed rooms, coupled with breathtaking views, provided a serene retreat. The staff's hospitality was exceptional, making my stay truly memorable. Every aspect of this hotel exudes excellence, from the gourmet dining options to the indulgent spa facilities. A stay here is not just accommodation; it's an experience of opulence and sophistication that lingers in your memory.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The hospitality offered is amazing. The hotel is a great package in totality ranging from sumptuous food to its ideal location, safety of personnel and belongings to the utmost kind and helpful nature of the staff. Had an amazing stay here. A special note to their stupendous buffet and spa. Kudos Efcee Sarovar premiere. #Kuchdintoguzariyeefceesarovarpremiereme.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed nights lovely hotel pastries lobby good restaurant victoria try buffet nice selection room excellent clean comfortable beds choice pillows nice shower americans obsessed good plumbing arranged transportation temple box breakfasts efficient problem check leaving payment systems card checked credit card company seemed back system except direct wire transfer bank usa would possible wanted us pay cash short would say leaving odd time settle account prior evening options poor guy desk authority though tried help finally left dollars normal exchange rate poor rate offering us ride waiting would miss connection",
                "recently pleasure staying efcee sarovar premiere bhavnagar experience left lasting impression moment arrived hotel exuded sense elegance tranquility one would hope find toptier hospitality destination rooms efcee sarovar retreat plush bedding modern decor amenities needed comfortable stay large windows offered picturesque view city added charm serenity room dining hotel highlight multiple options choose chefs clearly take pride culinary creations every dish tried delicious presented care local gujarati cuisine especially delightful gave taste regionâ\u0080\u0099s rich flavors efcee sarovarâ\u0080\u0099s commitment service evident staffs attentiveness whether front desk room service restaurant staff everyone went way ensure needs met smile warmth professionalism team truly made stay comfortable hotels amenities including wellequipped fitness center soothing spa cherries top already luxurious stay even location convenient close enough local attractions business district yet away hustle bustle would recommend efcee sarovar premiere anyone visiting bhavnagar business pleasure stands testament perfect blend traditional hospitality modern luxury",
                "hotel conveniently located victoria park road one two five stars bhavnagar facility well maintained offers pure veg food choice premiere deluxe executive rooms suites offer food good reasonably priced rooms overall positive experience",
                "staying hotel nothing short luxurious escape moment entered impeccable service attention detail exceeded expectations elegantly designed rooms coupled breathtaking views provided serene retreat staffs hospitality exceptional making stay truly memorable every aspect hotel exudes excellence gourmet dining options indulgent spa facilities stay accommodation experience opulence sophistication lingers memory",
                "hospitality offered amazing hotel great package totality ranging sumptuous food ideal location safety personnel belongings utmost kind helpful nature staff amazing stay special note stupendous buffet spa kudos efcee sarovar premiere kuchdintoguzariyeefceesarovarpremiereme"
            ]
        },
        {
            "name": "Nilambag Palace Hotel",
            "rating": [
                4.4
            ],
            "address": [
                "Rajkot Road, Nilambaug Circle, Nilambaug, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "As I entered the lobby, the friendly and attentive staff greeted me with genuine smiles and a heartfelt welcome. The room I was assigned to exuded elegance and sophistication, beautifully blending modern amenities with the hotel's rich heritage.\n\nThe dining experience at Heritage Hotel was an absolute delight. the food was prepared with exquisite finesse and a mastery of flavors. The hotel's amenities were exceptional. The well-maintained fitness center allowed me to stay on top of my workouts. Additionally, the hotel's meticulous attention to cleanliness and hygiene was particularly reassuring during these uncertain times.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "An absolute gem. One of the best heritage properties turned into 5 star 🏨. Very well kept and up to date. Your comfort is their top priority.\nRoom and amenities ⭐⭐⭐⭐ ⭐\nStaff & service ⭐⭐⭐⭐⭐\nDining ⭐⭐⭐⭐⭐\nLocation & value for💲⭐⭐⭐⭐⭐\nOverall all very quiet and kept very clean and neat. For the full experience do dine and try out the local food and the extracurricular activities (swimming, tennis 🎾, shooting range, gym and more)",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This review only for restaurant.\nIts one of the good palace with restaurant in this area.\n\nWe visited at their restaurant and its very royal and beautiful. You can get royal feel   everywhere. Food and service quality is good.\n\nParking: 2 & 4 wheelar free parking available here.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We went and stayed for 1 day. The property has beautiful rooms and exterior. The restaurant is located inside the palace hotel and the food is very tasty. The property has a swimming pool, however, it is a community swimming pool and is open for public on certain Timings. We stayed in rooms exterior to the palace however the rooms were decent. However, the rooms were in a need of renovation as there were problems of seepage on walls. Moisture could be seen on the wall. Service was good. Overall a good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms badly need renovation. Toilet seats broken, taps n flush at washroom malfunction. The property needs renovation to preserve heritage",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "entered lobby friendly attentive staff greeted genuine smiles heartfelt welcome room assigned exuded elegance sophistication beautifully blending modern amenities hotels rich heritage dining experience heritage hotel absolute delight food prepared exquisite finesse mastery flavors hotels amenities exceptional wellmaintained fitness center allowed stay top workouts additionally hotels meticulous attention cleanliness hygiene particularly reassuring uncertain times",
                "absolute gem one best heritage properties turned star ð\u009f\u008f¨ well kept date comfort top priority room amenities â­\u0090â­\u0090â­\u0090â­\u0090 â­\u0090 staff service â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090 dining â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090 location value forð\u009f\u0092²â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090 overall quiet kept clean neat full experience dine try local food extracurricular activities swimming tennis ð\u009f\u008e¾ shooting range gym",
                "review restaurant one good palace restaurant area visited restaurant royal beautiful get royal feel everywhere food service quality good parking wheelar free parking available",
                "went stayed day property beautiful rooms exterior restaurant located inside palace hotel food tasty property swimming pool however community swimming pool open public certain timings stayed rooms exterior palace however rooms decent however rooms need renovation problems seepage walls moisture could seen wall service good overall good experience",
                "rooms badly need renovation toilet seats broken taps n flush washroom malfunction property needs renovation preserve heritage"
            ]
        },
        {
            "name": "Hotel Clarks Collection Bhavnagar",
            "rating": [
                4
            ],
            "address": [
                "Kalubha Rd, Kalanala, Panwadi, Bhavnagar, Gujarat 364001, India"
            ],
            "reviews": [
                {
                    "text": "Excellent hospitality and great rooms. One of the best dinners and breakfast we had on our tour of Gujarat. Pretty much in the middle of the city, they do offer staff food for the driver. But our driver couldn't find a spot to sleep because the have just 6 beds. I suppose the hotel could expand on that since drivers need good rest for their work the next day. The restaurant service is wonderful. The hotel staff and the security are very helpful and attentive to guest needs.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Too cramped rooms. Paints peeled off.  Stained mirror.  Bed lost its shape. Returned with a stiff back. Staff was very courteous. Basic cleanliness ok. Complementary breakfast had limited variety. Taste was ok.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We had a very comfortable stay here. Good spread of breakfast. Food quality and taste excellent. Staff very pleasant and helpful.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The shower got jammed and I had to request them thrice to get it repaired. But the service is good. Breakfast is very good. Staff is helpful and the rooms are clean.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hello  I am not happy with Clarks Bhavnagar\nThe hospitality isn't good there. Especially the staff isn't cooperative.\nI wouldn't recommend this anymore.\nThe rooms are as expected. Obviously we have paid a good amount to stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent hospitality great rooms one best dinners breakfast tour gujarat pretty much middle city offer staff food driver driver couldnt find spot sleep beds suppose hotel could expand since drivers need good rest work next day restaurant service wonderful hotel staff security helpful attentive guest needs",
                "cramped rooms paints peeled stained mirror bed lost shape returned stiff back staff courteous basic cleanliness ok complementary breakfast limited variety taste ok",
                "comfortable stay good spread breakfast food quality taste excellent staff pleasant helpful",
                "shower got jammed request thrice get repaired service good breakfast good staff helpful rooms clean",
                "hello happy clarks bhavnagar hospitality isnt good especially staff isnt cooperative wouldnt recommend anymore rooms expected obviously paid good amount stay"
            ]
        },
        {
            "name": "Hotel The Basil Park",
            "rating": [
                4.4
            ],
            "address": [
                "5, opp. Victoria Park, ISCON Mega City, Vidhyanagar, Bhavnagar, Gujarat 364001, India"
            ],
            "reviews": [
                {
                    "text": "I am regular customer of The basil park, Bhavnagar from past 6 years. What I experienced  this time is that your food quality specially tea quality I was used to enjoy has been deteriorated. Previous chef was really good. Every year most of the staff has been changed.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "During the peak Diwali Festival, I visited Hotel Basil Park, and despite the festive rush, I experienced the best quality of services. The reception staff was exceptional, ensuring a seamless check-in experience. The hotel's prime location added to its appeal. The breakfast spread offered a variety of menus, providing a delightful start to the day. Room service was prompt and efficient, contributing to an overall positive stay. Hotel Basil Park in Bhavnagar combined excellent service with a convenient location, making it a top choice for travelers.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Dear DASJI,\n\nIt was all fabulous at Basil Park! Our family and friends thoroughly enjoyed the beautiful setting, delicious food and the great service that you and your team provided. We received the glowing feedback from our guests and we couldn't be happier.\n\nwe can't thank you enough for your hard work on all events when we decided to switch the ceremony site due to the DJ in the banquet hall.I was very impressed of how the ceremony went smoothly. You did a fantastic job guiding all of us throughout the ceremony.\nWe'll definitely stop by to say hello in our next event to Basil Park.Have a great new year!\n\nBest regards,\n\nRAMESH.D.RAJAI\nJITENDRA.K.RAJAI\nSAGAR.R.RAJAI\nRAJAI FAMILY",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms are very small, bathroom too is small keeping in mind what they charge. Beds and table are so light weight that they literally move when you are sleeping or touch them. Room service and house keeping  could have been better. The plus point is the location of the hotel",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rana Roy is a good loyal parsion, good behaviour skill.\nBut some reception person behaviour not good so please improve this.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "regular customer basil park bhavnagar past years experienced time food quality specially tea quality used enjoy deteriorated previous chef really good every year staff changed",
                "peak diwali festival visited hotel basil park despite festive rush experienced best quality services reception staff exceptional ensuring seamless checkin experience hotels prime location added appeal breakfast spread offered variety menus providing delightful start day room service prompt efficient contributing overall positive stay hotel basil park bhavnagar combined excellent service convenient location making top choice travelers",
                "dear dasji fabulous basil park family friends thoroughly enjoyed beautiful setting delicious food great service team provided received glowing feedback guests couldnt happier cant thank enough hard work events decided switch ceremony site due dj banquet halli impressed ceremony went smoothly fantastic job guiding us throughout ceremony well definitely stop say hello next event basil parkhave great new year best regards rameshdrajai jitendrakrajai sagarrrajai rajai family",
                "rooms small bathroom small keeping mind charge beds table light weight literally move sleeping touch room service house keeping could better plus point location hotel",
                "rana roy good loyal parsion good behaviour skill reception person behaviour good please improve"
            ]
        },
        {
            "name": "Hotel Virgo Sumeru",
            "rating": [
                4.4
            ],
            "address": [
                "Waghawadi Rd., Pragati Nagar, Vidhyanagar, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "Having wrost experience ever during stay. Not properly clean the room and even while inform for the cleaning to staffs at morning however while come at evening the room was as it is which I left at morning.. They cahrges me Rs. 1000 for Towel due to some black spot showing on it however the towel was already used maximum by the guest and it was already seems dirty however it was washed. I urge them for some waiver on it but the staff didn't ready to listen anything..I am exploring across Gujarat in a month since 8 years and never faced such wrost experiance ever.. I was stayed first time here and faced this issues.. I strongly recommended for avoid to stay here..Only food is quite good..",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Best hotel and finest restaurant in bhavnagar.  Reception is very helpful and housekeeping staff is also polite.  Pizzeria food items are awesome.  Keep it up",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Everything perfect organized, well managed property, nice food, very clean rooms, bathrooms too. Staff is politie ,ready to help one call. Under one roof , there is  tasty food in restaurant ..   worth stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very good stay. We came for pravin shah wedding group and all arrangements are good. Keep it up. Thnks for hospitality. Housekeeping pappu and reception Mayur Bhai good work. Prince housekeeping also helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms are well maintained and staff is very very helpful. However south indian option need to be more. Hence I went out for breakfast and dinner. Driver facility also good",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wrost experience ever stay properly clean room even inform cleaning staffs morning however come evening room left morning cahrges rs towel due black spot showing however towel already used maximum guest already seems dirty however washed urge waiver staff didnt ready listen anythingi exploring across gujarat month since years never faced wrost experiance ever stayed first time faced issues strongly recommended avoid stay hereonly food quite good",
                "best hotel finest restaurant bhavnagar reception helpful housekeeping staff also polite pizzeria food items awesome keep",
                "everything perfect organized well managed property nice food clean rooms bathrooms staff politie ready help one call one roof tasty food restaurant worth stay",
                "good stay came pravin shah wedding group arrangements good keep thnks hospitality housekeeping pappu reception mayur bhai good work prince housekeeping also helpful",
                "rooms well maintained staff helpful however south indian option need hence went breakfast dinner driver facility also good"
            ]
        },
        {
            "name": "HOTEL SANKALP",
            "rating": [
                3.6
            ],
            "address": [
                "OPP Krishna Nagar Sanskar Mandal, Sanskar Mandal Rd, Hill Drive, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "I don't know why this place has so many negative reviews.\nGranted, we weren't in the room much and we didn't use the room service option, but it's clean, comfortable and quiet - I couldn't ask for more in this budget. The room was very spacious. The staff were helpful.\nI went with my wife and we faced no issues. There was also another family staying in another room so it's clear that it's not a shady/seedy hotel.\nI would recommend this place to anyone looking for a budget-friendly stay.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Had booked family room for my parents but the room was too small. The location was very remote. For breakfast, they just provided poha and nothing else. No toiletries or coffee/tea sachets were provided. When asked for help to book cab they declined saying they don't provide those services and were not even ready to help with any information as well. Not quite 3 star experience.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good location.we checked in this hotel on 3.4.24, at present renovation work in progress so u find some difficulties bit staff behaviour service is quiet good.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I visited in hotel sankalp 5 years ago very nice clean and comfortable facility very good 😊",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "I had booked a premium room for 4 people. Staff was rude. No toiletries, no tea coffee items in room. No sense of hospitality. when asked for an auto rickshaw for the airport, staff was rude and said he does not know.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dont know place many negative reviews granted werent room much didnt use room service option clean comfortable quiet couldnt ask budget room spacious staff helpful went wife faced issues also another family staying another room clear shadyseedy hotel would recommend place anyone looking budgetfriendly stay",
                "booked family room parents room small location remote breakfast provided poha nothing else toiletries coffeetea sachets provided asked help book cab declined saying dont provide services even ready help information well quite star experience",
                "good locationwe checked hotel present renovation work progress u find difficulties bit staff behaviour service quiet good",
                "visited hotel sankalp years ago nice clean comfortable facility good ð\u009f\u0098\u008a",
                "booked premium room people staff rude toiletries tea coffee items room sense hospitality asked auto rickshaw airport staff rude said know"
            ]
        },
        {
            "name": "Hotel Vijay Palace",
            "rating": [
                3.8
            ],
            "address": [
                "Sutarwad, Panwadi, Bhavnagar, Gujarat 364001, India"
            ],
            "reviews": [
                {
                    "text": "I find this to be a nice hotel with fairly large and clean rooms. The staff was very friendly during our visit and the bed was comfortable.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Its good stay station at bhavnagar near railway station and bus station. It has special service regarding food which is like a home made food, no doubt manu is not big but delicious",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Excellent hospitality, good behavior, clean and very affordable.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel staff is very nice room is very clean",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "First off the good reviews provided are am not sure if it was from customers......\n\n01.The hotel is located in an area that makes you feel Bhavnagar doesn't have good localities, unless you step out of this hotel\n\n02. it survives by duplicating original resort \"Vijay palace \" located near RTO\npeople get fooled by word palace.\n\n03. owner is a very very rude guy. who is he to tell me that I arrived next day morning and I don't have a room. I had booked from day 1 afternoon to next day noon. it's my obligation to arrive in this period and leave within check out. He was creating so many situation to make me get out.\n\n04. Rooms were not having basic fan facility, charger point was hanging out\n\nfinally when I booked taxi, couple of guys asked me why did you book this hotel. They told me in hindi  some words that expressed ..........\n\nif the owner travels one day to my native, I will revenge him by  giving the best facilities  a hotel should give for Rs.1200 which he has obviously missed giving me in his hotel\n\nThere is a veg restaurant by a third party catering who are amazing. Try eating there without staying in amazing palace.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "find nice hotel fairly large clean rooms staff friendly visit bed comfortable",
                "good stay station bhavnagar near railway station bus station special service regarding food like home made food doubt manu big delicious",
                "excellent hospitality good behavior clean affordable",
                "hotel staff nice room clean",
                "first good reviews provided sure customers hotel located area makes feel bhavnagar doesnt good localities unless step hotel survives duplicating original resort vijay palace located near rto people get fooled word palace owner rude guy tell arrived next day morning dont room booked day afternoon next day noon obligation arrive period leave within check creating many situation make get rooms basic fan facility charger point hanging finally booked taxi couple guys asked book hotel told hindi words expressed owner travels one day native revenge giving best facilities hotel give rs obviously missed giving hotel veg restaurant third party catering amazing try eating without staying amazing palace"
            ]
        },
        {
            "name": "Aradhana Auberge",
            "rating": [
                4.1
            ],
            "address": [
                "Leela Circle, Bhavnagar - Sidsar Rd, near Iskon temple, Kailash Dham Society, B.A.D.A. Vikash Path, Bhavnagar, Gujarat 364002, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel and banquet for family functions…\nNice and co-operative staff and owner …\nWe were there for my sisters wedding in banquet and booked 6 rooms …\nPleasant stay and peaceful function with good food and swift service…..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A best hotel and restaurant in bhavnagar\nThere was a function of mine in banquet\nWas a great function...and great experience every guest was getting service properly ....so I recommend every people if u r having any plan for function for marriage u should definitely go for aradhna hotel ...amazing and tasty food great staff ....thanku specially dhrupadh bhai for not treating as a guest ...the owner was treating as a family\nThanku",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Rooms where small.\nBathroom consept of almost a transperant Glass is not comfortable when you are with Family.\nHot water was not available.\nFood at restaurant was good and serving was really nice.\nParking is available",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Normal Rooms are good but SUITE ROOM IS A LIE IT'S ALMOST SAME AS NORMAL ROOMS JUST A LITTLE BIT SPACIOUS. Food is good enough👌🏻.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good experience staying there. The location is off beat to city centre but I chose this because its nearer to Ghogha port. But overall location is good. The hotel itself Good. The rooms were neat and clean, spacious, the staff is also nice and friendly. Recommended",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel banquet family functionsâ\u0080¦ nice cooperative staff owner â\u0080¦ sisters wedding banquet booked rooms â\u0080¦ pleasant stay peaceful function good food swift serviceâ\u0080¦",
                "best hotel restaurant bhavnagar function mine banquet great functionand great experience every guest getting service properly recommend every people u r plan function marriage u definitely go aradhna hotel amazing tasty food great staff thanku specially dhrupadh bhai treating guest owner treating family thanku",
                "rooms small bathroom consept almost transperant glass comfortable family hot water available food restaurant good serving really nice parking available",
                "normal rooms good suite room lie almost normal rooms little bit spacious food good enoughð\u009f\u0091\u008cð\u009f\u008f »",
                "good experience staying location beat city centre chose nearer ghogha port overall location good hotel good rooms neat clean spacious staff also nice friendly recommended"
            ]
        },
        {
            "name": "HOTEL SUN 'N' SHINE",
            "rating": [
                3.8
            ],
            "address": [
                "S.T. Station Road, Panwadi, Sutarwad, Panwadi, Bhavnagar, Gujarat 364001, India"
            ],
            "reviews": [
                {
                    "text": "Nice and renovated hotel with good amenities in Bhavnagar City area. Rooms and facilities are very good but location is in densely populated bus stand area with lots of traffic noice. Rates are reasonable here. They also have in-house dining and catering, although you get plenty of eating stuff in walking distance. They did not have their sign board on when we checked in !! Funny !",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I tried to book room though phone . When I negotiated the price then person (who picked my phone) told me to try Dormitory in other place in rude manner. This was not acceptable behavior for the customer and got shocked with this. After this experience, I will never stay in this hotel in future.\nIf they behaved like with customer then what will they do when customer will checked in the hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good hotel for stay in Bhavnagar Nearly from Bus stop and Bhavnagar commercial hub Three star rating hotel but hotel is under renovation so many work is pending . Old is gold",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst hotel I have ever visited.\nVery rude staff they dont even know how to talk mannerless receptionist!\nNo water facility on time no hot water service\nU have to wait for hours call hundreds of times on reception but they dont reply.\nInspite of prebooking they make u sit for hours and behave like illiterate.\nTotal waste of money.\nU spoil ur trip if u visit such a pathetic hotel With ill mannered staff.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very pathetic hotel and very rude behaviour of Reception person.\nHe denied to give me room inspite of advance booking.\nMannerless people.\nAlso not informed me while booking about renovation of hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice renovated hotel good amenities bhavnagar city area rooms facilities good location densely populated bus stand area lots traffic noice rates reasonable also inhouse dining catering although get plenty eating stuff walking distance sign board checked funny",
                "tried book room though phone negotiated price person picked phone told try dormitory place rude manner acceptable behavior customer got shocked experience never stay hotel future behaved like customer customer checked hotel",
                "good hotel stay bhavnagar nearly bus stop bhavnagar commercial hub three star rating hotel hotel renovation many work pending old gold",
                "worst hotel ever visited rude staff dont even know talk mannerless receptionist water facility time hot water service u wait hours call hundreds times reception dont reply inspite prebooking make u sit hours behave like illiterate total waste money u spoil ur trip u visit pathetic hotel ill mannered staff",
                "pathetic hotel rude behaviour reception person denied give room inspite advance booking mannerless people also informed booking renovation hotel"
            ]
        }
    ]
}