{
    "places_with_reviews": [
        {
            "name": "Silver Storm",
            "rating": [
                4.1
            ],
            "address": [
                "athirapilly road, Chalakudy - Anamala Rd, Vettilappara, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "Five star is given for the entire staff. Great customer assistance from security to each staff. Ready to assist all the time. Customer and kids friendly. Snow storm was a great experience.\n\n1. Good experience the water drizzling on the path ways which I missed in other parks in this weather.\n\n2. Easy to access each ride, no steep pathways.\n\n3. Proper maintenance needed in changing rooms.\n\n4. 7D movie experience can be better. Movie and 3d glass were not clear at all. Unnecessary seat jerking only experienced.\n\n5. Mirror experience was cool. But ghost did not give any fear factor.\n\n6. Food outlets were excellent with reasonable experience.\n\nMy daughter lost her silver anklet in the pool but while leaving the park it was there in the reception. It was a nice touch.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent water theme park.\nSilver storm is suitable for kids, family and adults and has good number of quality water and dry rides and wave pool. It is located close to Athirappilly water falls. It's a fun destination to spend a day and enjoy the rides. Staffs are polite and welcoming. Good quality unlimited meals is served at reasonable price.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It  was a good experience. I went with family and we all had great time. we were able to cover all rides.  The water rides were super fun. There are not many rides but the ones that are there were super fun.\nThe restaurant has veg and non veg sections and are very affordable and its maintained very well. So people who eats pure veg wouldnt have a problem.\nWater rides are amazing. Wave pool was good but people are allowed only during the wave time which is twice in the evening for 30 minutes.\nThe Snow park was good but not totally worth. Its absolutely fine to miss the snow park. carry socks or buy socks if you have plans to go to snow park",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was really good experience. Rides are less but with its enough good rides for childrens.  Snow storm was a wonderful experience cost effective and overall 5stars for their service Also....",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Thrilling experience coupled with adventurous land rides and water rides as well. 🛝🏀⛱️The wave pool was the most exiting of them all. 🌊🌊🛟The food was quite flavorful but although it took some time to deliver there was no problem with the taste of the actual food. 😋🍴🍟Would recommend visiting on weekends.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "five star given entire staff great customer assistance security staff ready assist time customer kids friendly snow storm great experience good experience water drizzling path ways missed parks weather easy access ride steep pathways proper maintenance needed changing rooms movie experience better movie glass clear unnecessary seat jerking experienced mirror experience cool ghost give fear factor food outlets excellent reasonable experience daughter lost silver anklet pool leaving park reception nice touch",
                "excellent water theme park silver storm suitable kids family adults good number quality water dry rides wave pool located close athirappilly water falls fun destination spend day enjoy rides staffs polite welcoming good quality unlimited meals served reasonable price",
                "good experience went family great time able cover rides water rides super fun many rides ones super fun restaurant veg non veg sections affordable maintained well people eats pure veg wouldnt problem water rides amazing wave pool good people allowed wave time twice evening minutes snow park good totally worth absolutely fine miss snow park carry socks buy socks plans go snow park",
                "really good experience rides less enough good rides childrens snow storm wonderful experience cost effective overall stars service also",
                "thrilling experience coupled adventurous land rides water rides well ð\u009f\u009b\u009dð\u009f\u008f\u0080â\u009b±ï¸\u008fthe wave pool exiting ð\u009f\u008c\u008að\u009f\u008c\u008að\u009f\u009b\u009fthe food quite flavorful although took time deliver problem taste actual food ð\u009f\u0098\u008bð\u009f\u008d´ð\u009f\u008d\u009fwould recommend visiting weekends"
            ]
        },
        {
            "name": "Rainland Resort Athirappilly",
            "rating": [
                4.8
            ],
            "address": [
                "rainland athirapilly, Kannamkuzhy Bridge, po, vettilappara, athirapilly, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "I stayed here with family for two days. It was a very pleasant experience. The hotel's manager and the staff were very courteous and welcoming. They made sure of the comfort of all their guests. The food was very tasty too. My family loved it. The rooms were clean and the resort with swimming pool is very well maintained. There is a kids play area for small children.The resort is also very close to Athirappilly Waterfalls and Vazhachal waterfalls. I would definitely recommend this place to anyone who would like to visit these places or may be even as a weekend getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at a hotel in Rainland, and it was an exceptional experience. From the moment I checked in, the customer service was top-notch. The staff was incredibly welcoming and went above and beyond to ensure my stay was comfortable and enjoyable.\n\nThe hotel's environment added to the overall charm. It was serene and beautifully maintained, creating a perfect retreat after a day of exploring Rainland. The room I stayed in was not only cozy and well-appointed but also impeccably clean, making it a comfortable haven.\n\nAdditionally, the hotel's amenities were impressive.\n\nOverall, my stay at this hotel in Rainland was a delightful experience.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "A very cozy stay. The staff were really helpful and polite. Clean sheets and rooms, the pool was well maintained & clean and a 10-15 min walk to the river for a beautiful view. Complimentary breakfast was nice and the dinner was fabulous. Overall I had a lovely experience.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Best resort near Athirappilly to spent time with Family.\nVery friendly staff.\nBest and safe  pool even kids can enjoy safely.\nJust above average food which get 4 star only out of 5.\nRest everything holds 5 out of 5.\nReception staff are also very supportive",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Had a wonderful stay. Shout out to the team who were extremely hospitable. There was a kids area, swimming pool everything clean and well maintained. Food was excellent specially the chicken soup and veg soup. We had a great time at this hotel and definitely recommend to others.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed family two days pleasant experience hotels manager staff courteous welcoming made sure comfort guests food tasty family loved rooms clean resort swimming pool well maintained kids play area small childrenthe resort also close athirappilly waterfalls vazhachal waterfalls would definitely recommend place anyone would like visit places may even weekend getaway",
                "recently pleasure staying hotel rainland exceptional experience moment checked customer service topnotch staff incredibly welcoming went beyond ensure stay comfortable enjoyable hotels environment added overall charm serene beautifully maintained creating perfect retreat day exploring rainland room stayed cozy wellappointed also impeccably clean making comfortable additionally hotels amenities impressive overall stay hotel rainland delightful experience",
                "cozy stay staff really helpful polite clean sheets rooms pool well maintained clean min walk river beautiful view complimentary breakfast nice dinner fabulous overall lovely experience",
                "best resort near athirappilly spent time family friendly staff best safe pool even kids enjoy safely average food get star rest everything holds reception staff also supportive",
                "wonderful stay shout team extremely hospitable kids area swimming pool everything clean well maintained food excellent specially chicken soup veg soup great time hotel definitely recommend others"
            ]
        },
        {
            "name": "Athirappilly GREEN TREES RESORTS",
            "rating": [
                4.6
            ],
            "address": [
                "Athirapally Road, Pillappara, Vettilappara, Chalakkudy, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "I am sharing to express my utmost satisfaction and gratitude for the exceptional service my family and I received during our recent stay at your resort. It was truly a wonderful experience for us!\nFrom the moment we arrived, we were greeted with a cool and calm atmosphere that instantly put us at ease. The staff members exceeded our expectations by delivering an outstanding level of customer service with an incredible amount of empathy. They effortlessly fulfilled our needs without making us wait, and their attentiveness made us feel truly valued as guests.\n\nOne aspect that stood out to us was the impeccable cleanliness and tidiness of the rooms. It was evident that great care was taken to ensure a pristine environment, which further added to our overall comfort and enjoyment. Additionally, having multiple pools and a small playing area for kids was a huge bonus. Our 2-year-old son had a blast and it was heartwarming to see him having so much fun.\nAs a result of the efforts made by the entire team, my family and I were able to truly relax and unwind. We were left feeling extremely happy and rejuvenated by the end of our stay. The experience exceeded our expectations in every aspect, making it one of our most memorable vacations to date.\nOnce again, I would like to extend my sincere appreciation to each member of your staff for their exceptional service and commitment to providing an exceptional guest experience. You have certainly set a high standard for customer service that should be recognized.\nThank you for creating such a delightful environment for us and for making our stay at Green Trees an unforgettable one. We look forward to returning in the future and recommending your resort to friends and family.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "One of the best resort I have visited till now.  all the staffs are  very friendly and helpful. The room was well equipped and the service was excellent. From the balcony, we could view the nature view and feel the cool breeze. The location of our room was absolutely perfect. A very good place to relax and chill. The scenery was beautiful and it was a relieve to walk in such a quiet and peaceful Environmental. River side walking and fishing are very enjoyable.\nOur stay at the hotel was just for one day one night. Next day we left but we enjoyed a lot. And All respect for who does a great job here. Excellent hospitality. Thanks for the good experience Green Trees Resort",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Beautiful property. Superbly maintained. Very friendly staff. Food was good too.\n\nFew things to note:\n1. It's a small property so doesn't have a lot of open area to walk around etc. There are 3 pools though and they arrange a river walk outside every evening.\n2. Bang on the main road so easy access. Other resorts are bit inside and access rosds are not in good shape.\n3. There isn't much to explore by walk outside the resort but that's the case w all resorts in this area.\n4. Has a small pond/lake surrounded by rocks which must be beautiful right after monsoon.\n5. Property is on an incline so has steps here and there (not too many though) but might be a challenge for elder people.\n\nThis is definitely in the top 3 resorts there. You won't go wrong staying here.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Amazing ambience n lot of peace. Very beautiful place.The rooms are very clean. They provide with tasty n delicious food. Cook according to your requirements. The staff approaches very well. They are friendly n supportive. We had an amazing experience. Will love to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I had an absolutely wonderful one-day stay at the resort! From the moment I arrived, the staff was incredibly welcoming and attentive. The room was spacious, clean, offering a stunning view of the surrounding scenery. The resort's amenities were top-notch; I especially enjoyed the  swimming pool. Riverside trecking and fishing are the another activities. In the restaurant served delicious food, and the service was impeccable. My day at the resort felt like a true escape from the everyday hustle and bustle. I can't wait to return for a longer stay!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sharing express utmost satisfaction gratitude exceptional service family received recent stay resort truly wonderful experience us moment arrived greeted cool calm atmosphere instantly put us ease staff members exceeded expectations delivering outstanding level customer service incredible amount empathy effortlessly fulfilled needs without making us wait attentiveness made us feel truly valued guests one aspect stood us impeccable cleanliness tidiness rooms evident great care taken ensure pristine environment added overall comfort enjoyment additionally multiple pools small playing area kids huge bonus yearold son blast heartwarming see much fun result efforts made entire team family able truly relax unwind left feeling extremely happy rejuvenated end stay experience exceeded expectations every aspect making one memorable vacations date would like extend sincere appreciation member staff exceptional service commitment providing exceptional guest experience certainly set high standard customer service recognized thank creating delightful environment us making stay green trees unforgettable one look forward returning future recommending resort friends family",
                "one best resort visited till staffs friendly helpful room well equipped service excellent balcony could view nature view feel cool breeze location room absolutely perfect good place relax chill scenery beautiful relieve walk quiet peaceful environmental river side walking fishing enjoyable stay hotel one day one night next day left enjoyed lot respect great job excellent hospitality thanks good experience green trees resort",
                "beautiful property superbly maintained friendly staff food good things note small property doesnt lot open area walk around etc pools though arrange river walk outside every evening bang main road easy access resorts bit inside access rosds good shape isnt much explore walk outside resort thats case w resorts area small pondlake surrounded rocks must beautiful right monsoon property incline steps many though might challenge elder people definitely top resorts wont go wrong staying",
                "amazing ambience n lot peace beautiful placethe rooms clean provide tasty n delicious food cook according requirements staff approaches well friendly n supportive amazing experience love visit",
                "absolutely wonderful oneday stay resort moment arrived staff incredibly welcoming attentive room spacious clean offering stunning view surrounding scenery resorts amenities topnotch especially enjoyed swimming pool riverside trecking fishing another activities restaurant served delicious food service impeccable day resort felt like true escape everyday hustle bustle cant wait return longer stay"
            ]
        },
        {
            "name": "Hydel Palace Hotel and Resorts by Bestinn leisure",
            "rating": [
                4.4
            ],
            "address": [
                "Athirappilly, Vettilappara, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "Staying at the hotel near Athirapally Waterfalls was an unforgettable experience. The staff were incredibly welcoming and attentive, making sure every need was met with a smile. The rooms were comfortable, clean, and well-equipped, providing a cozy retreat after a day of exploring the surrounding natural beauty. The delicious local cuisine served at the hotel's restaurant was a delightful bonus, offering a true taste of Kerala. Overall, I highly recommend this hotel to anyone looking for a tranquil getaway amidst nature's wonders in Kerala.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Upon entering my room, I was immediately struck by the impeccable attention to detail. The decor exuded elegance, with plush furnishings and tasteful artwork creating a sense of opulence. The bed was a sanctuary of comfort, with high-quality linens inviting a restful night's sleep. The expansive windows offered breathtaking views of the city , providing the perfect backdrop to unwind after a long day of exploring.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "As a part of my trip with family we took room. It was really a good experience. Great ambience,forest view and staff are very friendly. They Have food service also so you can have it from their hotel or take it to the room  also. Food was nice and a lot of different foods are available, so it's worth it if u give it a try.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Rooms were filthy..very poorly maintained....full of flies and small cockroaches running around..they even switched off the A/c at night and we had to call them up at 2am in the morning to switch it back ON..there was no water in toilets in the morning and on enquiry the staff replied some one in the next room might be using the shower...I mean seriously?? Very poor service from the staff...",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had a stay here for a night with our 4 month old baby. The room and the restaurant met our expectations. The location is on the main road to Athirapilly waterfall. There is a limited parking facility in front of the hotel and more at the back. Good for family.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staying hotel near athirapally waterfalls unforgettable experience staff incredibly welcoming attentive making sure every need met smile rooms comfortable clean wellequipped providing cozy retreat day exploring surrounding natural beauty delicious local cuisine served hotels restaurant delightful bonus offering true taste kerala overall highly recommend hotel anyone looking tranquil getaway amidst natures wonders kerala",
                "upon entering room immediately struck impeccable attention detail decor exuded elegance plush furnishings tasteful artwork creating sense opulence bed sanctuary comfort highquality linens inviting restful nights sleep expansive windows offered breathtaking views city providing perfect backdrop unwind long day exploring",
                "part trip family took room really good experience great ambienceforest view staff friendly food service also hotel take room also food nice lot different foods available worth u give try",
                "rooms filthyvery poorly maintainedfull flies small cockroaches running aroundthey even switched ac night call morning switch back onthere water toilets morning enquiry staff replied one next room might using showeri mean seriously poor service staff",
                "stay night month old baby room restaurant met expectations location main road athirapilly waterfall limited parking facility front hotel back good family"
            ]
        },
        {
            "name": "Bethania Resorts Athirappilly",
            "rating": [
                3.6
            ],
            "address": [
                "Athirappilly Waterfalls, near Athirapppilly waterfalls, Bridge, near to Kannankuzhy, Athirapppilly, Ayyampuzha, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "We had a bad experience staying in this resort last week.\nThere was no water supply in the bathroom, and management didnt even cared about this even after we complained.\nThe plug points were not working.\nTV unit was not working, frequent power cuts during night.\nWorst room service.\nFood was below average and very expensive too.\nNot well maintained.. Only good thing is that property located on the riverside.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Last Saturday we 4 members (myself, my wife, my friend and his wife) came to stay here based on the communication between their sales staff and at that time they sent us some photos of the very clean and tidy room and toilet.When we arrived at Bethania Resort they said they would give us a family suite which included a master bedroom and an extra bed in the hall. But they need 15 minutes for clean the room so we ask the manager Mr. Antony to see the room. Only then we will confirm the room. At the same time my friend asked for common toilet. Then he said that he can use the toilet in the opposite room.Terrible thing is , the bathroom is pathetically maintained, the room is below average, we enter the opposite room, my friend is there after  urinating, antony said the opposite room is already confirmed to other guests,and ready to check in.but I saw the same situation in that room dust on the beds in the room too, so we feel very uncomfortable, better to go to some other resort so i informed mr.antony to we are leaving here because there is a huge difference in the photo and the reality.then his face gone rude and he needs 500 rupees for urinated i just wondered and asked him to discount 😏🤣.so he said this is not 'sathram'.Then we all negotiate with him but he behaved very badly to us including our lady members  so I refuse to pay so he said he is going to increase the charge to 2000. Otherwise you can't leave here, so I suggested to my friend lets contact the policeThat time antony told us that he has a good relationship with the nearest police station and there is no effect on you and told me to pay 2000 rupees again, he went from office to call his police friends, we waited for him for an hour but he did not come back, then someone at the reception ask to pay 500 and solve the problem. and finally as it was late night we paid the amount and found other accommodation\n\nDon't get your updates\nThis is not fair...\n???",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Thanks to bethania to enjoy myself wwith my family a memorable day in our trip wwhile stay in athirapalli one night. This resort have a awesome view with river and and other side forest.i noted the hotel staffs r very much concern on the guest needs and behabing them friendly. The rooms r some extend good and clean. Restaurant food is ok. How ever all over i felt very comfort in the srtay. Thanks bethania",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Resort is very good\nwonderful stay.... I will highly recommend the hotel for stay as well food..\nvery nice room  well maintained  rooms\nroom service too good especially house keeping staff are very friendly nature\n...",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Wonderful  Experience  !\nThe Resort  is full of Greenery  , Joy and Happiness\nThe staff if very helping  in Nature\nThe Management  is also pretty  good\nThe location  is Wonderful  as it is just beside the river\nThe food is also delicious  and good in taste\nLoved Going to these Resort\nYou must/have to try these Resort Once\n.....Thank You",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience staying resort last week water supply bathroom management didnt even cared even complained plug points working tv unit working frequent power cuts night worst room service food average expensive well maintained good thing property located riverside",
                "last saturday members wife friend wife came stay based communication sales staff time sent us photos clean tidy room toiletwhen arrived bethania resort said would give us family suite included master bedroom extra bed hall need minutes clean room ask manager mr antony see room confirm room time friend asked common toilet said use toilet opposite roomterrible thing bathroom pathetically maintained room average enter opposite room friend urinating antony said opposite room already confirmed guestsand ready check inbut saw situation room dust beds room feel uncomfortable better go resort informed mrantony leaving huge difference photo realitythen face gone rude needs rupees urinated wondered asked discount ð\u009f\u0098\u008fð\u009f¤£so said sathramthen negotiate behaved badly us including lady members refuse pay said going increase charge otherwise cant leave suggested friend lets contact policethat time antony told us good relationship nearest police station effect told pay rupees went office call police friends waited hour come back someone reception ask pay solve problem finally late night paid amount found accommodation dont get updates fair",
                "thanks bethania enjoy wwith family memorable day trip wwhile stay athirapalli one night resort awesome view river side foresti noted hotel staffs r much concern guest needs behabing friendly rooms r extend good clean restaurant food ok ever felt comfort srtay thanks bethania",
                "resort good wonderful stay highly recommend hotel stay well food nice room well maintained rooms room service good especially house keeping staff friendly nature",
                "wonderful experience resort full greenery joy happiness staff helping nature management also pretty good location wonderful beside river food also delicious good taste loved going resort musthave try resort thank"
            ]
        },
        {
            "name": "Athirappilly Clirind Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Kannankuzhi, Athirappilly Vettilappara.P.O. Trissur Dist. Kerala Athirappilly, 7HP5+JPR, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "I stayed with my family for a day. The staff were friendly, room was clean and the AC was working. The Athirapilly Falls was close by but was closed due as the water flow was low. But the kids enjoyed the bath in the shallow river closeby. Booked a Standard Room(Gold) for 2 adults and 3 kids. 2.5k with 500 for extra bed. Felt a bit pricey. Thanks for complimentary breakfast.   If they have some playstuff, swimming pool for the kids, it would have been great .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This place is not for family stay. This is almost a lodge than a resort. Power kept on failing through the night, affecting the family's peace. No kids playing area or activities. Room was shabby and toilet stinky. The location is in the middle of nowhere. The facility is under staffed. Identifying the location itself was a challenge since there are no boards. This is more of a bachelor party location than a family hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Room is spacious and clean. Hotel is near to the riverfront just 2 min walk to river side.\nFood is not that great and service was also delayed due to many guests. No amenities even though named as “Resort”",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "My family and I stayed here for one day. The stay was okay, but it didn't provide the comfort we've experienced at other resorts. We opted for their highest category room.\n\nI'm unsure why one of their staff members repeatedly stood in front of my room without reason. Upon opening the door, he would ask, 'Need any help?' This occurrence didn't seem coincidental. Furthermore, his attitude and gestures were not good.\n\nThe rooms were decent but not cozy. The bathroom requires renovation as it's in poor condition and lacks hygiene.\n\nThe breakfast provided was good.\nThe front office guy Anfaz was helpfull.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place for a fair price.\nRooms are clean, AC is working and also hot water.\nGot breakfast and dinner here, it was tasty. Also caretaker are kind and helpful.\nClose to the river for a bath in the evening.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed family day staff friendly room clean ac working athirapilly falls close closed due water flow low kids enjoyed bath shallow river closeby booked standard roomgold adults kids k extra bed felt bit pricey thanks complimentary breakfast playstuff swimming pool kids would great",
                "place family stay almost lodge resort power kept failing night affecting familys peace kids playing area activities room shabby toilet stinky location middle nowhere facility staffed identifying location challenge since boards bachelor party location family hotel",
                "room spacious clean hotel near riverfront min walk river side food great service also delayed due many guests amenities even though named â\u0080\u009cresortâ\u0080\u009d",
                "family stayed one day stay okay didnt provide comfort weve experienced resorts opted highest category room im unsure one staff members repeatedly stood front room without reason upon opening door would ask need help occurrence didnt seem coincidental furthermore attitude gestures good rooms decent cozy bathroom requires renovation poor condition lacks hygiene breakfast provided good front office guy anfaz helpfull",
                "good place fair price rooms clean ac working also hot water got breakfast dinner tasty also caretaker kind helpful close river bath evening"
            ]
        },
        {
            "name": "Sterling Athirappilly",
            "rating": [
                4.9
            ],
            "address": [
                "Kannamkuzhy Bridge, P.O, Vettilappara, Athirappilly, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "⭐⭐⭐⭐⭐\n\nWe had a fantastic stay at Sterling Resorts, Athirapally for our sales meeting! The staffs were super friendly and always ready to help. The property is lovely and conveniently located near the waterfalls. The views from the balcony and infinity pool are breathtaking. The food was pretty good, and the were clean and comfortable. Highly recommended for a memorable stay!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "A mindblowing experience with stunning view from the room's balcony. The food was delicious. The view of the waterfall from the infinity pool was spectacular! It was worth it! The staff was really friendly. The outdoor activities were also amazing. But the only thing I want to add on is that they should have some arrangements for the drivers. Over all it was incredible, outstanding! Totally enjoyed the stay👌👏🥳",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Rooms are awesome. Good customer care. Only draw back is food, even though they have few options in the menu, the taste is not so good. Enjoying morning breakfast fast by sitting near to the water stream is unforgettable.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "This was the nicest hotel we ever visited.\nThe rooftop pool was incredible.\nYou have a wonderful view of the river and the three waterfalls.\nWe Spent a lot of time in the restaurant, there is a big collection of food, all we tried was extremely delicious.\nThe service is awesome, everyone was very friendly and polite. We felt safe and all people were very helpful.\nWe would really recommend to stay here!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "I've been a member Sterling Holidays since many years and have stayed in many of their properties and i think i can gladly say that Sterling Athirappilly could very well be one of their best, at least in Kerala.\n\nWhen we visited the resort to celebrate our anniversary, the property was still in it's finishing stages with some small work going on in the background but the location easily takes the cake and can make us forget about other factors. It lies in very close proximity to the river with a clean and amazing view of the waterfalls from the roof of the property. The ambience is really nice and chill with all of the crew handling service and their duties really well.\n\nAll of the staff were so friendly and even surprised us with a cake and romantic decorations in our room for our special day.\n\nFood was also good with a dedicated chef and kitchen staff who all were very friendly and interacted with us warmly. Prices are slightly on the higher side but if you are familiar with Sterling Properties they have attractive meal plans and room\nUpgrade options which can make\nIt really worth the money.\n\nAlso the infinity pool was really nice with a great view and relaxing ambience, but would need better service and cleaning, once more and more guests start arriving, as i felt it is prone to getting dirty very fast.\n\nOverall this is a very nice place to relax and unwind if you are visiting Athirappilly. I really think they could become a spot to watch out for if they keep up their service and quality after finishing all the pending work, and after more guests start to come.\n\n5 Stars!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "â­\u0090â­\u0090â­\u0090â­\u0090â­\u0090 fantastic stay sterling resorts athirapally sales meeting staffs super friendly always ready help property lovely conveniently located near waterfalls views balcony infinity pool breathtaking food pretty good clean comfortable highly recommended memorable stay",
                "mindblowing experience stunning view rooms balcony food delicious view waterfall infinity pool spectacular worth staff really friendly outdoor activities also amazing thing want add arrangements drivers incredible outstanding totally enjoyed stayð\u009f\u0091\u008cð\u009f\u0091\u008fð\u009f¥³",
                "rooms awesome good customer care draw back food even though options menu taste good enjoying morning breakfast fast sitting near water stream unforgettable",
                "nicest hotel ever visited rooftop pool incredible wonderful view river three waterfalls spent lot time restaurant big collection food tried extremely delicious service awesome everyone friendly polite felt safe people helpful would really recommend stay",
                "ive member sterling holidays since many years stayed many properties think gladly say sterling athirappilly could well one best least kerala visited resort celebrate anniversary property still finishing stages small work going background location easily takes cake make us forget factors lies close proximity river clean amazing view waterfalls roof property ambience really nice chill crew handling service duties really well staff friendly even surprised us cake romantic decorations room special day food also good dedicated chef kitchen staff friendly interacted us warmly prices slightly higher side familiar sterling properties attractive meal plans room upgrade options make really worth money also infinity pool really nice great view relaxing ambience would need better service cleaning guests start arriving felt prone getting dirty fast overall nice place relax unwind visiting athirappilly really think could become spot watch keep service quality finishing pending work guests start come stars"
            ]
        },
        {
            "name": "Riverok Villas",
            "rating": [
                4
            ],
            "address": [
                "Kannankuzhi, Athirappally, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "Wort experience with this people... They won't respect small amount  rooms..  our rooms were fully covered with honey bees... We are really in kids... While we asked for. Another rooms for emergency..they all very rude... Still 11pm we waited in garden area.. after many conversations they allowed some other rooms.. but they said we won't allow you for extra facilities and switch off their AC... Worst... We really fed up with these people... Some times they won't available.. for that we are  check out very early... We didn't use their bathrooms and not even brush.. we just check out to  go to some restaurant asked their permission to brush teeth and for face for kids... To get fresh up......stupid ...worst experience... If you want good experience that resort...go with more money....",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I recently visited this resort with my family. Almost 15 members were there including kids. It is a nice place, perfect for family outings. Having the river in its backyard was a great attraction. Also the small trek from resort to waterfall was fun. With whole family except elderly, walking together to waterfall was truly a memorable experience.\n\nComing to rooms, they were cozy. 2-3 people were staying in each cottage. It was convenient. Food served was also good. Minor service issues were there but it didn’t affect our experience in any way. Staffs were very helpful and we had a grill arranged for the night. Staffs were very attentive to our needs.\n\nOverall I highly recommend this place..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good rooms, there are six room at ground floor and backside lawn is on river side with chairs and dining area..can go to river from hotel backside itself. Food is also average good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The place was really nice. It was river facing and had opportunities to get into the water directly from the resort. It is in very close proximity to the waterfalls. The staff is very friendly and the food was tasty. Totally recommend the place.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very cooperative and helping management and staff. Rooms are neat and tidy. Services excellent. Best food.\nFacility is very good and adjacent to the river\nWill again come and stay in near future.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wort experience people wont respect small amount rooms rooms fully covered honey bees really kids asked another rooms emergencythey rude still pm waited garden area many conversations allowed rooms said wont allow extra facilities switch ac worst really fed people times wont available check early didnt use bathrooms even brush check go restaurant asked permission brush teeth face kids get fresh upstupid worst experience want good experience resortgo money",
                "recently visited resort family almost members including kids nice place perfect family outings river backyard great attraction also small trek resort waterfall fun whole family except elderly walking together waterfall truly memorable experience coming rooms cozy people staying cottage convenient food served also good minor service issues didnâ\u0080\u0099t affect experience way staffs helpful grill arranged night staffs attentive needs overall highly recommend place",
                "good rooms six room ground floor backside lawn river side chairs dining areacan go river hotel backside food also average good",
                "place really nice river facing opportunities get water directly resort close proximity waterfalls staff friendly food tasty totally recommend place",
                "cooperative helping management staff rooms neat tidy services excellent best food facility good adjacent river come stay near future"
            ]
        },
        {
            "name": "Willow Heights Athirapally",
            "rating": [
                4.2
            ],
            "address": [
                "VI/248A, Kannamkuzhy Bridge, Athirappally, Vettilappara, Pariyaram, Kerala 680721, India"
            ],
            "reviews": [
                {
                    "text": "\"Willow Heights Athirapally is a hidden gem nestled along the serene banks of the Athirapally River. From the moment you arrive, you're enveloped in tranquility and natural beauty. The highlight of this enchanting retreat is undoubtedly the swimming pool overlooking the flowing river, offering a refreshing escape amidst breathtaking surroundings.\n\nThe resort itself is a testament to luxury and comfort, with spacious and elegantly appointed rooms providing a perfect blend of modern amenities and rustic charm. Whether you're lounging by the pool, taking a leisurely stroll along the riverbanks, or indulging in delectable cuisine at the on-site restaurant, every moment at Willow Heights is a cherished experience.\n\nThe staff's warm hospitality adds an extra layer of delight to your stay, ensuring that every need is met with a smile. Whether you're seeking a romantic getaway, a family adventure, or simply a peaceful retreat from the hustle and bustle of daily life, Willow Heights Athirapally promises an unforgettable stay. Highly recommended for anyone looking to immerse themselves in nature's embrace while enjoying the comforts of a luxurious resort.\"",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "View from the rooms is too good. We will have a swimming pool and access to the flowing river.\nMobile signals are good. Good food and service from the team. Cost is reasonable. Overall it's a great place to enjoy with the family.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The view to the river was the greatest thing I felt. The resort was near and calm and had good facilities. The service was excellent. The food was also amazing. There were a lot of nice photographic places inside the resort. The dip in the river in the early morning also was so special. The dedicated place for restaurant was also so pleasant and charming. The breakfast which was complementary was also good\nThe negatives I felt were, the location of the resort. A pocket road needs to be taken from the main road which is difficult to see. The road was bad and narrow. Also the AC remote wasn’t working in our room. So it took a long time to cool the room as the temperature was preadjusted.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Me and wife went for a day of staycation at Willow heights last week. We had booked the room with a river view.  Simply saying Best decision we made. We had a wonderful time there. The atmosphere at the hotel was so soothing and pleasant. Loved it. The food delivered for dinner was superb with reasonable cost. The  breakfast which was included in the room package was very delicious.  The hotel had a public pool which was ok for us. We enjoyed it a lot.  Since the river was nearby we enjoyed a morning walk along the river bed which had less water level due to summer. Overall we will give 9 out of 10\n\nOnly one problem was we found algae/ fungous on side of steps inside pool. We saw the pool cleaning process on the morning of our stay, but I think they only clean the lower flat surface of the pool and without realising it they r omitting the side especially on the side of steps. Hope they will do it next time.\n\nAnyway thank you for the wonderful time we enjoyed there. Will comeback soon.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The river view was awesome, you can access to the river directly from the resort. The swimming pool look was also outstanding. Family friendly and service, cleanliness was outstanding.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "willow heights athirapally hidden gem nestled along serene banks athirapally river moment arrive youre enveloped tranquility natural beauty highlight enchanting retreat undoubtedly swimming pool overlooking flowing river offering refreshing escape amidst breathtaking surroundings resort testament luxury comfort spacious elegantly appointed rooms providing perfect blend modern amenities rustic charm whether youre lounging pool taking leisurely stroll along riverbanks indulging delectable cuisine onsite restaurant every moment willow heights cherished experience staffs warm hospitality adds extra layer delight stay ensuring every need met smile whether youre seeking romantic getaway family adventure simply peaceful retreat hustle bustle daily life willow heights athirapally promises unforgettable stay highly recommended anyone looking immerse natures embrace enjoying comforts luxurious resort",
                "view rooms good swimming pool access flowing river mobile signals good good food service team cost reasonable overall great place enjoy family",
                "view river greatest thing felt resort near calm good facilities service excellent food also amazing lot nice photographic places inside resort dip river early morning also special dedicated place restaurant also pleasant charming breakfast complementary also good negatives felt location resort pocket road needs taken main road difficult see road bad narrow also ac remote wasnâ\u0080\u0099t working room took long time cool room temperature preadjusted",
                "wife went day staycation willow heights last week booked room river view simply saying best decision made wonderful time atmosphere hotel soothing pleasant loved food delivered dinner superb reasonable cost breakfast included room package delicious hotel public pool ok us enjoyed lot since river nearby enjoyed morning walk along river bed less water level due summer overall give one problem found algae fungous side steps inside pool saw pool cleaning process morning stay think clean lower flat surface pool without realising r omitting side especially side steps hope next time anyway thank wonderful time enjoyed comeback soon",
                "river view awesome access river directly resort swimming pool look also outstanding family friendly service cleanliness outstanding"
            ]
        },
        {
            "name": "Plantation Valley",
            "rating": [
                4.1
            ],
            "address": [
                "Vettilapara, Athirapilly Road, Pariyaram, Kerala 680724, India"
            ],
            "reviews": [
                {
                    "text": "We stayed in a dormitory situated 100 meters away from main lobby. The facility was average. Bathroom was below average. But the property was well maintained with a buffalo grass garden and plenty of space for family to spend their time. Property is right next to river make it more comfortable and accessible to enjoy. Food is very limited but good one.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We came to this hotel by chance, but we really liked it and stayed the night. Beautiful, well-groomed, clean area. The hotel is located in a picturesque location near the river. A great place for relaxation and events.\nThe staff is attentive and friendly.\nThe rooms need renovation. also the bed linen and towels need updating. Unfortunately, this is a big minus.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A very peaceful and economic destination in Athirappilly. A great river side stay and access to all sorts of Kerala food. The rooms are quite big and clean. Luckily we got a chance to witness a group of elephants coming to drink water form the river on the opposite bank of the stay. Room rent is around 3.2k+tax.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The accommodations were absolutely fantastic, and the proximity to Athirappilly Falls added an extra layer of excitement to our stay. Following our delightful time at the resort, we ventured to the falls, where we immersed ourselves in the beauty of nature and had an absolute blast. The staff members were not only incredibly professional but also exuded a warm and welcoming demeanor, making us feel right at home throughout our reunion. It was a joyous occasion, filled with laughter and cherished moments shared among my mother's colleagues and our extended family. The impeccable service provided by the staff contributed significantly to our overall enjoyment, leaving us with unforgettable memories to treasure for years to come.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Resort with a great river view from the cottage.Run by Kerala government.resonable pricing for AC cottages compared to other resorts area in the same locality .awesome Kerala food prepared by in house staff.dining area is overlooking the river which gives a relaxed feel.resort has a pathway to reach the river and play,which is private.stay here to visit athirapally waterfalls,thumboormuzhy dam&garden,charpa waterfalls,vazhachal waterfalls.also from chalakudy potta junction,u can visit snehatheeram beach and thriprayar ramaswami temple .we didn't go  on Pollachi/Valparai side from this resort  as we have already explored few yrs back.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed dormitory situated meters away main lobby facility average bathroom average property well maintained buffalo grass garden plenty space family spend time property right next river make comfortable accessible enjoy food limited good one",
                "came hotel chance really liked stayed night beautiful wellgroomed clean area hotel located picturesque location near river great place relaxation events staff attentive friendly rooms need renovation also bed linen towels need updating unfortunately big minus",
                "peaceful economic destination athirappilly great river side stay access sorts kerala food rooms quite big clean luckily got chance witness group elephants coming drink water form river opposite bank stay room rent around ktax",
                "accommodations absolutely fantastic proximity athirappilly falls added extra layer excitement stay following delightful time resort ventured falls immersed beauty nature absolute blast staff members incredibly professional also exuded warm welcoming demeanor making us feel right home throughout reunion joyous occasion filled laughter cherished moments shared among mothers colleagues extended family impeccable service provided staff contributed significantly overall enjoyment leaving us unforgettable memories treasure years come",
                "resort great river view cottagerun kerala governmentresonable pricing ac cottages compared resorts area locality awesome kerala food prepared house staffdining area overlooking river gives relaxed feelresort pathway reach river playwhich privatestay visit athirapally waterfallsthumboormuzhy damgardencharpa waterfallsvazhachal waterfallsalso chalakudy potta junctionu visit snehatheeram beach thriprayar ramaswami temple didnt go pollachivalparai side resort already explored yrs back"
            ]
        }
    ]
}