{
    "places_with_reviews": [
        {
            "name": "Krishna Beach Resort",
            "rating": [
                4.5
            ],
            "address": [
                "Palliyamoola Chalad, P.O, Alavil - Azhikode Rd, Chalad, Kannur, Kerala 670008, India"
            ],
            "reviews": [
                {
                    "text": "This resort is an architectural marvel. Pictures do not do justice to this place. Location is good, with a shortcut to the beach. However, view from the rooms is partially blocked because of trees within the campus. Rooms are very big in size. Balconies are also huge. But mosquitoes would not allow you to have a relaxed time there. Apart from that, the resort offers five-star hospitality, the staff was extremely polite and professional. Breakfast buffet was very good. Dinner buffet was also decent. Overall, a memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Krishna Beach Resort exceeded my expectations during my first visit for a function. The ambiance of the resort and it's surroundings were superb , creating a serene atmosphere .. The food served was also good, adding to the overall experience..The hall where our function took place was spacious, providing ample room for everyone to enjoy themselves during the function.  I would highly recommend it to anyone looking for a memorable and enjoyable event experience..❤️❤️",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The stay at KBR was very comfortable. The room was very clean and spacious. The breakfast buffet had a good variety with good Kerala delicacies. The auditorium was large enough for the group. The lunch and dinner services were excellent and the food very tasty. The negative points included poor audiovisual facilities in the hall and the sultry sweaty open air facilities. Some outdoor fans would have helped",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I stayed here for a day with family. Fourwheeler parking facility is available. But if any function is there in this resort, parking is a mess. I met a similar incident as I couldn't take my car out as several cars which came for the function parked irresponsibly obstructing my car. There are several Watchmen , but of no use. Resort stay was good, food was average. Location of the resort is awesome. The campus is great and we can take nice pictures.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We held 2 functions at Krishna beach resort: our engagement & our wedding. We had taken some rooms also on both occasions. It was so easy because they took care of almost everything in 1-2 packages. Food was great ! The stage and decorations were beautiful. The priest/pandit they arranged was very good. As requested, the marriage certificate from the resort was ready on time. Overall, everyone was happy with all of the food, rooms and arrangements. A big thanks to Krishna beach resort for arranging everything beautifully & special thanks to manager Ajay for full support and flexibility throughout.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort architectural marvel pictures justice place location good shortcut beach however view rooms partially blocked trees within campus rooms big size balconies also huge mosquitoes would allow relaxed time apart resort offers fivestar hospitality staff extremely polite professional breakfast buffet good dinner buffet also decent overall memorable stay",
                "krishna beach resort exceeded expectations first visit function ambiance resort surroundings superb creating serene atmosphere food served also good adding overall experiencethe hall function took place spacious providing ample room everyone enjoy function would highly recommend anyone looking memorable enjoyable event experienceâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
                "stay kbr comfortable room clean spacious breakfast buffet good variety good kerala delicacies auditorium large enough group lunch dinner services excellent food tasty negative points included poor audiovisual facilities hall sultry sweaty open air facilities outdoor fans would helped",
                "stayed day family fourwheeler parking facility available function resort parking mess met similar incident couldnt take car several cars came function parked irresponsibly obstructing car several watchmen use resort stay good food average location resort awesome campus great take nice pictures",
                "held functions krishna beach resort engagement wedding taken rooms also occasions easy took care almost everything packages food great stage decorations beautiful priestpandit arranged good requested marriage certificate resort ready time overall everyone happy food rooms arrangements big thanks krishna beach resort arranging everything beautifully special thanks manager ajay full support flexibility throughout"
            ]
        },
        {
            "name": "MAGNET HOTEL KANNUR",
            "rating": [
                4.3
            ],
            "address": [
                "W977+PJJ, Chirakkal, Puthiyatheru, Kerala 670011, India"
            ],
            "reviews": [
                {
                    "text": "There is no scenic view from the spot, but gives a better ambience with the Banyan tree in the front. Also the sculpture at reception gives an attire of being at folklore region.\n\nFront office staff is friendly and responds to queries.\n\nFood is nice and not exceptional in quality, and presented nicely giving you a bit of luxury feel. With ample parking space and dining space never use to be crowded.\n\nRoom rents are on a higher side when compared to similar ones in close vicinity. No comments on rooms, as I never experienced it.\n\nMost important fact is that, negative comments on review are not responded. Responses to such comments gives a feeling that things are being addressed and continuously improving.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel was really good. We went for a wedding reception. The hall was spacious and the food served was extremely good.\nAmple parking facility is available. The ambience and the view from the top is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Room and food was good. Service was nice. Arranged transportation according to our need. Only annoying thing was they made wait during checkout to check the room and ensure everything is present in room. A person who booked the room for 10k what he will steal from there, towels?. First time i faced this from a hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Lovely property. Had a pleasant stay. Rooms are quite good. Well arranged and spacious. Even the lobby areas and corridors are maintained properly.\nRestaurant is also nice, Just got a chance to stay overnight only. So had opportunity to try out breakfast only. But will visit again in future",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We were excited to celebrate Vishu with a traditional Sadhya meal, but unfortunately, our experience fell short this time. The service was lacking, and the food lacked proper seasoning(salt), which was very disappointing. Despite having enjoyed our visits in the past, this experience didn't meet our expectations.\"",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "scenic view spot gives better ambience banyan tree front also sculpture reception gives attire folklore region front office staff friendly responds queries food nice exceptional quality presented nicely giving bit luxury feel ample parking space dining space never use crowded room rents higher side compared similar ones close vicinity comments rooms never experienced important fact negative comments review responded responses comments gives feeling things addressed continuously improving",
                "hotel really good went wedding reception hall spacious food served extremely good ample parking facility available ambience view top also good",
                "room food good service nice arranged transportation according need annoying thing made wait checkout check room ensure everything present room person booked room k steal towels first time faced hotel",
                "lovely property pleasant stay rooms quite good well arranged spacious even lobby areas corridors maintained properly restaurant also nice got chance stay overnight opportunity try breakfast visit future",
                "excited celebrate vishu traditional sadhya meal unfortunately experience fell short time service lacking food lacked proper seasoningsalt disappointing despite enjoyed visits past experience didnt meet expectations"
            ]
        },
        {
            "name": "Pranav Beach Resort",
            "rating": [
                3.8
            ],
            "address": [
                "Beach Rd, Chalad, Palliyanmoola, Kerala 670008, India"
            ],
            "reviews": [
                {
                    "text": "We had the immense pleasure of organizing my son's wedding , and it was nothing short of spectacular. The venue's location, with its breathtaking sea-facing views, provided a stunning backdrop for the celebration. The charm of the sea, combined with the elegant setting, made for unforgettable memories.\n\nThe villas, where we and our guests stayed, were exceptional. Each room was neat and clean.\n\nWhat stood out to us, apart from the beautiful location and facilities, were the amenities provided. The  amenities added an extra layer of comfort and enjoyment to our stay.\n\nPranav Resort  offered the perfect setting for my son's wedding, combining natural beauty, luxurious accommodation, and exceptional service. We are deeply grateful to the staff and management for their part in making the event so special. I highly recommend   to anyone looking to organize a wedding or any celebration that calls for a beautiful, serene, and well-equipped venue.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Peaceful place for relax. Pranav beach resort is near payyambalam beach, light house , St. Angelo etc at Kannur. Under coconut trees there is few traditional type cottage with neat and tidy interiors which are attracting more foreigners as well. Beach is few steps away from this property. Staffs n management are very service oriented. Best experience..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I saw so many negative  reviews... But we stayed there a week ago to explore the town. We came from Bangalore.. and it was an amazing stay here..  they gave us an extra pillow, blanket, and their food was amazing which was complimentary ( breakfast)..  location is too good and huge space for parking...",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Right opposite one of the cleanest beaches of Kerala. Perfect location for a wedding function or a vacation. Great simple rooms with decent facilities and staff.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Planned for the vacation, please check any wedding is happening  in this resort ,before booking this place.  we visited the resort on wedding day full traffic no space for parking. No hot water for shower. rooms are ok, washrooms are not clean.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "immense pleasure organizing sons wedding nothing short spectacular venues location breathtaking seafacing views provided stunning backdrop celebration charm sea combined elegant setting made unforgettable memories villas guests stayed exceptional room neat clean stood us apart beautiful location facilities amenities provided amenities added extra layer comfort enjoyment stay pranav resort offered perfect setting sons wedding combining natural beauty luxurious accommodation exceptional service deeply grateful staff management part making event special highly recommend anyone looking organize wedding celebration calls beautiful serene wellequipped venue",
                "peaceful place relax pranav beach resort near payyambalam beach light house st angelo etc kannur coconut trees traditional type cottage neat tidy interiors attracting foreigners well beach steps away property staffs n management service oriented best experience",
                "saw many negative reviews stayed week ago explore town came bangalore amazing stay gave us extra pillow blanket food amazing complimentary breakfast location good huge space parking",
                "right opposite one cleanest beaches kerala perfect location wedding function vacation great simple rooms decent facilities staff",
                "planned vacation please check wedding happening resort booking place visited resort wedding day full traffic space parking hot water shower rooms ok washrooms clean"
            ]
        },
        {
            "name": "Marmara Beach House",
            "rating": [
                4
            ],
            "address": [
                "Payyambalam Beach Road, Chalad, Kannur, Kerala 670001, India"
            ],
            "reviews": [
                {
                    "text": "I stayed here with my family for 3N/2D.\n\n-Location is great as its exactly opposite to beach but to reach here you have to use very narrow roads. I guess that's common for all beach houses\n\n-Rooms of two types are available one is beach facing which is little costly over the other which is not facing to beach. And room facing beach are small i.e. convenient for only two persons with huge balcony to enjoy beach view but the other deluxe room (not  facing to beach) is huge literally a family of 4 can stay.\n\n-Service is the only problem of staying here especially for food as  there is no pantry/restaurant attached in this resort so you've to rely on hotels outside (which is good option as per taste and price). But you'll get a complimentary breakfast\n\nIn short it is more of a kind of convention centre best suited for any wedding/family functions but value for money to stay",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's a very nice place I actually went for an engagement function i loved the food there. There are lots of varieties in the buffet beautifully arranged. Its near the beach lovely view",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good place is stay with family, just located opposite of beach with beautiful view\nRooms can be improved a bit and break fast is normal, not much variety .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Please don't stay at this resort. There was no hygiene. The bathroom had cockroach. The AC did not work. Totally Don't stay there.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I just been there for a meetup.it is a beach front property with indoor and outdoor space for small meetups.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed family nd location great exactly opposite beach reach use narrow roads guess thats common beach houses rooms two types available one beach facing little costly facing beach room facing beach small ie convenient two persons huge balcony enjoy beach view deluxe room facing beach huge literally family stay service problem staying especially food pantryrestaurant attached resort youve rely hotels outside good option per taste price youll get complimentary breakfast short kind convention centre best suited weddingfamily functions value money stay",
                "nice place actually went engagement function loved food lots varieties buffet beautifully arranged near beach lovely view",
                "good place stay family located opposite beach beautiful view rooms improved bit break fast normal much variety",
                "please dont stay resort hygiene bathroom cockroach ac work totally dont stay",
                "meetupit beach front property indoor outdoor space small meetups"
            ]
        },
        {
            "name": "Asokam Beach Resort and Ayurveda Chikitsa Kendram",
            "rating": [
                4
            ],
            "address": [
                "Payyambalam Beach Road, Chalad, Palliyamoola, Kerala 670008, India"
            ],
            "reviews": [
                {
                    "text": "The resort was good and clean. For the price we paid for the non AC room the room could be a bit bigger. Food in the restaurant attached was very delicious. Breakfast was complementary even though we had not booked for it. Owner was generous",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Comfortable, clean and spacious room with modern facilities.\n\nExtra bed supplied for child was very comfortable.\n\nFriendly and helpful staff, assisting us to arrange private transportation and a great price.\n\nGood breakfast for adults and children.\n\nGreat pool and well maintained gardens.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very poorly managed Resort.\nSap: Below average, we had to wait till evening for the Spa & very average spa.\nStaff: very cordial, but a lackluster attitude.\nFood: Breakfast, below average.\nVery poor guest PR & zero Hospitality.\nInspite of taking permission and agreed by the front office staff for extra time for checkout, a message was sent to my mobile for extra charges.\nWill not step into this Resort the next time.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I had the best massage i have ever experienced\nTo be honest, I’m not sure what to write exactly – I wanted to just write: “SHEEJA  is awesome! She gives great massages and is very skilled and professional ” What more could I ask for?\nLooking forward to sessions every time i visit Kannur .\n\nThank you Sheeja ,Thank you Asoka therapy center",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Had a good and relaxing stay at Asokam beach resort.property was well maintained and in front of the main beach .rooms were spacious , clean and so was the washroom .\nFood was tasty and service was top notch , special mention to Dhanesh who was on his toes to fulfill all our requests.\nI would highly recommend to visit this place of you are considering to visit Kannur.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort good clean price paid non ac room room could bit bigger food restaurant attached delicious breakfast complementary even though booked owner generous",
                "comfortable clean spacious room modern facilities extra bed supplied child comfortable friendly helpful staff assisting us arrange private transportation great price good breakfast adults children great pool well maintained gardens",
                "poorly managed resort sap average wait till evening spa average spa staff cordial lackluster attitude food breakfast average poor guest pr zero hospitality inspite taking permission agreed front office staff extra time checkout message sent mobile extra charges step resort next time",
                "best massage ever experienced honest iâ\u0080\u0099m sure write exactly â\u0080\u0093 wanted write â\u0080\u009csheeja awesome gives great massages skilled professional â\u0080\u009d could ask looking forward sessions every time visit kannur thank sheeja thank asoka therapy center",
                "good relaxing stay asokam beach resortproperty well maintained front main beach rooms spacious clean washroom food tasty service top notch special mention dhanesh toes fulfill requests would highly recommend visit place considering visit kannur"
            ]
        },
        {
            "name": "Anansa Boutique Hotel by The Kannur Club",
            "rating": [
                4.6
            ],
            "address": [
                "Payyambalam Beach Road, Chalad, Kannur, Kerala 670008, India"
            ],
            "reviews": [
                {
                    "text": "like it a lot. If I come to Kannur again, I will definitely choose here. We have everything we need in a small space. Above that are the staff here. Their behavior was very good. They know very well how to treat the people who come there. It is very neat and clean here. Not to mention the food, it tastes great. I wish you all the very best for your new venture. All the best Kannur team.special thanks to Anansa❤️",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Great experience, The hotel was located right in front of the beach with a great view. It has a nice garden and a spacious parking spot.\nThe rooms had a modern look, it has a standing balcony with a view of the beach. The room is nice and spacious.\nThe staff were nice, the room service was quick and attentive.\nThe pool was big, with shallow and deep parts and also was of infinity pool style.\nThe breakfast buffet had many breakfast options and it's flavour was subtle and tasty.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Highly recommend for food! We had a vegetarian dinner here and each and every dish ordered was delicious. The staff are very good and accomodating and the ambience is wonderful. The place also has an awesome outdoor area. Definite go to place.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Best time in Kannur! Lovely view, service, food! Didn’t even feel the need to step out. The beach is right in front so no hassle there as well. The restaurant was amazing too. Akshay served us throughout with a smile. Arun was also very polite and greeted us at every visit to the restaurant. Loved it!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We loved our stay at Anansa ! The service was very warm and friendly, the rooms clean and food great ! The staff was helpful about everything we requested... The view from the hotel is gorgeous, to say the least. We would recommend this place to everyone who would want to unwind at Kannur near the beach ! You will love it",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "like lot come kannur definitely choose everything need small space staff behavior good know well treat people come neat clean mention food tastes great wish best new venture best kannur teamspecial thanks anansaâ\u009d¤ï¸\u008f",
                "great experience hotel located right front beach great view nice garden spacious parking spot rooms modern look standing balcony view beach room nice spacious staff nice room service quick attentive pool big shallow deep parts also infinity pool style breakfast buffet many breakfast options flavour subtle tasty",
                "highly recommend food vegetarian dinner every dish ordered delicious staff good accomodating ambience wonderful place also awesome outdoor area definite go place",
                "best time kannur lovely view service food didnâ\u0080\u0099t even feel need step beach right front hassle well restaurant amazing akshay served us throughout smile arun also polite greeted us every visit restaurant loved",
                "loved stay anansa service warm friendly rooms clean food great staff helpful everything requested view hotel gorgeous say least would recommend place everyone would want unwind kannur near beach love"
            ]
        },
        {
            "name": "Arabian Beach Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Palliyammoola ,Payyambalam Extention, Payyambalam Beach Road, Chalad, Kannur, Kerala 670014, India"
            ],
            "reviews": [
                {
                    "text": "A nice hotel facing the beach and with a spacious lawn and parking area in the adjacent compound. A nice place for conducting get to gether and marriage receptions. Food is also good",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "4.5/5.\nLocation is too good with ample room space along with an open terrace. Service can be a bit better. Swiggy Zomato works here",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Place and location is good but service is poor. Not even soap, towels, TV in room.\nAlso no food arrangement in the resort had to go outside for it.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good experience\nThe place is heaven to conduct celebrations",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A great resort..!!! he resort is very secure and they have security personnel  posted for night watch. the breakfast was good. Overall a very satisfying place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice hotel facing beach spacious lawn parking area adjacent compound nice place conducting get gether marriage receptions food also good",
                "location good ample room space along open terrace service bit better swiggy zomato works",
                "place location good service poor even soap towels tv room also food arrangement resort go outside",
                "good experience place heaven conduct celebrations",
                "great resort resort secure security personnel posted night watch breakfast good overall satisfying place stay"
            ]
        },
        {
            "name": "Luxe Inn",
            "rating": [
                4.5
            ],
            "address": [
                "Kannur - Alavil - Valapattanam Road, Chalad, Kannur, Kerala 670014, India"
            ],
            "reviews": [
                {
                    "text": "If you are looking a budget and neat room in Kannur town this one of the best option. The rooms are good and spacious. Enough space for car parking in the basement.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The Luxe Inn offered a pleasant and quiet retreat, providing a serene atmosphere that was a welcome escape from the hustle and bustle of daily life. Nestled in a tranquil setting, the peaceful ambiance allowed for a restful stay, creating a perfect environment for relaxation and rejuvenation. The attentive staff and the well-appointed accommodations further enhanced the overall experience, making it a memorable and delightful sojourn.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Service 👎🏻👎🏻👎🏻👎🏻\nRooms are good upto the money. But services and hospitality are like lodge rooms. Hotel should be follow hostel standards but here I didn’t feel any as such.\nIf you are looking for a hotel near to payyambalam beach and your are below 30, please avoid thinking a stay.\nLittle far from the beach, after 11:30 pm, very difficult to reach there since there is no auto or car services are available.\nNot good enough",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Little bit far away from the beach.  Good food is not nearby. You need to spend at least 50 rs to get somewhere. Rooms and bathrooms are very clean and spacious. They offered us in 1680 rs per night. Little smell in the bathroom due to faulty plumbing however it is manageable.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "A budget friendly hotel room located at the heart of kannur city.\nThis is well maintained , Neat and clean room\nSpacious as well\n\nAc room is so cheap\n\nGood for family and friends, with quiet atmosphere.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "looking budget neat room kannur town one best option rooms good spacious enough space car parking basement",
                "luxe inn offered pleasant quiet retreat providing serene atmosphere welcome escape hustle bustle daily life nestled tranquil setting peaceful ambiance allowed restful stay creating perfect environment relaxation rejuvenation attentive staff wellappointed accommodations enhanced overall experience making memorable delightful sojourn",
                "service ð\u009f\u0091\u008eð\u009f\u008f » ð\u009f\u0091\u008eð\u009f\u008f » ð\u009f\u0091\u008eð\u009f\u008f » ð\u009f\u0091\u008eð\u009f\u008f » rooms good upto money services hospitality like lodge rooms hotel follow hostel standards didnâ\u0080\u0099t feel looking hotel near payyambalam beach please avoid thinking stay little far beach pm difficult reach since auto car services available good enough",
                "little bit far away beach good food nearby need spend least rs get somewhere rooms bathrooms clean spacious offered us rs per night little smell bathroom due faulty plumbing however manageable",
                "budget friendly hotel room located heart kannur city well maintained neat clean room spacious well ac room cheap good family friends quiet atmosphere"
            ]
        },
        {
            "name": "Kanaka Beach House",
            "rating": [
                4.3
            ],
            "address": [
                "Payyambalam Beach Road, Palliyamoola, Kannur, Kerala 670008, India"
            ],
            "reviews": [
                {
                    "text": "We came here with a wedding party and continued the stay after they left. The rooms are perfect, everything is immaculate. The staff are honestly so helpful, there was nothing they wouldn’t do to help us, whether that’s sending a parcel, arranging an auto or bus journey, making us breakfast and chai. We are so sad to be leaving here, it’s so peaceful and seconds away from the beach!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Superb Stay ...Had my best Time at Kannur: Thanks to Savid especially for making the stay comfortable and ensured everything in place timely.\nKudos to Kanaka beach house Team.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Property is located just beside of sea beach. You can even have a full view of the sea from your bed.\n\nIt's a pet friendly property.\nPet lovers know how difficult it is to get a pet friendly property in India.\n\nRooms are very neat and clean. All required amenities are available in the room.\n\nAmple parking place available. where we have enjoyed playing football and cricket without damaging the property and parked vehicle.\n\nNow coming to the best part of it. The service is just awesome and the mouth watering food we had here during our stay is unforgettable.\n\nEven the owner of the property personally visited to know if any issues we are facing. it was a heart touching gesture.\n\nIcing on the top was, they have a small tree cafe. it was a rainy day and the sea looks fabulous from the tree cafe.\n\nWe have thoroughly enjoyed our stay in this property also like to recommend others as well. Just have a word with them, you will definitely find a connection.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The room is basic but the location is awesome the beach is just across the road.\n\nThe near by beach is very dirty but have water sports facilities.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I went here to attend a marriage reception from my relative side. The location is obviously good, at least while coming from the Taliparamba side as you don't need to bother about Puthiyatheru traffic. Take Alvil road and pretty much a good route to this place.\nFor parking, they have a good ample place in an adjacent open plot. The only problem is to step inside it when it rains.\nComing to the service and ambience, the place is bigger than expected. It can easily room, more than 100 people in their garden area. Proper place for stage and good sitting area. The opposite view is of the Arabian Sea which is scenic.\nYou can always consider this venue for any program and event.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "came wedding party continued stay left rooms perfect everything immaculate staff honestly helpful nothing wouldnâ\u0080\u0099t help us whether thatâ\u0080\u0099s sending parcel arranging auto bus journey making us breakfast chai sad leaving itâ\u0080\u0099s peaceful seconds away beach",
                "superb stay best time kannur thanks savid especially making stay comfortable ensured everything place timely kudos kanaka beach house team",
                "property located beside sea beach even full view sea bed pet friendly property pet lovers know difficult get pet friendly property india rooms neat clean required amenities available room ample parking place available enjoyed playing football cricket without damaging property parked vehicle coming best part service awesome mouth watering food stay unforgettable even owner property personally visited know issues facing heart touching gesture icing top small tree cafe rainy day sea looks fabulous tree cafe thoroughly enjoyed stay property also like recommend others well word definitely find connection",
                "room basic location awesome beach across road near beach dirty water sports facilities",
                "went attend marriage reception relative side location obviously good least coming taliparamba side dont need bother puthiyatheru traffic take alvil road pretty much good route place parking good ample place adjacent open plot problem step inside rains coming service ambience place bigger expected easily room people garden area proper place stage good sitting area opposite view arabian sea scenic always consider venue program event"
            ]
        },
        {
            "name": "Meenkunnu Beach Resort",
            "rating": [
                4.1
            ],
            "address": [
                "W859+6XM, Azhikode, Azhikode South, Kerala 670009, India"
            ],
            "reviews": [
                {
                    "text": "It was a great experience. Our host was very helpful. He was extremely polite and helpful. He helped us plan our itinerary. Also the location is perfect, away from the city, close to nature and spacious. The beach is close to resort and walkable and very private. Had a great stay at the resort.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very nicely managed resort, away from the city traffic and noise. Good for family and friends gatherings. Very pleasant & charming owners with whom it felt like we were staying at our friend's home only. Adjacent to a very calm and isolated beach named Meenkunnu. Go for a stay here if you want to spend a peaceful day.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The place is scenic in itself. While the building is kind of old, the location and the service over shadows this.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Perfect stay away from the hustle and bustle of the town. Don't go by the reviews given by these privileged and entitled “tourists”. Uncle and aunty really took care of us and were really helpful. The caretaker, Unni was just a phonecall away and helped us order food. We had the whole property to ourselves! So peaceful and the view of sea from the cliff is amazing! The best part, they're pet friendly too! Yes the hosts don't live on the property, but that doesn't mean they're not available in case you need to order food or anything. Aunty made us amazing breakfast everyday. Definitely staying here again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "So let's start the honest review, what I'm writing here so see how useless I'm feeling here.\nSo the owner is very good and kind, the property (if maintained properly) is beautiful that's two points are positive\nThe care taker is not from this planet, I don't know what to say, he is in his own world. Who won't listen.\nNow let me told you.\nWe came here to celebrate our anniversary. Even when we cut our cake, there was none except us, so we don't have any pictures of that moment. (Even the owner lives somewhere else)\nThe property is in it's worst shape. Uncle mainened that pre covid only.\nThe location is very far from all the visiting places. No food inside but yes kitchen is there u can cook.\nRooms are in very bad condition with very bad smell even I broomed my room so that I can sleep.\nMost of the things are not in order.\nI was very excited to see the kids area online but that's the worst part.\nI can write an essay but showing you some pictures you guys can understand.\nI cancelled my second day booking and going back today only.\nYes, don't be fooled by the internet photos and photos send by the owner he will send u the picture 100 years ago😜\nIf you don't wanna waste your money and your important day and don't want to be fooled and cheated.\nPlz don't come here, until the  owner get this place maintained.\nI want my day, my money and my time back. But that's no possible to trying to save another's.\nThat's it.\nRegards\nAnmolika",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great experience host helpful extremely polite helpful helped us plan itinerary also location perfect away city close nature spacious beach close resort walkable private great stay resort",
                "nicely managed resort away city traffic noise good family friends gatherings pleasant charming owners felt like staying friends home adjacent calm isolated beach named meenkunnu go stay want spend peaceful day",
                "place scenic building kind old location service shadows",
                "perfect stay away hustle bustle town dont go reviews given privileged entitled â\u0080\u009ctouristsâ\u0080\u009d uncle aunty really took care us really helpful caretaker unni phonecall away helped us order food whole property peaceful view sea cliff amazing best part theyre pet friendly yes hosts dont live property doesnt mean theyre available case need order food anything aunty made us amazing breakfast everyday definitely staying",
                "lets start honest review im writing see useless im feeling owner good kind property maintained properly beautiful thats two points positive care taker planet dont know say world wont listen let told came celebrate anniversary even cut cake none except us dont pictures moment even owner lives somewhere else property worst shape uncle mainened pre covid location far visiting places food inside yes kitchen u cook rooms bad condition bad smell even broomed room sleep things order excited see kids area online thats worst part write essay showing pictures guys understand cancelled second day booking going back today yes dont fooled internet photos photos send owner send u picture years agoð\u009f\u0098\u009c dont wan na waste money important day dont want fooled cheated plz dont come owner get place maintained want day money time back thats possible trying save anothers thats regards anmolika"
            ]
        }
    ]
}