{
    "places_with_reviews": [
        {
            "name": "Hotel Rest Inn",
            "rating": [
                4.2
            ],
            "address": [
                "Sai Sparsh Complex, Near Bank of Maharashtra, Pratapsinh Chowk Bye Pass Road, Savtamali Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Little bit disappointed with room service but cleanliness, hygiene, overall stay experience rating would be 10 out of 10\nOwner is very cooperative & helpful person",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent customer service and staying experience...... overall It was an awesome experience.......for food you can eat outside anywhere wherever you want..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Pro: Rooms are well designed, spacious, and have enough sunlight. It's close to Akluj bus stand and have good affordable local cuisine. I was traveling for work and had good stay in September 2023.\nCon: They initially didn't provide drinking water but packed bottled drinking water, this issue I faced most hotels of Solapur. They try to sell packed bottled water for additional income, which can be tricky if you are staying for longer period of time. Though staffs were really friendly and provided us RO water on request till we stayed.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The Hotel Rest Inn is a popular hotel located in a bustling city center. Upon arriving at the hotel, guests are greeted by friendly and professional staff who are eager to assist with any needs or questions.\n\nThe lobby of the hotel is elegantly designed with comfortable seating areas and plenty of natural light, creating a welcoming and relaxing atmosphere. Check-in is a breeze, and guests are quickly directed to their rooms.\n\nThe guest rooms at the Hotel Rest Inn are spacious and tastefully decorated, with a range of amenities to make guests' stays comfortable and enjoyable. Each room is equipped with a comfortable bed, high-quality linens, a flat-screen TV, a mini-fridge, and a work desk.\n\nThe hotel also features a variety of on-site amenities, including a restaurant serving delicious meals, a fitness center equipped with modern exercise equipment, and a swimming pool where guests can relax and unwind.\n\nOne of the standout features of the Hotel Rest Inn is its excellent customer service. The staff is always willing to go above and beyond to ensure that guests have a pleasant and enjoyable stay. From arranging transportation to recommending local attractions, the hotel staff is always ready to help.\n\nOverall, the Hotel Rest Inn provides a welcoming and comfortable home away from home for travelers visiting the city. With its convenient location, excellent amenities, and top-notch customer service, it's no wonder that so many guests choose to stay at this hotel when visiting the area.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Pathetic experience ever. Confirmed booking but only due to last name mismatch of husband wife inspite of providing marriage documents..Didn't approve..Asking for hard copies..sad to say even on airports hard copies are not required. Hotel owner needs to be literate",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "little bit disappointed room service cleanliness hygiene overall stay experience rating would owner cooperative helpful person",
                "excellent customer service staying experience overall awesome experiencefor food eat outside anywhere wherever want",
                "pro rooms well designed spacious enough sunlight close akluj bus stand good affordable local cuisine traveling work good stay september con initially didnt provide drinking water packed bottled drinking water issue faced hotels solapur try sell packed bottled water additional income tricky staying longer period time though staffs really friendly provided us ro water request till stayed",
                "hotel rest inn popular hotel located bustling city center upon arriving hotel guests greeted friendly professional staff eager assist needs questions lobby hotel elegantly designed comfortable seating areas plenty natural light creating welcoming relaxing atmosphere checkin breeze guests quickly directed rooms guest rooms hotel rest inn spacious tastefully decorated range amenities make guests stays comfortable enjoyable room equipped comfortable bed highquality linens flatscreen tv minifridge work desk hotel also features variety onsite amenities including restaurant serving delicious meals fitness center equipped modern exercise equipment swimming pool guests relax unwind one standout features hotel rest inn excellent customer service staff always willing go beyond ensure guests pleasant enjoyable stay arranging transportation recommending local attractions hotel staff always ready help overall hotel rest inn provides welcoming comfortable home away home travelers visiting city convenient location excellent amenities topnotch customer service wonder many guests choose stay hotel visiting area",
                "pathetic experience ever confirmed booking due last name mismatch husband wife inspite providing marriage documentsdidnt approveasking hard copiessad say even airports hard copies required hotel owner needs literate"
            ]
        },
        {
            "name": "Galande Hotel pure veg (Akluj Kr )",
            "rating": [
                4.2
            ],
            "address": [
                "Velapur - Akluj Rd, Vidya Nagar, Malewadi, Maharashtra 413118, India"
            ],
            "reviews": [
                {
                    "text": "Visited the place with lot of expectations. Average food quality with average service. Parking place is available. Seperate dining hall. Seperate small hall for celebration. Okay to try.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "▪️Ambience ✅️ - This restaurant has AVERAGE ambience and interior.\n▪️ Sitting Arrangement :- It is nice with good circulation space.\n▪️ Seperate Sitting Arrangement For Breakfast Items or Quick Bite Items.\n▪️Food quality 🍽 - Good. 👍🏼\n▪️Food quantity🥗 - Average serving portion. Good  Quantity.\n▪️Food tried :- Akkha Masoor, Kaju Masala and Chapati.\n▪️Food Taste 😋 :- Both the servings are tasty. One suggestion is that try to avoid food colour in gravy.\n▪️Accessible♿️✅ - THIS PLACE IS ACCESSIBLE FOR ♿.\n▪️Price and payment💵💳🧾 - Accept all types of mobile, card and cash payments. Prices are moderate.✅️\n▪️Service 🤵🧑‍🍳 - The staff is polite , service is quick and the serving staff is well trained.\n\n▪️Other Specifications :-\n1. Seperate Sitting For Quick bite Items and Separate For Lunch or Dinner.\n2. Parking space is limited almost you have park on roadside.\nOverall Nice Experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Shahi Misal ✅️  (unlimited in 100/- Only)\nTaste 5/5 ✨️\nService 5/5 ✨️\nAmbience 4/5 ✨️\nIt is approx. 3 to 4 kms frm Akluj on Velapur- Akluj road .\n\nPure vegetarian 💚\nSpecially Recommended ❤️  to All vegetarian people!! 👌\nFor Children activity are also available there !!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "More than expected. Love the ambiance. Perfect place for family dining. Small menu but taste awesome. Small Gathering and Party hall are also there. Food quality and quantity is great. Mostly famous for Breakfast and Vada Pav. Staff is also friendly and ordes you ahead. Little bit crowded on weekends. Highly recommended for vegitarian people.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best place for Brunch in Akluj. Misal Lover must visit",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited place lot expectations average food quality average service parking place available seperate dining hall seperate small hall celebration okay try",
                "â\u0096ªï¸\u008fambience â\u009c ï¸\u008f restaurant average ambience interior â\u0096ªï¸\u008f sitting arrangement nice good circulation space â\u0096ªï¸\u008f seperate sitting arrangement breakfast items quick bite items â\u0096ªï¸\u008ffood quality ð\u009f\u008d½ good ð\u009f\u0091\u008dð\u009f\u008f¼ â\u0096ªï¸\u008ffood quantityð\u009f¥\u0097 average serving portion good quantity â\u0096ªï¸\u008ffood tried akkha masoor kaju masala chapati â\u0096ªï¸\u008ffood taste ð\u009f\u0098\u008b servings tasty one suggestion try avoid food colour gravy â\u0096ªï¸\u008faccessibleâ\u0099¿ï¸\u008fâ\u009c place accessible â\u0099¿ â\u0096ªï¸\u008fprice paymentð\u009f\u0092µð\u009f\u0092³ð\u009f§¾ accept types mobile card cash payments prices moderateâ\u009c ï¸\u008f â\u0096ªï¸\u008fservice ð\u009f¤µð\u009f§\u0091â\u0080\u008dð\u009f\u008d³ staff polite service quick serving staff well trained â\u0096ªï¸\u008fother specifications seperate sitting quick bite items separate lunch dinner parking space limited almost park roadside overall nice experience",
                "shahi misal â\u009c ï¸\u008f unlimited taste â\u009c¨ï¸\u008f service â\u009c¨ï¸\u008f ambience â\u009c¨ï¸\u008f approx kms frm akluj velapur akluj road pure vegetarian ð\u009f\u0092\u009a specially recommended â\u009d¤ï¸\u008f vegetarian people ð\u009f\u0091\u008c children activity also available",
                "expected love ambiance perfect place family dining small menu taste awesome small gathering party hall also food quality quantity great mostly famous breakfast vada pav staff also friendly ordes ahead little bit crowded weekends highly recommended vegitarian people",
                "one best place brunch akluj misal lover must visit"
            ]
        },
        {
            "name": "Splash Mount",
            "rating": [
                4.2
            ],
            "address": [
                "Sujay 413101, Phule Nagar-Akluj Rd, Savtamali Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Not much good quality for veg.\nThey served different food instead of which we order\nDust and leaves will settle on dishes which makes overall dull ambience",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Food quality is excellent. Ambience is aslo up to the mark. Hygiene maintained. They provide great service to the customers. They provide quality food to the customer. They have enough parking area and waiting area. Very famous hotel in nearby cities. The most important thing in hotel sector is hygiene and they have maintained very well. Recommended hotel/restaurant to everyone.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Serving staff is patheic rude.\nThey are monologs.\nThey do what they want.\nThey mistake order and blame you for not placing.\nThey make you wait for 1 hr and bring the same cold dishes in next one minute and serve sarcastically as if you have lost and he won.\nThey argue if they are wrong.\nWorst quality of dal fry, jeera rice. It was worst than road side stall.\nThey serve food on your cloths legs and justify its just a bit of it.\nI dont recommend to visit.\nThey don't need customers they have lots but if you want to just spend money  for under standard food and make yourself fool plz do visit.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "If you’re coming on weekend still you will get table immediately. Specious but in food quality is not up to the mark",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Its Nice Restaurant food is good ,   but saturday & Sunday very rush I have waiting for the table 30 minutes.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "much good quality veg served different food instead order dust leaves settle dishes makes overall dull ambience",
                "food quality excellent ambience aslo mark hygiene maintained provide great service customers provide quality food customer enough parking area waiting area famous hotel nearby cities important thing hotel sector hygiene maintained well recommended hotelrestaurant everyone",
                "serving staff patheic rude monologs want mistake order blame placing make wait hr bring cold dishes next one minute serve sarcastically lost argue wrong worst quality dal fry jeera rice worst road side stall serve food cloths legs justify bit dont recommend visit dont need customers lots want spend money standard food make fool plz visit",
                "youâ\u0080\u0099re coming weekend still get table immediately specious food quality mark",
                "nice restaurant food good saturday sunday rush waiting table minutes"
            ]
        },
        {
            "name": "Chehita Pure Veg Restaurant, Function Hall & Catering Services Akluj",
            "rating": [
                4.3
            ],
            "address": [
                "S.No 101/1, Sangram Nagar, Girzani Road Taluka - Malshiras, Shivaji Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Decent venue to have small functions.. photographic interior.. well isolated place to enjoy your special day..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good ambience and well maintained.\nGood option for families.\nStaff is very cooperative.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This resort is really well maintained. Nice ambiance. Good food quality. Children can enjoy the games. Ample parking space. Need to have proper direction from main road. Enjoy your food.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A beautiful and spacious restaurant with a pretty garden and hall. Serene ambience with a lot of open space for kids to play. Highly recommended if you are visiting Akluj. Also, the food is delicious!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "If you are looking for a good Catering service in Akluj then I would recommend Tanishka Catering Services. Tasty food, experienced staff and good administration.\nAlong with this their restaurant space i.e Chehita Resort serves a variety of cusines along with a great ambience.\n\nMust visit place if you’re in akluj.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent venue small functions photographic interior well isolated place enjoy special day",
                "good ambience well maintained good option families staff cooperative",
                "resort really well maintained nice ambiance good food quality children enjoy games ample parking space need proper direction main road enjoy food",
                "beautiful spacious restaurant pretty garden hall serene ambience lot open space kids play highly recommended visiting akluj also food delicious",
                "looking good catering service akluj would recommend tanishka catering services tasty food experienced staff good administration along restaurant space ie chehita resort serves variety cusines along great ambience must visit place youâ\u0080\u0099re akluj"
            ]
        },
        {
            "name": "Veg Treat",
            "rating": [
                4.1
            ],
            "address": [
                "Ganga Image, Naka No. 1, Indapur Sangola Road, V2MC+HWV, Opp Shriram Theatre, Pratap Singh Chowk, Savtamali Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "One of the best chicken tandoori we had here. No comparison for chicken tandoori at all.\nAll food taste is amazing.\nOnly service and closing time are the issues.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is good but used to be great. I felt the masala or gravy they used is similar for many dishes. But still it is good. Prices are on a higher side little bit. A lot of options available which makes it up though. And please know this, dine in option is for breakfast only otherwise if  you have to  dine in then it's back side Hotel Splash Mount is available.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Title: A Pleasant Vegetarian Retreat: Veg Treat in Aakluj, Maharashtra\n\nReview:\n\nLocated in the serene town of Aakluj, Maharashtra, Veg Treat is a delightful hotel that offers a South Indian culinary experience with a focus on vegetarian cuisine. The restaurant is a haven for those seeking a taste of authentic South Indian breakfast in the early hours of the day. While the absence of tea or coffee may come as a surprise, Veg Treat makes up for it with its decent rates, pleasing taste, and commendable service.\n\nVeg Treat's commitment to vegetarianism is evident from the moment you step foot inside. The ambience is inviting, with a clean and comfortable dining area that sets the stage for a satisfying meal. As a dedicated South Indian restaurant, Veg Treat excels in providing an array of flavorful dishes to appease any palate.\n\nEarly birds will find solace in the fact that Veg Treat opens its doors with a range of delectable South Indian breakfast options. From crispy dosas and fluffy idlis to steaming vadas and mouth-watering uttapams, the breakfast menu promises a delightful start to the day. The dishes are prepared with care, showcasing the authentic flavors and traditional recipes of the region.\n\nDespite the lack of tea or coffee, Veg Treat manages to maintain its reputation with its decent rates. The affordability of the menu is certainly a plus point, making it an accessible dining choice for individuals and families alike. Moreover, the reasonable pricing does not compromise the taste or quality of the food.\n\nThe taste at Veg Treat lives up to its reputation of being decent. Each dish is prepared with precision, allowing the flavors to shine through. Whether you prefer a spicy treat or a milder option, the restaurant caters to different palates, ensuring a satisfying dining experience for all.\n\nThe service at Veg Treat is commendable, with attentive staff members who are friendly and quick to assist. The waiters are knowledgeable about the menu, helping guests navigate through the diverse offerings and suggesting popular dishes. The prompt service adds to the overall positive experience, making patrons feel valued and well taken care of.\n\nIn conclusion, Veg Treat in Aakluj, Maharashtra, offers a pleasant vegetarian retreat for South Indian food enthusiasts. While the absence of tea or coffee may be a drawback for some, the decent rates, delicious taste, and quality service more than compensate for it. Whether you're a local resident or a visitor passing through, Veg Treat is definitely worth a visit for an authentic South Indian breakfast experience in a serene setting.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's better to eat street food. Zero food quality",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Tired staff\nFood quality not satisfactory",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best chicken tandoori comparison chicken tandoori food taste amazing service closing time issues",
                "food good used great felt masala gravy used similar many dishes still good prices higher side little bit lot options available makes though please know dine option breakfast otherwise dine back side hotel splash mount available",
                "title pleasant vegetarian retreat veg treat aakluj maharashtra review located serene town aakluj maharashtra veg treat delightful hotel offers south indian culinary experience focus vegetarian cuisine restaurant seeking taste authentic south indian breakfast early hours day absence tea coffee may come surprise veg treat makes decent rates pleasing taste commendable service veg treats commitment vegetarianism evident moment step foot inside ambience inviting clean comfortable dining area sets stage satisfying meal dedicated south indian restaurant veg treat excels providing array flavorful dishes appease palate early birds find solace fact veg treat opens doors range delectable south indian breakfast options crispy dosas fluffy idlis steaming vadas mouthwatering uttapams breakfast menu promises delightful start day dishes prepared care showcasing authentic flavors traditional recipes region despite lack tea coffee veg treat manages maintain reputation decent rates affordability menu certainly plus point making accessible dining choice individuals families alike moreover reasonable pricing compromise taste quality food taste veg treat lives reputation decent dish prepared precision allowing flavors shine whether prefer spicy treat milder option restaurant caters different palates ensuring satisfying dining experience service veg treat commendable attentive staff members friendly quick assist waiters knowledgeable menu helping guests navigate diverse offerings suggesting popular dishes prompt service adds overall positive experience making patrons feel valued well taken care conclusion veg treat aakluj maharashtra offers pleasant vegetarian retreat south indian food enthusiasts absence tea coffee may drawback decent rates delicious taste quality service compensate whether youre local resident visitor passing veg treat definitely worth visit authentic south indian breakfast experience serene setting",
                "better eat street food zero food quality",
                "tired staff food quality satisfactory"
            ]
        },
        {
            "name": "RANA Restaurant",
            "rating": [
                4.1
            ],
            "address": [
                "V2Q4+MWP, Shivaji Nagar, Sangram Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "In rs 100 unlimited thali chikan thali machi thali vege thali first time in akluj.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Delivery boys are working so fast.......and that's good",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The best place ever is a great place to visit with family and friends delicious food the best dish is biryani . Great ambiance. Friendly staff. Has both veg and nonveg food . Great for  parties . Kids can even enjoy the rides present there .  At least visit once if you get a chance.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Tasty veg and non veg.food maharashtrian.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Though situated a little away from the main road this place is a good one if you want to have dinner late. Try out their chicken sukka and I bet u wont regret going there.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rs unlimited thali chikan thali machi thali vege thali first time akluj",
                "delivery boys working fastand thats good",
                "best place ever great place visit family friends delicious food best dish biryani great ambiance friendly staff veg nonveg food great parties kids even enjoy rides present least visit get chance",
                "tasty veg non vegfood maharashtrian",
                "though situated little away main road place good one want dinner late try chicken sukka bet u wont regret going"
            ]
        },
        {
            "name": "Jogeshwari Misal",
            "rating": [
                4.1
            ],
            "address": [
                "V2JG+4H8, Velapur - Akluj Rd, Savtamali Nagar, Sangramnagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Testis awesome Mr qualities good I just loving it the food and the service also",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Delicious Misalpav & buttermilk, along with excellent service,pure vegetarian ,there are plenty of parking...\nAppreciate your assistance, jogeshwari Misal Akluj",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Jogeshwari Misal is one of the best misal I have ever tried .\nThere quality of misal is very much awesome.\nNo compromise in quality of misal .\nIt's mouthwatering good spicy not that much.\nBut I didn't like the paav there are not normal pav there are bun pav",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Jogeshwari misal has very unique test. I love their spices, Matta is also good. Service good. I recommend to try once",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food tastes awesome\nAmbience is best\nWell managed franchise store",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "testis awesome mr qualities good loving food service also",
                "delicious misalpav buttermilk along excellent servicepure vegetarian plenty parking appreciate assistance jogeshwari misal akluj",
                "jogeshwari misal one best misal ever tried quality misal much awesome compromise quality misal mouthwatering good spicy much didnt like paav normal pav bun pav",
                "jogeshwari misal unique test love spices matta also good service good recommend try",
                "food tastes awesome ambience best well managed franchise store"
            ]
        },
        {
            "name": "Hotel Aditya and Sanskruti lodge",
            "rating": [
                3.6
            ],
            "address": [
                "Akluj Bypass MAHARSHI CHOWK NEAR NEW BUS STAND, Ruta Nagar, Sumitra Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "The meal is average, once you finished your meal before paying bill amount kindly check the quantity wise amount.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "good food but worst  service",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Food was tasty, but most of thestarters served were not hot enough. Tomota soup served was luke warm with no bread crums. Surprizingly they served, paneer Manchurian/chilli instead of paneer tikka. Good thing was it was tasty enough to ignore their mistake. 3 stars are purely given for the taste.\n\nNote: Avoid the facial expressions of the serving people while ordering something unusual from their menu.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "You will definitely enjoy your meal here. Best food best service. 👍",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Food is tasty and food prices are reasonable. Recommended.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "meal average finished meal paying bill amount kindly check quantity wise amount",
                "good food worst service",
                "food tasty thestarters served hot enough tomota soup served luke warm bread crums surprizingly served paneer manchurianchilli instead paneer tikka good thing tasty enough ignore mistake stars purely given taste note avoid facial expressions serving people ordering something unusual menu",
                "definitely enjoy meal best food best service ð\u009f\u0091\u008d",
                "food tasty food prices reasonable recommended"
            ]
        },
        {
            "name": "Balaji Lodge",
            "rating": [
                4.1
            ],
            "address": [
                "Infront Of New, ST Stand, Savtamali Nagar, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Nice lodge, Staff is very co-operative specially manager , rooms are clean and neet, wifi free with very good speed , set-up box channels as per request, quick room service, generator backup is good, sanitize rooms.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Door handle was broken. Washroom was not clean. Not a single air freshener was available in washroom or in room. Sheets were dirty and stains were there on sheet.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Holt",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Not bad",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice lodge staff cooperative specially manager rooms clean neet wifi free good speed setup box channels per request quick room service generator backup good sanitize rooms",
                "door handle broken washroom clean single air freshener available washroom room sheets dirty stains sheet",
                "nice",
                "holt",
                "bad"
            ]
        },
        {
            "name": "Hotel Girme-Best Pure Veg Restaurant in Akluj",
            "rating": [
                4.2
            ],
            "address": [
                "Malewadi akluj Akluj velapure road, near, Malewadi Rd - Akluj, Vidya Nagar, Malewadi, Akluj, Maharashtra 413101, India"
            ],
            "reviews": [
                {
                    "text": "Readily available birthday party decoration. Best ambience. One thing noticed about triangular seats. That are uncomfortable, needs to change that.\nWe have taken parcel from here. Food quality and food quantity is very good.\nMust recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I visited Hotel Girme today and was pleasantly surprised by the readily available birthday party decorations. The ambience was simply the best, creating a warm and inviting atmosphere. However, one noticeable drawback was the triangular seats, which were uncomfortable, and I believe they need to improve that aspect.\n\nWe also ordered a parcel from here, and I must say the food quality and quantity were top-notch. The flavors were exceptional, and the portion sizes were generous. Overall, Hotel Girme - हॉटेल गिरमे is a fantastic pure veg restaurant with fantastic food, but a minor seating adjustment could enhance the overall experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The service time can be a bit better because they took a lot of time for bringing extra chapatis and rotis\n\nTandoori roti can be a little better because it tasted little chewy. But the food tastes really good. The atmosphere is family friendly",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice Place for Vegetarian Food, Service is very nice, Precious Place and Parking.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Best pure veg hotel.. Must go 😋",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "readily available birthday party decoration best ambience one thing noticed triangular seats uncomfortable needs change taken parcel food quality food quantity good must recommend",
                "visited hotel girme today pleasantly surprised readily available birthday party decorations ambience simply best creating warm inviting atmosphere however one noticeable drawback triangular seats uncomfortable believe need improve aspect also ordered parcel must say food quality quantity topnotch flavors exceptional portion sizes generous overall hotel girme à¤¹à¥\u0089à¤\u009fà¥\u0087à¤² à¤\u0097à¤¿à¤°à¤®à¥\u0087 fantastic pure veg restaurant fantastic food minor seating adjustment could enhance overall experience",
                "service time bit better took lot time bringing extra chapatis rotis tandoori roti little better tasted little chewy food tastes really good atmosphere family friendly",
                "nice place vegetarian food service nice precious place parking",
                "best pure veg hotel must go ð\u009f\u0098\u008b"
            ]
        }
    ]
}