{
    "places_with_reviews": [
        {
            "name": "Hotel Paviesh Park",
            "rating": [
                4
            ],
            "address": [
                "1173 A, Salem NH By Pass Road, Lakshmi Nagar, Kalingarayanpalayam, Lakshmi Nagar, Bhavani, Tamil Nadu 638316, India"
            ],
            "reviews": [
                {
                    "text": "The hotel stay was comfortable and enjoyable. The room was clean and well-equipped with all necessary amenities. The staff was friendly and attentive, providing excellent service throughout the stay. The location was convenient, with easy access to nearby attractions and transportation options.  However, the Wi-Fi connection could have been more reliable at times. Overall, it was a pleasant stay and I would recommend the hotel to others.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nestled in the heart of Bhavani, Hotel Paviesh Park offers a serene and comfortable stay for travelers seeking a peaceful retreat. The hotel's prime location provides easy access to local attractions while ensuring a quiet ambiance for a relaxing stay.\n\nThe rooms are spacious, well-appointed, and equipped with modern amenities to cater to the needs of both leisure and business travelers. The hotel's courteous staff is always ready to assist, ensuring a pleasant and hassle-free stay for guests.\n\nGuests can indulge in delicious meals at the hotel's restaurant, which offers a variety of dishes to suit every palate. The hotel also features a well-equipped fitness center, perfect for guests looking to stay active during their stay.\n\nOverall, Hotel Paviesh Park offers excellent value for money with its comfortable rooms, convenient location, and friendly service. Whether you're in Bhavani for business or leisure, this hotel is a great choice for a memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We just dined there in the lawn and did not stay. We were not happy with the unclean banana leaf and wiped off the dirt. The food was ok ok…nothing to appreciate. The place has birds and we saw goose walking on the lawn eating food littered off purposely by cleaning staff…I even saw goose eating left over food directly from plates kept in the lawn.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I have a planned Ear piercing function with Non Veg Menu & we provided them Mutton /chicken for cooking (optional) ,… Foods are Tasty & serviced in Good Manner …All Age  group peoples liked the Non veg food ….. Restaurant has Kids play area and Good place to plan for Family functions.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "There is a statement in Tamil \" Kaluthai thenju katterumba pochu\". Day by day the quality of the food and service is becoming worse. It looks like a government hotel nowadays. There is no response from the service. I have seen this hotel for the past 10+ years, day by day down in their services.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel stay comfortable enjoyable room clean wellequipped necessary amenities staff friendly attentive providing excellent service throughout stay location convenient easy access nearby attractions transportation options however wifi connection could reliable times overall pleasant stay would recommend hotel others",
                "nestled heart bhavani hotel paviesh park offers serene comfortable stay travelers seeking peaceful retreat hotels prime location provides easy access local attractions ensuring quiet ambiance relaxing stay rooms spacious wellappointed equipped modern amenities cater needs leisure business travelers hotels courteous staff always ready assist ensuring pleasant hasslefree stay guests guests indulge delicious meals hotels restaurant offers variety dishes suit every palate hotel also features wellequipped fitness center perfect guests looking stay active stay overall hotel paviesh park offers excellent value money comfortable rooms convenient location friendly service whether youre bhavani business leisure hotel great choice memorable stay",
                "dined lawn stay happy unclean banana leaf wiped dirt food ok okâ\u0080¦nothing appreciate place birds saw goose walking lawn eating food littered purposely cleaning staffâ\u0080¦i even saw goose eating left food directly plates kept lawn",
                "planned ear piercing function non veg menu provided mutton chicken cooking optional â\u0080¦ foods tasty serviced good manner â\u0080¦all age group peoples liked non veg food â\u0080¦ restaurant kids play area good place plan family functions",
                "statement tamil kaluthai thenju katterumba pochu day day quality food service becoming worse looks like government hotel nowadays response service seen hotel past years day day services"
            ]
        },
        {
            "name": "Sakthi Murugan Residency",
            "rating": [
                3.8
            ],
            "address": [
                "Bhavani, Erode, SH-20, Bhavani Erode Road, Erode, Erode, Bhavani, Tamil Nadu 638301, India"
            ],
            "reviews": [
                {
                    "text": "No proper amenities like extra plug points for mobile charger, no ventilation in bathroom in A/C room. No mosquito repellant liquid. The caretaker said there are no mosquitoes though there were a noticeable number. To conclude, nor worth Rs.1100/ day.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst Lodge\nPlease don’t go\nEven though they’re charging high prices the maintenance is very poor\nFor 4 people the room charges they charged 3000\nWorst room, AC is working but no cooling, Bathroom is not cleaned well, Mattress they used is worst, bed sheet is also very thin & little\nNo compliments even like bath towel, Paste, soap\nPls don’t go",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room is nice but washroom is not clean and fittings are not correct.\nLot of disturbance out side the room that's in reception side in early morning 4.00 AM con't sleep peacefully. Worst experience.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It is a lodge with average facilities but located close to the temple as well as the bustand in Bhavani. The room sizes are small, cleanliness and maintenance of the rooms are okay. Hot water is available for 24hrs (during our stay) which is a plus point. Other than this there is zero features and zero service.\nThere is no lift facilities, no parking space, Drinking water, toiletries are all wont be provided and you have to manage on your own. Just okay for one day stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Pros:\nReception staffs are very nice.\n\nCons:\nNo water to drink\nNo towel\nNo bathing soap\nIf you open your room door after 6pm 1000 mosquitoes will enter your room but they will not give you any mosquito liquid or coil.\nBathroom is just ok, no water sprayer in latrine.\nNo lift facilities.\nAC is ok.\nThey have charged 2016rs per day for 3 persons for AC room but i think it's not worth for the amount they charged",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "proper amenities like extra plug points mobile charger ventilation bathroom ac room mosquito repellant liquid caretaker said mosquitoes though noticeable number conclude worth rs day",
                "worst lodge please donâ\u0080\u0099t go even though theyâ\u0080\u0099re charging high prices maintenance poor people room charges charged worst room ac working cooling bathroom cleaned well mattress used worst bed sheet also thin little compliments even like bath towel paste soap pls donâ\u0080\u0099t go",
                "room nice washroom clean fittings correct lot disturbance side room thats reception side early morning cont sleep peacefully worst experience",
                "lodge average facilities located close temple well bustand bhavani room sizes small cleanliness maintenance rooms okay hot water available hrs stay plus point zero features zero service lift facilities parking space drinking water toiletries wont provided manage okay one day stay",
                "pros reception staffs nice cons water drink towel bathing soap open room door pm mosquitoes enter room give mosquito liquid coil bathroom ok water sprayer latrine lift facilities ac ok charged rs per day persons ac room think worth amount charged"
            ]
        },
        {
            "name": "Sivamurugan Residency",
            "rating": [
                4.2
            ],
            "address": [
                "76, Bhavani Main Rd, Erode, Bhavani, Tamil Nadu 638301, India"
            ],
            "reviews": [
                {
                    "text": "Very good hotel to stay. Rooms are clean. Except that there's no restaurants near to eat. Rest are good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Clean and good ,need to improve the service  response level .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good customer service and support kindly tearting as special guest",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I strongly not recommend this hotel to anyone as I got very bad experience here. Booked 7 rooms recently and below are my reasons to avoid this hotel.\n\n1. They didn’t provide the rooms on time during check-in rather waited for more than 5 hours to get the same after a hectic travel. No proper reason provided. Same happened during checkout. Waited for half an hour.\n2. Increased cost from 1300 for a standard room to 1650 telling the reason that it is festival time.\n3. Charging 2.5 % extra if you pay through credit card which is very bad for a business providing non quality rooms.\n4. Unhealthy, filthy rooms and toilets with no exhaust if you choose standard room with A/C. When asked to clean only literal sweep is done rather than a deep clean.\n5. No blankets for A/C room, No basic itineraries like soap, etc. They are telling the reason that blankets went for wash and will not be provided.\n6. You can find lot of mosquitoes, Spiders, Insects as your roommates.\n7. You can get cigarette smoke smell in rooms, corridors in all floors.\n8. No proper knowledge for the manager as they are saying that they are new here and cannot address any of the concerns reported.\n\nSince I had a hectic travel and temple visits didn’t argue much with the owner when I reported these concerns. Please avoid this hotel when you are planning to visit Bhavani.\n\nSuggestion to management - Please maintain proper hotel etiquettes if you want to grow your business or people will suffer like me paying higher costs by simply seeing the Google reviews.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good in that area.\nLocation near temple and river.\nParking space available nearby\n50 metres.\nMainly lift facility available.\n24 hours hot water available.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel stay rooms clean except theres restaurants near eat rest good",
                "clean good need improve service response level",
                "good customer service support kindly tearting special guest",
                "strongly recommend hotel anyone got bad experience booked rooms recently reasons avoid hotel didnâ\u0080\u0099t provide rooms time checkin rather waited hours get hectic travel proper reason provided happened checkout waited half hour increased cost standard room telling reason festival time charging extra pay credit card bad business providing non quality rooms unhealthy filthy rooms toilets exhaust choose standard room ac asked clean literal sweep done rather deep clean blankets ac room basic itineraries like soap etc telling reason blankets went wash provided find lot mosquitoes spiders insects roommates get cigarette smoke smell rooms corridors floors proper knowledge manager saying new address concerns reported since hectic travel temple visits didnâ\u0080\u0099t argue much owner reported concerns please avoid hotel planning visit bhavani suggestion management please maintain proper hotel etiquettes want grow business people suffer like paying higher costs simply seeing google reviews",
                "good area location near temple river parking space available nearby metres mainly lift facility available hours hot water available"
            ]
        },
        {
            "name": "amman lodge komarapalayam",
            "rating": [
                4
            ],
            "address": [
                "CMQW+7C9 33/71, opp. to anna kalyana mandapam, Vijaya Thottam, Komarapalayam, Tamil Nadu 638183, India"
            ],
            "reviews": [
                {
                    "text": "Room is compact and convenient. very good location. Best safe hotels for unmarried couples in komarapalayam.👍 Friendly staff. Average breakfast buffet. In all value for money",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "After after seeing the rating of 5 we contacted this Hotel for wedding function, But the incharges (both male and female) kept on creating demand for alloting room for every 5 minutes, and our parents and ladies were treated in bad manner. We never experienced this kind of guest welcome. So, decently we just came out of the lodge without booking. We are not sure that the ratings showing in google review were genuine.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "No air ventilation\n\nEdit: I am talking about non AC room\nBeds also not clean",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Cheap rates. It is 2 km away from main busstand. Transport and dining are big problems . There is only one vegetarian hotel that too at a distance of two kms opp to komarapalayam police station. Considering the rate it is suitable for lower income group people. Single non AC room rs 500/ per day. In the morning you can get tab water at 6 am only. It is a huge drawback for those who wish to depart earlier.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "My sincere greetings to all of you friends this hostel (Amman lodge puthupalaiyam [komarapalaiyam] ) is very very dirty lodge  there is no clean facilities here. Also, all the rooms here are not clean and not maintaining for the uploaded pic",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room compact convenient good location best safe hotels unmarried couples komarapalayamð\u009f\u0091\u008d friendly staff average breakfast buffet value money",
                "seeing rating contacted hotel wedding function incharges male female kept creating demand alloting room every minutes parents ladies treated bad manner never experienced kind guest welcome decently came lodge without booking sure ratings showing google review genuine",
                "air ventilation edit talking non ac room beds also clean",
                "cheap rates km away main busstand transport dining big problems one vegetarian hotel distance two kms opp komarapalayam police station considering rate suitable lower income group people single non ac room rs per day morning get tab water huge drawback wish depart earlier",
                "sincere greetings friends hostel amman lodge puthupalaiyam komarapalaiyam dirty lodge clean facilities also rooms clean maintaining uploaded pic"
            ]
        },
        {
            "name": "Hotel Pranawas castle",
            "rating": [
                4
            ],
            "address": [
                "5/72, Pranavalingam enclave, Bhavani main road, Kalingarayanpalayam, Bhavani, Tamil Nadu 638301, India"
            ],
            "reviews": [
                {
                    "text": "Hotel very good Room service and good traffic but not debit card and Credit card facility that only definitely this hotel pls provide card mechanism facility",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Safe parking, tasty breakfast, but asking more rate than website room rent",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "One of the best rooms in bhavani. Well maintained, room service is good.\nYou do not have to miss your morning work out. Yes, they do have gym facility. Rooms are really good. And also near by hotels, atm, hospitals available.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Morning they will provide complimentary breakfast.\nFor lunch and dinner you have to visit near by restaurants. If you want hotel staff will get it for you.\nRooms were fine.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good and food is tasty and spicy",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel good room service good traffic debit card credit card facility definitely hotel pls provide card mechanism facility",
                "safe parking tasty breakfast asking rate website room rent",
                "one best rooms bhavani well maintained room service good miss morning work yes gym facility rooms really good also near hotels atm hospitals available",
                "morning provide complimentary breakfast lunch dinner visit near restaurants want hotel staff get rooms fine",
                "good food tasty spicy"
            ]
        },
        {
            "name": "Sabari Lodge",
            "rating": [
                3.3
            ],
            "address": [
                "818 638301 468/818, Thoppur-Mettur Dam-Bhavani-Erode Rd, Varanapuram, Bhavani, Tamil Nadu 638301, India"
            ],
            "reviews": [
                {
                    "text": "They had a great room nd all services. I'll suggest you to pre-book the rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Very small rooms, congested toilet...but staff are good and kind. Location is good; just opposite to the busstand.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Nightmare service. Came with my family after booking. After coming here they're asking for extra money and when I refused to pay they're threatening with two goons. Had no other choice but to pay the extra money since it was the middle of the night and there are no other options available nearby.\nPlease don't come with family.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Wrost lodge experience no proper reception welcome manager was showing attitude they just open lodge for show case, I sincerely sujest not to stay they stay ur own risk",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "The reception person was not having adequate knowledge regarding customer requirements.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great room nd services ill suggest prebook rooms",
                "small rooms congested toiletbut staff good kind location good opposite busstand",
                "nightmare service came family booking coming theyre asking extra money refused pay theyre threatening two goons choice pay extra money since middle night options available nearby please dont come family",
                "wrost lodge experience proper reception welcome manager showing attitude open lodge show case sincerely sujest stay stay ur risk",
                "reception person adequate knowledge regarding customer requirements"
            ]
        },
        {
            "name": "Rasu Hotel Komarapalayam",
            "rating": [
                3.5
            ],
            "address": [
                "175/E6, PERANTHAR KAADU, C.N.PALAYAM, Komarapalayam, Tamil Nadu 638183, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL VARDHA INN - Bhavani",
            "rating": [
                4.9
            ],
            "address": [
                "No 66, 67 - Main road, Sangameshwar Temple Rd, near Kooduthurai, beside Bhavani Scan Center, Bhavani, Tamil Nadu 638301, India"
            ],
            "reviews": [
                {
                    "text": "Rooms is very good. Neat and clean. Location is near to Sangameshwarar Temple in Bhavani. Worth for Money that I have Spent in this Hotel.Well maintained and had such a comfortable and pleasant stay. Staff were courteous. We get good breakfast and lunch in the restaurant opp to this hotel. So walkable distance for immediate needs. I would highly recommend this hotel for families and business trips.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very clean and new rooms , esp the restroom was was brand new and clean. Well maintained.\nWe stayed for a break journey for a couple of hours and had such a comfortable and pleasant stay. Staff were courteous. We get good breakfast and lunch in the restaurant opp to this hotel. So walkable distance for immediate needs. I would highly recommend this hotel for families and business trips.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Overall, a very pleasant experience. It's a new hotel so the room was clean. Just a few things that need improvement. Door needs to be fixed. More thought could have gone into the planning but not a big deal. The bathroom accessories were of high quality (German). Heater was good.\nWifi worked well. Even Netflix was available. Reception staff very courteous and helpful. Great location as shops are close by. Lovely vegetarian restaurant just opp the hotel. Cheap and good food. Had no issues. Ramraj store close by was fantastic too with service. Of course, being of walking distance to the fascinating Sangameshwarar temple was a huge plus point.\nVardha Inn is a gem in Bavani if you are looking for a comfortable and stress free stay.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Neat and spacious rooms. Service is prompt and polite. Location is near to the temple. For family best in this vicinity. Value for money.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very good option for family stay in bavani area . basement  parking areas  Calm and peaceful place , very neat and clean room . Staffs are very frndly and good voice . Good experience for me se u agin . Thank you",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms good neat clean location near sangameshwarar temple bhavani worth money spent hotelwell maintained comfortable pleasant stay staff courteous get good breakfast lunch restaurant opp hotel walkable distance immediate needs would highly recommend hotel families business trips",
                "clean new rooms esp restroom brand new clean well maintained stayed break journey couple hours comfortable pleasant stay staff courteous get good breakfast lunch restaurant opp hotel walkable distance immediate needs would highly recommend hotel families business trips",
                "overall pleasant experience new hotel room clean things need improvement door needs fixed thought could gone planning big deal bathroom accessories high quality german heater good wifi worked well even netflix available reception staff courteous helpful great location shops close lovely vegetarian restaurant opp hotel cheap good food issues ramraj store close fantastic service course walking distance fascinating sangameshwarar temple huge plus point vardha inn gem bavani looking comfortable stress free stay",
                "neat spacious rooms service prompt polite location near temple family best vicinity value money",
                "good option family stay bavani area basement parking areas calm peaceful place neat clean room staffs frndly good voice good experience se u agin thank"
            ]
        },
        {
            "name": "SPOT ON Amman Lodge",
            "rating": [
                3.4
            ],
            "address": [
                "73, W Colony, Vijaya Thottam, Komarapalayam, Tamil Nadu 638183, India"
            ],
            "reviews": [
                {
                    "text": "Poor service, they say they have room but when we go there they say we are full",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Best family lodge in komarapalayam,good connectivity  lodge and rooms are very clean and calm place and very well maintained  team",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Responsible very worst., Rent very high compare to Oyo",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "poor service say room go say full",
                "best family lodge komarapalayamgood connectivity lodge rooms clean calm place well maintained team",
                "responsible worst rent high compare oyo"
            ]
        },
        {
            "name": "SIVASAKTHI LODGE AC",
            "rating": [
                3.4
            ],
            "address": [
                "Nadaraja Nagar, Komarapalayam, Tamil Nadu 638183, India"
            ],
            "reviews": [
                {
                    "text": "First of all, price is high for the room, bed was bit dirty and pillows were worn out. The room we stayed had no lock for bathroom from inside which was the basic thing. There is no hot water for bathing in any of the rooms. They charged Rs. 700 for the room we took with the above cons which is not at all acceptable for the price. In the city like bangalore only we get very good condition room for below 700 only.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "The hall is big but not clean the bride and groom room are too small",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Worst place no clean toilets... Don't stay here",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Worst lodge ever, worst response, worst service simply west",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Spacious rooms, good ventilation with reasonable charges.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "first price high room bed bit dirty pillows worn room stayed lock bathroom inside basic thing hot water bathing rooms charged rs room took cons acceptable price city like bangalore get good condition room",
                "hall big clean bride groom room small",
                "worst place clean toilets dont stay",
                "worst lodge ever worst response worst service simply west",
                "spacious rooms good ventilation reasonable charges"
            ]
        }
    ]
}