{
    "places_with_reviews": [
        {
            "name": "Vanraji Resort (Ambaji)",
            "rating": [
                4.6
            ],
            "address": [
                "GJ SH 53, Panchha, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Pristine views, surrounded by forested mountains & farms. Superb amenities for relaxation. Great garden & nature views from Super Deluxe rooms.\n\nRooms were excellently sized especially height. Overall premium feel except for the Bathrooms that have premium materials but very poor workmanship - could be better drained and towel rack located away from spray zone. Supplying a wiper can help otherwise re-shape/re-tile flooring.\n\nWe had a dinner & breakfast at in house restaurant. Can confirm food is of great taste and quality. Remember to enjoy camp fire in winter months.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "A really good place for a family vacation. Slightly remotely located but the environment around is amazing. Best place for a winter stay with family. Swimming pool, big rooms, big dining and banquet, good food, helpful staff, kids play zone area, plenty of parking space. Must visit this place if you are planning to stay in Ambaji.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Booked for parents to stay for Ambani mandir Darshan. The quality of room, hygiene was very good. Room and restaurant service was great, food was also very good. Overall, they loved the stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very good location in the heart of nature.As being a new property, cleanliness is there. Lots of efforts needed in staff training & food quality. Front desk staffs are not properly trained , need much  efforts  for improvement. Rest are ok.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I had the pleasure of staying at Vanraji Resort for a week and I can honestly say it was one of the best experiences of my life. The resort is located in a beautiful and serene location, surrounded by lush greenery and stunning views. The rooms are spacious, comfortable and well-equipped with all the amenities you could need. The staff are friendly, helpful and attentive, always ready to assist you with anything you might require. The food is delicious, varied and fresh, catering to different tastes and preferences. The resort offers a range of activities and facilities for guests to enjoy, such as a swimming pool, a spa, a gym, a yoga studio, , and more. The resort also organizes excursions and tours to nearby attractions, such as temples, waterfalls, wildlife sanctuaries and cultural sites. I had a wonderful time exploring the local area and learning about its history and culture. Vanraji Resort is more than just a place to stay, it is a place to relax, rejuvenate and reconnect with yourself and nature. I highly recommend it to anyone looking for a memorable and satisfying vacation.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pristine views surrounded forested mountains farms superb amenities relaxation great garden nature views super deluxe rooms rooms excellently sized especially height overall premium feel except bathrooms premium materials poor workmanship could better drained towel rack located away spray zone supplying wiper help otherwise reshaperetile flooring dinner breakfast house restaurant confirm food great taste quality remember enjoy camp fire winter months",
                "really good place family vacation slightly remotely located environment around amazing best place winter stay family swimming pool big rooms big dining banquet good food helpful staff kids play zone area plenty parking space must visit place planning stay ambaji",
                "booked parents stay ambani mandir darshan quality room hygiene good room restaurant service great food also good overall loved stay",
                "good location heart natureas new property cleanliness lots efforts needed staff training food quality front desk staffs properly trained need much efforts improvement rest ok",
                "pleasure staying vanraji resort week honestly say one best experiences life resort located beautiful serene location surrounded lush greenery stunning views rooms spacious comfortable wellequipped amenities could need staff friendly helpful attentive always ready assist anything might require food delicious varied fresh catering different tastes preferences resort offers range activities facilities guests enjoy swimming pool spa gym yoga studio resort also organizes excursions tours nearby attractions temples waterfalls wildlife sanctuaries cultural sites wonderful time exploring local area learning history culture vanraji resort place stay place relax rejuvenate reconnect nature highly recommend anyone looking memorable satisfying vacation"
            ]
        },
        {
            "name": "SHREE HOTEL",
            "rating": [
                4.3
            ],
            "address": [
                "OPP REVA PRABHU SADAN, NEAR DK TRIVEDI CIRCLE, Danta Rd, Shaktidhara Society, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Decent place to stay, I have stayed there twice . They have updated their rooms and facilities. Rooms are spacious and clean. Prompt service , food options are limited, however there are plenty places to eat around nearby. Car parking available at site with a security guard.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Overall, I had a really amazing experience here I stayed for a night and the staff here is really responsive and humble. I had a great experience I really recommend this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A Budget-Friendly Gem in Ambaji:\n\nA Positive Review of Hotel Shree\n\nWhile searching for accommodations in Ambaji, I came across Hotel Shree and was pleasantly surprised by what it offered. While classified as an \"economy hotel,\" my experience surpassed expectations, making it a great value for money.\n\nCleanliness is Key: One of the most important aspects for me is a clean and hygienic environment. Hotel Shree delivered on this front. The rooms were spotless, and the housekeeping staff maintained high standards throughout my stay.\n\nLocation Convenience: The hotel's position near the Ambaji temple and bus stop was incredibly convenient. It allowed me to explore the town effortlessly, saving time and avoiding unnecessary transportation hassles.\n\nBudget-Conscious Choice: As an \"economy hotel,\" Hotel Shree offered excellent value for my money. The room rates were very reasonable, and the amenities provided were more than enough for my needs.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We choose the Superior ac at Shree Hotel situated at the most prime location, culinary excellence awaited us with a diverse menu showcasing local flavors at Shree Kodiyar Kathiyawadi restaurant located in the premises. With adequate amenities including hot running water & air-conditions. A well mannered security & staff! added to the experience, & a good & adequate parking space, gave us a satisfaction of the stay. Look forward to visiting them.\"",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed in the hotel for one night for our visit to Ambaji The Hotel is very nice. it is conveniently located at the highway and very close to the temple. Rooms are clean and spacious. The staff is helpful. The hotel has ample parking Space. There is a Kathiawadi restaurant available in the hotel premises which serves authentic Kathiawadi cuisine at a very reasonable price. Must try. I highly recommend this hotel to prospective travellers.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent place stay stayed twice updated rooms facilities rooms spacious clean prompt service food options limited however plenty places eat around nearby car parking available site security guard",
                "overall really amazing experience stayed night staff really responsive humble great experience really recommend hotel",
                "budgetfriendly gem ambaji positive review hotel shree searching accommodations ambaji came across hotel shree pleasantly surprised offered classified economy hotel experience surpassed expectations making great value money cleanliness key one important aspects clean hygienic environment hotel shree delivered front rooms spotless housekeeping staff maintained high standards throughout stay location convenience hotels position near ambaji temple bus stop incredibly convenient allowed explore town effortlessly saving time avoiding unnecessary transportation hassles budgetconscious choice economy hotel hotel shree offered excellent value money room rates reasonable amenities provided enough needs",
                "choose superior ac shree hotel situated prime location culinary excellence awaited us diverse menu showcasing local flavors shree kodiyar kathiyawadi restaurant located premises adequate amenities including hot running water airconditions well mannered security staff added experience good adequate parking space gave us satisfaction stay look forward visiting",
                "stayed hotel one night visit ambaji hotel nice conveniently located highway close temple rooms clean spacious staff helpful hotel ample parking space kathiawadi restaurant available hotel premises serves authentic kathiawadi cuisine reasonable price must try highly recommend hotel prospective travellers"
            ]
        },
        {
            "name": "Vijaya Palace Resort",
            "rating": [
                4.8
            ],
            "address": [
                "opp. Reva Prabhu sadan, beside Asopalav, Shaktidhara Society, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Amazing stay. Very spacious and clean rooms at a very reasonable price. Breakfast was also very good. The staffs there very supportive and helpful. A little more care should be done for the pool but they did their best when asked. I will definitely suggest , this is the best stay in Ambaji . Strongly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very good one day stay.Friendly staff, clean property with pool and lots of plants and flowers. Need some maintenance.\nNew Hotel, work in progress. As a USA🇺🇸Hotels  and motels owner I recommend this hotel Vijaya Palace resort.🇮🇳",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very nice hotel,, neat and clean room,, room is big size,, swimming pool and game zone,, beautiful garden,, many plant and pots,, nearby market and temple,, I sujest this beautiful risort for stay.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "This resort is the best in the town. Suitable for one day stay, marriage, and vacations.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Nice risort,,luss green garden,,clean pull and room's, many flower plant, Zula and fountain   ,, best service, I suggest to stay hear.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing stay spacious clean rooms reasonable price breakfast also good staffs supportive helpful little care done pool best asked definitely suggest best stay ambaji strongly recommended",
                "good one day stayfriendly staff clean property pool lots plants flowers need maintenance new hotel work progress usað\u009f\u0087ºð\u009f\u0087¸hotels motels owner recommend hotel vijaya palace resortð\u009f\u0087®ð\u009f\u0087³",
                "nice hotel neat clean room room big size swimming pool game zone beautiful garden many plant pots nearby market temple sujest beautiful risort stay",
                "resort best town suitable one day stay marriage vacations",
                "nice risortluss green gardenclean pull rooms many flower plant zula fountain best service suggest stay hear"
            ]
        },
        {
            "name": "Iscon ambe valley",
            "rating": [
                4.1
            ],
            "address": [
                "8VMF+3H2, Ambaji, Chikhla, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Best location & property to stay. The rooms & surrounding area is very neat , clean & has a greenlush garden and green vegetation. The rooms are spacious & luxurious to stay. The food at the in-house restaurant is also very good in quality.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Inconvenience ambe Valley is a very good and comfortable place for staying. Large spacious space and neat clean. Compared to other hotels in Ambaji,  this is an ideal location.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very clean and peaceful hotel. It's around 3 km from the Ambaji bus stand. Very supportive and good staff. The rooms are very spacious and clean. I highly recommend that whenever you are in Ambaji you can choose this hotel to stay .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best room\nGood Service\nBut for Chek out not corrective\nRooms R MT but not give for 2 hr exta",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "All rooms are clean and decent, Mr. Sanjaybhai Raval and his staff is too much supportive. Quality food is also available with nominal rate.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best location property stay rooms surrounding area neat clean greenlush garden green vegetation rooms spacious luxurious stay food inhouse restaurant also good quality",
                "inconvenience ambe valley good comfortable place staying large spacious space neat clean compared hotels ambaji ideal location",
                "clean peaceful hotel around km ambaji bus stand supportive good staff rooms spacious clean highly recommend whenever ambaji choose hotel stay",
                "best room good service chek corrective rooms r mt give hr exta",
                "rooms clean decent mr sanjaybhai raval staff much supportive quality food also available nominal rate"
            ]
        },
        {
            "name": "Lords Eco Inn Ambaji",
            "rating": [
                4.1
            ],
            "address": [
                "Ambaji Hwy, Khodiyar Chowk, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "My stay at Lords Eco Inn, Ambaji was nothing short of delightful. From the warm welcome to the impeccable service throughout, Mr. A. B. Chaki and his team ensured a memorable experience. The room was spacious, clean, and tastefully decorated, offering a cozy retreat after a day of exploration. I highly recommend this establishment for a relaxing and enjoyable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very nice place to stay.... So clean.. supportive staff... Nice ambiance.... Providing detox water for welcome... In room food service... So neat and clean rooms and washroom with all the facilities",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Overall, a pleasant stay with super clean comfortable rooms, very polite and courteous staff and good hotel atmosphere.\nProbably due to solar unit but getting hot water, very early morning / late night is difficult, especially if you want to go for early darshan or leave early. Limited parking space within hotel building. Little pricier than other hotels in vicinity but wont consider overpriced.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We stayed total 20 family's.  we enjoyed lots of at Lord's eco inn. All amenities and staff was very co operative and helpful. Location is awesome. I will definitely prefer to stay here for 2 to 3 days in future.  All food items are very delicious. And very near to Maa Ambaji mandir.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent stay at Lords Eco Inn Ambaji. With its prime location of being so close to Ambaji Temple to the excellent service of hotel staff, there was nothing that could dampen the joy of being in this city. Had a wholesome and spiritual experience in Ambaji. Jai Maa Ambe.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay lords eco inn ambaji nothing short delightful warm welcome impeccable service throughout mr b chaki team ensured memorable experience room spacious clean tastefully decorated offering cozy retreat day exploration highly recommend establishment relaxing enjoyable stay",
                "nice place stay clean supportive staff nice ambiance providing detox water welcome room food service neat clean rooms washroom facilities",
                "overall pleasant stay super clean comfortable rooms polite courteous staff good hotel atmosphere probably due solar unit getting hot water early morning late night difficult especially want go early darshan leave early limited parking space within hotel building little pricier hotels vicinity wont consider overpriced",
                "stayed total familys enjoyed lots lords eco inn amenities staff co operative helpful location awesome definitely prefer stay days future food items delicious near maa ambaji mandir",
                "excellent stay lords eco inn ambaji prime location close ambaji temple excellent service hotel staff nothing could dampen joy city wholesome spiritual experience ambaji jai maa ambe"
            ]
        },
        {
            "name": "KALIDAS MISTRY BHAVAN",
            "rating": [
                4.5
            ],
            "address": [
                "Danta Road, Ambaji, 8R6V+5F6, GJ SH 56, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "It's a top notch community style stay at Ambaji Danta highway. I visited this property for a friend's wedding for 3 days. We stayed in the rooms . Planning is good. Spacious property with ample space of parking.\n\nCommunity hall and big area for dining and any social get to gather or event.\n\nThere is no lift for the first floor, they should think of this.\n\nRoom tarrifs are also very reasonable.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Superb location to stay.\nFacilities of stay and food.\nAC rooms, ample parking area, garden, Hall, and open space.\nCan be rented for official and social functions like Medical camps or engagement, etc.\nAt close distance from Ambaji temple.\n\nHas a beautiful temple of Lord Vishwakarma within the campus.\nCan see Gabbar from the temple. Image attached.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Average decent stay. Spacious rooms and best part is wash basin, toilet and bathroom all three separate. However our toilet flush was leaking otherwise overall good stay. Food is average they use a lot of spices and oil inspite of our instructions given for mild healthy food.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very peaceful place.\nGood location.\nPure Gujarati food lunch .\nGo allways for advance booking .\nBest location for near ambaji.\nWithin 5/10 minit distance for ambaji temple.\nEasy available local transport for go to Ambaji temple.\nVery best location for photography /selfy.\nVishwakarma temple is situated in this location and very peaceful.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It's best place to leave when visiting Ambaji mandir. Food is also good l, they have breakfast, lunch and dinner at nominal price. Rooms are clean and spacious. It is a peaceful place. If visit in after rain and start of winter don't miss out to have a early morning (before sunrise) walk.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "top notch community style stay ambaji danta highway visited property friends wedding days stayed rooms planning good spacious property ample space parking community hall big area dining social get gather event lift first floor think room tarrifs also reasonable",
                "superb location stay facilities stay food ac rooms ample parking area garden hall open space rented official social functions like medical camps engagement etc close distance ambaji temple beautiful temple lord vishwakarma within campus see gabbar temple image attached",
                "average decent stay spacious rooms best part wash basin toilet bathroom three separate however toilet flush leaking otherwise overall good stay food average use lot spices oil inspite instructions given mild healthy food",
                "peaceful place good location pure gujarati food lunch go allways advance booking best location near ambaji within minit distance ambaji temple easy available local transport go ambaji temple best location photography selfy vishwakarma temple situated location peaceful",
                "best place leave visiting ambaji mandir food also good l breakfast lunch dinner nominal price rooms clean spacious peaceful place visit rain start winter dont miss early morning sunrise walk"
            ]
        },
        {
            "name": "Royal Inn Hotel || Best Family Hotel, Rooms, Hotel",
            "rating": [
                4.3
            ],
            "address": [
                "DK Circle, Danta Rd, near SBI Bank, Shiv Shakti Society, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel choice for a stay in Ambaji! The rooms are comfortable and well-maintained, and the room service is top-notch. The location near the bus station is perfect for travelers, offering great convenience. Highly recommend!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "They have basement parking facility. One of the best food they provide in ambaji in breakfast, lunch(unlimited thali) or dinner(a la carte). Rooms were clean. Just I experienced smelly Bathroom. Room service was good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "FRAUD, FRAUD, FRAUD, BE CAREFUL. Don't pay any amount or book this hotel Got number from Google and paid full amount yet demand extra money and ask to enter code in payment option of gpay for booking confirmation . totally fraud.lodge complaint in cyber crime .let's see if get refund .don't pay any advance",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good service, clean rooms and food also good quality and taste",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "From google chat option got the no. For booking the fraud man has taken half amount and was ready to do fraud by sending code and saying to pay again by telling that it will online give me code ur money will not be debited I asked him questions further but he kept the call and is not receiving kindly dont go here i can share the recording and also payment screenshot if u want ..............such liers and fraud",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel choice stay ambaji rooms comfortable wellmaintained room service topnotch location near bus station perfect travelers offering great convenience highly recommend",
                "basement parking facility one best food provide ambaji breakfast lunchunlimited thali dinnera la carte rooms clean experienced smelly bathroom room service good",
                "fraud fraud fraud careful dont pay amount book hotel got number google paid full amount yet demand extra money ask enter code payment option gpay booking confirmation totally fraudlodge complaint cyber crime lets see get refund dont pay advance",
                "good service clean rooms food also good quality taste",
                "google chat option got booking fraud man taken half amount ready fraud sending code saying pay telling online give code ur money debited asked questions kept call receiving kindly dont go share recording also payment screenshot u want liers fraud"
            ]
        },
        {
            "name": "Hotel Kardhar INN",
            "rating": [
                4.5
            ],
            "address": [
                "Shiv Arcade, Khedbhrama road, Shaktidhara Society, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "I've not had the opportunity to stay however, I would like to appreciate the kindness of Mr. Aneel. He has been prompt in resolving the queries and helping with complete information. Moreover, he has been super true about the availability of restaurants around and how the hotel is constantly improving. I believe it is always a good idea to stay at a hotel where people are willing to understand people. Unfortunately, I had to cancel the booking but I can not stop applauding for the quick assistance and understanding by him. Must visit because if the hotel cares for you over the call, you are sure to have a great stay with such a great hotel staff and management.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Pros.\nGreat location in Ambaji near walking distance to all the great restaurants and temple. Definitely would have given 5 star if there was better hospitality.\nCons.\nAbsolutely no hot water in all rooms only less then 2 litre and then have to wait for 10 mins to become hot which is very inconvenient when the temperature outside is in the teens and having to wait while you shower.  According to the front desk we were advised that water is cold that's why it gets cold faster which really doesn't make any sense and it was expected to have been normal.\nRoom was also was considered as a Deluxe room with \"BATHTUB\" with only less then 2 litre hot water available to fill up and bathe.\nIn room hot water kettle was provided but no mugs or cups or instant packets of tea/coffee was available. When asked about instant packets we were advised to order it from the restaurant.\nLots of dust and debris all over the corridor and room furniture in the room. Need a lots of attention to cleaning and maintenance.\nAbsolutely would not recommend to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I stayed for 3 nights but cant fine single complain... Hotels rooms are so comfortable for couples & families.. Rooms & bathrooms are neat & clean.. Room Service is also very fast.. You cant find better hotel option in this price.. Really very good hospitality....",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Hotel Kardhar INN was one of the best stays that I have had in Ambaji, Gujarat. The deluxe rooms with balcony were big and were neat and clean. They had a great view from balcony and were equipped with all the necessary amenities. Service was top notch and location was convenient to Ambaji temple and good restaurants near by.\n\nSpecial thanks to Mr. Anil who was a wonderful host and very professional. He was very accommodating with our request for early check-in.\n\nWhen I travel to Ambaji Kardhar INN is going to be my goto hotel to stay for sure. Thank you!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good well maintained rooms. Location also good. It's 2mins drive from Ambaji 51Shaktipeeth Circle towards Himmatnagar side. Staff and the manager are soft spoken and polite. Room's AC TV all in good condition. Stayed here for a day. We all liked the stay. Not too costly. Pricing is proper not too high.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ive opportunity stay however would like appreciate kindness mr aneel prompt resolving queries helping complete information moreover super true availability restaurants around hotel constantly improving believe always good idea stay hotel people willing understand people unfortunately cancel booking stop applauding quick assistance understanding must visit hotel cares call sure great stay great hotel staff management",
                "pros great location ambaji near walking distance great restaurants temple definitely would given star better hospitality cons absolutely hot water rooms less litre wait mins become hot inconvenient temperature outside teens wait shower according front desk advised water cold thats gets cold faster really doesnt make sense expected normal room also considered deluxe room bathtub less litre hot water available fill bathe room hot water kettle provided mugs cups instant packets teacoffee available asked instant packets advised order restaurant lots dust debris corridor room furniture room need lots attention cleaning maintenance absolutely would recommend anyone",
                "stayed nights cant fine single complain hotels rooms comfortable couples families rooms bathrooms neat clean room service also fast cant find better hotel option price really good hospitality",
                "hotel kardhar inn one best stays ambaji gujarat deluxe rooms balcony big neat clean great view balcony equipped necessary amenities service top notch location convenient ambaji temple good restaurants near special thanks mr anil wonderful host professional accommodating request early checkin travel ambaji kardhar inn going goto hotel stay sure thank",
                "good well maintained rooms location also good mins drive ambaji shaktipeeth circle towards himmatnagar side staff manager soft spoken polite rooms ac tv good condition stayed day liked stay costly pricing proper high"
            ]
        },
        {
            "name": "Nandini Ashram Trust ( Nandini Guest house )",
            "rating": [
                4.3
            ],
            "address": [
                "कुम्भारिया रोड, Gajanand Society, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Best place to stay in ambaji (one of the 51 shaktipeeth), great location surrounded by mountains and fresh air breezing, have enough space for parking. It's the best place for nature lovers. They have 4 ground turtles and a water turtle (jamin ane pani na kachba) so small kids can play with them too., but with care.best place for going with family, friends , with couple and you can have a solo trip too.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Excellent property,and very convinient for staying.The front desk staff and other staff members are extremely helpful and they all go beyound and above to make your stay comfortable. This property is highly recommended...must visit.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It is one of the good property in ambaji to accommodate and I love the part as they have kept turtle too in your premises.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Had a great time\nLocation, staff, and hospitality were superb.\nWill definitely recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best for staying with food facility. Peaceful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place stay ambaji one shaktipeeth great location surrounded mountains fresh air breezing enough space parking best place nature lovers ground turtles water turtle jamin ane pani na kachba small kids play carebest place going family friends couple solo trip",
                "excellent propertyand convinient stayingthe front desk staff staff members extremely helpful go beyound make stay comfortable property highly recommendedmust visit",
                "one good property ambaji accommodate love part kept turtle premises",
                "great time location staff hospitality superb definitely recommend",
                "best staying food facility peaceful"
            ]
        },
        {
            "name": "Reva Prabhu Sadan",
            "rating": [
                4
            ],
            "address": [
                "Shiv shakti nagar, Khodiyar Chowk, Ambaji, Gujarat 385110, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful place to stay. Rooms are clean and room service was very good. Staff was friendly and helpful. If you like authentic gujrati food then you can pay in advance and delicious meal can be served at the restaurant.  10 mins walk to Ambaji temple. Plenty of auto rickshaw available and you can get to temple as well. If you like outside food then plenty of restaurants available in walking distance.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Just opposite main Temple gate with Good DINING facilities and They serve Punjabi, Gujrati, South Indian, Pavbhaji at budget friendly price.\nWe ordered butter Pav bhaji ( Rs. 125/plate) which was good in taste but not satisfied with pav quality ( not soft).\nService was fast .",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This is not original website.. I have booked one family room and they changed me to 3000/- and then they said to me that I have paid with taxes and I have paid 3180/- again.. they sent me hotel receipt on watsapp and then I asked my 3000/- refund they continue cut my call and then they blocked me.. so please don't go this website..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place for staying with family\nOnline booking not available so please not try for online booking.\nNear temple\nOn main road",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "My family eating and not finish food owner tell me standup other Clint cooking\nHe is behave so ruddle\nI order light pav bhaji but serve spicy food was waste a money\nWaiter are unexpired\nNot go 2 ND time",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful place stay rooms clean room service good staff friendly helpful like authentic gujrati food pay advance delicious meal served restaurant mins walk ambaji temple plenty auto rickshaw available get temple well like outside food plenty restaurants available walking distance",
                "opposite main temple gate good dining facilities serve punjabi gujrati south indian pavbhaji budget friendly price ordered butter pav bhaji rs plate good taste satisfied pav quality soft service fast",
                "original website booked one family room changed said paid taxes paid sent hotel receipt watsapp asked refund continue cut call blocked please dont go website",
                "best place staying family online booking available please try online booking near temple main road",
                "family eating finish food owner tell standup clint cooking behave ruddle order light pav bhaji serve spicy food waste money waiter unexpired go nd time"
            ]
        }
    ]
}