{
    "places_with_reviews": [
        {
            "name": "Hotel Ramdev",
            "rating": [
                4
            ],
            "address": [
                "PB Road, Nehru Nagar, near Jawaharlal Nehru Medical College, Nehru Nagar, Belagavi, Karnataka 590001, India"
            ],
            "reviews": [
                {
                    "text": "Stopped here for lunch. Sat in the family room. Food was great but the service was below average. There was no waiter and when one came for the order he messed it up.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's a decent place for South Indian breakfast and lunch.\nFood is average yet its crowded most of the times\nService has to improve.\nThey are seriously understaffed.\nParking is available, located in the prime area.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Scams possible at front desk.\nThey keep a grey area ....so that they can play arround the discounts. Not sure it's a trick management itself or silly stunt by the front desk staff. Suggest always be very clear about discounts offered and ask for bills and receipts.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Had been for dinner with family at around 10:00pm few days ago (panchavati veg - family room i guess). Food was really tasty and scored full marks. But the actual disappointment started with family room serving staff shouting and heated arguing with other staff, just next to our table almost at the end stage of our dinner. We were not even offered finger bowl post dinner and had to ask and pay bill at counter without usually the table serviced.\nHope the hotel Ramdev team ensures staff arguments dont happen in front of restaurant guests and full service is offered.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hi All,\n\nI would share my experience that I will not recommend for ramdev hotel for everyone for dinner and breakfast,  because breakfast and dinner is not good and taste less food. Once upon a time ramdev hotel is best in the belgaum city before 15 to 20 years ago but now a days I don't like this hotel because of foods quality is too much bad..🤕🤒🤮🤮.. If you are in ramdev circle I  will suggest instead going to ramdev hotel go to shabri or sai hotel beside ramdev hotel..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stopped lunch sat family room food great service average waiter one came order messed",
                "decent place south indian breakfast lunch food average yet crowded times service improve seriously understaffed parking available located prime area",
                "scams possible front desk keep grey area play arround discounts sure trick management silly stunt front desk staff suggest always clear discounts offered ask bills receipts",
                "dinner family around pm days ago panchavati veg family room guess food really tasty scored full marks actual disappointment started family room serving staff shouting heated arguing staff next table almost end stage dinner even offered finger bowl post dinner ask pay bill counter without usually table serviced hope hotel ramdev team ensures staff arguments dont happen front restaurant guests full service offered",
                "hi would share experience recommend ramdev hotel everyone dinner breakfast breakfast dinner good taste less food upon time ramdev hotel best belgaum city years ago days dont like hotel foods quality much badð\u009f¤\u0095ð\u009f¤\u0092ð\u009f¤®ð\u009f¤® ramdev circle suggest instead going ramdev hotel go shabri sai hotel beside ramdev hotel"
            ]
        },
        {
            "name": "UK27 The Fern - An Ecotel Hotel, Belagavi",
            "rating": [
                4.3
            ],
            "address": [
                "Ayodhya Nagar, Sadashiv Nagar, Belagavi, Karnataka 590019, India"
            ],
            "reviews": [
                {
                    "text": "UK 27 The Fern Hotel provides a luxurious and comfortable stay with spacious rooms and excellent amenities. The staff is friendly and accommodating, ensuring a pleasant experience for guests. The hotel's location offers convenient access to nearby attractions and transportation hubs. However, some guests may find the pricing slightly on the higher side compared to similar accommodations in the area. Overall, it's a great choice for travelers looking for a high-quality stay in the UK.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel..feels like a sweet home ..supportive staff from the desk of reception to the dinner table. Ambience which bound me to stay for one more day.. thanks the fern team towards your all kindness and quick assistance nature.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "They have pretty nice rooms for the price. Although the service could be upped a little. They could get more premium like giving bathroom slippers in the room. Room had a few plumbing issues which was sorted out effectively by the staff. The view is said to be a city view but it isn't that great. Was pretty unlucky to get an old electric tower out of my window.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Was thre at Uk27 Fern for Business trip. It is a next level luxury and spacious hotel. Very tasty food. Lounge is classy. Quick service. Rooms are occupied with Oven, heater, Sofa, Working table, TV's, Iron and what not. A bag with \"Times of India\"  hanged to door written Good Morning wishes makes a good start for the day. Location is very much approachable to any corner of city. Worth it. Thanks team Fern!!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is one of the best hotels at this price.. the lobby is little small.. but the rooms are very luxurious, cozy and well maintained.. room has all the necessary facilities.. it was superbly decorated.. little things like good quality lights, variety of lamps, nice seating area with luxury chairs, work desk, even live plant placed near wash basin.. all these things makes the stay very worth it.. in room dining service need to be improved.. eg. we ordered soup which was cold when brought in room.. Internet service was was not stable.. otherwise rest experience was awesome.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "uk fern hotel provides luxurious comfortable stay spacious rooms excellent amenities staff friendly accommodating ensuring pleasant experience guests hotels location offers convenient access nearby attractions transportation hubs however guests may find pricing slightly higher side compared similar accommodations area overall great choice travelers looking highquality stay uk",
                "hotelfeels like sweet home supportive staff desk reception dinner table ambience bound stay one day thanks fern team towards kindness quick assistance nature",
                "pretty nice rooms price although service could upped little could get premium like giving bathroom slippers room room plumbing issues sorted effectively staff view said city view isnt great pretty unlucky get old electric tower window",
                "thre uk fern business trip next level luxury spacious hotel tasty food lounge classy quick service rooms occupied oven heater sofa working table tvs iron bag times india hanged door written good morning wishes makes good start day location much approachable corner city worth thanks team fern",
                "one best hotels price lobby little small rooms luxurious cozy well maintained room necessary facilities superbly decorated little things like good quality lights variety lamps nice seating area luxury chairs work desk even live plant placed near wash basin things makes stay worth room dining service need improved eg ordered soup cold brought room internet service stable otherwise rest experience awesome"
            ]
        },
        {
            "name": "Hotel Sankam Residency",
            "rating": [
                4.1
            ],
            "address": [
                "Airport Road, Off, Madras Bombay Trunk Rd, Zakriya Mohalla, Gandhi Nagar, Belagavi, Karnataka 590016, India"
            ],
            "reviews": [
                {
                    "text": "Hotel Sankam Residency offers a comfortable stay with its clean and well-maintained rooms. The staff is friendly and provides prompt service to guests, enhancing their overall experience. The hotel's location is convenient, with easy access to nearby attractions and commute to outstation. The hotel also provides grand banquet halls and lawn venue for weddings and other functions alike. Overall, Hotel Sankam Residency provides good value for budget-conscious travelers seeking a hassle-free stay in the area.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Great stay option on the national highway! Clean modern rooms, comfy bed, clean bathrooms with toiletries..\nFast check in and check out.. Very nice breakfast spread.. The owner was so kind to personally supervise and recommend dishes to us. We felt very welcomed. The staff was very polite too.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I regularly go with my family to have the buffet breakfast. We enjoy it very much. But today it was disappointing.  Most of the items were missing. No cakes, no tea, no hot milk, no fruits. The staff were not helpful. They were busy with some preparations for a marriage party. They were not responding to us.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good hotel but Bad management. Very bad in terms of parking. They kept 2 wedding on same day in lawn area. The useless watchman has place for visitors but not for guests. Music was on by 7 am in the morning. No sound proof rooms.\nNo electricity for 5 hours.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hotel is quite good and comfortable. Nice Place for small party's ....Ample parking space....The ambience and services provided at the hotel are very good. Hygienic and spacious rooms. Food is tasty.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel sankam residency offers comfortable stay clean wellmaintained rooms staff friendly provides prompt service guests enhancing overall experience hotels location convenient easy access nearby attractions commute outstation hotel also provides grand banquet halls lawn venue weddings functions alike overall hotel sankam residency provides good value budgetconscious travelers seeking hasslefree stay area",
                "great stay option national highway clean modern rooms comfy bed clean bathrooms toiletries fast check check nice breakfast spread owner kind personally supervise recommend dishes us felt welcomed staff polite",
                "regularly go family buffet breakfast enjoy much today disappointing items missing cakes tea hot milk fruits staff helpful busy preparations marriage party responding us",
                "good hotel bad management bad terms parking kept wedding day lawn area useless watchman place visitors guests music morning sound proof rooms electricity hours",
                "hotel quite good comfortable nice place small partys ample parking spacethe ambience services provided hotel good hygienic spacious rooms food tasty"
            ]
        },
        {
            "name": "Hotel Sanman Deluxe",
            "rating": [
                3.8
            ],
            "address": [
                "VG85+395, College Rd, Kallehol, Camp, Belagavi, Karnataka 590001, India"
            ],
            "reviews": [
                {
                    "text": "Very bad experience this time\nReached hotel at 7 pm on 8 march 2024\nBooked 2 ac rooms as parents were travelling with us. Was given 2 rooms on 5 th floor. The AC in our room didn’t work so told the reception and they changed the room. The AC in this room was also faulty as ice buildup was happening and filters were not even cleaned. As it was on top floor fan was throwing warm air, could not check out due to my old age parents otherwise would have done the same. Very bad experience of a hotel which charge a good amount but could not maintain its room and its reputation. A big No in future.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It happened for us to stay here recently. Rooms are costly as compared to their ambience... non ac room are charged heavily But it was okay if room were  new and renovated.  Toilet is an old one which feels like it will break if we use it... an ages old sink in bathroom.. and most imp thing is the receptionist attitude,  he tried to judge us on our clothes... this was worst part... very bad experience in belgaum",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Utter waste of money!!! Stayed here for weekend recently and canbe counted as one of the worst hotel stays of my life. The rooms are moderately spacious but poorly kept with cleanliness issues. The washroom was very ill maintained with significant plumbing issues. No toiletries were provided. The WiFi doesn't work inside the room and the solution given to tat was use it in the corridor!!\nThe housekeeping staff do not attend to calls or queries or keep you waiting for long hours. The front desk staff are equally bad and very rude and non-caring towards the guests.\nOverall a very poor and horrible experience. Would not recommend this to anyone!!!!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The rooms are very spacious and well maintained at hotel Sanman deluxe.\n\nRoom and Restaurant service staff is very polite, friendly and hospitable.\n\nThey maintain good quality South Indian, North Indian and Chinese cuisine along with nice variety of desserts.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good old hotel. Nice simple rooms with restaurant.  They provide complimentary breakfast of Rs 250 for 2 members. If you take beyond that we have to pay extra.\nStaff receiving is good.  Food in the restaurant is ok but can be made more tastier, we don't find any spiciness even in biryani.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience time reached hotel pm march booked ac rooms parents travelling us given rooms th floor ac room didnâ\u0080\u0099t work told reception changed room ac room also faulty ice buildup happening filters even cleaned top floor fan throwing warm air could check due old age parents otherwise would done bad experience hotel charge good amount could maintain room reputation big future",
                "happened us stay recently rooms costly compared ambience non ac room charged heavily okay room new renovated toilet old one feels like break use ages old sink bathroom imp thing receptionist attitude tried judge us clothes worst part bad experience belgaum",
                "utter waste money stayed weekend recently canbe counted one worst hotel stays life rooms moderately spacious poorly kept cleanliness issues washroom ill maintained significant plumbing issues toiletries provided wifi doesnt work inside room solution given tat use corridor housekeeping staff attend calls queries keep waiting long hours front desk staff equally bad rude noncaring towards guests overall poor horrible experience would recommend anyone",
                "rooms spacious well maintained hotel sanman deluxe room restaurant service staff polite friendly hospitable maintain good quality south indian north indian chinese cuisine along nice variety desserts",
                "good old hotel nice simple rooms restaurant provide complimentary breakfast rs members take beyond pay extra staff receiving good food restaurant ok made tastier dont find spiciness even biryani"
            ]
        },
        {
            "name": "Native Hotels by Heda Hospitality",
            "rating": [
                4.1
            ],
            "address": [
                "CTS NO.732, RFGX+XMH, Khanapur Rd, near 3rd railway gate, opp. D Mart, Hindu Nagar, Tilakwadi, Belagavi, Karnataka 590006, India"
            ],
            "reviews": [
                {
                    "text": "The rooms are clean and big enough.\nAnd the staff is really really helpful, doing their best to make you happy.\n\nReason for four stars: we went out at 8am, back at 3pm and the card was not working, they help and change the card (same for other guests). The room was not done yet, they immediately provided the cleaning but they forgot to replace the toilet paper that was finished. So in general they are willing to help but some basics are missing. In general the hotel is good, maybe is just bad luck.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's a beautiful place to stay. Spik n span. I loved staying here for 3 days. Their housekeeping staff is very lovely and humble. Both the doorman uncles were very helpful. The lady on the reception desk was ever so receptive and helpful. She will go miles in the hospitality industry. My room was lovely. It was cleaned daily, towels were replenished. I absolutely adored the stay. If I had any grievances, it's about 2 things.\n\n1. Food. Food could be better. Definitely. It was on the saltier side, most of the time.\n\n2. I was a solo female traveller. I had a train to catch at 5:45 a.m in the morning, so I was going to check out at 5 a.m. I asked at the reception counter if the hotel could arrange a commute for me. Not only did they say a blatant 'No', but they did not even offer any help in any other way. If you treat your female customers this way, I doubt I will ever think about staying at your property again, no matter how much I like other things. I hope you realize that the travellers are guests in your city and we ask for your help while in your city, because you are more familiar with your city.  This experience made me sad. Ultimately, I was able to arrange a rickshaw with the help of doorman uncle and thanks to him, I was able to catch my train on time.\n\nI hope the management takes note of this and is able to provide such assistance to the needy travellers, in the future.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Entire room and bathroom smells of smoke, 💨  🚬 🚬🚬\n\nEven though rooms are smoke free.\n\nThe bathroom ventilation is connected with other rooms and looks like someone is smoking secretly in other rooms and it’s just giving others the joy of passive smoking\n\nMore fun- we got the room changed late night due to extreme smoke smell coming through AC vents and now the new room has water leaking from Roof .💦💧\n\nMore experience to come shortly",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The room was mediocre, but the bathroom  was substandard, with the added frustration of a malfunctioning hot water system. The untrained staff, mostly junior members under training, added to the dissatisfaction. The restaurant's small size and non-functioning toaster were further disappointments. For a business trip, it's advisable to explore other options, as the experience did not justify the high tariff.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very poor experience. Literally preponed my checkout plans thanks to their worst service. They assigned me a room with flush not working and no toilet paper and there were many other amenities missing. Within an hour of check in I made some 12-15 calls only to get basic stuff. Never recommending to anyone. Oh and btw - they charge 1500 for early check in and check out which is literally the amount I paid for the train to Belgaum in AC 2 tier.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms clean big enough staff really really helpful best make happy reason four stars went back pm card working help change card guests room done yet immediately provided cleaning forgot replace toilet paper finished general willing help basics missing general hotel good maybe bad luck",
                "beautiful place stay spik n span loved staying days housekeeping staff lovely humble doorman uncles helpful lady reception desk ever receptive helpful go miles hospitality industry room lovely cleaned daily towels replenished absolutely adored stay grievances things food food could better definitely saltier side time solo female traveller train catch morning going check asked reception counter hotel could arrange commute say blatant even offer help way treat female customers way doubt ever think staying property matter much like things hope realize travellers guests city ask help city familiar cityâ experience made sad ultimately able arrange rickshawâ help doorman uncle thanks able catch train time hope management takes note able provide assistance needy travellers future",
                "entire room bathroom smells smoke ð\u009f\u0092¨ ð\u009f\u009a¬ ð\u009f\u009a¬ð\u009f\u009a¬ even though rooms smoke free bathroom ventilation connected rooms looks like someone smoking secretly rooms itâ\u0080\u0099s giving others joy passive smoking fun got room changed late night due extreme smoke smell coming ac vents new room water leaking roof ð\u009f\u0092¦ð\u009f\u0092§ experience come shortly",
                "room mediocre bathroom substandard added frustration malfunctioning hot water system untrained staff mostly junior members training added dissatisfaction restaurants small size nonfunctioning toaster disappointments business trip advisable explore options experience justify high tariff",
                "poor experience literally preponed checkout plans thanks worst service assigned room flush working toilet paper many amenities missing within hour check made calls get basic stuff never recommending anyone oh btw charge early check check literally amount paid train belgaum ac tier"
            ]
        },
        {
            "name": "Mayur Belgaum Presidency Hotel & Spa",
            "rating": [
                4.2
            ],
            "address": [
                "CTS-1019, BUDA Office Road, near Tallest Indian National Flag, Besides Killa Lake, NH48, Ashok Nagar, Shivaji Nagar, Belagavi, Karnataka 590016, India"
            ],
            "reviews": [
                {
                    "text": "So this is to the Mayur pool side  Restaurant and great service appreciation to the maintainance staff. I had taken my parents for the dinner and the food service was good and fast apart from that you can spend a good quality peaceful time over there, the ambience is quite well good\nThere is one staff named Santosh in the maintainance department he was the best at its hospitality towards us.... He helped clicking out numerous pictures and videos of ours in the Mayur Residency. So good services by the staff. Good wishes for the future 🌟🌟🌟🌟",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Cleanliness is the biggest issue. The toilet seats weren't clean. The linens were dirty. The TV won't turn off neither would the volume change.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stayed here while coming back from Kancheepuram but experience was not so good as there were ants in the room & on bed linen…also there were long hairs lying on floor & pubic hairs on bed linen…but then staff changed the room and also housekeeping staff cleaned it within minutes…but got the lesson good & big looking rooms in pictures always not that good. Specially when your tired of journey.\n\nFood was passable.\n\nPs- Reception staff was only looking to sell rooms without checking cleanliness of the room..management does not care about the overall experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The service is pathetic, slow and equally bad. They couldn’t follow simple cooking instructions of excluding some food items. The ambience, music was nice.. but food service is REALLY BAD!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Unsatisfactory encounter. The service was notably sluggish, and the quality of the food fell below expectations. The overall experience was disappointing, prompting a reconsideration of the establishment's standards and service efficiency.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mayur pool side restaurant great service appreciation maintainance staff taken parents dinner food service good fast apart spend good quality peaceful time ambience quite well good one staff named santosh maintainance department best hospitality towards us helped clicking numerous pictures videos mayur residency good services staff good wishes future ð\u009f\u008c\u009fð\u009f\u008c\u009fð\u009f\u008c\u009fð\u009f\u008c\u009f",
                "cleanliness biggest issue toilet seats werent clean linens dirty tv wont turn neither would volume change",
                "stayed coming back kancheepuram experience good ants room bed linenâ\u0080¦also long hairs lying floor pubic hairs bed linenâ\u0080¦but staff changed room also housekeeping staff cleaned within minutesâ\u0080¦but got lesson good big looking rooms pictures always good specially tired journey food passable ps reception staff looking sell rooms without checking cleanliness roommanagement care overall experience",
                "service pathetic slow equally bad couldnâ\u0080\u0099t follow simple cooking instructions excluding food items ambience music nice food service really bad",
                "unsatisfactory encounter service notably sluggish quality food fell expectations overall experience disappointing prompting reconsideration establishments standards service efficiency"
            ]
        },
        {
            "name": "Hotel Adarsha Palace",
            "rating": [
                3.7
            ],
            "address": [
                "#3360, 2B, College Rd, opp. Lingaraj College, Khade Bazar, Camp, Belagavi, Karnataka 590001, India"
            ],
            "reviews": [
                {
                    "text": "Nice place to stay if you are in Belgaum. Rooms are Little old now but clean. Service is good.. breakfast spread is excellent. Ample parking space. Location is also good. This can be used as night halt place if you are traveling from Mumbai to Bangalore or vice versa.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Located in the center of belgaum city. Rooms are neat, clean & fresh. 4 floor hotel + Lodging available. Lift is available also Compensatory breakfast is provided where 6-7 cuisine available. Room service is good. We booked 2 rooms here. In 1 room hot water available & in other lukewarm water present. 24 hour check in check out service available. At the ground floor there is an ample amount of parking available also Pure veg hotel available at the Ground floor. On the top floor Veg-non veg restaurant+ bar is available. Overall a great experience to stay in the Adarsh palace hotel for 2 days.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Had stayed in the hotel but the experience was very bad when u dont have single room than why you have to book do all the registration process and than after giving 2 bed rooms on asked to change they didn't had room as this was been told by the reception staff bt after i inquired from the room service staff they told me there were rooms vacant so after so much request my room was not been changed the washroom was very bad also the food here is too too costly i really didn't like the way the reception staff behaviour was please respect your customers....",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Modern rooms and bathrooms. It's like a three star hotel at cheap rates. Great location in the center of the city. However, if you want peace and quiet consider a hotel on the outskirts. Businessmen will appreciate the location.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Adarsha Palace is a fantastic place to stay in the city. It offers comfortable and well-appointed rooms that ensure a pleasant and relaxing stay. The palace is known for its elegant architecture and luxurious amenities, providing a royal experience to its guests. The staff at Adarsha Palace is friendly and attentive, always ready to assist with any needs or requests. The palace also boasts a range of facilities, including a swimming pool, spa, and fitness center, allowing guests to unwind and rejuvenate during their stay. The on-site restaurant serves delicious and flavorful cuisine, offering a delightful dining experience. The location of Adarsha Palace is convenient, with easy access to popular attractions and shopping areas. Whether you're traveling for business or leisure, Adarsha Palace is a top choice for a comfortable and enjoyable stay. So, if you're looking for a place to relax and indulge in luxury, Adarsha Palace is the perfect destination. 🏰✨😊",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place stay belgaum rooms little old clean service good breakfast spread excellent ample parking space location also good used night halt place traveling mumbai bangalore vice versa",
                "located center belgaum city rooms neat clean fresh floor hotel lodging available lift available also compensatory breakfast provided cuisine available room service good booked rooms room hot water available lukewarm water present hour check check service available ground floor ample amount parking available also pure veg hotel available ground floor top floor vegnon veg restaurant bar available overall great experience stay adarsh palace hotel days",
                "stayed hotel experience bad u dont single room book registration process giving bed rooms asked change didnt room told reception staff bt inquired room service staff told rooms vacant much request room changed washroom bad also food costly really didnt like way reception staff behaviour please respect customers",
                "modern rooms bathrooms like three star hotel cheap rates great location center city however want peace quiet consider hotel outskirts businessmen appreciate location",
                "adarsha palace fantastic place stay city offers comfortable wellappointed rooms ensure pleasant relaxing stay palace known elegant architecture luxurious amenities providing royal experience guests staff adarsha palace friendly attentive always ready assist needs requests palace also boasts range facilities including swimming pool spa fitness center allowing guests unwind rejuvenate stay onsite restaurant serves delicious flavorful cuisine offering delightful dining experience location adarsha palace convenient easy access popular attractions shopping areas whether youre traveling business leisure adarsha palace top choice comfortable enjoyable stay youre looking place relax indulge luxury adarsha palace perfect destination ð\u009f\u008f°â\u009c¨ð\u009f\u0098\u008a"
            ]
        },
        {
            "name": "Pai Resort - Best Business Hotel in Belgaum",
            "rating": [
                4.1
            ],
            "address": [
                "1044 3B-2, opp. fort lake Phase, Azad Mohalla, Gandhi Nagar, Belagavi, Karnataka 590016, India"
            ],
            "reviews": [
                {
                    "text": "Located closely to the belagavi bus stop, we booked the hall with food buffet for 40k for 100 people, it's non AC hall and stage decoration have to be arranged on our own. Enough space for parking.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Staying at Pai Resort in Belgaum was an absolute delight! The cleanliness of the rooms exceeded my expectations, making for a comfortable and refreshing stay. The service provided by the staff was exemplary, with their attention to detail and friendly demeanor enhancing the overall experience. From check-in to check-out, every aspect of my stay was met with professionalism and efficiency. I highly recommend Pai Resort to anyone seeking a relaxing and hassle-free getaway in Belgaum.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Worst accommodation I have ever stayed, Food quality is also the worst. Staff behaviour is also not good. If I have came this far to give review then you all can think that how this place is. I will suggest everyone if possible book any other accommodation.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The hotel not only offers a serene setting with beautiful lake views and stunning sunsets but also boasts a diligent staff, excellent cleanliness, and reasonable room prices. Additionally, it provides a party hall accommodating 50 to 80 guests for various celebrations. Moreover, its large garden space, with a capacity of 100 to 150 guests, is perfect for hosting mid-sized events like wedding receptions, birthdays, and anniversaries, ensuring picturesque and memorable gatherings.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Most easily approachable from highway and well connected to city with roads on both sides. The rooms are renovated absolutely clean and well lit . Top of it all breakfast spread is yummy & full of variety. Highly Recommended to stay",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located closely belagavi bus stop booked hall food buffet k people non ac hall stage decoration arranged enough space parking",
                "staying pai resort belgaum absolute delight cleanliness rooms exceeded expectations making comfortable refreshing stay service provided staff exemplary attention detail friendly demeanor enhancing overall experience checkin checkout every aspect stay met professionalism efficiency highly recommend pai resort anyone seeking relaxing hasslefree getaway belgaum",
                "worst accommodation ever stayed food quality also worst staff behaviour also good came far give review think place suggest everyone possible book accommodation",
                "hotel offers serene setting beautiful lake views stunning sunsets also boasts diligent staff excellent cleanliness reasonable room prices additionally provides party hall accommodating guests various celebrations moreover large garden space capacity guests perfect hosting midsized events like wedding receptions birthdays anniversaries ensuring picturesque memorable gatherings",
                "easily approachable highway well connected city roads sides rooms renovated absolutely clean well lit top breakfast spread yummy full variety highly recommended stay"
            ]
        },
        {
            "name": "Hotel Samudra",
            "rating": [
                4
            ],
            "address": [
                "1164, Hotel Samudra, 1165, Saraf Galli, Shahapur, Belagavi, Karnataka 590003, India"
            ],
            "reviews": [
                {
                    "text": "Food is horrible, overpriced and not worth money in any aspect. Hotel is located in a congested lane with high room tariffs and no hot water. Service is delayed so better ask for anything in advance.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "“Average hotel with very less parking”\n\n1. The checkin was smooth.\n2. Checkout was smooth.\n3. Property is new but not maintained well.\n4. Parking is very less. Can accommodate only 3 to 4 cars comfortably. When we stayed, there was a function in their hall and those guests had parked. To which the hotel representatives asked us to park on the roadside. We declined and got our parking. This has never been the case with any other hotel that we have stayed in belagavi.\n5. Restaurant: even with less options, the food was good and delicious.\n6. Breakfast: very less options. Was surprised to see that a hotel in Belagavi doesn't serve dosa or idli in the breakfast. People like us like to eat those things whenever we come to the town.\n7. Approach road: even though the road is of good width, the road was full of the people selling vegetables and hence it was occupied. It seems that happens every Saturday.\n8. AC filters need to be cleaned.\n\nOverall, it is good but not recommended for people who travel often as it's not comfortable in the aspects referred above.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The approach road to the hotel is very narrow and from a congested area. There is no other way to the hotel. Food was average. Rooms were small but clean. Service was good and the staff was very cooperative.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very decent hotel at a budget price. Rooms are neat and clean. Slightly small rooms but there is small area outside washroom for changing and closet. Food is also Good and reasonably priced. Staff is helpful and very prompt service.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A gem of a hotel, tucked in a sleepy residential location. Clean bedsheets, clean toilets and good breakfast. Try their Aloo Parathas  ... delicious.\nDon't park your car in their basement, I Los my front bumper to a nasty steel pie protruding from ground. Beware.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food horrible overpriced worth money aspect hotel located congested lane high room tariffs hot water service delayed better ask anything advance",
                "â\u0080\u009caverage hotel less parkingâ\u0080\u009d checkin smooth checkout smooth property new maintained well parking less accommodate cars comfortably stayed function hall guests parked hotel representatives asked us park roadside declined got parking never case hotel stayed belagavi restaurant even less options food good delicious breakfast less options surprised see hotel belagavi doesnt serve dosa idli breakfast people like us like eat things whenever come town approach road even though road good width road full people selling vegetables hence occupied seems happens every saturday ac filters need cleaned overall good recommended people travel often comfortable aspects referred",
                "approach road hotel narrow congested area way hotel food average rooms small clean service good staff cooperative",
                "decent hotel budget price rooms neat clean slightly small rooms small area outside washroom changing closet food also good reasonably priced staff helpful prompt service",
                "gem hotel tucked sleepy residential location clean bedsheets clean toilets good breakfast try aloo parathas delicious dont park car basement los front bumper nasty steel pie protruding ground beware"
            ]
        },
        {
            "name": "Treebo Trend Elite Residency, Belagavi",
            "rating": [
                3.8
            ],
            "address": [
                "1676/1, Kirloskar Road, Opp.Nucleus Mall, Ramling Khind Rd, Raviwar Peth, Belagavi, Karnataka 590001, India"
            ],
            "reviews": [
                {
                    "text": "When entered the hotel , made to wait for long time though it was advance booked. Room ok ok. Bed is worst... Service is too late... Asked to update tea bag and other things at 10:30 and again we only reminded but they gave it in lunch time... Reception people don't know how to welcome the guests. Too much disturbance by the workers... They were shouting like anything .... Not peaceful environment.. it disturbed in my work .. overall as per my personal experience.. I don't give any number.  Not worth ... It's too costly also. There is no parking facility also. Concerned people take it positively and better bring pleasing atmosphere to the guests.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had a pleasant stay here. Located in the prime area, tidy rooms. Highly recommended for business travellers and families.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It’s Ok for one or two nights stay. One major problem is that the rooms have absolutely no window. Claustrophobics will have a problem. Breakfast was Ok. Bathrooms are small but Ok. Location is nice, everything is nearby. Only one thing is a problem, rooms have no window or daylight. If the doors are closed, you can’t guess if it’s day or night.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The hotel is spacious, loved the clean and tidy rooms. The breakfast had a variety of items and it was delicious and the dining area was calm and spacious. Really loved my stay and would recommend!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had an excellent stay at this hotel, and surprisingly, I booked it last minute but managed to secure a fantastic deal with lower rates. The rooms were spacious, well-maintained, and the bathrooms were impeccably clean. Overall, it was a delightful experience.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "entered hotel made wait long time though advance booked room ok ok bed worst service late asked update tea bag things reminded gave lunch time reception people dont know welcome guests much disturbance workers shouting like anything peaceful environment disturbed work overall per personal experience dont give number worth costly also parking facility also concerned people take positively better bring pleasing atmosphere guests",
                "pleasant stay located prime area tidy rooms highly recommended business travellers families",
                "itâ\u0080\u0099s ok one two nights stay one major problem rooms absolutely window claustrophobics problem breakfast ok bathrooms small ok location nice everything nearby one thing problem rooms window daylight doors closed canâ\u0080\u0099t guess itâ\u0080\u0099s day night",
                "hotel spacious loved clean tidy rooms breakfast variety items delicious dining area calm spacious really loved stay would recommend",
                "excellent stay hotel surprisingly booked last minute managed secure fantastic deal lower rates rooms spacious wellmaintained bathrooms impeccably clean overall delightful experience"
            ]
        }
    ]
}