{
    "places_with_reviews": [
        {
            "name": "Hotel Grand Park",
            "rating": [
                4.2
            ],
            "address": [
                "Bank Street, Opp. SBI, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Attended a friend's wedding. Self drove here and stayed at this hotel with another friend.\n\nBusiness/family atmosphere.\n\nComfortable, clean rooms.\n\n24-hours hot water for bathing.\n\nMattress in the bed was very, very soft for my liking, but that was a variable nares in my preference.\n\nGood parking.\n\nLift facility.\n\nWas a comfortable 2-night stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "1and 2nd mar 2024 i stayed with family room 410 for my brother sons wedding.Room and toilet room ok but water not chocked out from comet often problem.second one no chairs,no catle for heat water for coffe or tea making.minimum facilty nil.some what poor maitance, room charges that not much worth",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Came here for a campus recruitment drive. Rooms are good, clean and comfortable. Bathroom was also clean and well maintained. This hotel does not have a restaurant attached. So even coffee and tea have to be ordered through room service. Room service is slow so order well in advance. It may take 40 min to 1 hour to service the order. Location was good and located centrally with ample parking place",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Location almost in the centre of the city. Rooms are spacious. Priced on higher side. no kettle, free drinking water, toiletries...etc are not provided & washrooms could be little bigger. Their function hall too is good as we had an event planned recently. No service lift available for the event planner get big items.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Staff  behavior was not good I'll give these for 5*  rating not all some persons",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "attended friends wedding self drove stayed hotel another friend businessfamily atmosphere comfortable clean rooms hours hot water bathing mattress bed soft liking variable nares preference good parking lift facility comfortable night stay",
                "nd mar stayed family room brother sons weddingroom toilet room ok water chocked comet often problemsecond one chairsno catle heat water coffe tea makingminimum facilty nilsome poor maitance room charges much worth",
                "came campus recruitment drive rooms good clean comfortable bathroom also clean well maintained hotel restaurant attached even coffee tea ordered room service room service slow order well advance may take min hour service order location good located centrally ample parking place",
                "location almost centre city rooms spacious priced higher side kettle free drinking water toiletriesetc provided washrooms could little bigger function hall good event planned recently service lift available event planner get big items",
                "staff behavior good ill give rating persons"
            ]
        },
        {
            "name": "HOTEL SAMRAT",
            "rating": [
                4
            ],
            "address": [
                "Konkapalli, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Overall the hotel is very nice. Basic facilities are provided. Car parking is also very good and whenever there is power cut immediately they on the generator. Rooms are also nice and clean..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Need to improve service. Rooms are good.  Water availablity is great. Hot water comes continuesly.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good place and tasty food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "No parking\nNo proper vegetarian food\nPoor ambience\n\nRecently i attended a doctor meeting.\nPoor organisation and not a good place for meetings.\n\nIf i give u a suggestion, you have to take it and correct it.  But poiting that its my fault to come to ur place. not at all a good business idea. Ur doing business, so you have to be patient while listening to customer complaints. Then only success comes.\nArrogance and business, dont go along.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Bed sheets not changed. A C not working",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall hotel nice basic facilities provided car parking also good whenever power cut immediately generator rooms also nice clean",
                "need improve service rooms good water availablity great hot water comes continuesly",
                "good place tasty food",
                "parking proper vegetarian food poor ambience recently attended doctor meeting poor organisation good place meetings give u suggestion take correct poiting fault come ur place good business idea ur business patient listening customer complaints success comes arrogance business dont go along",
                "bed sheets changed c working"
            ]
        },
        {
            "name": "Hotel Subhagruha",
            "rating": [
                4.1
            ],
            "address": [
                "Main Rd, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Excellent room. 5 star rated room. Hot water, TV and AC are provided. With one large bed and we took an extra bed. We accommodated with 3 adult and 2 kids",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very clean and well maintained rooms. Bathroom fixtures are top notch. Water pressure is more than adequate. Hot and cold water available.\n\nMosquitoes are a problem in the lobby and lift. But the management provides all-out mosquito repellent for every room. Stairwells require more lighting. Pillow covers need to be cleaned more thoroughly.\n\nReception staff are very polite. Room service is prompt and considerate. The experience is comparable to what you get in Holiday Inn hotels in the US.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Well space and maintenance, classic ambience. One more interesting my marriage was done on this hotel. Good service with reasonable price. Recommended this",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "rooms are hygenic..but too much costly in this area",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "All good expect the cost little bit more compared with other hotels",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent room star rated room hot water tv ac provided one large bed took extra bed accommodated adult kids",
                "clean well maintained rooms bathroom fixtures top notch water pressure adequate hot cold water available mosquitoes problem lobby lift management provides allout mosquito repellent every room stairwells require lighting pillow covers need cleaned thoroughly reception staff polite room service prompt considerate experience comparable get holiday inn hotels us",
                "well space maintenance classic ambience one interesting marriage done hotel good service reasonable price recommended",
                "rooms hygenicbut much costly area",
                "good expect cost little bit compared hotels"
            ]
        },
        {
            "name": "Hotel Satkar - Best Restaurant and Hotel",
            "rating": [
                4
            ],
            "address": [
                "near VPC, behind Busstand, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "I had an exceptional experience at this hotel. The ambience exudes comfort, the food is delectable, and the room services are top-notch. The staff's friendliness made my stay even more enjoyable; they went above and beyond, offering valuable advice on places to visit. Highly recommended for a delightful stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's located to a road connected to main road. Little hard to find out for new visitors.  Decent parking area. It's next to movie theaters,  If you are visiting at the show closing time, lot of traffic will be there.  Inside ambiance is fine, Food taste is also ok. bedsheets are not clean, dirty pillows, repairs in bathrooms. better than any other restaurants in the place. Good variety of food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel Sarkar is an absolute gem for those seeking an amazing party spot! The boarding experience is top-notch, akin to a three-star hotel, with courteous and mannered staff who truly elevate the stay. The management's dedication and friendliness add an extra sparkle to the experience. As a guest, the surprises surpassed all expectations. It's a must-visit for anyone looking for an exceptional hangout destination and lodging. 🤩🤩🤩",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Booked rooms for 2 days for family. Rooms are good and hospitality is good. Staff welcomes us very nicely. The only problem is there are lots of mosquitoes and cockroaches and even rats in one of the room",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are ok. Not value for money. Food in the restaurant is WOREST. Overall experience is average.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "exceptional experience hotel ambience exudes comfort food delectable room services topnotch staffs friendliness made stay even enjoyable went beyond offering valuable advice places visit highly recommended delightful stay",
                "located road connected main road little hard find new visitors decent parking area next movie theaters visiting show closing time lot traffic inside ambiance fine food taste also ok bedsheets clean dirty pillows repairs bathrooms better restaurants place good variety food",
                "hotel sarkar absolute gem seeking amazing party spot boarding experience topnotch akin threestar hotel courteous mannered staff truly elevate stay managements dedication friendliness add extra sparkle experience guest surprises surpassed expectations mustvisit anyone looking exceptional hangout destination lodging ð\u009f¤©ð\u009f¤©ð\u009f¤©",
                "booked rooms days family rooms good hospitality good staff welcomes us nicely problem lots mosquitoes cockroaches even rats one room",
                "rooms ok value money food restaurant worest overall experience average"
            ]
        },
        {
            "name": "Srikala Grand Residency",
            "rating": [
                3.6
            ],
            "address": [
                "H2F2+C8W, K M Agraharam, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are not upto mark..but ok..washrooms are not well maintained..water is being clogged..hotel location is fine..no restaurant is linked to it..we have to get food from outside",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Rooms are good but the washrooms are very dirty",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Rooms are smelling bad , bedsheets are not washed, the bathroom is not clean.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "We stayed here for a wedding and the wedding party booked this hotel for us. It was such a pathetic experience.\n\nThe bathrooms were not cleaned, the bedsheets weren't cleaned, the room was stinking, AC wasn't working in one of the rooms. We got dirty, ditch water from the taps - upon asking the staff said it's coz they cleaned the tank and the we would get clean water after throwing  4-5 buckets - which wasn't the case.\n\nWe never got clean bedsheets in our 2 night stay - they said it was laundry.\n\nI don't know how many hotel are there in Amalapuram but this is a worst option would not recommend to anybody.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Staff here is so kind,rooms are good,\nI forgot my valuable headphones and aperson whom i won't forgot has brought it till my bus boarding point.\nI felt happy thanks to this particular person.overall a good experience.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms upto markbut okwashrooms well maintainedwater cloggedhotel location fineno restaurant linked itwe get food outside",
                "rooms good washrooms dirty",
                "rooms smelling bad bedsheets washed bathroom clean",
                "stayed wedding wedding party booked hotel us pathetic experience bathrooms cleaned bedsheets werent cleaned room stinking ac wasnt working one rooms got dirty ditch water taps upon asking staff said coz cleaned tank would get clean water throwing buckets wasnt case never got clean bedsheets night stay said laundry dont know many hotel amalapuram worst option would recommend anybody",
                "staff kindrooms good forgot valuable headphones aperson wont forgot brought till bus boarding point felt happy thanks particular personoverall good experience"
            ]
        },
        {
            "name": "ROYAL PALACE",
            "rating": [
                4.2
            ],
            "address": [
                "OPPOSITE: DCB BANK, near LIC OFFICE, Konkapalli, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "The hotel room showcased an exceptional commitment to guest satisfaction. The meticulous attention to cleanliness and upkeep was evident throughout, creating a welcoming and hygienic environment. The well-thought-out design and decor demonstrated a keen understanding of both style and functionality. Notably, the room's amenities were not only modern but also seamlessly integrated, enhancing the overall convenience and comfort. This positive experience was a testament to the hotel's dedication to providing a superior stay for its guests. At last I would like to suggest this place for stay with friends and family",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst maintenance ever, worst pest control, there are too many lizards, cockroaches & spiders & insects lying around in the premises, never face such worst hotel even in other towns or villages also, the staff is also very much arrogant, please don't visit this hotel, it's not value for money, worstest maintenance you'll face & see. So waste hotel, the AC doesn't work, due to the mis management the owner is going to suffer because of such half knowledged staff who respond arrogantly, the worst thing is \"SAFETY\" is 0, because the windows of the room are open, there might be a chance of theft when you are not in room, so please don't stay here & save yourselves🤮🤮🤮🤮",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Awesome place with fine interior. One of the best hotel to visit",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms were good  Parking was too small to park cars",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Not good and cost is high and complementary breakfast and u will not get hot water they will provide water heater if you want hot water\n\nNot worthy for price",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel room showcased exceptional commitment guest satisfaction meticulous attention cleanliness upkeep evident throughout creating welcoming hygienic environment wellthoughtout design decor demonstrated keen understanding style functionality notably rooms amenities modern also seamlessly integrated enhancing overall convenience comfort positive experience testament hotels dedication providing superior stay guests last would like suggest place stay friends family",
                "worst maintenance ever worst pest control many lizards cockroaches spiders insects lying around premises never face worst hotel even towns villages also staff also much arrogant please dont visit hotel value money worstest maintenance youll face see waste hotel ac doesnt work due mis management owner going suffer half knowledged staff respond arrogantly worst thing safety windows room open might chance theft room please dont stay save yourselvesð\u009f¤®ð\u009f¤®ð\u009f¤®ð\u009f¤®",
                "awesome place fine interior one best hotel visit",
                "rooms good parking small park cars",
                "good cost high complementary breakfast u get hot water provide water heater want hot water worthy price"
            ]
        },
        {
            "name": "swayamprabha service apartments",
            "rating": [
                4.6
            ],
            "address": [
                "KNF Street, above Heritage Super Market, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "It's a very pleasant stay, great service and hospitality. Staff are very cooperative and responds quickly for any request.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Biggest no is that they have a limit for the service apartments. So far, i didn't come across anybody saying that they allow only 4 members for 2bhk service apartment. If thay is the case, we can simply opt for lodging rooms.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "This is probably the best place for a family of 4 or more. It offers two spacious bed rooms with attached bathrooms, a full 2 BR apartment. We liked it as the place is unlike any of the cramped rooms of hotels. Service and staff are excellent. I would recommend this to anyone that is traveling with a family. This place is about substance, not style, like hotels, carpets and interiors.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We a group of 4 people travelled from Hyderabad to attend a marriage in amalapuram. Booked 2 rooms here, charged 2500/- per room but they couldn't afford to provide us with towels even after repeated requests. All they could say was 'no towels available', before our checkout.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "🌟Really I had comfort stay. Delightful service.\nFood quality was delicious. Staffs are so cooperative and professional. If you’re looking for comfortable stay definitely, it’s a better choice.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pleasant stay great service hospitality staff cooperative responds quickly request",
                "biggest limit service apartments far didnt come across anybody saying allow members bhk service apartment thay case simply opt lodging rooms",
                "probably best place family offers two spacious bed rooms attached bathrooms full br apartment liked place unlike cramped rooms hotels service staff excellent would recommend anyone traveling family place substance style like hotels carpets interiors",
                "group people travelled hyderabad attend marriage amalapuram booked rooms charged per room couldnt afford provide us towels even repeated requests could say towels available checkout",
                "ð\u009f\u008c\u009freally comfort stay delightful service food quality delicious staffs cooperative professional youâ\u0080\u0099re looking comfortable stay definitely itâ\u0080\u0099s better choice"
            ]
        },
        {
            "name": "OYO Vintage Grand",
            "rating": [
                3.3
            ],
            "address": [
                "188, Gate, Gandhi Bazar, near Munnidivaram, Kakinada, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Worst ever this hotel. Rooms are dirty. Condoms are there on walls. Spit on walls. Worst service by management.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Not cleaned it was dirty when I was visited here\nThere have some used condoms and cigerettes\nIt was dirty rooms there",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Such A Disgusting Hotel.Hotel Management Us Simply Looting Customer Money By Taking Bookings Oyo Doesnt Work Here.Municipality Ground Is Better Than This Hotel.\nWorst Bed,Poor And Very Dirty Bathroom No Water In Hotel And No One Is Responsinle For That.Taps Are Not Working.\nDont Go To This Hotel By Seeing Online Phtos There Are Lot Of Big Big Coacroaches Over The Rooms",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "never ever go to this hotel with family..lift not present .it is better for bachelors",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Not at all worthy of the arrangement the staff did. No working TV's, not at all hygienic,There was foul smell of something dead through out the day on several complaints also only once air freshener was sprayed and the stay was horrible. No proper ventilation.The name perfectly suits itself as most of the items in here were too much vintage not in a good way.\nNo service boys.No value for money",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst ever hotel rooms dirty condoms walls spit walls worst service management",
                "cleaned dirty visited used condoms cigerettes dirty rooms",
                "disgusting hotelhotel management us simply looting customer money taking bookings oyo doesnt work heremunicipality ground better hotel worst bedpoor dirty bathroom water hotel one responsinle thattaps working dont go hotel seeing online phtos lot big big coacroaches rooms",
                "never ever go hotel familylift present better bachelors",
                "worthy arrangement staff working tvs hygienicthere foul smell something dead day several complaints also air freshener sprayed stay horrible proper ventilationthe name perfectly suits items much vintage good way service boysno value money"
            ]
        },
        {
            "name": "Hotel Preethi Residency",
            "rating": [
                3.3
            ],
            "address": [
                "D.no. 3-2-108/2, Atchuta Ramayya street, SBI Line, Black Bridge Main Rd, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "Center of amalapuram\nWorst rooms , no proper service, no maintenance, they demand simply for money",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "It is very dirty hotel with cockroaches and bad smell in rooms. don't go there.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Prices reasonable, very neat and clean.\nGood service.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Residency looks excellent from outside but inside maintenance is not that good\nParking is not sufficient.\nSome rooms are getting smell.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "The residency looks excellent from outside but inside maintenance is not that good\n\nAC rooms are available but they will not provide extra beds when requested\n\nThere is no provision for hot water in the rooms\n\nThe extension number and the phone not working in our room and when asked they simply said it will not work\n\nLocality is prime..but experience is average\n\nI dont know about room costs as we have boarded there for a wedding.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "center amalapuram worst rooms proper service maintenance demand simply money",
                "dirty hotel cockroaches bad smell rooms dont go",
                "prices reasonable neat clean good service",
                "residency looks excellent outside inside maintenance good parking sufficient rooms getting smell",
                "residency looks excellent outside inside maintenance good ac rooms available provide extra beds requested provision hot water rooms extension number phone working room asked simply said work locality primebut experience average dont know room costs boarded wedding"
            ]
        },
        {
            "name": "OYO 49427 Vani Residency",
            "rating": [
                4
            ],
            "address": [
                "4144, 14, Vadlamani vari street, near ASN College, Sri Rama Nagar, Amalapuram, Andhra Pradesh 533201, India"
            ],
            "reviews": [
                {
                    "text": "If you want to attend any functions and don't have any relatives nearby  with big family this is the best option. It's like service apartment. Pleasant atmosphere,  no traffic sounds and full of greenery. Short stay",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good for staying peaceful place,\nYou wont have a room service there\nBetter place for bachelors and students to make parties as no one bothers us",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very well",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Ok, but it is not convenient to get food. No good hotel facilities near to this residence",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This is one of the luxurious Residencies among in Amalapuram....\nAnd this is Familiar as Oyo apartment....\nAnd they have Cancelled the legal agreement with the Oyo company",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "want attend functions dont relatives nearby big family best option like service apartment pleasant atmosphere traffic sounds full greenery short stay",
                "good staying peaceful place wont room service better place bachelors students make parties one bothers us",
                "well",
                "ok convenient get food good hotel facilities near residence",
                "one luxurious residencies among amalapuram familiar oyo apartment cancelled legal agreement oyo company"
            ]
        }
    ]
}