{
    "places_with_reviews": [
        {
            "name": "Hyatt Place Bharuch",
            "rating": [
                4.5
            ],
            "address": [
                "Hyatt Place Bharuch College Road, Old Nh 8, opp. Svmit College, Friends Colony, Bholav, Bharuch, Gujarat 392002, India"
            ],
            "reviews": [
                {
                    "text": "My experience was really really outstanding.\nThe rooms , service, and location was awesome and everyone was well mannered and educated.\nThey always greet us with smile no matter what is the time . The restaurant was lavish and there were many varieties of food and it was 24/7 open .\nThey provide spa , gym , swimming, games room for small kids .\nThe View from swimming pool was awesome specially in night .\nThey celebrate each and every festival and everyone was very humble whether they were guards to the director.\nI'll recommend this to everyone if you want to feel like classy , lavish or luxurious.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The menu featured a diverse range of cuisines, skillfully prepared with fresh, high-quality ingredients. The chefs' creativity shone through in every dish, making each meal a memorable journey for the taste buds. The attentive and knowledgeable staff further enhanced the dining experience, providing excellent recommendations and ensuring impeccable service.\nThe hotel's ambiance is a perfect blend of sophistication and comfort. The attention to detail in the decor, lighting, and overall design creates a welcoming and luxurious atmosphere. Whether enjoying a meal in the elegant dining area or relaxing in the beautifully appointed rooms, the ambiance at Hyatt adds a touch of magic to the entire stay. The thoughtful use of space and design elements contributes to a sense of tranquility, making it an ideal retreat for both business and leisure travelers.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The best 5* hotel in Bharuch and the service was above and beyond. Perfect location with everything being so close by.\nThe staff are extremely helpful and a hotel where you wouldn't want to step out as it's so clean and so peaceful and also have a gym and pool.\nThey have an amazing restaurant with professional staff working there.\nThe food is so fresh and tasty and so many options to choose from.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "5 stars all the way. Large spacious rooms. Spanking new. Super clean bathrooms. The breakfast spread is both Indian and continental. Dinner was uninteresting. The service in the restaurant was fabulous. Polite and attentive. A great place to stay in Bharuch. Very close to Bharuch station. If starting for the industrial zones in the morning, start early to avoid traffic jams just outside the room. Liked the place",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Amazing hotel, this is what Bharuch has needed for a long time. I've visited after 10 years but knowing there is this standard of hotel here it makes it very attractive to come again very soon.\n\nCan't fault the facilities nor the service provided by all the staff, especially the security staff Hetal and Sanjay who welcome you to the hotel. They provide a very warm welcome with a big smile, always have time for a conversation and are humorous, they will make you feel 'garden garden'!\n\nHave to mention the food and restaurant, not only the breakfast but all the food really is worth trying and is very reasonably priced - hats off to the chefs!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience really really outstanding rooms service location awesome everyone well mannered educated always greet us smile matter time restaurant lavish many varieties food open provide spa gym swimming games room small kids view swimming pool awesome specially night celebrate every festival everyone humble whether guards director ill recommend everyone want feel like classy lavish luxurious",
                "menu featured diverse range cuisines skillfully prepared fresh highquality ingredients chefs creativity shone every dish making meal memorable journey taste buds attentive knowledgeable staff enhanced dining experience providing excellent recommendations ensuring impeccable service hotels ambiance perfect blend sophistication comfort attention detail decor lighting overall design creates welcoming luxurious atmosphere whether enjoying meal elegant dining area relaxing beautifully appointed rooms ambiance hyatt adds touch magic entire stay thoughtful use space design elements contributes sense tranquility making ideal retreat business leisure travelers",
                "best hotel bharuch service beyond perfect location everything close staff extremely helpful hotel wouldnt want step clean peaceful also gym pool amazing restaurant professional staff working food fresh tasty many options choose",
                "stars way large spacious rooms spanking new super clean bathrooms breakfast spread indian continental dinner uninteresting service restaurant fabulous polite attentive great place stay bharuch close bharuch station starting industrial zones morning start early avoid traffic jams outside room liked place",
                "amazing hotel bharuch needed long time ive visited years knowing standard hotel makes attractive come soon cant fault facilities service provided staff especially security staff hetal sanjay welcome hotel provide warm welcome big smile always time conversation humorous make feel garden garden mention food restaurant breakfast food really worth trying reasonably priced hats chefs"
            ]
        },
        {
            "name": "Regenta Central Harimangla, Bharuch",
            "rating": [
                4.2
            ],
            "address": [
                "Near ABC Circle, Old, NH-8, Bholav, Bharuch, Gujarat 392015, India"
            ],
            "reviews": [
                {
                    "text": "We went for dinner. Food was fabulous. Value for money. Service was good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Beautiful hotel...\nDon't have non veg here as it was upset ur stomach, which I experienced.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice place, good ambience and super service. Can do better in terms of cleanliness.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Front desk receptionists too arrogant, they don't have good manners either.\nManager not much pleasant, having too much attitude.\nRestaurant staff too good and happy to help nature. Buffet breakfast so-so.,not served hot.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good quality of food, personal favourite is chaaps and Maki ki roti with saag",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "went dinner food fabulous value money service good",
                "beautiful hotel dont non veg upset ur stomach experienced",
                "nice place good ambience super service better terms cleanliness",
                "front desk receptionists arrogant dont good manners either manager much pleasant much attitude restaurant staff good happy help nature buffet breakfast sosonot served hot",
                "good quality food personal favourite chaaps maki ki roti saag"
            ]
        },
        {
            "name": "Ginger Bharuch",
            "rating": [
                4.1
            ],
            "address": [
                "1, Railway Station Rd, Opp. Patel Super Market, Moficer Jin Compound, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "I dined at the GINGER in-hotel restaurant and while my experience was an average, Food was well prepared and presented.\nThe atmosphere was nice and the service was decent, but the food was a bit lackluster. I ordered the Some starter and main course while it was cooked to my liking, it lacked flavor and seasoning. There were also nothing special.\nThe prices were a bit high for the quality of the food.\nOverall, it was an okay dining experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stayed here during a business trip for a couple nights.\n\nThe property is located on a busy road. The entrance is a little confusing if you are visiting for the first time. They have open parking for guests which is not very great but something is better than nothing.\n\nThe rooms are neat and clean. They have a decent gym and it is locked most of the time. You have to request them to open it up if you want to use it.\n\nThe restaurant offered good options for both buffet and a la carte. I really loved the food.\n\nAll in all a decent place to stay in Bharuch.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This property is located on the main station road of Bharuch, but amidst the chaotic environment, it is quite well-maintained. The staff is cooperative, helpful and generous. The rooms are clean and spacious. The property also has a restaurant which is beautiful and has unique sitting spaces. The food is also delicious and has a variety, no less than any other locations of this brand. Overall, a really nice getaway which was totally worth it!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was overall a very bad experience Ginger a brand everyone trust but sorry to say they don't keep any promises\n\nRooms are full of mosquitos. Hotel staff are least bothered to provide anything to reduce it.\n\nThey don't have iron to provide to customers if you request more they will provide you a dirty and bad quality iron which will spoil your clothes\n\nIn. Breakfast area they don't provide services\n\nI don't know whether I should to recommend this property to anyone or not\n\nOur stay was horrible we don't ask anyone to stay at this property\n\nManagement and hall staff is not up to the mark.room acs are not working.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We had a great stay experience. The AC wasn't working very well for our room however, the service was decent. The rooms were clean although not very well- litup. The location is really good and greatly accessible from city and  station. The food at the hotel was very average. However, the vicinity in which the hotel is located has many great food options nearby at walking distance. The staff was polite and professional. Overall stay was good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dined ginger inhotel restaurant experience average food well prepared presented atmosphere nice service decent food bit lackluster ordered starter main course cooked liking lacked flavor seasoning also nothing special prices bit high quality food overall okay dining experience",
                "stayed business trip couple nights property located busy road entrance little confusing visiting first time open parking guests great something better nothing rooms neat clean decent gym locked time request open want use restaurant offered good options buffet la carte really loved food decent place stay bharuch",
                "property located main station road bharuch amidst chaotic environment quite wellmaintained staff cooperative helpful generous rooms clean spacious property also restaurant beautiful unique sitting spaces food also delicious variety less locations brand overall really nice getaway totally worth",
                "overall bad experience ginger brand everyone trust sorry say dont keep promises rooms full mosquitos hotel staff least bothered provide anything reduce dont iron provide customers request provide dirty bad quality iron spoil clothes breakfast area dont provide services dont know whether recommend property anyone stay horrible dont ask anyone stay property management hall staff markroom acs working",
                "great stay experience ac wasnt working well room however service decent rooms clean although well litup location really good greatly accessible city station food hotel average however vicinity hotel located many great food options nearby walking distance staff polite professional overall stay good"
            ]
        },
        {
            "name": "Rang Lords Inn Bharuch",
            "rating": [
                4.1
            ],
            "address": [
                "R S No, Over Bridge, 79 A, ABC Chokdi, near Nandelav Road, Bholav, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "Amazing place for food n stay. Food quality is upscale served with great hospitality. Parking facilities are free. Conference facilities are upscale. Love this place. Highly recommend for those travellers are going to join new express way  Delhi to Mumbai from Bharuch side.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I stayed there for a day with my family as I had to attend a function near by. Excellent stay and total value for money. The Rooms were spacious, clean and equipped.The room service food (veg/Non Veg) was good, both taste wise and quantity wise. The staff were polite and prompt. Mr Shivraj from front desk was really helpful and cooperative as were the other members in the staff. They had baby chair for my toddler in the restaurant which was another plus point. The breakfast spread was also sufficient. Will surely recommend if you are visiting the area and looking for a place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good property with good room and washroom. Buffet breakfast has large options of South Indian, North Indian as well as continental Dishes with fruits and juices. The food quality was great. The staff os very helpful and courteous.\nOverall a great stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Front desk employees were very helpful, they were kind and polite as well.\nThey treated me in the best way they could.\nI guess I remember there names too, PRIYANKA , SHIVRAJ and NIKITA.\nThank you guys for making my stay comfortable and wonderful.\nHope i will see you again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms were revamped and very good. Service level is excellent. Very hospitable staff.\n\nRestaurant food was good. Clean washrooms. Even small issues which persisted were solved by the staff such as Hot Water Constraints.\n\nHighly recommend for short stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing place food n stay food quality upscale served great hospitality parking facilities free conference facilities upscale love place highly recommend travellers going join new express way delhi mumbai bharuch side",
                "stayed day family attend function near excellent stay total value money rooms spacious clean equippedthe room service food vegnon veg good taste wise quantity wise staff polite prompt mr shivraj front desk really helpful cooperative members staff baby chair toddler restaurant another plus point breakfast spread also sufficient surely recommend visiting area looking place stay",
                "good property good room washroom buffet breakfast large options south indian north indian well continental dishes fruits juices food quality great staff os helpful courteous overall great stay",
                "front desk employees helpful kind polite well treated best way could guess remember names priyanka shivraj nikita thank guys making stay comfortable wonderful hope see",
                "rooms revamped good service level excellent hospitable staff restaurant food good clean washrooms even small issues persisted solved staff hot water constraints highly recommend short stay"
            ]
        },
        {
            "name": "Hotel Shalimar",
            "rating": [
                3.8
            ],
            "address": [
                "Railway Station Rd, Soneri Mahal, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "The rooms are tiny yet comfortable. However there was a lot of noise from the floor above of people dragging furniture till late at night. I think there was an activity hall above the room where they used to arrange furniture for the day ahead at night.\n\nOne thing to watch out for is that they have a limited breakfast, which was not told to us at the dining hall. So make sure to clarify with the server. The breakfast is also not very good so better to avoid it altogether!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Personally I like the food never stayed in rooms just enjoy the afternoon fixed Gujarati thali .. best",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Introduction:\nI recently had the pleasure of staying at the Shalimar Hotel for a weekend getaway with my family. Our stay dates were from July 15th to July 17th, and overall, it was a delightful experience.\n\nCheck-In Experience:\nThe check-in process was smooth and hassle-free. The reception staff welcomed us warmly and efficiently handled the check-in formalities. They provided us with all the necessary information about the hotel's facilities and nearby attractions.\n\nRoom and Accommodation:\nOur room was spacious and well-maintained. The cleanliness was commendable, and the housekeeping staff did an excellent job of keeping it tidy throughout our stay. The beds were comfortable, ensuring a good night's sleep after long days of exploration.\n\nService and Staff:\nThe hotel staff were incredibly courteous and attentive to our needs. They were quick to assist us with any inquiries and always wore a friendly smile. Their professionalism added to the overall positive experience during our stay.\n\nDining Options:\nThe dining options at Shalimar Hotel were quite impressive. We enjoyed the delicious breakfast buffet with a variety of choices to cater to different tastes. The on-site restaurant offered delectable dishes, and the room service was prompt and efficient.\n\nFacilities and Amenities:\nShalimar Hotel provided a range of facilities that added value to our stay. The gym was well-equipped, allowing us to maintain our fitness routine. The swimming pool was clean and inviting, providing a refreshing break from the summer heat.\n\nLocation:\nThe hotel's location was convenient, situated in close proximity to several popular tourist attractions and shopping centers. It was easy to access public transportation, which made exploring the city hassle-free.\n\nValue for Money:\nConsidering the quality of service, comfortable accommodation, and convenient location, the Shalimar Hotel offered good value for the price paid.\n\nCleanliness and Hygiene:\nThe hotel maintained a high standard of cleanliness and hygiene throughout the premises. The common areas, as well as our room, were well-kept and sanitary.\n\nOverall Experience:\nOur overall experience at Shalimar Hotel was excellent. The friendly staff, comfortable rooms, and great amenities contributed to making our stay memorable. I would highly recommend this hotel to anyone visiting the area and would gladly return for another stay in the future.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst experience even I paid for breakfast but still they have charged extra for breakfast and staff directly entered in room without knowing door",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I'm belong to punjab but my daughter like Gujarati khanna.. Shalimar hotel food very testi and resealable price ..i like Shalimar hotel..thxx u so much..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms tiny yet comfortable however lot noise floor people dragging furniture till late night think activity hall room used arrange furniture day ahead night one thing watch limited breakfast told us dining hall make sure clarify server breakfast also good better avoid altogether",
                "personally like food never stayed rooms enjoy afternoon fixed gujarati thali best",
                "introduction recently pleasure staying shalimar hotel weekend getaway family stay dates july th july th overall delightful experience checkin experience checkin process smooth hasslefree reception staff welcomed us warmly efficiently handled checkin formalities provided us necessary information hotels facilities nearby attractions room accommodation room spacious wellmaintained cleanliness commendable housekeeping staff excellent job keeping tidy throughout stay beds comfortable ensuring good nights sleep long days exploration service staff hotel staff incredibly courteous attentive needs quick assist us inquiries always wore friendly smile professionalism added overall positive experience stay dining options dining options shalimar hotel quite impressive enjoyed delicious breakfast buffet variety choices cater different tastes onsite restaurant offered delectable dishes room service prompt efficient facilities amenities shalimar hotel provided range facilities added value stay gym wellequipped allowing us maintain fitness routine swimming pool clean inviting providing refreshing break summer heat location hotels location convenient situated close proximity several popular tourist attractions shopping centers easy access public transportation made exploring city hasslefree value money considering quality service comfortable accommodation convenient location shalimar hotel offered good value price paid cleanliness hygiene hotel maintained high standard cleanliness hygiene throughout premises common areas well room wellkept sanitary overall experience overall experience shalimar hotel excellent friendly staff comfortable rooms great amenities contributed making stay memorable would highly recommend hotel anyone visiting area would gladly return another stay future",
                "worst experience even paid breakfast still charged extra breakfast staff directly entered room without knowing door",
                "im belong punjab daughter like gujarati khanna shalimar hotel food testi resealable price like shalimar hotelthxx u much"
            ]
        },
        {
            "name": "HOTEL ASHISH",
            "rating": [
                4.1
            ],
            "address": [
                "ABC Chowkdi, Old National Highway, No. 8, Bholav, Bharuch, Gujarat 392015, India"
            ],
            "reviews": [
                {
                    "text": "Food is of good quality and taste. They have renowated the hotel and interior is good. However they have still Indian style washroom without jet spray which they should change. Rates are slightly higher as compared to other hotels.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I have visited here for the first time and the experience was better than I was expecting. Nice staff, very helpful. I would consider the fare reasonable. Have not tried the food yet but I have a positive thoughts for the food as well.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Located at best location in Bharuch it is easily approachable. It serves good and tasty food. Service is super fast and staff is humble.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Recently I stayed here for 1 night. Nice hotel to stay as well as location accessible to Bharuch Station and highway towards Dahej Saykha. One more amazing thing the Restaurant they have with amazing vegetarian food. If anyone travelling bharuch must recommend this hotel for food as well as stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is good. Taste is good.\nStaff is little arrogant and foolish",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food good quality taste renowated hotel interior good however still indian style washroom without jet spray change rates slightly higher compared hotels",
                "visited first time experience better expecting nice staff helpful would consider fare reasonable tried food yet positive thoughts food well",
                "located best location bharuch easily approachable serves good tasty food service super fast staff humble",
                "recently stayed night nice hotel stay well location accessible bharuch station highway towards dahej saykha one amazing thing restaurant amazing vegetarian food anyone travelling bharuch must recommend hotel food well stay",
                "food good taste good staff little arrogant foolish"
            ]
        },
        {
            "name": "Hotel Apex",
            "rating": [
                4
            ],
            "address": [
                "1, Vaibhav Arcade, Mipco Chowkdi, GNFC Twp, GIDC, Bharuch, Gujarat 392015, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel. Near ABC circle. Food quality and brakefast good. Room are neat and clean. Big size room.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are simple but clean. Restaurant service is fast test is good but  don't have long list of items in menu.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "3-Star service. Spacious rooms. Reasonably priced for the big room and a decent bathroom space.\nIt was an Executive room.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Do not think it is a hotel, this just a budget lodge . So do not keep you expectations high.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It has many option like delux etc rooms are clean and spacious. Toilets are also well maintained package includes dinner and morning breakfast there are many variety available for breakfast. Check buttons of the toilet we had problem with button. AC makes noise and there are mosquitos inside room good knight also installed in room check out timing is noon 12",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel near abc circle food quality brakefast good room neat clean big size room",
                "rooms simple clean restaurant service fast test good dont long list items menu",
                "star service spacious rooms reasonably priced big room decent bathroom space executive room",
                "think hotel budget lodge keep expectations high",
                "many option like delux etc rooms clean spacious toilets also well maintained package includes dinner morning breakfast many variety available breakfast check buttons toilet problem button ac makes noise mosquitos inside room good knight also installed room check timing noon"
            ]
        },
        {
            "name": "Hotel Comfort Bharuch",
            "rating": [
                3.9
            ],
            "address": [
                "Sai Dham Complex, ABC Cir, Near Rohini Nagar, Bholav, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "Don't book a room here.. I repeat don't book a room here... I paid ₹2700/- for this cheap quality room in the name of a 3 star hotel.\nThe walls are peeling out, the bathroom tap is rusty and dirty, the toilet is so dirty, hygiene issues. Poor room quality. Not at all recommend to book this hotel. Go for Regenta or Hyatt.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel is in prime location of Bharuch. You get many eatable shops at a walking distance near to Hotel. Parking of hotel is not specific to hotel however, they have taken space in adjacent society to park our vehicles. Entrance of hotel is not good at all however once you get out from lift and enter to hotels reception it is another world.\nRooms are clear and okayish type. Basic necessities were available. No kettle, No coffee or tea pouch. No Cable. Dental kit is available on request at free of cost.\nFood is bit costly as compared to normal menu items.\n\nOverall it is good to stay",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "After we paid 2500 RS. Charge for 1 night hold we never expected mosquito in room and not Protection also in room  like All out but here available only agarbatti for mosquito. This is very bed I not like it. I suggest to hotelier that it's need to improve room facilities compare to charge.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very nit and clean Hotel. Staff is very supportive. Food is also good. Good hotel to stay in budget.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Had to stay over night during my trip room no 210,AC swing was not working and the exhaust fan in washroom was making lot of noise,we pay for comfort and services which is basic and right for the customer,we went for dinner at 10 pm ,the guy said it's closed for dinner,so had to go out for dinner.The management needs to take care of small issues on a serious note,Drivers accomodation facility is not available,which I beleive is basic facility overall ok staying experience. Lot of improvements required.,Front office staff Tousif was very courteous enough",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dont book room repeat dont book room paid â\u0082¹ cheap quality room name star hotel walls peeling bathroom tap rusty dirty toilet dirty hygiene issues poor room quality recommend book hotel go regenta hyatt",
                "hotel prime location bharuch get many eatable shops walking distance near hotel parking hotel specific hotel however taken space adjacent society park vehicles entrance hotel good however get lift enter hotels reception another world rooms clear okayish type basic necessities available kettle coffee tea pouch cable dental kit available request free cost food bit costly compared normal menu items overall good stay",
                "paid rs charge night hold never expected mosquito room protection also room like available agarbatti mosquito bed like suggest hotelier need improve room facilities compare charge",
                "nit clean hotel staff supportive food also good good hotel stay budget",
                "stay night trip room ac swing working exhaust fan washroom making lot noisewe pay comfort services basic right customerwe went dinner pm guy said closed dinnerso go dinnerthe management needs take care small issues serious notedrivers accomodation facility availablewhich beleive basic facility overall ok staying experience lot improvements requiredfront office staff tousif courteous enough"
            ]
        },
        {
            "name": "Hotel Apple Inn",
            "rating": [
                4.1
            ],
            "address": [
                "Shalimar Complex, B/H thakur Restaurant, Railway Station Rd, Old Town, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "One of the best Hotels to book in BHARUCH - city where you do not have much choices of hotels in normal price segment.\n\n✅ Staff Behavior Good, Service is good\n\n✅ Booking without food is recommended, Zomato Swiggy is allowed in hotel.\n\n❌ Parking will be on outside of hotel premises. They will help to do parking but there is no dedicated parking space available with this high hotel fairs.\n\n✅ Check in check out done smoothly.\n\n✅ Lift is available, UPI is available\n\nRecommended….",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's quite near to Bharuch railway station. It's amazing experience with the hotel service and their co operation.\nI stayed here for 2 days.\nStaff is very humble and quick service of food.\n\nThank you team for your good service and co operation.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good rooms and service. i had a great time here . 1 minus point is there is very less parking space for car and  bike as well.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice place to eat. the main ingredients were missing from the ordered dish. Overall okay.\nThe staff was friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A very mouthwatering taste of each and every gravy. Specially the paneer gravy dish is very amazing. Also I have ordered Panjabi and Gujarati thaali in which Gujarati thaali comes without dish(thaali) packing but it was more in quantity and Punjabi thaali comes in thaali sealed pack and lesser quantity than Gujarati thaali. But both thaali tase was good as it contains different varieties and flavours.\n\nI really recommend this to people who only eats vegetarian food and it's very good option for them.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best hotels book bharuch city much choices hotels normal price segment â\u009c staff behavior good service good â\u009c booking without food recommended zomato swiggy allowed hotel â\u009d\u008c parking outside hotel premises help parking dedicated parking space available high hotel fairs â\u009c check check done smoothly â\u009c lift available upi available recommendedâ\u0080¦",
                "quite near bharuch railway station amazing experience hotel service co operation stayed days staff humble quick service food thank team good service co operation",
                "good rooms service great time minus point less parking space car bike well",
                "nice place eat main ingredients missing ordered dish overall okay staff friendly",
                "mouthwatering taste every gravy specially paneer gravy dish amazing also ordered panjabi gujarati thaali gujarati thaali comes without dishthaali packing quantity punjabi thaali comes thaali sealed pack lesser quantity gujarati thaali thaali tase good contains different varieties flavours really recommend people eats vegetarian food good option"
            ]
        },
        {
            "name": "Hotel Corona",
            "rating": [
                4
            ],
            "address": [
                "Opp. Railway Station, Behind Dadabhai Garden, Moficer Jin Compound, Bharuch, Gujarat 392001, India"
            ],
            "reviews": [
                {
                    "text": "room 11x13 feet, decent size bath. clean.\nthe hotel could not fix a leaking tap throughout my 3 day stay.\nextremely hard water and soap not effective at all. all fittings are green with sulphate deposits.\nhot water system is very inefficient as you have to open tap and let water drain for at least 10 min before you start getting hot water.\nfood is veg only but decent pricing and good qty and hence 3star.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I had a good experience in this hotel,\n\nIt was a good two weak stay,\nGood breakfast facilities and lunch as well dinner.\n\nDinner facilities very fantastic could area outside.\nRoom services and all services are good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "service, very near to Railway station, the only drawback was the price i.e 1900 rs per night. That was a bit over for me. But that's what you get in bharuch as you won't get better quality at cheaper rates.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst hotel& restaurant service I ever experienced there. I recommend not to go there, because they don't have good staff, good food , and the behaviour of manager is also worst.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel Corona is very near to Railway station, only walkable distance. It is little costlier. You can include or exclude complimentary breakfast from your package. Breakfast will be of small buffet type with readymade items as well as other items like Sada Dosa, masala dosa etc,.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room x feet decent size bath clean hotel could fix leaking tap throughout day stay extremely hard water soap effective fittings green sulphate deposits hot water system inefficient open tap let water drain least min start getting hot water food veg decent pricing good qty hence star",
                "good experience hotel good two weak stay good breakfast facilities lunch well dinner dinner facilities fantastic could area outside room services services good",
                "service near railway station drawback price ie rs per night bit thats get bharuch wont get better quality cheaper rates",
                "worst hotel restaurant service ever experienced recommend go dont good staff good food behaviour manager also worst",
                "hotel corona near railway station walkable distance little costlier include exclude complimentary breakfast package breakfast small buffet type readymade items well items like sada dosa masala dosa etc"
            ]
        }
    ]
}