{
    "places_with_reviews": [
        {
            "name": "Gotheeswaram Beach Gardens",
            "rating": [
                3.9
            ],
            "address": [
                "O.M Road, near Abinanth Industries, Beypore, Kozhikode, Kerala 673015, India"
            ],
            "reviews": [
                {
                    "text": "Had a great experience in Gotheeswaram Beach Gardens. The place is beautiful surrounded by nature. Full of trees and birds.\n\nSuper quiet place for having a great sleep. The rooms are big, with AC and fresh. It's just 300 meters from the beach and they offer a restaurant with ocean view.\n\nAlso is a huge place to celebrate parties or event with a nice decoration.\n\nReally recommend to stay here. Thanks",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's a nice and serene place to spend time with friends and family.  Nearby beach adds much to its ambience. Good food and super service.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "A peaceful seaside place for relaxing with friends or family. Also, suitable for small events like birthdays.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Gotheeswaram resort is near the sea.it's calm and quiet place.Resort situated in more than one acres",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This was a fantastic location. Very peaceful and near to nature. The entire land is shaded by three banyan trees and more than 15 mango trees. The staff is quite pleasant and courteous. The restaurant has a beautiful sea view and a pleasant breeze. The food is fantastic.\n\nAccording to the locals, this location is provided free of charge for marriage functions for those who are financially disadvantaged. This was a pretty modest gesture of kindness.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great experience gotheeswaram beach gardens place beautiful surrounded nature full trees birds super quiet place great sleep rooms big ac fresh meters beach offer restaurant ocean view also huge place celebrate parties event nice decoration really recommend stay thanks",
                "nice serene place spend time friends family nearby beach adds much ambience good food super service",
                "peaceful seaside place relaxing friends family also suitable small events like birthdays",
                "gotheeswaram resort near seaits calm quiet placeresort situated one acres",
                "fantastic location peaceful near nature entire land shaded three banyan trees mango trees staff quite pleasant courteous restaurant beautiful sea view pleasant breeze food fantastic according locals location provided free charge marriage functions financially disadvantaged pretty modest gesture kindness"
            ]
        },
        {
            "name": "Jellyfish Watersports & Houseboat",
            "rating": [
                4.5
            ],
            "address": [
                "Jellyfish Ln, Kozhikode, Kerala 673655, India"
            ],
            "reviews": [
                {
                    "text": "My entire team and I went for kayaking and canoeing and our experience was just wonderful. The mentor was so good; he really made kayaking and canoeing super fun and easy to understand the technicalities. Tuku Sir is one of the finest coach I would highly recommend. Anyone under his guidance would really love the water sports exploration.\nWould definitely want to visit there again.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very professional and safe. Proper instructions were given. Tuku made it feel safe and adventurous. Drinking tea in kayak in the middle of the river was so peaceful and refreshing. 🤘💪\nI would recommend this place!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I went for Stand up paddle and had the best  experience ever. TUKU is the sweetest guide ever and very safe for first timers.  He also gives you sweets and chips in middle of the journey .Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Had a wonderful time at Jellyfish. The group of 15 people did rafting and kayaking. The trainers/ guides were very experienced and friendly. The equipments were in good conditions. A must do for groups looking for different experiences",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The kayaking experience was just amazing. Perfect view. Serene atmosphere. Tuku helped with the activities and is a very fun guide. Definitely going to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "entire team went kayaking canoeing experience wonderful mentor good really made kayaking canoeing super fun easy understand technicalities tuku sir one finest coach would highly recommend anyone guidance would really love water sports exploration would definitely want visit",
                "professional safe proper instructions given tuku made feel safe adventurous drinking tea kayak middle river peaceful refreshing ð\u009f¤\u0098ð\u009f\u0092ª would recommend place",
                "went stand paddle best experience ever tuku sweetest guide ever safe first timers also gives sweets chips middle journey highly recommended",
                "wonderful time jellyfish group people rafting kayaking trainers guides experienced friendly equipments good conditions must groups looking different experiences",
                "kayaking experience amazing perfect view serene atmosphere tuku helped activities fun guide definitely going visit"
            ]
        },
        {
            "name": "Tarang Farm House",
            "rating": [
                4.2
            ],
            "address": [
                "Kadalundy Rd, near Mannur Toddy Shop, Kozhikode, Kerala 673328, India"
            ],
            "reviews": [
                {
                    "text": "Had an awesome experience staying at this place, the property and its premises were well maintained. Highly recommended for friends and family getogether's.\nAlso special mention to the caretaker Anil, who was ready to help with our needs at any point of time.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A Disastrous Experience at Tarang Farmhouse.\n\nI cannot express my disappointment enough with our recent stay at Tarang Farmhouse. We booked this venue with high hopes to celebrate our wedding anniversary, but the entire experience turned out to be a nightmare.\n\nUpon arrival, we were greeted with an appalling lack of cleanliness throughout the property. The showers in the bathroom were non-functional, leaving us without basic hygiene facilities. To make matters worse, we found a bed stained in one of the bedrooms, a dead rat near the swimming pool. The fridge contained remnants of the previous guest's meal, including chicken and milk, which were left to rot. The entire place was a breeding ground for disgust and discomfort, completely disregarding basic hygiene standards.\n\nThe condition of the kitchen was beyond pathetic, making it impossible for us to prepare any food comfortably. It was filthy and clearly had not been cleaned in a long time. The presence of a dead rat near the swimming pool and stains on the bed is not only disgusting but also a severe health hazard.\n\nTo add insult to injury, the care taker, who should be ensuring the safety and comfort of the guests, behaved outrageously. He blocked our exit by closing the gates and demanded payment before letting us leave. Furthermore, he insisted that we clean up all the food waste before we leave. This demand is not only unprofessional but also absurd, considering we were paying guests expecting a clean and pleasant environment.\n\nOur attempts to seek assistance from the owner were met with extreme disappointment. After ignoring our calls and messages, the owner finally answered, only to display the utmost rudeness. His response, claiming he wasn’t running the property for money and dismissing our concerns, was not just disrespectful but also deeply unprofessional.\n\nIn light of this terrible experience, I strongly advise against considering Tarang Farmhouse for any celebrations or events. The utter lack of cleanliness, unprofessional conduct of the staff, and the owner's indifference have left us appalled. This establishment clearly does not value its customers, and I urge anyone reading this review to seek alternative venues where your special occasions will be treated with the respect and consideration they deserve.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Perfect choice for family gatherings or getaway parties. Surrounded with beautiful and scenic views of Kadalundi river.\nSwimming pool, a small turf, outdoor dining along with beautiful garden makes the outdoor or yard feel more deluxe.\nPretty well furnished 4-5 rooms available.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst Experiences Ever! The property is not maintained and the condition is pathetic. The owner behaves very rudely and is not ready to admit the issues. Very poor cleanliness, there was bed stains in one of the bedrooms. Showers were not working in the bathrooms. Had a very bad experience staying at this place. A 100% not recommended!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Property is not well maintained. It needs a lot of maintenance work done, especially in the kitchen. The location is excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "awesome experience staying place property premises well maintained highly recommended friends family getogethers also special mention caretaker anil ready help needs point time",
                "disastrous experience tarang farmhouse express disappointment enough recent stay tarang farmhouse booked venue high hopes celebrate wedding anniversary entire experience turned nightmare upon arrival greeted appalling lack cleanliness throughout property showers bathroom nonfunctional leaving us without basic hygiene facilities make matters worse found bed stained one bedrooms dead rat near swimming pool fridge contained remnants previous guests meal including chicken milk left rot entire place breeding ground disgust discomfort completely disregarding basic hygiene standards condition kitchen beyond pathetic making impossible us prepare food comfortably filthy clearly cleaned long time presence dead rat near swimming pool stains bed disgusting also severe health hazard add insult injury care taker ensuring safety comfort guests behaved outrageously blocked exit closing gates demanded payment letting us leave furthermore insisted clean food waste leave demand unprofessional also absurd considering paying guests expecting clean pleasant environment attempts seek assistance owner met extreme disappointment ignoring calls messages owner finally answered display utmost rudeness response claiming wasnâ\u0080\u0099t running property money dismissing concerns disrespectful also deeply unprofessional light terrible experience strongly advise considering tarang farmhouse celebrations events utter lack cleanliness unprofessional conduct staff owners indifference left us appalled establishment clearly value customers urge anyone reading review seek alternative venues special occasions treated respect consideration deserve",
                "perfect choice family gatherings getaway parties surrounded beautiful scenic views kadalundi river swimming pool small turf outdoor dining along beautiful garden makes outdoor yard feel deluxe pretty well furnished rooms available",
                "worst experiences ever property maintained condition pathetic owner behaves rudely ready admit issues poor cleanliness bed stains one bedrooms showers working bathrooms bad experience staying place recommended",
                "property well maintained needs lot maintenance work done especially kitchen location excellent"
            ]
        },
        {
            "name": "Hotel Soorya Galaxy",
            "rating": [
                3.7
            ],
            "address": [
                "Soorya Galaxy Kozhikode-Palakkad Road Near Federal Bank Cheruvennur, Kozhikode, Kerala 673631, India"
            ],
            "reviews": [
                {
                    "text": "Large rooms compared to other hotels in kozhikodu, corridors are wider. Average price compared to city side. Their reception at the second floor.enough parking area at the ground. Neat and tidy atmosphere. A local bar at ground floor AC bar is also there. Room service takes a long time to deliver items. Wash room floor they fixed with normal floor tiles so its slippery (no grip on tiles), fell down in wash room bath area. If you are  opening a hot water valve on the shower, boiled water will reach in all other taps, so take care. Getting a taxi or uber from this place is difficult, so we have to plan the trip early. Outside the hotel, auto rikshaw is available at normal timings.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This is the most useless hotel, the behavior of the guy who works at the reception during the day is also not good, No basic ethics. I have not seen such stupid staff till date. I call for cleaning and their cleaner left with dustbin envelope in my hand, i stayed there 4 days and none came to Clean my room, such a pathetic place, really disgusting",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Many smoker's are around the bar and hotel",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Had gone for a seminar the hall was good the service staffs were very nice food was good, but the wash room was pathetic smelly not cleaned properly. In the evening when the bar open the ground floor is full of local drunkards.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good stay and clean rooms",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "large rooms compared hotels kozhikodu corridors wider average price compared city side reception second floorenough parking area ground neat tidy atmosphere local bar ground floor ac bar also room service takes long time deliver items wash room floor fixed normal floor tiles slippery grip tiles fell wash room bath area opening hot water valve shower boiled water reach taps take care getting taxi uber place difficult plan trip early outside hotel auto rikshaw available normal timings",
                "useless hotel behavior guy works reception day also good basic ethics seen stupid staff till date call cleaning cleaner left dustbin envelope hand stayed days none came clean room pathetic place really disgusting",
                "many smokers around bar hotel",
                "gone seminar hall good service staffs nice food good wash room pathetic smelly cleaned properly evening bar open ground floor full local drunkards",
                "good stay clean rooms"
            ]
        },
        {
            "name": "RIVER VIEW STAYS",
            "rating": [
                4.4
            ],
            "address": [
                "Paruthipara Rd, Feroke, Kozhikode, Kerala 673632, India"
            ],
            "reviews": [
                {
                    "text": "I am happy with the rooms and their service. The owner is too friendly and helpful. The calm atmosphere and the view of the river is really nice. The road to the property is very narrow and drivers need to little more careful. The property don't  have a restaurant, but don't worry they will help you in getting the food delivered to room.\nI enjoyed the stay at River View and it can be recommended to others without any doubt..",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Clean and beautiful rooms with amazing view. Owners are friendly and helpful to find the exact location. More over a resort its a kind of homestay. You need to take extra precautions while you driving to River view as the road is too narrow with sharp edges wall",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "THE BEST resort I've ever been to. Nothing less than a five start hotel room. Clean and beautiful rooms with amazing view, they also provide superfast wifi and the owner of the place is really friendly and very helpful. Had an amazing time staying there!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One of the most pleasant stays, the room was very clean and amazing river view to wake up to. The host was a super nice and was very humble.  Highly recommend to visit this beautiful place!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Had a great time here.. Affordable price and comfortable stay with the river view.. Rooms are clean and well maintained.. Management is friendly.. Well suited for bachelors, families, solo or group travelers and couples also.. There is no shops near by but the management will arrange food facilities",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "happy rooms service owner friendly helpful calm atmosphere view river really nice road property narrow drivers need little careful property dont restaurant dont worry help getting food delivered room enjoyed stay river view recommended others without doubt",
                "clean beautiful rooms amazing view owners friendly helpful find exact location resort kind homestay need take extra precautions driving river view road narrow sharp edges wall",
                "best resort ive ever nothing less five start hotel room clean beautiful rooms amazing view also provide superfast wifi owner place really friendly helpful amazing time staying",
                "one pleasant stays room clean amazing river view wake host super nice humble highly recommend visit beautiful place",
                "great time affordable price comfortable stay river view rooms clean well maintained management friendly well suited bachelors families solo group travelers couples also shops near management arrange food facilities"
            ]
        },
        {
            "name": "OYO Home 40119 Elegant Stay Kings Circle",
            "rating": [
                3.4
            ],
            "address": [
                "Kings Circle, 3/447 B, Main Rd, Nallalam P.O, Meenchanda, Kozhikode, Kerala 673027, India"
            ],
            "reviews": [
                {
                    "text": "Worst class hotel. Plz do not try. Alcohol bottles. cigarette buds found inside. No fan. AC problem. TV Non functional. Bedsheets worst class. Internal, outdoor cleanliness very poor.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Room was not properly maintained and it was dirty. Dirty  bed sheets, dirty bathroom with cigarette buds and ashes. Used soaps. No towel was there. Overall it was my worst stay in OYO",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "The hotel was not operational when reached there in midnight. Very horrible experience.A big thumbs down to Oyo and this hotel.\n\nSomehow we could arrange another hotel because of out auto driver.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Poor Oyo have tv and ac but not working\nBad atmosphere.low quality rooms",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Excellent facility. Neat and clean bedsheet/blanket & toilets.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst class hotel plz try alcohol bottles cigarette buds found inside fan ac problem tv non functional bedsheets worst class internal outdoor cleanliness poor",
                "room properly maintained dirty dirty bed sheets dirty bathroom cigarette buds ashes used soaps towel overall worst stay oyo",
                "hotel operational reached midnight horrible experiencea big thumbs oyo hotel somehow could arrange another hotel auto driver",
                "poor oyo tv ac working bad atmospherelow quality rooms",
                "excellent facility neat clean bedsheetblanket toilets"
            ]
        },
        {
            "name": "HOTEL JINEESH",
            "rating": [
                4.5
            ],
            "address": [
                "Kozhikode, Kerala 673301, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "SPOT ON 76899 Chaliyam Residency",
            "rating": [
                3.4
            ],
            "address": [
                "Chaliyar Tower, Kozhikode, Chaliyam, Kerala 673301, India"
            ],
            "reviews": [
                {
                    "text": "No response",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "response"
            ]
        },
        {
            "name": "Maliyekkal House, Karuvanthiruthy",
            "rating": [
                5
            ],
            "address": [
                "5R67+CR9, Karuvanthiruthy, Kozhikode, Kerala 673301, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful tourist place in great malabar calicut.. peoples are usually using fish hunting as their daily needs... we can see different types of birds ..",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful tourist place great malabar calicut peoples usually using fish hunting daily needs see different types birds"
            ]
        },
        {
            "name": "FARM FORT RESORT & CONVENTION CENTRE",
            "rating": [
                4.9
            ],
            "address": [
                "Farook College Road, Chungam, Ramanattukara, Via, Feroke, Kozhikode, Kerala 673631, India"
            ],
            "reviews": [
                {
                    "text": "Farm Fort exceeded all my  expectations..! From the arrival moment, the staff's attention and commitment to customer satisfaction was evident. The facilities are luxurious, the rooms are spacious and well-appointed. Resort's amenities are fantastic. The scenic views from the garden add an extra touch of tranquility. Whether you are here for a relaxing getaway or a special occasion, Farm Fort is a true gem. Highly recommended for a memorable Stay with family and friends.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Everything about this resort was exceptional!! The rooms were spacious,clean, comfortable,well equipped & well maintained... Ambience was awesome with swimming pool,kids park, garden area etc.. We had a great time with family enjoying each nook & corner of the resort by playing in pool viewing the scenic beauty & taking snaps... The breakfast buffet was so delicious with huge variety of options.. Service was excellent & Mr.Mithun was so friendly and attentive & he made sure that we were more comfortable there ...\nSpecial thanks to Mr.Prasanth for arranging everything so perfect..\nI highly recommend this place to stay with family and friends.. please go for it..!!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Wonderful environment. A complete disconnect with busy life. The swimming pool and other activities inside the property are the best highlight. You can spend your entire stay within the hotel and have a great time.| Reaching the farm made were easy just 12Km from calicut airport.| Tye Ambience and infrastructure everything is top notch and the Hospitality  are very Friendly and helpful throughout,  | A definite must visit",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We had a wonderful stay in the property. The hospitality, rooms, location, food... are fantastic. Great staffs with polite and good service skills. They have indoor & outdoor activities both for adults and kids. The large  swimming pool , Beautiful Garden Space, Fishing pond and many more... It was a wonderful experience.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Stay was good, rooms were neat and clean. Breakfast was good.\nIt could have been better if you didn't set a pool time limit. 😊 Thank you",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "farm fort exceeded expectations arrival moment staffs attention commitment customer satisfaction evident facilities luxurious rooms spacious wellappointed resorts amenities fantastic scenic views garden add extra touch tranquility whether relaxing getaway special occasion farm fort true gem highly recommended memorable stay family friends",
                "everything resort exceptional rooms spaciousclean comfortablewell equipped well maintained ambience awesome swimming poolkids park garden area etc great time family enjoying nook corner resort playing pool viewing scenic beauty taking snaps breakfast buffet delicious huge variety options service excellent mrmithun friendly attentive made sure comfortable special thanks mrprasanth arranging everything perfect highly recommend place stay family friends please go",
                "wonderful environment complete disconnect busy life swimming pool activities inside property best highlight spend entire stay within hotel great time reaching farm made easy km calicut airport tye ambience infrastructure everything top notch hospitality friendly helpful throughout definite must visit",
                "wonderful stay property hospitality rooms location food fantastic great staffs polite good service skills indoor outdoor activities adults kids large swimming pool beautiful garden space fishing pond many wonderful experience",
                "stay good rooms neat clean breakfast good could better didnt set pool time limit ð\u009f\u0098\u008a thank"
            ]
        }
    ]
}