{
    "places_with_reviews": [
        {
            "name": "The Fern Royal Farm Resort, Anjar, Kutch",
            "rating": [
                4.4
            ],
            "address": [
                "The Fern Royal Farm Resort, Plot No. 66, Survey No. 258, Royal Riviera Farm, Bhuj - Anjar Hwy, opp. Shriji Petrol Pump, Anjar, Ratatalav, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "The property is great and has good amenities! The staff however, seems new and still under training, but still helpful!  The Manager was very cooperative and resolved our issues quickly! The rooms are spacious and good. They also have Private Villas with pools on the property if you wanna opt for those.\n\nIt's 15-20 mins away from the main market, but really worth the distance. You can easily book a cab in advance to take you back and forth! My overall experience at The Fern Anjar was great!\n\nPro-Tip: The Gym, Pool and Restaurant are great, but avoid the Spa! I had a very weird experience at the entrance desk itself, the receptionist at the Spa gave me some ridiculous explanation when I asked if they had just foot massage therapy available, which made me question the entire service.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had a blast at The Fern Royal Farm Resort, Anjar, thanks to Ritik and Rohit! They were phenomenal in guiding us through various in-house activities like table tennis, 8-ball pool, and archery. Their friendliness and expertise made every game enjoyable. Highly recommend joining them for any activity!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had a superb stay. The climate was also very pleasant. Rooms are very good, neat and clean. Food is Amazing. Clean and neat swimming pool. Very good place for photo shoots. The property also has a garden with kids playing area. Also there is a game zone for kids and club house for every one. The property also has a gym, spa, mini theater,  in-house clubbing. Only thing they missed with is to offer clubbing and mini theater as a complimentary to the guest who stay there with some specific timings everyday. As many 5 star offer this kind of service to the guest who stay in property as a complimentary. So if this can be done than I am sure that everybody will have a memorable stay at The Fern Royal Anjar. Last and not the least, they have given us a complimentary photo frame which can be kept at home anywhere. This photo frame will make us always remember about The Fern Royal Anjar",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "When I have arrived at the reception desk I was astonished by the view of the surroundings and hall area that hardly is seen in 5 star hotels or resorts.\nThe new year celebration was an tremendous experience worthy of your time.\nThe staff was joyful, jolly and helpful in dealing with the guests.\nI would like to mention and thank the staff members like Rani  and Vicky  &all team their cooperation with the guests.\nHAPPY NEW YEAR",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We had booked two rooms for two nights each and had a pleasant experience with the Fern Royal Farm Resort during our stay around the republic day weekend last week. Rooms were spacious and clean. The only issue we had was the location as we had planned to visit a lot of places in Kutch which were a bit far away from the hotel’s location. Otherwise, I’d like to visit this one again in future and would recommend it to everyone.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property great good amenities staff however seems new still training still helpful manager cooperative resolved issues quickly rooms spacious good also private villas pools property wan na opt mins away main market really worth distance easily book cab advance take back forth overall experience fern anjar great protip gym pool restaurant great avoid spa weird experience entrance desk receptionist spa gave ridiculous explanation asked foot massage therapy available made question entire service",
                "blast fern royal farm resort anjar thanks ritik rohit phenomenal guiding us various inhouse activities like table tennis ball pool archery friendliness expertise made every game enjoyable highly recommend joining activity",
                "superb stay climate also pleasant rooms good neat clean food amazing clean neat swimming pool good place photo shoots property also garden kids playing area also game zone kids club house every one property also gym spa mini theater inhouse clubbing thing missed offer clubbing mini theater complimentary guest stay specific timings everyday many star offer kind service guest stay property complimentary done sure everybody memorable stay fern royal anjar last least given us complimentary photo frame kept home anywhere photo frame make us always remember fern royal anjar",
                "arrived reception desk astonished view surroundings hall area hardly seen star hotels resorts new year celebration tremendous experience worthy time staff joyful jolly helpful dealing guests would like mention thank staff members like rani vicky team cooperation guests happy new year",
                "booked two rooms two nights pleasant experience fern royal farm resort stay around republic day weekend last week rooms spacious clean issue location planned visit lot places kutch bit far away hotelâ\u0080\u0099s location otherwise iâ\u0080\u0099d like visit one future would recommend everyone"
            ]
        },
        {
            "name": "Manav Residency",
            "rating": [
                4.2
            ],
            "address": [
                "Madhavbag Opp Varsamadi Naka Near Jain Dada Vadi, Kushal Nagar, Anjar, Kutch,, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "Good place to stay and service is also very quick. Sweet staff.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We have been eating at Manav restaurant for years but there was no problem in food or service, but since the new Manav Square has opened for some time, we are facing one problem and that is very poor service. When it was found out that the reason for this was that some or the other events happen regularly in both the hotels due to which the cooking and service staff gets reduced.\n\nToday when I went to eat food at old Manav, they were not even giving the menu and after a long time when the food arrived, there were no plates, spoons or even water glasses. I have never seen such poor service and that too in a MANAV restaurant. I want to tell you that you should increase your staff or work only on events.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent place, food and best for photoshoot.\nRooms were neat and clean",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good place. Good food. As a  person from other state, i feel that they want us to have food there and not outside. They didnt restrict us. But still felt the same.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I would recommend everyone to spend more and stay in decent hotels like Radisson or Fern. This is an OK type Hotel. Food is still good. If are not at all fussy about bed, washroom, staff behaviour then you may be able to put up with the standard of this hotel. For me this will be my first and last stay at Shree Manav Anjar.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay service also quick sweet staff",
                "eating manav restaurant years problem food service since new manav square opened time facing one problem poor service found reason events happen regularly hotels due cooking service staff gets reduced today went eat food old manav even giving menu long time food arrived plates spoons even water glasses never seen poor service manav restaurant want tell increase staff work events",
                "excellent place food best photoshoot rooms neat clean",
                "good place good food person state feel want us food outside didnt restrict us still felt",
                "would recommend everyone spend stay decent hotels like radisson fern ok type hotel food still good fussy bed washroom staff behaviour may able put standard hotel first last stay shree manav anjar"
            ]
        },
        {
            "name": "Shree Ramkrupa Party Plot & Resort",
            "rating": [
                4.7
            ],
            "address": [
                "Mitha Pasvariya, G.IDC, Road, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "Our resort stay was absolute paradise! The breathtaking views, luxurious accommodations, and outstanding service made it a dream vacation. The amenities were fantastic, and we can't wait to return! Highly recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Water in the swimming pool is not clean and is very small.\nResort claims that 50 people can be accommodated in the swimming pool, but not possible.\nThird class washrooms and no changing rooms available.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Uniform atmosphere with complete secure morning",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "A good private space. Pool is clean and the games area is an added bonus too. Rooms are decent.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This is amaging trip to this place . This place have best natural view ever & this kind of hotels are perfect for valuable customers .The services are very good & hotels are kind facility in a room as feeling as royality.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort stay absolute paradise breathtaking views luxurious accommodations outstanding service made dream vacation amenities fantastic cant wait return highly recommended",
                "water swimming pool clean small resort claims people accommodated swimming pool possible third class washrooms changing rooms available",
                "uniform atmosphere complete secure morning",
                "good private space pool clean games area added bonus rooms decent",
                "amaging trip place place best natural view ever kind hotels perfect valuable customers services good hotels kind facility room feeling royality"
            ]
        },
        {
            "name": "Hotel Guddi",
            "rating": [
                3.8
            ],
            "address": [
                "DEVALIYA GATE, Ganga Naka, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "There Was My First Experience In Gudi But That Was Poor Serving Service And Staff Members I Continue Said To Give Me Tandoori Rotie But They Are No One Responses That All Over Staff Yet Not Proper Behaviour So I Don't Like This Hotels Staff and I Don't Want To Again Visit In This Hotel And Friends Are Ready This My Note Please No To Go This Hotel 😡 Because Their Staff Was Not Proper Response To Serve Food",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Its a 2 star hotel or type of guest house, stays in cheap rate so don't expect much ya but you sleep in Peace thats important so if you are a service traveler then you must go",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "A good place nearby to bus stop and railway station and in the middle of the city.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It is a nice restaurant and we ate a Punjabi thali which was quite good. And was also pocket friendly and the ambience was also amazing . But the only drawback is that there are no restaurants open in this area after 10:30 pm, so if you are planning to visit then make sure that you eat before this time or else you will have to slep empty stomach.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nice one good service and good decipilen in the hotel good experience",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "first experience gudi poor serving service staff members continue said give tandoori rotie one responses staff yet proper behaviour dont like hotels staff dont want visit hotel friends ready note please go hotel ð\u009f\u0098¡ staff proper response serve food",
                "star hotel type guest house stays cheap rate dont expect much ya sleep peace thats important service traveler must go",
                "good place nearby bus stop railway station middle city",
                "nice restaurant ate punjabi thali quite good also pocket friendly ambience also amazing drawback restaurants open area pm planning visit make sure eat time else slep empty stomach",
                "nice one good service good decipilen hotel good experience"
            ]
        },
        {
            "name": "Hotel Shiv Krupa - Best Hotel, Budget Hotel, Family Hotel, Ac Hotel",
            "rating": [
                4.9
            ],
            "address": [
                "Kodrani foods Savasar Naka, Road, Naka Road, Ganga Naka, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "A very affordable and good rooms with sufficient amenities. Hotel owner and staff is very helpful in nature. Must book and feel like your home. 💫✨",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Great deals with minimum bajet\nSupperb\nNice\nPlace",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "This man of Shiv Krupa hotel is a big fraud. He will send pics on WhatsApp and once you see it. He will directly ask for money. Pictures don't comply with rooms. If we will be 5 mins late to send money He will say rooms are booked.zero stqrs",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Welll service n best enjoyment friendly employee service so thankful best performance 🎭",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Good service nice room best location..I.am.. happy",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "affordable good rooms sufficient amenities hotel owner staff helpful nature must book feel like home ð\u009f\u0092 « â\u009c¨",
                "great deals minimum bajet supperb nice place",
                "man shiv krupa hotel big fraud send pics whatsapp see directly ask money pictures dont comply rooms mins late send money say rooms bookedzero stqrs",
                "welll service n best enjoyment friendly employee service thankful best performance ð\u009f\u008e­",
                "good service nice room best locationiam happy"
            ]
        },
        {
            "name": "Hotel Toral Residency",
            "rating": [
                3.7
            ],
            "address": [
                "vaishali cinema, Shiv Shakti Society, Vir Bhaghat Singh Nagar, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "It was a pleasant experience staying in Hotel Toral Residency. Staff was too polite and helpful. Most important thing is you will get warm water 24 hours. Transport connectivity is too easy.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Amazing atmosphere. Nice location. Sufficient parking space. Neat and clean room, bathroom also. Hot n cold water available. Supportive staffing. Very chief and economy food breakfast available. Thanks 👍 Hotel Toral Residency",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I stayed for total of 3 days. Decent rooms . All basic facilities available. Service is also good. I had raised few problems after the room was allotted. The hotel management quickly addressed my concern and changed the room as it was available . Would recommend.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Hotel Toral Residency, it has a planned and expected guests and that is the reason they have  everything just like that, like there is no such room.service nor the well maintained rooms. The entrance itself is worst. The ambience is worst. It is situated in some closed mall.or shopping center, which might be having a cinema screen in itself. But the mall is closed and have missused in by people in the night. So the safety it self is an issue. Overall i don't recommend it for family stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Room is Good\nService like medium\nHotel Location Besttt",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pleasant experience staying hotel toral residency staff polite helpful important thing get warm water hours transport connectivity easy",
                "amazing atmosphere nice location sufficient parking space neat clean room bathroom also hot n cold water available supportive staffing chief economy food breakfast available thanks ð\u009f\u0091\u008d hotel toral residency",
                "stayed total days decent rooms basic facilities available service also good raised problems room allotted hotel management quickly addressed concern changed room available would recommend",
                "hotel toral residency planned expected guests reason everything like like roomservice well maintained rooms entrance worst ambience worst situated closed mallor shopping center might cinema screen mall closed missused people night safety self issue overall dont recommend family stay",
                "room good service like medium hotel location besttt"
            ]
        },
        {
            "name": "Hotel Payal",
            "rating": [
                3.6
            ],
            "address": [
                "428J+9PX, NH41, Ajepar Nagar, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "The hotel was pretty decent situated In a very less traffic area. Got a room for Rs 400. Manager was polite and helpful. Had a good night stay over here. Recommended.\n\nFurther details can be found as below.\n\n- Walk-in booking\n- Single person\n- Date: 10 Dec 2023\n- Parking - No (Street parking opposite the hotel)",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Staff/Owner behaviour is so rude dont stay here guys .. there are many hotels nearby in this price range with so much luxury wanna rate it ZERO but there are no options available 😿",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Pathetic rooms and attitude of the owner, zero cleanliness",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "If you compare prices, one the best hotel in town with, the best part is clean and neat with fresh air, specious rooms, and good staff behaviour. What else will you get in budget hotels tariff is 600 inr only.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "The rooms are cheap but disgustingly unhygienic. As we had no other option, we had to stay here for a night. The place is not clean at all. We had lived here previously but the hygiene has just degraded. The jet spray in the loo wasn't operational. The air conditioning was not powerful enough to cool down a room. There are literally no charging points and whatever is there, has been damaged. They do not provide soap or shampoos and the drinking water provided is a bit salty.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel pretty decent situated less traffic area got room rs manager polite helpful good night stay recommended details found walkin booking single person date dec parking street parking opposite hotel",
                "staffowner behaviour rude dont stay guys many hotels nearby price range much luxury wan na rate zero options available ð\u009f\u0098¿",
                "pathetic rooms attitude owner zero cleanliness",
                "compare prices one best hotel town best part clean neat fresh air specious rooms good staff behaviour else get budget hotels tariff inr",
                "rooms cheap disgustingly unhygienic option stay night place clean lived previously hygiene degraded jet spray loo wasnt operational air conditioning powerful enough cool room literally charging points whatever damaged provide soap shampoos drinking water provided bit salty"
            ]
        },
        {
            "name": "Shree Radhe Resort",
            "rating": [
                3.9
            ],
            "address": [
                "32XP+6MH, GJ SH 46, Anjar, Gujarat 370205, India"
            ],
            "reviews": [
                {
                    "text": "Perfect location for stay and for the functions, large space available for parking and a very nice loan area as well.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It's good place for marriage reception and marriage function and small to big gathering. Budget friendly and very good location that out side of City No Parking issue and No issues from Local People's",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice party plot for family functions 👌🏻👌🏻",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very spacious, most suitable for budget friendly destination weddings.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Anjar to bhuj no buses in 10:00 am to 12:00 pm intercity. Please mannage buses more this  ruts.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "perfect location stay functions large space available parking nice loan area well",
                "good place marriage reception marriage function small big gathering budget friendly good location side city parking issue issues local peoples",
                "nice party plot family functions ð\u009f\u0091\u008cð\u009f\u008f » ð\u009f\u0091\u008cð\u009f\u008f »",
                "spacious suitable budget friendly destination weddings",
                "anjar bhuj buses pm intercity please mannage buses ruts"
            ]
        },
        {
            "name": "shree Modh Jivan Dev karan jain dharamshala",
            "rating": [
                4.3
            ],
            "address": [
                "163B, Ajepar Nagar, Anjar, Gujarat 370205, India"
            ],
            "reviews": [
                {
                    "text": "Good place to stay, rooms are neat and clean.\nThey can just improve with the parking area so, it could be easy for all.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Rate low for room Rs. 200/- old room, new 600/- non ac. But if you jain so you stay at dadawadi anjar. Facilities good and bhojan shala also their\n🌹🌹",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Better than hotel rooms and facilities. I wonder why this place was not on maps.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Ha",
                    "languageCode": "en-US",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en-US",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay rooms neat clean improve parking area could easy",
                "rate low room rs old room new non ac jain stay dadawadi anjar facilities good bhojan shala also ð\u009f\u008c¹ð\u009f\u008c¹",
                "better hotel rooms facilities wonder place maps",
                "ha",
                "nice"
            ]
        },
        {
            "name": "Shreeju Regency",
            "rating": [
                4.9
            ],
            "address": [
                "Shree shyama shyam building, jesal toral samadhi road, Ajepar Nagar, Anjar, Gujarat 370110, India"
            ],
            "reviews": [
                {
                    "text": "Hotel Shreeju Regency, Anjar: A clean and comfortable stay with friendly staff. Centrally located, making it convenient to explore the area.\n\nOverall, a positive and enjoyable experience.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Great location, nearby to all major attractions in city. Nice and clean rooms with excellent service.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best hotel in anjar\nGreat rooms\nNice staff",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Location is good 👍 The staff is well mannered and the prices of the rooms are reasonable.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best location near to JESAL TORAL MANDIR , AJEPAR MANDIR , walking distato khatri chowk where you handmade famous kutchi Bhandhani and hand work made all items in clothes.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel shreeju regency anjar clean comfortable stay friendly staff centrally located making convenient explore area overall positive enjoyable experience",
                "great location nearby major attractions city nice clean rooms excellent service",
                "best hotel anjar great rooms nice staff",
                "location good ð\u009f\u0091\u008d staff well mannered prices rooms reasonable",
                "best location near jesal toral mandir ajepar mandir walking distato khatri chowk handmade famous kutchi bhandhani hand work made items clothes"
            ]
        }
    ]
}