{
    "places_with_reviews": [
        {
            "name": "Madhubhan Resort & Spa",
            "rating": [
                4.7
            ],
            "address": [
                "Anand - Sojitra Rd, Vithal Udyognagar, Vallabh Vidyanagar, Anand, Gujarat 388120, India"
            ],
            "reviews": [
                {
                    "text": "They have a good quality service and very friendly staff.food is just awesome who love an Indian 🇮🇳 and South Gujarati Indian cuisines and for a diet people’s as well they have an options for breakfast.\n\nLocation is also very rich with a lot of environment friendly and green.at this moment weather is hot so you will feel a bit hotness in environment but better come here at winter ❄️\n\nYou will definitely get a peace ☮️ at this place and able to spend a quality time with a family.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Visited their restaurant for lunch. Found it to be amazing. The spread, the variety, staff support everything. Some people may find it to be expensive but they do provide the value and doesn't seem to be overpriced. Most of the items that we tried was good in taste, especially the sweets.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Stayed for a destination wedding for 2 nights. Rooms are very spacious and superb hospitality. House keeping is unbelievably quick. Being a huge resort, movement is a bit long in between rooms and restaurant and banquet. But they have an efficient cart support. Never even once had to walk, would always find a cart.\n\nFood variety is good and everything is cooked to near perfection.\n\nHad a wonderful time. Kudos to the wonderful team.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "A great resort with utmost care of nature.....If someone really wants to spare time with family in quiet place, it's the right place.\n\nStaff friendly.\nFood quality very good.\n\nProperty being old more than 14 years now, it requires renovation of rooms on high priority as rooms are maintained below average in comparison to cost.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I had a wonderful experience staying at Madhubhan resort and Spa. The rooms were well-maintained and comfortable, and the room service was impressively fast. The staff was incredibly helpful and kind, always ready to assist with any requests or queries.\n\nOne of the highlights of my stay was the delicious food at the resort. Both breakfast and dinner offered a wide variety of options, ensuring that there was something for everyone's taste. The quality of food was excellent, and I thoroughly enjoyed every meal.\n\nOverall, my stay at Madhubhan resort and Spa was truly amazing. The combination of great room service, friendly staff, and delectable food made it a memorable experience. I would highly recommend this resort to anyone looking for a fantastic getaway.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good quality service friendly stafffood awesome love indian ð\u009f\u0087®ð\u009f\u0087³ south gujarati indian cuisines diet peopleâ\u0080\u0099s well options breakfast location also rich lot environment friendly greenat moment weather hot feel bit hotness environment better come winter â\u009d\u0084ï¸\u008f definitely get peace â\u0098®ï¸\u008f place able spend quality time family",
                "visited restaurant lunch found amazing spread variety staff support everything people may find expensive provide value doesnt seem overpriced items tried good taste especially sweets",
                "stayed destination wedding nights rooms spacious superb hospitality house keeping unbelievably quick huge resort movement bit long rooms restaurant banquet efficient cart support never even walk would always find cart food variety good everything cooked near perfection wonderful time kudos wonderful team",
                "great resort utmost care natureif someone really wants spare time family quiet place right place staff friendly food quality good property old years requires renovation rooms high priority rooms maintained average comparison cost",
                "wonderful experience staying madhubhan resort spa rooms wellmaintained comfortable room service impressively fast staff incredibly helpful kind always ready assist requests queries one highlights stay delicious food resort breakfast dinner offered wide variety options ensuring something everyones taste quality food excellent thoroughly enjoyed every meal overall stay madhubhan resort spa truly amazing combination great room service friendly staff delectable food made memorable experience would highly recommend resort anyone looking fantastic getaway"
            ]
        },
        {
            "name": "Hotel Blueivy",
            "rating": [
                4.7
            ],
            "address": [
                "Hotel Blueivy, 80 Feet Rd, opposite Patcon House, Rajiv Nagar, Patel Chokdi, Vivekanand Wadi, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "Located in a well developed area. It's easy to reach over there. The rooms are very clean. The ambience of the hotel is pleasant. Service staff are humble and co-operative. They listen to you very carefully. I have visited this place mostly to attend wedding receptions or other medium size birthday parties. Their party hall is well suited for gatherings of 200-250 persons.\n\nIf you go to have lunch or dinner. It's a bit costly in terms of the amount of sabji compared to the cost of it. The quality of food is awesome. Hotel charges are also reasonable.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Blueivy is a hidden culinary gem! From the moment you step inside, the inviting ambiance sets the stage for an unforgettable dining experience. Each dish is a work of art, bursting with flavor and beautifully presented. The attentive staff adds to the overall charm, ensuring a memorable visit. Don't miss the opportunity to indulge in the exquisite cuisine at blueivy.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The dining experience at Blue Ivy was truly delightful. The food was not only delicious but also presented with attention to detail. The service was prompt and the staff exhibited a standard level of professionalism, ensuring a pleasant atmosphere. The environment itself was wonderful, contributing to a relaxing and enjoyable meal. Overall, a highly recommended dining destination for those seeking a combination of tasty cuisine, excellent service, and a great ambiance.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great place to stay clean and nice rooms...very helpful staff front desk person Mr. Imran is helpful.\nGood food.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We went there for lunch and i must say, they have a wide variety of dishes on their menu and everything had a unique taste.\n\nShould definitely go if you are planning for lunch or dinner.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located well developed area easy reach rooms clean ambience hotel pleasant service staff humble cooperative listen carefully visited place mostly attend wedding receptions medium size birthday parties party hall well suited gatherings persons go lunch dinner bit costly terms amount sabji compared cost quality food awesome hotel charges also reasonable",
                "blueivy hidden culinary gem moment step inside inviting ambiance sets stage unforgettable dining experience dish work art bursting flavor beautifully presented attentive staff adds overall charm ensuring memorable visit dont miss opportunity indulge exquisite cuisine blueivy",
                "dining experience blue ivy truly delightful food delicious also presented attention detail service prompt staff exhibited standard level professionalism ensuring pleasant atmosphere environment wonderful contributing relaxing enjoyable meal overall highly recommended dining destination seeking combination tasty cuisine excellent service great ambiance",
                "great place stay clean nice roomsvery helpful staff front desk person mr imran helpful good food",
                "went lunch must say wide variety dishes menu everything unique taste definitely go planning lunch dinner"
            ]
        },
        {
            "name": "Hotel Arizona Inn",
            "rating": [
                4.2
            ],
            "address": [
                "Anand - Sojitra Rd, near Madhubhan Resort, Vithal Udyognagar, GIDC, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "A very well maintained hotel. Rooms are spacious and clean. The location is very good. A high end shopping centre is just beside the hotel. Breakfast is well spread with South Indian food along with other items. The restaurant of the hotel is very well maintained and the food quality and quantity both are really good. Enough parking space for all kinds of vehicles.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Great stay, I was there for my first time a few days ago.\nOverall excellent experience and service, bellmen were always on time and took care of all our items and requests.\nHotel overall does need some work as far as pests go - these were addressed but it is India so pests are expected.\nI ask that front desk try to stay aware of these things before simply saying they’ll handle it.\nBreakfast could use some more variety - seemed to be the same everyday vs what is advertised .\nRecommend a stay here but will take a couple years before it’s at its full extent.\nSome of the issues are simply due to India climate so that makes sense.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Constant odor in the room from the bathroom gutter.. Dirty carpet full of hair... Not vacuumed and dark spots everywhere. Plus, mosquitoes  by the dozens in the bedroom. Management had no answers for them. By the way, I paid a premium for the Suites Room. Also, the bath towels and bed sheets had blood stains on them. They replaced them, however, the next time they changed them out, they again put blood stained towels and sheets. Apparently, they don't do a good job of thoroughly washing or replacing towels and  bed sheets.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I have visited Arizona Hotel three times and each time it was marriage ceremony. It's a good place to be. Food is also of good quality. It's situated on the Anand Sojitra highway and easy to find. Beside Arizona Hotel is Maruti Solaris. Anyway, nice hotel and banquet.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This hotel is beyond your expectations.. I had booked it for 2 whole days for my marriage function and they just served our guests better than any 5 star hotels..Banquet Manger Mr. Jitu was standing there all the time to ensure the best service to be provided and the food was on top notch.. also the rooms were very neat and clean and room service was also upto the mark.. Arizona Inn staff made our special day more special as all the guests were happy and I think my wedding must be the 1st wedding where noone had a single complain about food or any service all thanks to Arizona team..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "well maintained hotel rooms spacious clean location good high end shopping centre beside hotel breakfast well spread south indian food along items restaurant hotel well maintained food quality quantity really good enough parking space kinds vehicles",
                "great stay first time days ago overall excellent experience service bellmen always time took care items requests hotel overall need work far pests go addressed india pests expected ask front desk try stay aware things simply saying theyâ\u0080\u0099ll handle breakfast could use variety seemed everyday vs advertised recommend stay take couple years itâ\u0080\u0099s full extent issues simply due india climate makes sense",
                "constant odor room bathroom gutter dirty carpet full hair vacuumed dark spots everywhere plus mosquitoes dozens bedroom management answers way paid premium suites room also bath towels bed sheets blood stains replaced however next time changed put blood stained towels sheets apparently dont good job thoroughly washing replacing towels bed sheets",
                "visited arizona hotel three times time marriage ceremony good place food also good quality situated anand sojitra highway easy find beside arizona hotel maruti solaris anyway nice hotel banquet",
                "hotel beyond expectations booked whole days marriage function served guests better star hotelsbanquet manger mr jitu standing time ensure best service provided food top notch also rooms neat clean room service also upto mark arizona inn staff made special day special guests happy think wedding must st wedding noone single complain food service thanks arizona team"
            ]
        },
        {
            "name": "Nilkanth Resort and Party Plot",
            "rating": [
                4.2
            ],
            "address": [
                "Lambhvel, Amar Cold Storge, Near, kanjri Road, Anand, Lambhvel, Gujarat 388310, India"
            ],
            "reviews": [
                {
                    "text": "Average venue for the international audience but perhaps locals would have less preferences around . Washrooms and hand washing facilities definitely require urgent attention and considerable efforts to achieve near acceptable level of hygiene. Overall just about 2 stars this time but hope to see this place doing and improving well soon.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Today Visited with Jlmorison India Ltd Gujarat Sales Team and Staff is very good and helpful, Room is very cleaning and Food is very fantastic, Location is Good\n\nThanks Nilkanth Resort Team",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent Rooms with courteous staff. Mr.Sandip and Mr.Girish both are very helpful… Will surely come back after sometime.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We recently attended a family event at the party venue. The space was spacious and could accommodate a large number of people.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good Place to stay with family\nFood quantity is good\nAwesome service and supportive staff",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "average venue international audience perhaps locals would less preferences around washrooms hand washing facilities definitely require urgent attention considerable efforts achieve near acceptable level hygiene overall stars time hope see place improving well soon",
                "today visited jlmorison india ltd gujarat sales team staff good helpful room cleaning food fantastic location good thanks nilkanth resort team",
                "excellent rooms courteous staff mrsandip mrgirish helpfulâ\u0080¦ surely come back sometime",
                "recently attended family event party venue space spacious could accommodate large number people",
                "good place stay family food quantity good awesome service supportive staff"
            ]
        },
        {
            "name": "Hotel Darshan Inn",
            "rating": [
                4.3
            ],
            "address": [
                "GWV2+5M9, Anand - Sojitra Rd, Sardar Nagar Society, Phase -IV, Karamsad, Anand, Gujarat 388325, India"
            ],
            "reviews": [
                {
                    "text": "Especially Mr. Prakasbhai is very cordial,polite,quite listener and prompt in response.\nAll team at Darshan is very co operative and obedient. Services has been given with a smiling face.\nAppreciate food quality ,ambience and overall experience was excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Online Food Order Review from the Restaurant:\nEvery time I've ordered from the restaurant, I have always loved the food! They have a good variety in their menu, and overall I feel you can trust whatever you try to be delicious and fresh!\n\nPaneer Bhurji - 10/10\nPaneer Kadhai - 9/10 (you might need to dab out some oil that floats to the top while delivering, but other than that, it's great!)\nButter Chapati - 10/10 (one of the few resturants around which serve whole wheat and home-like chapatis)\nDarshan Dum Biryani - 9/10",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Today evening we ordered veg fried rice &veg.manchuriam with special note 0 spicy,but it was so 🥵 that my children unable to eat; same happened last month in dal tadka too..their chefs don't have customised menu,only cooks fix recipe food.\nAfter notifying them reception(cashier )will say Sorry only. Totally useless..\nPlease this not first time ........",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had celebrated my Ring Ceremony here ar Darshan Inn.\nEverything from food to the service was superb. Especially professionalism shown by Mr. Prakash Bhai is praiseworthy. He is a great guy and makes sure your function is executed smoothly. I would highly highly recommend this place for anyone looking organize any ceremony here.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Amazing, clean and well maintained rooms.\nHotel team are very responsive, helpful and polite, especially Atul and Adil. It has been a pleasure meeting you 😊.\n\nThe food was exceptional - no need to go outside the hotel to eat!\n\nComing back every year!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "especially mr prakasbhai cordialpolitequite listener prompt response team darshan co operative obedient services given smiling face appreciate food quality ambience overall experience excellent",
                "online food order review restaurant every time ive ordered restaurant always loved food good variety menu overall feel trust whatever try delicious fresh paneer bhurji paneer kadhai might need dab oil floats top delivering great butter chapati one resturants around serve whole wheat homelike chapatis darshan dum biryani",
                "today evening ordered veg fried rice vegmanchuriam special note spicybut ð\u009f¥µ children unable eat happened last month dal tadka tootheir chefs dont customised menuonly cooks fix recipe food notifying receptioncashier say sorry totally useless please first time",
                "celebrated ring ceremony ar darshan inn everything food service superb especially professionalism shown mr prakash bhai praiseworthy great guy makes sure function executed smoothly would highly highly recommend place anyone looking organize ceremony",
                "amazing clean well maintained rooms hotel team responsive helpful polite especially atul adil pleasure meeting ð\u009f\u0098\u008a food exceptional need go outside hotel eat coming back every year"
            ]
        },
        {
            "name": "Hotel H",
            "rating": [
                4.4
            ],
            "address": [
                "Hotel H, Anand - Vidyanagar Rd, Vivekanand Wadi, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "Overall a very decent hotel\n\nEverything is ok in this hotel with the room size to cleanliness, although in a place like Anand this is one of the best you can get.\n\nNo complaint from the same.\n\nAlthough it is not comparable to a 4 or 5 star hence 3 star given.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "varieties available for ice cream & pastry !\n\nThe seating area is good and spacious so a big group can easily dine in , few options are available in coffee and snacks like sandwich and doughnut,\n\ni visited during tea time at noon , and was quite satisfied with the quality and the quantity.\n\ni noticed a wine store in this hotel , maybe convenient for the wine permit holders.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I love exploring various restaurants, hotels and cafe to enjoy delicious taste of food and beverages. I visited this place today with my friend and we had a cup of tea. We enjoyed spending our time, especially beautiful location.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good experience at Hotel H! Rooms are super comfortable. Enough place for car parking. Food is amazing.\n\nFew suggestions\n1) Hotel should have in house car cleaner.\n2) Hotel staff for Room keeping should have uniforms instead of Civil clothes.\n3) Room dining should be made available 24/7 since people check in at different times of the day or atleast allow Zomato/ Swiggy.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Don't even feel like to give 1 star, I was there for 2.5 days and Internet didn't even worked for 5 minutes regular. I called receptions continuously and all they said is we are working on it but the staff they had the wifi access all the time. Secondly there is no hotwater facility and then whole night they do maintainance and preprations and then you won't be able to get proper sleep. Please book Hotel blue IV which is far better.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall decent hotel everything ok hotel room size cleanliness although place like anand one best get complaint although comparable star hence star given",
                "varieties available ice cream pastry seating area good spacious big group easily dine options available coffee snacks like sandwich doughnut visited tea time noon quite satisfied quality quantity noticed wine store hotel maybe convenient wine permit holders",
                "love exploring various restaurants hotels cafe enjoy delicious taste food beverages visited place today friend cup tea enjoyed spending time especially beautiful location",
                "good experience hotel h rooms super comfortable enough place car parking food amazing suggestions hotel house car cleaner hotel staff room keeping uniforms instead civil clothes room dining made available since people check different times day atleast allow zomato swiggy",
                "dont even feel like give star days internet didnt even worked minutes regular called receptions continuously said working staff wifi access time secondly hotwater facility whole night maintainance preprations wont able get proper sleep please book hotel blue iv far better"
            ]
        },
        {
            "name": "La Casa Inn Hotel & Restaurant",
            "rating": [
                4.1
            ],
            "address": [
                "Anand - Sojitra Rd, near Ganesh Crossing, Mangalpura, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "Excellent place currently staying at La casa\nRooms are clean, service is excellent , great location as well.\nWebsite advertises a gym/fitness center but that’s not included yet\nFood/breakfast is great every morning\nFront and House staff are always at your service\nOf course the hotel has room to grow with keeping the rooms in shape, cleaning etc but with time this should happen.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was nice restaurant but hotel rooms weren’t that good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good hotel in prime location in Anand near Ganesh Chokdi and Amul Dairy.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best location  near expressed  highway & railway  stations  great meeting room &group lunch",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Our ac was not working properly and we ask the boy who works there. Then we went out. When we came back it was fixed. Walking distance to the temple.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place currently staying la casa rooms clean service excellent great location well website advertises gymfitness center thatâ\u0080\u0099s included yet foodbreakfast great every morning front house staff always service course hotel room grow keeping rooms shape cleaning etc time happen",
                "nice restaurant hotel rooms werenâ\u0080\u0099t good",
                "good hotel prime location anand near ganesh chokdi amul dairy",
                "best location near expressed highway railway stations great meeting room group lunch",
                "ac working properly ask boy works went came back fixed walking distance temple"
            ]
        },
        {
            "name": "Hummingbird Hotel & Banquet",
            "rating": [
                4.5
            ],
            "address": [
                "B/H Architect College Nr. University Library temple, Iskcon Rd, Mota Bazaar, Vallabh Vidyanagar, Anand, Gujarat 388120, India"
            ],
            "reviews": [
                {
                    "text": "Recently dined at Hummingbird and was thoroughly impressed! The rooftop option added a charming touch to the cozy ambiance. They offer a diverse menu catering to both vegetarians and non-vegetarians, and the food was delightful. Whether you're in the mood for veggie delights or savory non-veg dishes, this place has you covered.\n\nLoved the Chicken Kebabs!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "If you’re look for clean fresh food .. look no further.. the vegetarian dish’s were tasty not over spiced and a delight to eat. The butter chicken was the first one I have had with the right  texture and gravy , it’s was buttery tasty not flowing with oil ..polished off with thin fluffy nans …under stated Resturant .. a must go if looking for quality food ..",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The room were clean and beautiful, staff is helpful and cooperative especially thanks to Rakesh sir gives excellent service of hospitality. rooms is very good.I visited hotel for marriage function.\nit was good banquet halls. We come here regularly for our birthday and anniversary celebrations. The stay and food is very good. The staff is very helpful and they ensure your stay is happy and comfortable.👍",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I went to celebrate my son birthday with his friends in half day. It was amazing experience and wonderful time we spent there. The service and food with activities are awesome . Staff are very friendly, polite and helpful.and good rooms.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I stayed in your hotel for 3 days along with my close friend. We had come there to attend our college reunion in Jan 2023. We had a pleasant stay in the hotel and the staffs were also very good in their service.\n\nMaintain this service quality and it is definitely value for money.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently dined hummingbird thoroughly impressed rooftop option added charming touch cozy ambiance offer diverse menu catering vegetarians nonvegetarians food delightful whether youre mood veggie delights savory nonveg dishes place covered loved chicken kebabs",
                "youâ\u0080\u0099re look clean fresh food look vegetarian dishâ\u0080\u0099s tasty spiced delight eat butter chicken first one right texture gravy itâ\u0080\u0099s buttery tasty flowing oil polished thin fluffy nans â\u0080¦under stated resturant must go looking quality food",
                "room clean beautiful staff helpful cooperative especially thanks rakesh sir gives excellent service hospitality rooms goodi visited hotel marriage function good banquet halls come regularly birthday anniversary celebrations stay food good staff helpful ensure stay happy comfortableð\u009f\u0091\u008d",
                "went celebrate son birthday friends half day amazing experience wonderful time spent service food activities awesome staff friendly polite helpfuland good rooms",
                "stayed hotel days along close friend come attend college reunion jan pleasant stay hotel staffs also good service maintain service quality definitely value money"
            ]
        },
        {
            "name": "Hotel Rama Residency",
            "rating": [
                4.2
            ],
            "address": [
                "Shree Ram Arcade, 3rd Floor, Old Gopal Cinema, Railway Station Rd, Ganesh Chokdi, Sardar Ganj, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "Our stay at Rama Residency in Anand earlier this year was a good experience overall. Situated in a perfect location, the hotel offered easy access to local shopping in the area.\n\nWhile the rooms are dated, the comfort and warmth provided by the staff more than made up for it. Their attentive service and willingness to accommodate our needs ensured a pleasant and memorable stay. A special mention to the kitchen staff, especially Chef Pappu bhai. His food was very tasty, and he willingly accommodated our special dietary requests. Vaibhav bhai, the owner, was also prompt in addressing some issues with our room and took our suggestions on board.\n\nOverall, Rama Residency met our expectations. With not many local options in the area, we would definitely recommend this hotel to anyone seeking a comfortable stay in Anand.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "As a customer, he/she expect a good hospitality, service and food and which was satisfied by the HOTEL RAMA RESIDENCY..\n\nKeep it up the same.....\n\nBOSS IS AWESOME.....\nAND\nHe is having cooperating nature...\n\nFINALLY VERY VARY HAPPY..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good rooms for the budget. Staff is very cooperative. Didn’t deny even smallest of requests. Breakfast was also good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good hospitality and good food. Overall very good property at valuable rates.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent hospitality, vary safe, neat and tidy all times, free internet , unmatched staff service, homely environment with home-like food taste, variety of breakfast recipes, polite owner and staff nature, centrally located in Anand. All aminities available.Laundary services. Best and value added hotel in town.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay rama residency anand earlier year good experience overall situated perfect location hotel offered easy access local shopping area rooms dated comfort warmth provided staff made attentive service willingness accommodate needs ensured pleasant memorable stay special mention kitchen staff especially chef pappu bhai food tasty willingly accommodated special dietary requests vaibhav bhai owner also prompt addressing issues room took suggestions board overall rama residency met expectations many local options area would definitely recommend hotel anyone seeking comfortable stay anand",
                "customer heshe expect good hospitality service food satisfied hotel rama residency keep boss awesome cooperating nature finally vary happy",
                "good rooms budget staff cooperative didnâ\u0080\u0099t deny even smallest requests breakfast also good",
                "good hospitality good food overall good property valuable rates",
                "excellent hospitality vary safe neat tidy times free internet unmatched staff service homely environment homelike food taste variety breakfast recipes polite owner staff nature centrally located anand aminities availablelaundary services best value added hotel town"
            ]
        },
        {
            "name": "Surabhi Regency",
            "rating": [
                4.2
            ],
            "address": [
                "Jay Tower, Amul Dairy Rd, Popati Nagar, Anand, Gujarat 388001, India"
            ],
            "reviews": [
                {
                    "text": "Spacious room, helpful staff and location also on main road, walkable distance for Amul factory, 5-7 mins drive to station.. just a suggestion for the management - pls have a shower curtain else bathroom becomes very wet once we take shower ..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent Hotel with a very warm ambience, Hotel staff is extremely  courteous and polite. Rooms are cozy but washrooms can improve! Perfect location, right at the centre of things\n\nMust stay hotel, if you're planning a trip to Anand!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stayed here for almost 12 days. This was the best experience in Anand out of 4 hotels that I have stayed in in the past 6 months. Staff is extremely polite and diligent in work. The in house kitchen also has very good Punjabi food. The complimentary breakfast had two items everyday along with fruit, eggs and bread. I think it was very basic home like breakfast which u can actually have everyday, not very heavy or fancy. All in all, a very good experience. Will definitely stay at this hotel only for all visits to Anand in future. Thank u to the whole team",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Overall, an excellent stay with good service. Rooms were clean and spacious. Close to Anand station. Room service for food was also good. They arranged cars as needed at very reasonable rates. Cars were also clean and drivers good. Minor suggestions to improve: Please keep a jestspray in washroom and provide an electric kettle with tea/coffee sachet",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the finest hotel I have ever experienced in my life with all the excellent accommodation and also  marvelous staff",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "spacious room helpful staff location also main road walkable distance amul factory mins drive station suggestion management pls shower curtain else bathroom becomes wet take shower",
                "excellent hotel warm ambience hotel staff extremely courteous polite rooms cozy washrooms improve perfect location right centre things must stay hotel youre planning trip anand",
                "stayed almost days best experience anand hotels stayed past months staff extremely polite diligent work house kitchen also good punjabi food complimentary breakfast two items everyday along fruit eggs bread think basic home like breakfast u actually everyday heavy fancy good experience definitely stay hotel visits anand future thank u whole team",
                "overall excellent stay good service rooms clean spacious close anand station room service food also good arranged cars needed reasonable rates cars also clean drivers good minor suggestions improve please keep jestspray washroom provide electric kettle teacoffee sachet",
                "one finest hotel ever experienced life excellent accommodation also marvelous staff"
            ]
        }
    ]
}