{
    "places_with_reviews": [
        {
            "name": "Hotel Grand Xenia",
            "rating": [
                4.2
            ],
            "address": [
                "Foy Sagar Rd, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Very good experience.  View from rooms were toooo good. Very tasty food and Lavish Breakfast spread. Staff was very caring and well mannered. Only drawback is its away from main city,but green well maintained lawns and peaceful surroundings will make your stay fresh and happy.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I would love to come whenever I want to relax. Good rooms, service, and the view is breathtaking. Staff and the manager, Mr. Ashish, are all so kind and polite and always ready to help.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A sorry excuse for a 4 star hotel.\n\nAfter a long journey all me and my family wanted was some rest, but unfortunately from the moment we opened the doors to our rooms (3 double occupancy rooms) a never ending parade of problems walked our way.\n\nMultiple instances of key card not working\nRoom not serviced\nThe bathrooms had no water\nPipes were malfunctioning\nThe soap dispensers were out of order\nPhones not working\n\nAnd the list goes on...\n\nI personally asked one of the people in the reception why this was so and she replied with a big smile \"The service is bad and this was the case since she joined\"\n\nAll I could do was smile back\n\nNote: We were part of a tour group and this was the stay arranged by them, I have made sure that they won't choose Xenia the next time around.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "\"Visit at this hotel for a wedding and it exceeded all expectations! The ambiance is elegant, the catering service was exceptional, and the garden provided a picturesque backdrop for the ceremony. The marriage hall was spacious and beautifully decorated. Additionally, ample parking space and well-appointed rooms added to the convenience. Highly recommend this venue for any special occasion!\"",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Really awesome Ambience of this hotel, too much yummy breakfast, tasty food, feel so romantic dinner floor on the roof top.... I really like 508 Room.... NEXT TIME I WILL BE BOOK 508 😜 STAFF IS TOO GOOD AND SUPPORTIVE..... THANKU SO MUCH FOR THE BEST MEMORIES",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good experience view rooms toooo good tasty food lavish breakfast spread staff caring well mannered drawback away main citybut green well maintained lawns peaceful surroundings make stay fresh happy",
                "would love come whenever want relax good rooms service view breathtaking staff manager mr ashish kind polite always ready help",
                "sorry excuse star hotel long journey family wanted rest unfortunately moment opened doors rooms double occupancy rooms never ending parade problems walked way multiple instances key card working room serviced bathrooms water pipes malfunctioning soap dispensers order phones working list goes personally asked one people reception replied big smile service bad case since joined could smile back note part tour group stay arranged made sure wont choose xenia next time around",
                "visit hotel wedding exceeded expectations ambiance elegant catering service exceptional garden provided picturesque backdrop ceremony marriage hall spacious beautifully decorated additionally ample parking space wellappointed rooms added convenience highly recommend venue special occasion",
                "really awesome ambience hotel much yummy breakfast tasty food feel romantic dinner floor roof top really like room next time book ð\u009f\u0098\u009c staff good supportive thanku much best memories"
            ]
        },
        {
            "name": "Hotel Mansingh Palace, Ajmer",
            "rating": [
                4.4
            ],
            "address": [
                "Gaurav Path, Vaishali Rd, Tarachand Ka Bhatta, Vaishali Nagar, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "I came from the United States for my wedding here and I want to recognize the staff and management for going above and beyond in their preparation, food service, hospitality, and customer service. Coming from overseas, it is difficult to make arrangements and I’m truly impressed and thankful for their accommodations. Everyone had a safe and amazing time. Our ceremony went up to 4am and management was still on-site to check in on us. I’ve travelled all over the world and the service here is truly world class. My partner and I will be back to stay here anytime we come back to Ajmer!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice ambience, good food, centrally located, well behaved staff.  Drawbacks - food has become costly, Rooms need upgradation , parking problem when there is a party. Yet I would be liberal giving 4 stars.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I just went there for dinner with family.\nThe ambience was just ok.\nThe live performer was singing as if he hadn't had any food since ages.\nThe staff was well behaved but probably the hotel doesn't want to spend on their attire. Some waiters were wearing dirty and torn shirts.\nThe waiters didn't know about the dish preparation. They don't even know what kind of scotch they have in the bar.\nAnd most importantly the food.. it was pathetic in taste. I ordered 6 dishes and they all helped me ruining my evening.\nI paid just under 7000/ (INR) for a pathetic service, pathetic food, pathetic drink and a sleepy live performer.\nAnd... They are selective about accepting a credit card.\nAlso, the washroom was stinky & messy.\nOne star is more than enough.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Just working on old reputation. I continued stay because of receptionist Ms Sonali's helping nature. All othetr staff is working for tip. Breakfast was poor quality and staff at breakfast was attending to customer who offers Tip (money) . Few staff is also good..One of plumber technician helped me very well.\nBut 90 % staff is only working for tip. No proper food service. Water pressure at wash basin was very slow.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Extremely bad experience. When you call, they say we can discuss on room tariff, once you arrive there with baggage...they have zero considerations. Not a ethical way of doing business.\n\nThey even deny for hair oil pouch.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "came united states wedding want recognize staff management going beyond preparation food service hospitality customer service coming overseas difficult make arrangements iâ\u0080\u0099m truly impressed thankful accommodations everyone safe amazing time ceremony went management still onsite check us iâ\u0080\u0099ve travelled world service truly world class partner back stay anytime come back ajmer",
                "nice ambience good food centrally located well behaved staff drawbacks food become costly rooms need upgradation parking problem party yet would liberal giving stars",
                "went dinner family ambience ok live performer singing hadnt food since ages staff well behaved probably hotel doesnt want spend attire waiters wearing dirty torn shirts waiters didnt know dish preparation dont even know kind scotch bar importantly food pathetic taste ordered dishes helped ruining evening paid inr pathetic service pathetic food pathetic drink sleepy live performer selective accepting credit card also washroom stinky messy one star enough",
                "working old reputation continued stay receptionist ms sonalis helping nature othetr staff working tip breakfast poor quality staff breakfast attending customer offers tip money staff also goodone plumber technician helped well staff working tip proper food service water pressure wash basin slow",
                "extremely bad experience call say discuss room tariff arrive baggagethey zero considerations ethical way business even deny hair oil pouch"
            ]
        },
        {
            "name": "Hotel Merwara Estate",
            "rating": [
                4.2
            ],
            "address": [
                "Hotel Merwara Estate, Near, Daulat Bagh Rd, Ganj, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "The hotel looks antique with its great heritage but it desperately needs a serious maintenance. The room was neat and tidy. The washroom, hot water were not running, the cushion cover and the bed runners are too old, and the curtains are also run down, even the windows were dirty. The service overall were satisfactory, the staff were quite polite, the buffet seating area is in great need of makeover. It is regrettable to point out that such a remarkable hotel seating in a perfect location, to be so close to its truly beautiful state just out of loutrous touch.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Cannot complain about the location . It's perfect!!!\nThe rooms are royal, so is the view and the ambience .\nService needs a major upgrade.\nThe bridal suites have the common toilet drainage running into the bathing area. So it stinks like a gutter the entire room everytime someone shots or pees.\n\nWe recently went for my sister's wedding.\nNeeds a lot of maintenance ...\nI had to send my man to buy Ala Robin bleach and pour it into the drains , show the staff that till they re route the drainage system which is severely lacking .",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This property is on one of the best location of Ajmer ..how ever the maintainance is the major issue .There is no proper upkeep .The hotel owner has to start thinking for the same or else he should tie up with some good renowned group for managing the same.The prices are also equal to some good managed property. So customer do not get value for their money .the size of room are BiG and view from some rooms are also very nice ..Food is OK ..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "An old styled Heritage hotel known for its legacy.\n\nNear to Daulat baag and Anna Sagar Lake with beautiful view and luxury.\n\nEnough space for car parking at two levels.\n\nGood space for weddings and functions.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Attended marriage function only. So no reviews for rooms, services and activities. Ambiance was good. Space management seen one of the better in recent times. Views are good in all directions. Parking space is a problem as usual.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel looks antique great heritage desperately needs serious maintenance room neat tidy washroom hot water running cushion cover bed runners old curtains also run even windows dirty service overall satisfactory staff quite polite buffet seating area great need makeover regrettable point remarkable hotel seating perfect location close truly beautiful state loutrous touch",
                "complain location perfect rooms royal view ambience service needs major upgrade bridal suites common toilet drainage running bathing area stinks like gutter entire room everytime someone shots pees recently went sisters wedding needs lot maintenance send man buy ala robin bleach pour drains show staff till route drainage system severely lacking",
                "property one best location ajmer ever maintainance major issue proper upkeep hotel owner start thinking else tie good renowned group managing samethe prices also equal good managed property customer get value money size room big view rooms also nice food ok",
                "old styled heritage hotel known legacy near daulat baag anna sagar lake beautiful view luxury enough space car parking two levels good space weddings functions",
                "attended marriage function reviews rooms services activities ambiance good space management seen one better recent times views good directions parking space problem usual"
            ]
        },
        {
            "name": "Hotel LN Courtyard",
            "rating": [
                4.2
            ],
            "address": [
                "Road, near Sbbj Bank, Shastri Nagar, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Very bad experience, staff was very bad and rude , they don't have manners to attend and welcome  guest , no politeness and humbleness has seen in any staff members, and they have very dirty pillow and blankets, and the bed  is very small queen size if you are taking good amount for the room then you also have to provide good room service to your guest and if you are tall then you have to be very alert about the fan, bcoz the distance between the floor and fan is very less, it may injured you. I will never recommended this hotel to anyone and for sure I will also not booked this hotel ever in my Life..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Had stayed here for one night. Centrally located in Ajmer and easily accessible by local auto. They have limited parking space as well in case you are coming by your own car. I stayed here for one night in deluxe room with 2 A and 2 kids. Barring some small issues, it was a good modern setup hotel. Front desk was super helpful . They have a rooftop bar as well. Nothing major for kids, wifi signal was good.  Overall no major issues and good for small stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the finest hotels in the heart of Ajmer. This quality property does give you all the required amenities which you expect from any 4/5 star hotel. This place is approximately 10-12 minutes from the railways station ( consider going by an auto) and is on the main road near the local market.\nThe bar and the food menu is really diverse and one can find anything and everything.\nThe room was spacious and the interiors were great too.\nThe staff and the line manager,Manoj was courteous and one could feel it while conversing.\nFor those who don't wish to spend more on in house booze are recommended to buy from outside.\nThe other must places to visit are not too far from this property\nSo, do give this hotel a try and take out your inner vlogger to comment further.\nAdios.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's situated near Jawahar Rangmanch. It's a hotel and restaurant. Hotel rooms are quite good and clean. Food is also very good but it's not pocket friendly. Free parking is available here. And wheelchair is also accessible. Ajmer railway station is near about 1.5km from here and ajmer bus stand is near about 1km.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good room very good service very good location so beautiful so elegant just looking like wooow",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience staff bad rude dont manners attend welcome guest politeness humbleness seen staff members dirty pillow blankets bed small queen size taking good amount room also provide good room service guest tall alert fan bcoz distance floor fan less may injured never recommended hotel anyone sure also booked hotel ever life",
                "stayed one night centrally located ajmer easily accessible local auto limited parking space well case coming car stayed one night deluxe room kids barring small issues good modern setup hotel front desk super helpful rooftop bar well nothing major kids wifi signal good overall major issues good small stay",
                "one finest hotels heart ajmer quality property give required amenities expect star hotel place approximately minutes railways station consider going auto main road near local market bar food menu really diverse one find anything everything room spacious interiors great staff line managermanoj courteous one could feel conversing dont wish spend house booze recommended buy outside must places visit far property give hotel try take inner vlogger comment adios",
                "situated near jawahar rangmanch hotel restaurant hotel rooms quite good clean food also good pocket friendly free parking available wheelchair also accessible ajmer railway station near km ajmer bus stand near km",
                "good room good service good location beautiful elegant looking like wooow"
            ]
        },
        {
            "name": "The Archis Castle",
            "rating": [
                4.3
            ],
            "address": [
                "Nehru Nagar, Madar, near bhero Mandir, Adarsh Nagar, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Wonderful place to spend an evening. Food is good but a little overpriced. The ambiance is great. They should keep a baby chair in a restaurant so that parents with young kids can enjoy the food.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Archis Castle is a wonderful place, the hotel here is very beautiful, it would be great to come with family, there is a fake aeroplane, a bot in the hotel, only if you want to be photographed then you can come here.\n\nThis place is built on a deserted place, which makes it very interesting. It is a very big resort, there is a lift facility, there is a restaurant and there is also a separate room for sitting.\n\nThere is a huge airplane built above this resort which has the facility to sit. After sitting inside it, you will get the feeling of being on a real plane. There are many statues in this resort which are very beautiful.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Place is good to visit. Good place to explore. Rooftop is really good and they have small Disc kind of place where anyone can dance and enjoy and it's free.\n\nFood quality is good but day by day they are degrading the taste",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The view is nice but it's not worth going all the way for food. The restaurant had a lot of flies, the washroom was dirty, it was overpriced and the food didn't even taste good. The staff isn't nice either.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good place to visit with family, nice ambience, good food but not for events purpose like anniversaries or marriages as they have the worst management team, no corporation from staff, no help in case of emergencies plus the prices are overhyped",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wonderful place spend evening food good little overpriced ambiance great keep baby chair restaurant parents young kids enjoy food",
                "archis castle wonderful place hotel beautiful would great come family fake aeroplane bot hotel want photographed come place built deserted place makes interesting big resort lift facility restaurant also separate room sitting huge airplane built resort facility sit sitting inside get feeling real plane many statues resort beautiful",
                "place good visit good place explore rooftop really good small disc kind place anyone dance enjoy free food quality good day day degrading taste",
                "view nice worth going way food restaurant lot flies washroom dirty overpriced food didnt even taste good staff isnt nice either",
                "good place visit family nice ambience good food events purpose like anniversaries marriages worst management team corporation staff help case emergencies plus prices overhyped"
            ]
        },
        {
            "name": "Hotel Sanwar Sharif",
            "rating": [
                4.2
            ],
            "address": [
                "FJ6H+295, Dargah Bazar, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "This hotel is good.reasonable during Ramadan.People are supportive.nearby dargah very accessible by walk.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice Room And Nice Helper To All item Is A Wonderful",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Visit only if you're pro believer I like their cleaning",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice place , must visit for blessings",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent service. They have not given GST Bill to any Customer No Bill  But charged for every thing.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel goodreasonable ramadanpeople supportivenearby dargah accessible walk",
                "nice room nice helper item wonderful",
                "visit youre pro believer like cleaning",
                "nice place must visit blessings",
                "excellent service given gst bill customer bill charged every thing"
            ]
        },
        {
            "name": "Hotel Ajmer Inn",
            "rating": [
                4.1
            ],
            "address": [
                "Churi Bazar, Purani Mandi, near Nagar Nigam, Naya Bazaar, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Obviously I have choosen this hotel after seeing the reviews. We were amazed too seeing the property.\n\nBut heartfelt!!!\nWe have an unusual experience that this hotel has thieves too. Entire staff and the owner.\n\nFirstly our train was delayed hence we checked in late at night around 11/11:30pm and they asked us to checkout by 12noon, though we agreed as we were here to seek blessings. However they cooperated to keep our luggage at their luggage room, unfortunately they did not have cctv in that room (which we totally forgot to check) and the toss, our wallet got disappeared from the bag along with 1 of the adhar card kept in the same place. Staff and the owner are least bothered to help us. Because of them we missed our next train. We literally begged to give us the ID’s and cards atleast.\n\nWe all were seating at the reception and the staff’s like ignoring us like what can we do.\n\nIs this the hospitality…? Shame on you thieves.\n\nPeople Be Wise before selecting!!!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "one of the best decisions to chose this hotel ajmer inn.A very good property located in centre of city.  friendly staff specially reception Manager Mr Dinesh , He is nice  person. well Maintained Property,Highly Recommend.....",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice n pleasant stay with family just because of Mr virender he was so co operative n understand us. upgraded our room also,and dealing with guest he knows so well.Mr .Virender is always  there for us n he concern about us.. Thanku.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "One week ago I stayed in this Hotel\nLocation of Hotel is very much convenient to all major areas of Ajmer\nFacilities in hotel & hospitality is marvellous in Hotel Ajmer Inn\nMr.Dinesh sir is very polite, very caring person & with his help my Dargah darshan has become very easy & I never forget his help, special thanks to him\nMr. Veerender sir also very nice person & polite & helpful person\nFinally it's a wonderful & marvellous journey\nThank you so much Hotel Ajmer Inn & Make My Trip",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice rooms. Good staff. Well maintained.\nLots thanks to. Virendra Singh.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "obviously choosen hotel seeing reviews amazed seeing property heartfelt unusual experience hotel thieves entire staff owner firstly train delayed hence checked late night around pm asked us checkout noon though agreed seek blessings however cooperated keep luggage luggage room unfortunately cctv room totally forgot check toss wallet got disappeared bag along adhar card kept place staff owner least bothered help us missed next train literally begged give us idâ\u0080\u0099s cards atleast seating reception staffâ\u0080\u0099s like ignoring us like hospitalityâ\u0080¦ shame thieves people wise selecting",
                "one best decisions chose hotel ajmer inna good property located centre city friendly staff specially reception manager mr dinesh nice person well maintained propertyhighly recommend",
                "nice n pleasant stay family mr virender co operative n understand us upgraded room alsoand dealing guest knows wellmr virender always us n concern us thanku",
                "one week ago stayed hotel location hotel much convenient major areas ajmer facilities hotel hospitality marvellous hotel ajmer inn mrdinesh sir polite caring person help dargah darshan become easy never forget help special thanks mr veerender sir also nice person polite helpful person finally wonderful marvellous journey thank much hotel ajmer inn make trip",
                "nice rooms good staff well maintained lots thanks virendra singh"
            ]
        },
        {
            "name": "The Royal Melange Beacon, Ajmer",
            "rating": [
                4.1
            ],
            "address": [
                "Power House, Jaipur Rd, Opposite City, Sundar Vilas, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Very helpful staff. Well appointed rooms. Though we stayed only overnight, facilities provided were very good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hotel prices are reasonable\nRooms are nice\nStaff Behaviour is also good.\nParking facility available\nOne good thing about this hotel is location\nLocation is near main market you can find anything from the market at midnight also\n\nHotel nearby bus stand area\nOverall experience is good",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I had a fantastic stay at the hotel! The staff was incredibly friendly and went above and beyond to make our visit memorable. They not only arranged a visit to Ajmer Shareef Dargah but also accompanied a khadim who recited dua, enhancing our experience. The gesture of offering a discount on our second-day stay showcased their commitment to customer satisfaction. Highly recommend this hotel for its hospitality and thoughtful service.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Overall is a wonderful place and had a nice stay. The staff is very cooperative and having good behaviour. The is a scope of improvement in food variety specially in starter..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Big room, comfy beds, good air con, excellent breakfast, very nice staff, quiet at night.\nWi fi and hot water were patchy.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "helpful staff well appointed rooms though stayed overnight facilities provided good",
                "hotel prices reasonable rooms nice staff behaviour also good parking facility available one good thing hotel location location near main market find anything market midnight also hotel nearby bus stand area overall experience good",
                "fantastic stay hotel staff incredibly friendly went beyond make visit memorable arranged visit ajmer shareef dargah also accompanied khadim recited dua enhancing experience gesture offering discount secondday stay showcased commitment customer satisfaction highly recommend hotel hospitality thoughtful service",
                "overall wonderful place nice stay staff cooperative good behaviour scope improvement food variety specially starter",
                "big room comfy beds good air con excellent breakfast nice staff quiet night wi fi hot water patchy"
            ]
        },
        {
            "name": "HOTEL VIVAN PINNACLE",
            "rating": [
                4.1
            ],
            "address": [
                "NEETI MARG, 260/4, Jaipur Rd, Muslim Mochi Mohalla, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "Very poor hospitality, we had to keep our luggage in room and then during checkout also.\nThe standards were high in ajmer but this hotel serves tasteless food.\nRooms were not cleaning. We booked suite and there was dust in the room as if the rooms has not been opened from days.\n\nIn mmt hotel has mentioned there is parking but there is parking only for 2 vehicles. Don't trust this hotel by mmt or any other online platform.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We stayed for 2 Nights in Vivan Pinnacle Ajmer and we want to share our below experience.\n\nLocation, Rooms, Services is very good but We do not suggest if you are a Family. This hotel is having Liquor Bar on the ground floor and You feel very uncomfortable when you come to reception area. We also have a horrible night due to drunked peoples Shouting and bad noices till 2.45 AM. So don't take a risk with family.\n\nOther thing is Food. It is overcharged and not up to the mark in Taste.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "it's a great place to stay and location is very good just five minutes away from station and bus stand.... completely corporate hotel...if u have budget around 2000-2500 then u must try this place.... restaurant is costly....some people criticise for darkness in the room but IMO it is not like that after that u'll get good vibes in the room as interior is too good....",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We stayed for one night We have traveled extensively but never before experienced this level of quality and service. Every part of the experience seems to have been choreographed to meet the needs of the guests. From the welcome to departure the service and hospitality from all staff sets this hotel to marvel at Food was very good, specially the breakfast buffet which had a variety of options and the manager made sure we didn't have to wait during the breakfast buffet. He also went an extra mile to We had a great time, thank you",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The room was tidy and spacious. The washroom was clean and hygienic. The location of the hotel was to a great distance from the railway station, ajmer fort, Ajmer Sharif Dargah and Ana Sagar lake.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "poor hospitality keep luggage room checkout also standards high ajmer hotel serves tasteless food rooms cleaning booked suite dust room rooms opened days mmt hotel mentioned parking parking vehicles dont trust hotel mmt online platform",
                "stayed nights vivan pinnacle ajmer want share experience location rooms services good suggest family hotel liquor bar ground floor feel uncomfortable come reception area also horrible night due drunked peoples shouting bad noices till dont take risk family thing food overcharged mark taste",
                "great place stay location good five minutes away station bus stand completely corporate hotelif u budget around u must try place restaurant costlysome people criticise darkness room imo like ull get good vibes room interior good",
                "stayed one night traveled extensively never experienced level quality service every part experience seems choreographed meet needs guests welcome departure service hospitality staff sets hotel marvel food good specially breakfast buffet variety options manager made sure didnt wait breakfast buffet also went extra mile great time thank",
                "room tidy spacious washroom clean hygienic location hotel great distance railway station ajmer fort ajmer sharif dargah ana sagar lake"
            ]
        },
        {
            "name": "LODHA INN",
            "rating": [
                3.8
            ],
            "address": [
                "Prithivi Raj Marg Gandhi Bhawan Circle, Nr Nagar Nigam, Railway Colony, Ajmer, Rajasthan 305001, India"
            ],
            "reviews": [
                {
                    "text": "A nice and budgeted place to stay in Ajmer. Very big property with different size of rooms from big rooms to small rooms\nThe staff and service also was very good.  Had dinner yesterday in their restuarant, it was really very delicious",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The Lodha Inn Ajmer is a great place to stay. though basic the rooms are big and spacious.  There is a chaiwala around all the time.\nThe kitchen has good vegetarian food.\nThe compound is safe for children to play with in the complex.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Room is clean & Good for 2 person in 1000+gst....\nDinner test is good (gujarati test ) in only 140/-",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The rooms differ based on your requirement. It's proximity to the ajmer railway station makes it ideal place for stay if you are looking for homely accomodation.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It's my first day here and it's nice place to stay as well as this place is near the main ajmer junction railway station. The staff is polite.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice budgeted place stay ajmer big property different size rooms big rooms small rooms staff service also good dinner yesterday restuarant really delicious",
                "lodha inn ajmer great place stay though basic rooms big spacious chaiwala around time kitchen good vegetarian food compound safe children play complex",
                "room clean good person gst dinner test good gujarati test",
                "rooms differ based requirement proximity ajmer railway station makes ideal place stay looking homely accomodation",
                "first day nice place stay well place near main ajmer junction railway station staff polite"
            ]
        }
    ]
}