{
    "places_with_reviews": [
        {
            "name": "Palm Galaxy",
            "rating": [
                3.9
            ],
            "address": [
                "NH-2, Etmadpur, Agra, Dharera, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Best Experience At This Place, Good Place For Staff Meeting Any Ocassion. Good Food.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Mattress are not comfortable in the rooms. One may get survical pain after sleeping.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good hotel however, in the outskirts of Agra. Good rooms, Good food and Good staff. Only challenge is to find any ola, Uber for commutation.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good place for wedding events.\nShould have a proper safe parking facility though.\nAnd valet parking too is required.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "So hotel palm galaxy has been built atop the rashtradeep restaurant, an old and famous dhaba which has evolved into a fine restaurant. It has decent, clean rooms which can be used for short business/couple/family trips. Food can be a limitation here though, since Zomato and swiggy are not available and the restaurant serves mainly Desi Indian food.\n\nThe service is decent, I had a minor electricity issue which took time to fix but the staff was apologetic about it so that's good.\n\nOverall though, it offers good value for the cost they charge and I'd be okay with a second stay here if the need so arises.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best experience place good place staff meeting ocassion good food",
                "mattress comfortable rooms one may get survical pain sleeping",
                "good hotel however outskirts agra good rooms good food good staff challenge find ola uber commutation",
                "good place wedding events proper safe parking facility though valet parking required",
                "hotel palm galaxy built atop rashtradeep restaurant old famous dhaba evolved fine restaurant decent clean rooms used short businesscouplefamily trips food limitation though since zomato swiggy available restaurant serves mainly desi indian food service decent minor electricity issue took time fix staff apologetic thats good overall though offers good value cost charge id okay second stay need arises"
            ]
        },
        {
            "name": "Satkar Hotel - Best Wedding Venue in Tundla, Best Wedding Lawn in Tundla, Pure Vegetarian Restaurant, Couple Cafe in Tundla",
            "rating": [
                4
            ],
            "address": [
                "Agra Rd, near fh medical college, Tundla, Mohammadabad, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Hotel service was was really amazing. Food was also tasty. Room was good but its expensive for me. But dine experience was really awesome.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "According to me this place is quite expensive and the some of the dishes(veg.maggie,chole bhatoore and burger)was also not worthy.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "On prime location near by FH medical College tundla, food and ambience is very nice, you can enjoy in ac hall also in open area.. choice is yours,just come with your family and friends and have fun",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place for family dinners as there's no place in tundla where you can get such a good ambiance + well mannered staff and THE Best food all together at a single place. Will visit again.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food was nice but the staff was a little bit bad like they did not even talked properly like they were in a rush I said them to wash the plates properly 1 time but they said like we don't have this much time and when he gave the plates they were not washed and bathroom was so dirty in simple words the food was good but service was bad",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel service really amazing food also tasty room good expensive dine experience really awesome",
                "according place quite expensive dishesvegmaggiechole bhatoore burgerwas also worthy",
                "prime location near fh medical college tundla food ambience nice enjoy ac hall also open area choice yoursjust come family friends fun",
                "best place family dinners theres place tundla get good ambiance well mannered staff best food together single place visit",
                "food nice staff little bit bad like even talked properly like rush said wash plates properly time said like dont much time gave plates washed bathroom dirty simple words food good service bad"
            ]
        },
        {
            "name": "Royal garden hotel and guest house",
            "rating": [
                3.9
            ],
            "address": [
                "Railway Station Rd, Kothi No 1, Tundla, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Does not a good experience but is average experience on my site stop was good 🔥🤟",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Its a good hall for party located in tundla station road.\nIts location is very good cause its on main road.\nThe lawn is very spacious. Having capacity to hold large parties.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is a nice place for weeding and party. It is greenish field with proper designing and completely look very nice. The field is medum size not too large and not too small. There is proper rest room for the weeding guest and i can go there many times, so it is nice weeding resort..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good restaurant. Excellent food!",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice place fir wedding",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good experience average experience site stop good ð\u009f\u0094¥ð\u009f¤\u009f",
                "good hall party located tundla station road location good cause main road lawn spacious capacity hold large parties",
                "nice place weeding party greenish field proper designing completely look nice field medum size large small proper rest room weeding guest go many times nice weeding resort",
                "good restaurant excellent food",
                "nice place fir wedding"
            ]
        },
        {
            "name": "Flagship 72863 New Satkar Hotel",
            "rating": [
                3.8
            ],
            "address": [
                "Agra Rd, near F.H Medical College, Tundla, Mohammadabad, Uttar Pradesh 282007, India"
            ],
            "reviews": [
                {
                    "text": "Overall a decent stay. Had to change rooms and pay extra for it, service was great, food was amazing, and it's near a highway quite outside the city so travel becomes a hassle.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very well managed hotel. So neat and clean room,bathroom. Staff behaved nicely to us. Thank you",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Its better to avoid this facade hotel. Don't fall for the outer beauty. Rooms have bugs.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food quality is very good but very expensive",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It's nice to stay here . Nice services and good staff",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall decent stay change rooms pay extra service great food amazing near highway quite outside city travel becomes hassle",
                "well managed hotel neat clean roombathroom staff behaved nicely us thank",
                "better avoid facade hotel dont fall outer beauty rooms bugs",
                "food quality good expensive",
                "nice stay nice services good staff"
            ]
        },
        {
            "name": "OYO 36958 Rama Hotel & Restaurant",
            "rating": [
                3.5
            ],
            "address": [
                "Subhash Chauraha, in front of bus stand, Tundla, Tundli, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "The Most Dramatic Hotel I Had Ever Stayed In... They Don't Take Online Bookings, U Have To Book Rooms After Reaching The Hotel At Their Fixed Price... The Staff Have Their Own Tantrums, They Don't Take Orders Before 10AM... The Hotel Staffs Are Very Arrogant... They Don't Accept Their Mistakes They Start Arguing With U... On A Personal Note I Don't Prefer Anyone To Book This Hotel...🤬🤬🤬",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Staff nature is very good. Honour Mr. Padam Gupta & Aman Gupta both are gentle man. Everyone treat the coustomer very politely. Good taste is gud. Rooms luking wise good. Lift also available in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "I have used oyo services many times in my life but this time my experience in oyo was very bad because there was no responsible person who can listen and solve our problems here light It is a big issue because the light keeps going on every one or two hours and because of that such can not be used, because of this I did not like this hotel at all nor did I like the behavior of the hotel management. It seemed to me that the hoteliers did us a favor by booking the hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Great food at affordable prices. Loved the ambient atmosphere inside the restaurant, even the service was swift and great.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Don't go this hotel ever. The owner is a drunker.. he don't know how to talk with clients. They have 4 to 5 Gunda type people's.. they threatened to clients and increase the rate at the time of check out",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "dramatic hotel ever stayed dont take online bookings u book rooms reaching hotel fixed price staff tantrums dont take orders hotel staffs arrogant dont accept mistakes start arguing u personal note dont prefer anyone book hotelð\u009f¤¬ð\u009f¤¬ð\u009f¤¬",
                "staff nature good honour mr padam gupta aman gupta gentle man everyone treat coustomer politely good taste gud rooms luking wise good lift also available hotel",
                "used oyo services many times life time experience oyo bad responsible person listen solve problems light big issue light keeps going every one two hours used like hotel like behavior hotel management seemed hoteliers us favor booking hotel",
                "great food affordable prices loved ambient atmosphere inside restaurant even service swift great",
                "dont go hotel ever owner drunker dont know talk clients gunda type peoples threatened clients increase rate time check"
            ]
        },
        {
            "name": "Hotel J.S. Restaurant",
            "rating": [
                3.8
            ],
            "address": [
                "Baghel Market , In front of Royal Garden Station Road, Dist, Tundla, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Worst experience so far, upon check in I informed for a 3 days stay. The person agreed. Next day he got a booking for marriage at higher price and asked me to vacate as I was offered room at a low price. What unprofessional behaviour, greedy owner and very rude. That is the reason they don't flourish. Highly not recommended",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "After an unexpected train delay we sought overnight stay near to Tundla Junction. Average facilities but it was good to have a shower and bed for night. Bathroom let it down by Indian standards.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Would recommend not to come to this hotel.very dirty rooms , not well maintained, front office person behaviour not good. rooms were available but here they would show you expensive rooms.No hot water..Worst hotel .",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I highly recommend that you never stay at this hotel.they were very rude and they missguide you. very high charges for a small rooms with a thin blanket.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Some main course were tasty like Mutter paneer, dal fry. Overall ambience and service needs improvement. However, given the town , this is more manageable restaurant option. The hotel is pathetic. Rooms are horrible. Don't stay at all.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst experience far upon check informed days stay person agreed next day got booking marriage higher price asked vacate offered room low price unprofessional behaviour greedy owner rude reason dont flourish highly recommended",
                "unexpected train delay sought overnight stay near tundla junction average facilities good shower bed night bathroom let indian standards",
                "would recommend come hotelvery dirty rooms well maintained front office person behaviour good rooms available would show expensive roomsno hot waterworst hotel",
                "highly recommend never stay hotelthey rude missguide high charges small rooms thin blanket",
                "main course tasty like mutter paneer dal fry overall ambience service needs improvement however given town manageable restaurant option hotel pathetic rooms horrible dont stay"
            ]
        },
        {
            "name": "Parivaar Hotel and Family Restaurant",
            "rating": [
                3.3
            ],
            "address": [
                "Railway Station Rd, Kothi No 1, Tundla, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Please find my review in points below.\n\n1. Good ambience.\n2. Hygienic.\n3. I ordered Dal Makhni and Kabli Naan. Both were awesome and delicious, specifically Dal Makhni which had a unique taste.\n4. The service was good but could be improved slightly.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Parivaar hotel is approximately 2 km from railway station. I have visited tundla many times but this hotel for accomodation for the first time. This is perfect for budget accommodation and short stay. Very reasonable in cost around Rs 800 per night. They also have restaurant which serves normal food and nothing fancy. Overall this is a good stay for transit or if you have some work in tundla. I would also recommend this hotel for people visiting for annual satsang program.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Stayed in the hotel and ate at the restaurant. Food was well-made and tasty, though service was quite slow (it took 30 minutes to make us coffee, and the restaurant had almost nobody else in it). Servers were friendly. Room was okay. There was a tv, AC, fans, a balcony with a nice view of the street, a big bed (bring your own sheets/blankets), and a bathroom. The bathroom had a Western-style toilet, a sink, and a shower (which was essentially just a pipe that shot one stream of water out of the wall). Overall, this was what I expected from a hotel in a small town in India.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Decent hotel, i was in a single room, the price is really low, they charged 600 rs each day and the most important thing is, both the TV and AC don't work. And i think they're completely aware of that. And rooms are clean",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Stayed in hotel in the last fortnight for 2 days.rate for ac room quoted as 1200₹ non ac room ₹800.on persuasion came down to 1000 & 600 respectively.i opted for non ac.room etc was ok.there was a TV,geyser  .a restaurant also which are a rare sight in tundla.but restaurant ok for family get-together but not for an individual as it works out costly.generally ate at a close-by dhaba type jt.quite reasonable with dal,roti,chawal.bagal maine beer/wine shop as well for those interested in it.bagal maine Jio mobile,clothes,general merchants store+a local delicacy bedai(stuffed kachori/jalebi/dahi/chai shop .very easily accessible to rly.station.auto raat bhar chalti hain.i had to take a morning 4 o'clock train.wondering whether would get conveance but got it within 5 mts.hotel needs maintenance but in a tundla type down town it is a good place to sleepover and rest.no doubt rates were further negotiable but I didn't bargain further as I found it a good proposition for passing of my time.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "please find review points good ambience hygienic ordered dal makhni kabli naan awesome delicious specifically dal makhni unique taste service good could improved slightly",
                "parivaar hotel approximately km railway station visited tundla many times hotel accomodation first time perfect budget accommodation short stay reasonable cost around rs per night also restaurant serves normal food nothing fancy overall good stay transit work tundla would also recommend hotel people visiting annual satsang program",
                "stayed hotel ate restaurant food wellmade tasty though service quite slow took minutes make us coffee restaurant almost nobody else servers friendly room okay tv ac fans balcony nice view street big bed bring sheetsblankets bathroom bathroom westernstyle toilet sink shower essentially pipe shot one stream water wall overall expected hotel small town india",
                "decent hotel single room price really low charged rs day important thing tv ac dont work think theyre completely aware rooms clean",
                "stayed hotel last fortnight daysrate ac room quoted â\u0082¹ non ac room â\u0082¹on persuasion came respectivelyi opted non acroom etc okthere tvgeyser restaurant also rare sight tundlabut restaurant ok family gettogether individual works costlygenerally ate closeby dhaba type jtquite reasonable dalrotichawalbagal maine beerwine shop well interested itbagal maine jio mobileclothesgeneral merchants storea local delicacy bedaistuffed kachorijalebidahichai shop easily accessible rlystationauto raat bhar chalti haini take morning oclock trainwondering whether would get conveance got within mtshotel needs maintenance tundla type town good place sleepover restno doubt rates negotiable didnt bargain found good proposition passing time"
            ]
        },
        {
            "name": "SPOT ON 48578 Hotel Star",
            "rating": [
                3.5
            ],
            "address": [
                "NH2, Etmadpur Nagar Palika Office, Etmadpur, Agra, Etmadpur, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "These hotels are just for couples who spend one or two hours.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Staff  Very bad\nNd room ac  not working nd room is not clean\nBad experience",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "It near ION DIGITAL ZONE kuberpur aagra tundla highway.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Worrang place",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Ok for just for staying a night",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotels couples spend one two hours",
                "staff bad nd room ac working nd room clean bad experience",
                "near ion digital zone kuberpur aagra tundla highway",
                "worrang place",
                "ok staying night"
            ]
        },
        {
            "name": "OYO 70541 Radha Krishna",
            "rating": [
                4.2
            ],
            "address": [
                "Resort, Near, Tundla, Tundli, Uttar Pradesh 283103, India"
            ],
            "reviews": [
                {
                    "text": "Nice hotel 🏨 and staff",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Awesome 👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good service",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good hotels",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice hotel ð\u009f\u008f¨ staff",
                "awesome ð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "good service",
                "good",
                "good hotels"
            ]
        },
        {
            "name": "HOTEL SARHANA",
            "rating": [
                4.3
            ],
            "address": [
                "NH2 HIGHWAY, ROAD, KANPUR, Tundla, Uttar Pradesh 283204, India"
            ],
            "reviews": [
                {
                    "text": "Very hospitable staff ..... must to visit ..... food is super delicious . Everything about hotel was exceptional. Rooms were Clean ,roomy, stylish and great value for money .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very hospitable staff room so hygienic and clean and hot water geyser available and food also delicious 😋",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice Clean hotel. Had a pleasant stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "very nice service and food interior so cool❤️🤤🤤",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Excellent food taste must visit on hotel ❤️☺️☺️",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hospitable staff must visit food super delicious everything hotel exceptional rooms clean roomy stylish great value money",
                "hospitable staff room hygienic clean hot water geyser available food also delicious ð\u009f\u0098\u008b",
                "nice clean hotel pleasant stay",
                "nice service food interior coolâ\u009d¤ï¸\u008fð\u009f¤¤ð\u009f¤¤",
                "excellent food taste must visit hotel â\u009d¤ï¸\u008fâ\u0098ºï¸\u008fâ\u0098ºï¸\u008f"
            ]
        }
    ]
}