{
    "places_with_reviews": [
        {
            "name": "Hotel Plaza",
            "rating": [
                3.3
            ],
            "address": [
                "B. K, K. Road, Barpeta, Assam 781301, India"
            ],
            "reviews": [
                {
                    "text": "For the price they are charging, the maintenance of the room is not upto mark. They charged 1600, for an AC room. The washroom was dirty and the taps were leaking. The room was extremely congested, considering the price tag of Rs.1600. The bed sheets were stained and had holes.\n\nIf kept clean and maintained well, it can be an okay place to stay at.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Stayed there few times. Everytime I had a wonderful experience. Staff & management is very friendly and helpful also",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Not stayed there. But went nearby area.any way lodging is to some extent good not bad and location is in the heart of the town",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Best service at night stay ,AC facility available here . family hotel best & good . barpeta middle place at Hotel PLAZA .Best of Good service",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Room service is not so good. Room rent is high compared room quality.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "price charging maintenance room upto mark charged ac room washroom dirty taps leaking room extremely congested considering price tag rs bed sheets stained holes kept clean maintained well okay place stay",
                "stayed times everytime wonderful experience staff management friendly helpful also",
                "stayed went nearby areaany way lodging extent good bad location heart town",
                "best service night stay ac facility available family hotel best good barpeta middle place hotel plaza best good service",
                "room service good room rent high compared room quality"
            ]
        },
        {
            "name": "Hotel Manas",
            "rating": [
                3.7
            ],
            "address": [
                "Amolapatty, Dr, BK Rd, Barpeta, Assam 781301, India"
            ],
            "reviews": [
                {
                    "text": "I have never stayed in a hotel in Barpeta until yesterday. One of colleagues referred to Hotel Manas and I stayed in the hotel on 18th April last. Staying at Manas has been a very good experience for me. I stayed in a room on the ground floor. The room was spotlessly clean and linens were too very clean. Bathroom is well maintained.  Service of the staff is ok. Parking is a little small. However,location of the hotel is superb. I advise the management to think about providing food on order.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "For Restaurants in Barpeta . Rated 3.7 based on 32 Customer Reviews and Ratings with 5 Photos. Check Menu, Offers, Prices, ...\n\n￼\nIt is a very nice hotel",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good environment,  clean hotel.\nStuff behaviour is also good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Neat and clean and proper place in barpeta town.Manas hotel owner behavior is good.Overall good experience.You can definitely refer Manas hotel",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hotel in barpeta town. Clean room and bathroom, stuff behaviour is also good. Price is also affordable..",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "never stayed hotel barpeta yesterday one colleagues referred hotel manas stayed hotel th april last staying manas good experience stayed room ground floor room spotlessly clean linens clean bathroom well maintained service staff ok parking little small howeverlocation hotel superb advise management think providing food order",
                "restaurants barpeta rated based customer reviews ratings photos check menu offers pricesâ ï¿¼ nice hotel",
                "good environment clean hotel stuff behaviour also good",
                "neat clean proper place barpeta townmanas hotel owner behavior goodoverall good experienceyou definitely refer manas hotel",
                "good hotel barpeta town clean room bathroom stuff behaviour also good price also affordable"
            ]
        },
        {
            "name": "Usha Regency",
            "rating": [
                3.1
            ],
            "address": [
                "Barpeta, Assam 781301, India"
            ],
            "reviews": [
                {
                    "text": "My experience here at Usha Regency was very bad..We booked two rooms for 1 night which was for 1200 each.The room was in the 1st floor .The room quality was very poor.They didnot maintain hygiene at all.the bathrooms had broken taps broken floor.The glasses provided in the room was full of cigarettes ashes which was not cleaned.They didn't have gyser facility in both the rooms. we were sent to another room to use the gyser at 2nd floor when inquired.After going there we found out those rooms were more spacious and better than the ones provided to us.\nThe room given to us was not worth the money.",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "Over priced\nThey charged 1200 per room and there was no hot water, AC was not working and TV also not working.\nWe found a 🐁 inside our room one day.\nRoom cleaning people rarely comes.\nThe only advantage is that there is elevator 🛗\nNo complementary breakfast given.\nThe bed was also very bad. The middle portion is dipped.",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "Bumla Pass...Indo-China Border (22.10.2023)",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "There are very few hotels in barpeta town.. Among them usha is probably the best to stay. Though it too need to improve a bit in cleanliness . Toilets and bedsheets are needed to be cleaner, and there is no fooding available. Ac/non Ac both rooms are available in various sizes according to rent. Location is quite good",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                },
                {
                    "text": "Not preferred for family. Maybe good for solo traveller.\nPlease verify room first after that only book.  confirm your rent before booking.",
                    "languageCode": "en",
                    "rating": [
                        3.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience usha regency badwe booked two rooms night eachthe room st floor room quality poorthey didnot maintain hygiene allthe bathrooms broken taps broken floorthe glasses provided room full cigarettes ashes cleanedthey didnt gyser facility rooms sent another room use gyser nd floor inquiredafter going found rooms spacious better ones provided us room given us worth money",
                "priced charged per room hot water ac working tv also working found ð\u009f\u0090\u0081 inside room one day room cleaning people rarely comes advantage elevator ð\u009f\u009b\u0097 complementary breakfast given bed also bad middle portion dipped",
                "bumla passindochina border",
                "hotels barpeta town among usha probably best stay though need improve bit cleanliness toilets bedsheets needed cleaner fooding available acnon ac rooms available various sizes according rent location quite good",
                "preferred family maybe good solo traveller please verify room first book confirm rent booking"
            ]
        },
        {
            "name": "Jonak Hotel & Restaurant",
            "rating": [
                4.3
            ],
            "address": [
                "9X5Q+HJ, Dona Kuchi, Garemara Pathar, Assam 781314, India"
            ],
            "reviews": [
                {
                    "text": "I had high expectations but was let down by the food quality. The place is suitable for photo shoots or gatherings, but the food doesn't match up. The naan I ordered was unexpectedly tough, requiring considerable effort to tear apart. While the interior is pleasing and the service is delivered with proper etiquette, unfortunately, the culinary experience fell short of satisfactory.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Its a great experience ... Good ambience , tasty food nd staffs are very nice.. Overall experience is satisfactory 👍",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Looks nyc and food quality is very good and testy and staff behaviour is awesome ...I like this Hotel",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Food is Superb, Employees behavior is very good Special Deep, Rahul and Rinku Da",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good service and fresh food item in a law price.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "high expectations let food quality place suitable photo shoots gatherings food doesnt match naan ordered unexpectedly tough requiring considerable effort tear apart interior pleasing service delivered proper etiquette unfortunately culinary experience fell short satisfactory",
                "great experience good ambience tasty food nd staffs nice overall experience satisfactory ð\u009f\u0091\u008d",
                "looks nyc food quality good testy staff behaviour awesome like hotel",
                "food superb employees behavior good special deep rahul rinku da",
                "good service fresh food item law price"
            ]
        },
        {
            "name": "Nijora Hotel",
            "rating": [
                4
            ],
            "address": [
                "Barpeta Road, Road, Muslimpatty, Barpeta, Assam 781309, India"
            ],
            "reviews": [
                {
                    "text": "Nicc",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nicc"
            ]
        },
        {
            "name": "Nizora Lodge",
            "rating": [
                4
            ],
            "address": [
                "82J3+5JF, Muslimpatty, Barpeta, Assam 781301, India"
            ],
            "reviews": [
                {
                    "text": "food quality are very good\ngood service give to costomer\nthis hotel are very famour\nclean room\nnice place\nlooking very nice\nso\ni like it",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice mess",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Awesome",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food quality good good service give costomer hotel famour clean room nice place looking nice like",
                "nice mess",
                "awesome"
            ]
        },
        {
            "name": "Zannat Hotel",
            "rating": [
                2
            ],
            "address": [
                "790, Sonkuchi, Bahmura, Assam 781314, India"
            ],
            "reviews": [
                {
                    "text": "N7uj",
                    "languageCode": "en-US",
                    "rating": [
                        2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nuj"
            ]
        },
        {
            "name": "Patowary hotel",
            "rating": [
                "Unknown"
            ],
            "address": [
                "82H4+G57, Barpeta-Mandia Road, Muslimpatty, Satra Baradi, Barpeta, Assam 781301, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Hotel Jam Jam",
            "rating": [
                4.5
            ],
            "address": [
                "9X3R+WMR, Bahmura, Assam 781314, India"
            ],
            "reviews": [
                {
                    "text": "Very Good Place For Taking Food...And There Have A Very Big Parking Place.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very good",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Average",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place taking foodand big parking place",
                "good",
                "average"
            ]
        },
        {
            "name": "MAA Hotel",
            "rating": [
                3
            ],
            "address": [
                "Muslipatty, Muslimpatty, Barpeta, Assam 781301, India"
            ],
            "reviews": [
                {
                    "text": "Very good",
                    "languageCode": "en",
                    "rating": [
                        3
                    ]
                },
                {
                    "text": "Borpeta",
                    "languageCode": "en-US",
                    "rating": [
                        3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good",
                "borpeta"
            ]
        }
    ]
}