{
    "places_with_reviews": [
        {
            "name": "Lords Plaza Ankleshwar",
            "rating": [
                4.1
            ],
            "address": [
                "C4/6, GIDC, Old National Highway No. 8, Ankleshwar GIDC, Ankaleshwar, Ankleshwar, Gujarat 393002, India"
            ],
            "reviews": [
                {
                    "text": "I stayed in Lords for 1 day business trip- room 212-The rooms are very spacious and clean. One suggestion, they can put a freshener like Godrej air, in the bathroom as it was giving stink smell. The staff is very courteous. The breakfast and dinner was excellent and food is very good indeed.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "My stay at this hotel was a bittersweet experience. The staff mannerisms, good food, and high service levels are commendable. However, the worn-out infrastructure was a letdown.\n\nWhile the hotel excels in human resources and service standards, there's a clear need for improvement in the infrastructure to enhance the overall guest experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I am sincerely grateful for the incredible kindness and cooperation extended by your staff. I wanted to express my heartfelt thanks for their prompt assistance in delivering my laptop charger safely to my home.\nTwo days after leaving the hotel room, I realized that my laptop charger was missing. The quick response and efficient service and daily follow up provided by your team were truly commendable. Their efforts have made a significant difference, and I am genuinely appreciative of their exceptional service.\nOnce again, thank you for the outstanding support and dedication of your staff.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A very nice place to stay.Neat and clean rooms and also house keeping staff is very supporting and well mannered specially Mr Nitish kumar.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Fantastic place to stay especially Gautam and Sonal were great to serve and positive attitude. Will recommend to my friends also.Superb experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed lords day business trip room rooms spacious clean one suggestion put freshener like godrej air bathroom giving stink smell staff courteous breakfast dinner excellent food good indeed",
                "stay hotel bittersweet experience staff mannerisms good food high service levels commendable however wornout infrastructure letdown hotel excels human resources service standards theres clear need improvement infrastructure enhance overall guest experience",
                "sincerely grateful incredible kindness cooperation extended staff wanted express heartfelt thanks prompt assistance delivering laptop charger safely home two days leaving hotel room realized laptop charger missing quick response efficient service daily follow provided team truly commendable efforts made significant difference genuinely appreciative exceptional service thank outstanding support dedication staff",
                "nice place stayneat clean rooms also house keeping staff supporting well mannered specially mr nitish kumar",
                "fantastic place stay especially gautam sonal great serve positive attitude recommend friends alsosuperb experience"
            ]
        },
        {
            "name": "Hotel Sadanand",
            "rating": [
                4.2
            ],
            "address": [
                "Sadanand Chokdi, Rajpipla Road, NH 48, Gadkhol Part, Hifazat Nagar, Ankleshwar, Gujarat 393002, India"
            ],
            "reviews": [
                {
                    "text": "Had been to Sadanand Suratkal , and one at crawford market mumbai , but this one surprised me , super food , super ambience , and their nonveg menu is too good ... Don't miss this place when you are at bharuch , ankleshwar 😋",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of best hotel in the Ankleshwar. I never found well manner staff in the any other mid range hotels in the Ankleshwar compare with this hotel.Food quality is very good and taste is delicious. Served the food with maintain proper hygiene. Dinning room is well maintained and interior is also very nice.  Front space garden is also very good facilities for waiting.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's nice place to stop for lunch or dinner if you are traveling mumbai to Ahmedbad.  Food quality is good. Service os excellent. On highway. Hygiene maintained.\nNorth Indian cuisine is best.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I love the food abd service there. It has been there with the same good quality since I was a kid. The service staff is always polite. The food is always delicious and the quality is also good. You can see the food is handled with care.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I had a wonderful stay at Hotel Sadanand in Ankleshwar during my motorcycle journey from Gujarat to Mumbai. The ambiance was delightful, the food was delicious, and the rooms were spotlessly clean. What truly stood out was the exceptional hospitality, with a special thanks to Mr. Karan at the reception for his outstanding service. I would highly recommend this hotel to fellow travelers.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sadanand suratkal one crawford market mumbai one surprised super food super ambience nonveg menu good dont miss place bharuch ankleshwar ð\u009f\u0098\u008b",
                "one best hotel ankleshwar never found well manner staff mid range hotels ankleshwar compare hotelfood quality good taste delicious served food maintain proper hygiene dinning room well maintained interior also nice front space garden also good facilities waiting",
                "nice place stop lunch dinner traveling mumbai ahmedbad food quality good service os excellent highway hygiene maintained north indian cuisine best",
                "love food abd service good quality since kid service staff always polite food always delicious quality also good see food handled care",
                "wonderful stay hotel sadanand ankleshwar motorcycle journey gujarat mumbai ambiance delightful food delicious rooms spotlessly clean truly stood exceptional hospitality special thanks mr karan reception outstanding service would highly recommend hotel fellow travelers"
            ]
        },
        {
            "name": "VITS Shalimar, Ankleshwar",
            "rating": [
                4.1
            ],
            "address": [
                "Valia Road, Near G.I.D.C. Reservoir, J274+VCH, Ankleshwar GIDC, Ankleshwar, Gujarat 393002, India"
            ],
            "reviews": [
                {
                    "text": "A very nice property. Very good food and smiling service. Stayed for 5 days.\nThey treat foreigners nicer than native Indians.\nThis is nothing less than 5 stars. But 4 are given as\n1. The water supply for room 308 was not with intermittent force sometimes on or off for the shower.\n2. The restaurant served us food pretty slowly. We wanted to have a quick lunch...but our first dish took more than 1 hr. They improved on the next days",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very lovely business types rooms.\nService is late and not too great\nLocation could have been better there are other things to do.\nVery noisy most of the time as there are weddings all throughout the year",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Vits Shalimar Hotel Ankleshwar, and it was truly a delightful experience. From the moment I entered, the warm and inviting ambiance set the tone for a memorable stay.\n\nThe rooms at Vits Shalimar are not only well-appointed but also exude comfort. The attention to detail in the room's decor and amenities was commendable, making my stay incredibly enjoyable.\n\nOne of the standout aspects of my visit was the culinary experience. The hotel's restaurant offered a diverse menu, and every dish I tried was a culinary delight. The chefs at Vits Shalimar have truly mastered the art of creating delicious and memorable meals.\n\nWhat sets Vits Shalimar apart, besides its comfortable accommodations and fantastic dining options, is the impeccable service. The staff went above and beyond to ensure that every aspect of my stay was enjoyable. Their friendliness and attentiveness added a personal touch to the overall experience.\n\nIn conclusion, Vits Shalimar Hotel Ankleshwar exceeded my expectations in every aspect. It's a perfect choice for those seeking a blend of luxury, excellent dining, and top-notch service. I highly recommend this hotel to anyone visiting Ankleshwar.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms are nice, the location is beautiful, and the food is also great but there is a big problem with the internet not working in certain Rooms. Staff had to be called several times before they responded to your demands.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is highly polluted area. Rooms maintenance is very poor, exhaust fan is not working in toilet, taps leakage, room size is small and tariff is very high. Quality of food is too bad. No proper service from the hotel management as well",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice property good food smiling service stayed days treat foreigners nicer native indians nothing less stars given water supply room intermittent force sometimes shower restaurant served us food pretty slowly wanted quick lunchbut first dish took hr improved next days",
                "lovely business types rooms service late great location could better things noisy time weddings throughout year",
                "recently pleasure staying vits shalimar hotel ankleshwar truly delightful experience moment entered warm inviting ambiance set tone memorable stay rooms vits shalimar wellappointed also exude comfort attention detail rooms decor amenities commendable making stay incredibly enjoyable one standout aspects visit culinary experience hotels restaurant offered diverse menu every dish tried culinary delight chefs vits shalimar truly mastered art creating delicious memorable meals sets vits shalimar apart besides comfortable accommodations fantastic dining options impeccable service staff went beyond ensure every aspect stay enjoyable friendliness attentiveness added personal touch overall experience conclusion vits shalimar hotel ankleshwar exceeded expectations every aspect perfect choice seeking blend luxury excellent dining topnotch service highly recommend hotel anyone visiting ankleshwar",
                "rooms nice location beautiful food also great big problem internet working certain rooms staff called several times responded demands",
                "location highly polluted area rooms maintenance poor exhaust fan working toilet taps leakage room size small tariff high quality food bad proper service hotel management well"
            ]
        },
        {
            "name": "Hotel Narmada Gate",
            "rating": [
                4
            ],
            "address": [
                "Hifazat Nagar, Ankleshwar, Gujarat 393001, India"
            ],
            "reviews": [
                {
                    "text": "It's an okish hotel. Nothing great about it.\nRooms are big but not well maintained.\nWe asked for large beds but got twin sharing beds.\nNo room service available. No lifts and we got room on 2nd floor.\nAmple parking available",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice place and well connected to the main road highways. The food quality is very good and freshly made. You will find good vegetarian thaali options in gujrati food. The tea, coffee and hot milk with sugar for kids is also available on demand. The quality of food is adequate and service is very quick. There is also option for you to pick local snack from the counter like biscuits, wafers and other local snack like peanut bar and peanuts, chewing gum, mint, chocolate bar etc",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotels with tasty food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hotel Narmada Gate is a popular hotel located in the city of Bharuch in Gujarat, India. The hotel offers a range of rooms, including deluxe and executive rooms, to cater to the needs of different travelers. The rooms are well-furnished and equipped with modern amenities like air conditioning, television, and Wi-Fi. The hotel also has a restaurant that offers a variety of dishes, including local Gujarati cuisine and other Indian and international delicacies. The restaurant is known for its delicious food and great service. The hotel also has a conference room and banquet hall, making it a popular choice for business meetings and events. The staff members are friendly and attentive, providing excellent customer service. The location of the hotel is also convenient, with easy access to the city's main attractions and transportation hubs. Overall, Hotel Narmada Gate is a great choice for travelers looking for comfortable accommodation with modern amenities and excellent service in Bharuch.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice restaurant on side of the highway you must visit when you are traveling , breakfast,tea and coffee , lunch , dinner available , budget friendly place , wheelchair accessible area, and car parking available , hygienic washrooms and good sitting arrangements , service available",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "okish hotel nothing great rooms big well maintained asked large beds got twin sharing beds room service available lifts got room nd floor ample parking available",
                "nice place well connected main road highways food quality good freshly made find good vegetarian thaali options gujrati food tea coffee hot milk sugar kids also available demand quality food adequate service quick also option pick local snack counter like biscuits wafers local snack like peanut bar peanuts chewing gum mint chocolate bar etc",
                "good hotels tasty food",
                "hotel narmada gate popular hotel located city bharuch gujarat india hotel offers range rooms including deluxe executive rooms cater needs different travelers rooms wellfurnished equipped modern amenities like air conditioning television wifi hotel also restaurant offers variety dishes including local gujarati cuisine indian international delicacies restaurant known delicious food great service hotel also conference room banquet hall making popular choice business meetings events staff members friendly attentive providing excellent customer service location hotel also convenient easy access citys main attractions transportation hubs overall hotel narmada gate great choice travelers looking comfortable accommodation modern amenities excellent service bharuch",
                "nice restaurant side highway must visit traveling breakfasttea coffee lunch dinner available budget friendly place wheelchair accessible area car parking available hygienic washrooms good sitting arrangements service available"
            ]
        },
        {
            "name": "Hotel Sun Plaza",
            "rating": [
                3.8
            ],
            "address": [
                "C/513 Near Gidc Bus Depot N.h No-8, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India"
            ],
            "reviews": [
                {
                    "text": "Hi, we have reached in the morning today. We came here to attend someone special's function. Here, Staff members behave like we are just coming to do some vulgar activities. These guys also don't allow us to enter in the banquet hall.\n\nThis feels so embarassing to us as a guest. This is so ridiculous behavior.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Personally i didn't like that much. Price is ok but for same price you can get other hotels with better facilities.\n\nRooms are soo congested, food menu you find only veg. They will allow outside food in room no issues.\n\nStaff should be trained.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The infrastructure of the hotel is good and full of facilities. And the cleanliness of all the rooms is very good. You can spend your time here comfortably. The behavior and thoughts of all the hotel staff are impressive. This hotel is very close to the highway.\n\nI had stay here in August 2019.\n\nthank you\n\nGhumte Raho😘",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good highway stopover if you are traveling from Bombay to Vadodara",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "A hidden gem if to be said in a line\n\nThe banquet is in basement and is excellently maintained\n\nAmple spacious stairs and easy access makes its a most sorted out location for ocassion\n\nAccessibility with highway on oen side and state highway on another is a really good location\n\nThey have a small garden too making it a very good experience",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hi reached morning today came attend someone specials function staff members behave like coming vulgar activities guys also dont allow us enter banquet hall feels embarassing us guest ridiculous behavior",
                "personally didnt like much price ok price get hotels better facilities rooms soo congested food menu find veg allow outside food room issues staff trained",
                "infrastructure hotel good full facilities cleanliness rooms good spend time comfortably behavior thoughts hotel staff impressive hotel close highway stay august thank ghumte rahoð\u009f\u0098\u0098",
                "good highway stopover traveling bombay vadodara",
                "hidden gem said line banquet basement excellently maintained ample spacious stairs easy access makes sorted location ocassion accessibility highway oen side state highway another really good location small garden making good experience"
            ]
        },
        {
            "name": "Hotel Paradise",
            "rating": [
                4.2
            ],
            "address": [
                "Omkar Complex, Ankleshwar - Valia Rd, GIDC, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India"
            ],
            "reviews": [
                {
                    "text": "It is one of the good option for stay at Ankleshwar. Staff is polite,friendly and helpful. Service is good. They also offer complimentary breakfast between 7 am to 10 am. Rooms are neat and clean. We stayed in deluxe room double occupancy.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Staff is polite and humble. Nice and clean room. They have drivers room facilities which is very nice.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Well behaved staff, neat and clean lobbies\n\nFood tests good\n\nMost Important 24 hours check in",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I m impressed by there service & food, very affordable price. Good location just 100 meter away from the highway....",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Hotel is very neat n clean and sevice also very good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one good option stay ankleshwar staff politefriendly helpful service good also offer complimentary breakfast rooms neat clean stayed deluxe room double occupancy",
                "staff polite humble nice clean room drivers room facilities nice",
                "well behaved staff neat clean lobbies food tests good important hours check",
                "impressed service food affordable price good location meter away highway",
                "hotel neat n clean sevice also good"
            ]
        },
        {
            "name": "THE GORBANDH PALACE HOTEL",
            "rating": [
                4.1
            ],
            "address": [
                "623/B lakeview plaza, Ankleshwar - Valia Rd, GIDC, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India"
            ],
            "reviews": [
                {
                    "text": "The hotel room is good, the service is fine and the food is equally great with no. of items. There is an AC  function hall available good for medium size functions/events.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I took dinner with my family , hotel is with Royal experience and well food taste is also very different form other hotels , the barbecue sizzler is bery tasty",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is so good,\nQuite Place, No rush, No waitings,\nMist Visit",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Perfectly baked fresh out of the oven kind of taste. Loved the taste. Can’t get over the lasagna which was out of the world. Loved the way it was cooked. Gives a pleasant churn. Strongly recommended to other food lovers.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is the best place and it has excellent service 😇. I also enjoy it. One time you go Ankleshwer you should enjoy it.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel room good service fine food equally great items ac function hall available good medium size functionsevents",
                "took dinner family hotel royal experience well food taste also different form hotels barbecue sizzler bery tasty",
                "food good quite place rush waitings mist visit",
                "perfectly baked fresh oven kind taste loved taste canâ\u0080\u0099t get lasagna world loved way cooked gives pleasant churn strongly recommended food lovers",
                "best place excellent service ð\u009f\u0098\u0087 also enjoy one time go ankleshwer enjoy"
            ]
        },
        {
            "name": "Hotel Navjeevan",
            "rating": [
                4.3
            ],
            "address": [
                "J2G6+MQC, NH 48, Gadkhol Part, Ankleshwar GIDC, Ankleshwar, Gujarat 393001, India"
            ],
            "reviews": [
                {
                    "text": "It's good to have a halt here if you are traveling with family. Safe place, good play area for child, parking is also good. Cleanliness is good.\nDon't know about food quality as we have takem only cold drinks here. But i think there will be good option for lunch and dinner. We found varieties of mouth freshener here.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed for a snacks and tea while traveling to saputara around 2 AM and still their fast food corner service open for what we ordered. Also for kid's they have plenty of space and rides for them to enjoy over there. Best place to hold on your travel in between Mumbai or surat travelers..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Hi guys... I came from new Zealand... Always struggle with kids and there play area that they can stress their body after long drive.... Amazing rides for kids and food... I highly recommended... Thanks for this joy... Love it...",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This place is really good for staying sometimes. Special good for children to much playing Area inside, Food is ok not a great test but it's ok.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The food is good and service bad.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good halt traveling family safe place good play area child parking also good cleanliness good dont know food quality takem cold drinks think good option lunch dinner found varieties mouth freshener",
                "stayed snacks tea traveling saputara around still fast food corner service open ordered also kids plenty space rides enjoy best place hold travel mumbai surat travelers",
                "hi guys came new zealand always struggle kids play area stress body long drive amazing rides kids food highly recommended thanks joy love",
                "place really good staying sometimes special good children much playing area inside food ok great test ok",
                "food good service bad"
            ]
        },
        {
            "name": "Hotel Monarch Excellency",
            "rating": [
                4
            ],
            "address": [
                "Plot No: C/3/7, Parshwanath Complex GIDC Road Opp. Railway Street East, Gadkhol Part, GIDC, Ankleshwar GIDC, Ankleshwar, Gujarat 393002, India"
            ],
            "reviews": [
                {
                    "text": "We had a overnight stay for transit. Overall experience was satisfactory. They don’t have lift, difficult for seniors and disabled. One of the rooms flush was not working. Recommended only if you are passing by the NH48 highway and need to stay overnight. Food was average.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Everything is good. Room service is good and quick. Near to bus stand and Railway station . The only thing that needs to be improved is the food menu and taste. Overall 👍.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Room was ok but paint smell was coming throughout the area and wash basin tap was broken. Regarding service the receptionist and the owner has two different opinion towards there policies one is saying children above 5 years is chargeable and the other is saying any age child is chargeable. They had charged me 300rs more for below 5 year child as if he aquire one full bed and they also dint give extra bed after charging it.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It was a nice experience staying in this hotel. Spacious rooms, excellent room service and immediate response. Nearer to the Railway station.\nThis hotel is extremely suitable for family also. I enjoyed the service and staff behaviour n approach  more than expected.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The room was good and the hospitality  was much better . The room was neat and clean  and the bathroom was also neat and clean.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overnight stay transit overall experience satisfactory donâ\u0080\u0099t lift difficult seniors disabled one rooms flush working recommended passing nh highway need stay overnight food average",
                "everything good room service good quick near bus stand railway station thing needs improved food menu taste overall ð\u009f\u0091\u008d",
                "room ok paint smell coming throughout area wash basin tap broken regarding service receptionist owner two different opinion towards policies one saying children years chargeable saying age child chargeable charged rs year child aquire one full bed also dint give extra bed charging",
                "nice experience staying hotel spacious rooms excellent room service immediate response nearer railway station hotel extremely suitable family also enjoyed service staff behaviour n approach expected",
                "room good hospitality much better room neat clean bathroom also neat clean"
            ]
        },
        {
            "name": "Hotel Silver Leaf",
            "rating": [
                4.2
            ],
            "address": [
                "Hexzone Arcade plot no 623/3/A, next to Jaya Ben Modi hospital, GIDC, Ankleshwar GIDC, Ankleshwar, Gujarat 393002, India"
            ],
            "reviews": [
                {
                    "text": "My experience at this hotel was far from satisfactory. Upon arrival, the hotel's appearance left much to be desired. The first thing that struck me was the overpowering, unpleasant chemical odor that permeated the entire lobby and hallways. It was so strong that it made my stay uncomfortable from the start.\n\nIn addition to the initial concerns, there were further disappointments. We had requested water bottles, but they did not arrive on the first attempt, which was inconvenient. Access to drinking water is a basic expectation for any hotel, and such requests should be promptly fulfilled.\n\nFurthermore, the malfunctioning AC was a significant issue. The fact that the maintenance staff arrived after we were already asleep was highly inconvenient and disrupted our comfort during the stay.\n\nThe condition of the towels and linen provided in my room was equally disappointing. They were worn out, discolored, and had seen better days. It was evident that they were in desperate need of replacement, which greatly affected my perception of the hotel's cleanliness and attention to detail.\n\nTo make matters worse, the room service at this hotel was practically non-existent. I had hoped to enjoy some meals in the comfort of my room, but the service was slow, and the limited menu options were disappointing. It was frustrating to have to wait for extended periods, only to receive subpar food that didn't justify the high prices.\n\nIn summary, my stay at this hotel was marred by an unappealing appearance, an unpleasant chemical odor, substandard towels and linen, a lackluster room service experience, delayed response to basic requests like water bottles, and a malfunctioning AC that was addressed only after a considerable delay. I would strongly advise management to address these issues promptly to provide a more pleasant and comfortable stay for future guests.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A good place to visit at a proper location. Very clean rooms. The best hotel in town.  The response of management is poor. I missed some of my items here while leaving. Sent a mail as well as a call about it but no response.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very nice hotel well cleaned rooms and nice food, but breakfast is quite costly but it's ok ok",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Food is good... But you have to wait for atleast 1 hour to get your order.\nOverall... Not recommended.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The reaalastic throught and like royal feelings\nAlso staff members specially behaviour is so softly..\nGood food test 100%Hygiene sorronding area\nThe real service and neat Ness.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience hotel far satisfactory upon arrival hotels appearance left much desired first thing struck overpowering unpleasant chemical odor permeated entire lobby hallways strong made stay uncomfortable start addition initial concerns disappointments requested water bottles arrive first attempt inconvenient access drinking water basic expectation hotel requests promptly fulfilled furthermore malfunctioning ac significant issue fact maintenance staff arrived already asleep highly inconvenient disrupted comfort stay condition towels linen provided room equally disappointing worn discolored seen better days evident desperate need replacement greatly affected perception hotels cleanliness attention detail make matters worse room service hotel practically nonexistent hoped enjoy meals comfort room service slow limited menu options disappointing frustrating wait extended periods receive subpar food didnt justify high prices summary stay hotel marred unappealing appearance unpleasant chemical odor substandard towels linen lackluster room service experience delayed response basic requests like water bottles malfunctioning ac addressed considerable delay would strongly advise management address issues promptly provide pleasant comfortable stay future guests",
                "good place visit proper location clean rooms best hotel town response management poor missed items leaving sent mail well call response",
                "nice hotel well cleaned rooms nice food breakfast quite costly ok ok",
                "food good wait atleast hour get order overall recommended",
                "reaalastic throught like royal feelings also staff members specially behaviour softly good food test hygiene sorronding area real service neat ness"
            ]
        }
    ]
}