{
    "places_with_reviews": [
        {
            "name": "Ketki Wadi Beach Resort",
            "rating": [
                3.8
            ],
            "address": [
                "Anjarle, Dapoli, R3XQ+X4J, Ratnagiri, Anjarle, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "Too much hope less Hotel. Low quality veg and non veg food. Too late service to serve food. I am suggesting, if you want to enjoy your Holiday, then don't stay in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Rooms are ok, the beach and resort location is wonderful,\nThe only complaint is about the service, especially when serving dinner.\nNo management at all.\nThey didn't have a clue how to manage such a crowd.\nFor peak season , let say, if the resort has 100 rooms and you imagine 4 to 5 people living in each room, then resort should be able to manage food for 400 to 500 people.\nWe had to cancel our order and at the end we were force to take tali.\nWe gave order at 8:17 PM and we took tali at 22:34, more than 2 hours our order was not entertained, and in between we went there to enquire many time in kitchen.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Pathetic experience in my life for this resort. Unhygienic rooms, bedsheets worst, not properly clean. Worst experience of lifetime. Food taste not good, staff very rude. The owner does not even bother if the customer is getting everything properly on time. The staff treats the customer as if the customer has done something wrong . I would suggest please do not choose this resort even if photos on Google are good. Please do not book the resort before checking. There are lot many resorts which charge you less but service is awesome but here charges are as if it's a 5 star resort and service is worst. Overall the resort, the staff and the owner are pathetic. Worst experience of life😡😡😡",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Dining should be improve by regularly cleaning and much more or they have to dine in the rooms on there own.\nChicken thali I have try but it should have to improve its taste food quality is quite good\nFish price is high but quality matters.\nRooms are very nice but they have to adjust there price by the people needs.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good and reasonable place to stay. All basic amenities are available at the resort. Host is very cooperative and helpful.\nAnjarle beach is beautiful beach.  Resort is on the beach. Beach is very clean.  AC room cottage are available. Room size is comfortable for 3-4 persons. Charges are 2500 on week days.  Advised to visit on week days for conformable stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "much hope less hotel low quality veg non veg food late service serve food suggesting want enjoy holiday dont stay hotel",
                "rooms ok beach resort location wonderful complaint service especially serving dinner management didnt clue manage crowd peak season let say resort rooms imagine people living room resort able manage food people cancel order end force take tali gave order pm took tali hours order entertained went enquire many time kitchen",
                "pathetic experience life resort unhygienic rooms bedsheets worst properly clean worst experience lifetime food taste good staff rude owner even bother customer getting everything properly time staff treats customer customer done something wrong would suggest please choose resort even photos google good please book resort checking lot many resorts charge less service awesome charges star resort service worst overall resort staff owner pathetic worst experience lifeð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡",
                "dining improve regularly cleaning much dine rooms chicken thali try improve taste food quality quite good fish price high quality matters rooms nice adjust price people needs",
                "good reasonable place stay basic amenities available resort host cooperative helpful anjarle beach beautiful beach resort beach beach clean ac room cottage available room size comfortable persons charges week days advised visit week days conformable stay"
            ]
        },
        {
            "name": "SaffronStays Villa 270°, Dapoli",
            "rating": [
                4.2
            ],
            "address": [
                "Harnai-Palande Rd, Bazar Mohalla, Harnai, Pandhari, Maharashtra 415713, India"
            ],
            "reviews": [
                {
                    "text": "I want to take a moment to express my sincere gratitude for the exceptional experience at Villa 270. Everything about it was simply perfect.\nThe location was ideal, offering breathtaking views and a serene atmosphere. I cherished every moment spent there, often finding solace in the solitude it provided. Sharing photos with my family and friends allowed me to relive those beautiful memories with them.\nThe location of the rooms was so exceptional that I could see the ocean from my room, making it hard to tear oneself away from the mesmerizing scenery.\nThe culinary experience was truly remarkable. The food was not only delicious but also a learning opportunity for me. I discovered a newfound appreciation for carbohydrates and indulged more than I care to admit.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Villa 270 is an amazing property with amazing views, literally 270 degree views. Villas are sea facing. Lush green with stone carved statues.\nPros:\nBreathtaking views\nBeautiful sunset\nGood food\nBest room service\nCozy rooms with antiques\nShower was made of stones\nGood WiFi\nCons:\nMusic is played in full volume in nearby villages all the time 24x7.\nThe nearest beach is a 20min drive.\nNo cell connectivity\n\nAvoid visiting if you have elders as it has many stairs to climb to the villa.\nAvoid if looking for peace of mind as loud music can irritate you.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This was my first experience with saffron stays and I must tell you it's awesome ! The hospitality of the staff, the food , the vibe! Everything here was excellent. The location and views from the room will make you feel connected to the sea. You have the ocean view from everywhere because the villa is built on a mountain top. Special thanks to the entire staff and chef Mangesh for the absolutely amazing quality of food. All the dishes we ordered were so delicious! The staff also arranged an auto for us to travel locally. They are very helpful. Hygiene and everything was on point ! If you go, don't forget to taste their \"ukdiche modak\"!\nOverall I will suggest it to everyone who wants to spend some enriching time with friends and family.\nDo visit Anjarle beach, a lovely white sand beach which is 15-20 mins from the resort.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Amazing location, easy to reach, calm and relaxing atmosphere and amazing experience.\n\nLocation wise and view wise it is just amazing and one of its kind. Amazing sunsets, dont miss at any cost.\n\nCost wise comes to a premium category but lacks services equivalent to it. No welcome drinks, No Complimentary breakfast, no additonal services like pick up n drop services and not even a persons to attend and pick your baggage. (You have to pay extra for all these or you are not offered)\n\nPhone conversations are professional yet lack empathy, no suggestions over the local cuisine, no suggestions to nearby tourist attraction, no suggestions for local food and market place, “when asked specifically”.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Villa 270 Degrees Superb and peaceful Locations\nWe had Ex employees REUNION at this wonderful Villa surrounded by Sea Coast Breezy and Enjoyable indeed.\nVery delicious food ,well maintained clean and luxury rooms\nand above all Courteous staff willing to go extra mile to ensure Customer delight\nHighly recommendable for availing and experiencing it",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "want take moment express sincere gratitude exceptional experience villa everything simply perfect location ideal offering breathtaking views serene atmosphere cherished every moment spent often finding solace solitude provided sharing photos family friends allowed relive beautiful memories location rooms exceptional could see ocean room making hard tear oneself away mesmerizing scenery culinary experience truly remarkable food delicious also learning opportunity discovered newfound appreciation carbohydrates indulged care admit",
                "villa amazing property amazing views literally degree views villas sea facing lush green stone carved statues pros breathtaking views beautiful sunset good food best room service cozy rooms antiques shower made stones good wifi cons music played full volume nearby villages time x nearest beach min drive cell connectivity avoid visiting elders many stairs climb villa avoid looking peace mind loud music irritate",
                "first experience saffron stays must tell awesome hospitality staff food vibe everything excellent location views room make feel connected sea ocean view everywhere villa built mountain top special thanks entire staff chef mangesh absolutely amazing quality food dishes ordered delicious staff also arranged auto us travel locally helpful hygiene everything point go dont forget taste ukdiche modak overall suggest everyone wants spend enriching time friends family visit anjarle beach lovely white sand beach mins resort",
                "amazing location easy reach calm relaxing atmosphere amazing experience location wise view wise amazing one kind amazing sunsets dont miss cost cost wise comes premium category lacks services equivalent welcome drinks complimentary breakfast additonal services like pick n drop services even persons attend pick baggage pay extra offered phone conversations professional yet lack empathy suggestions local cuisine suggestions nearby tourist attraction suggestions local food market place â\u0080\u009cwhen asked specificallyâ\u0080\u009d",
                "villa degrees superb peaceful locations ex employees reunion wonderful villa surrounded sea coast breezy enjoyable indeed delicious food well maintained clean luxury rooms courteous staff willing go extra mile ensure customer delight highly recommendable availing experiencing"
            ]
        },
        {
            "name": "Exotica Suvarna Samudra - Sea View Resort Dapoli",
            "rating": [
                4.1
            ],
            "address": [
                "Bypass Road, Harnai, Dapoli, Maharashtra 415713, India"
            ],
            "reviews": [
                {
                    "text": "This property is now managed by Lemon Tree. Was here with friends on 2024 Holi long weekend and paid quite a hefty amount for 2 nights. It was a below average experience overall. The staff is new. They go back to manager to check for everything we asked for!!! The food is below average. They did not have ice available with them for 2 day!! The pool is average. The drinks counter near the pool is closed. The rooftop pub and the spa is closed. Property is located quite far from the beach. Only the view is good from the rooms if you choose to ignore the garbage lying on the hill below. Initially they gave us room on ground floor which had smell in washroom. We had to change our rooms. The breakfast is again below average. The property is off from the main road and it is a steep climb to the gate.\n\nOverall if you just want to relax and take rest in the rooms with occasional tour to the beach by car and also getting the rooms at Rs. 3000 approx. with breakfast then this is good otherwise can be skipped.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I think it's the best option to stay with family, including an elderly person. Nice location, on hill top, overlooking the a small town and clear wide view of Arabian sea, almost, 180 degrees view. Staffs there are young, energetic and very friendly. Response time is very quick. Property is also well equipped with all required things, restaurant again is like dinning next to sea, nice open well lighted. Full marks to location, ambience, staffs. Overall, a great place to stay and relax.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's on a hill overlooking the ocean. Good view but not the best. Its taken over by Lemon Tree Hotels so somethings were not operational like pool when we went.\nRooms are really nice and service was excellent. Food especially breakfast options could be better.\nIts little far from main nodes of the town and cell network is zero there throughout the 15-20 kms radius.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The location is very nice...! Rooms are also clean and maintained . Mr. Thapa and other staff are also good .. only thing they need to improve is quality and variety of food.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I had a pleasant experience at this hotel. The rooms were comfortable and offered beautiful sea views. However, there were ongoing renovations within the hotel premises. Unfortunately, I was not impressed with their restaurant as the food was not fresh, service very slow and quite expensive.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property managed lemon tree friends holi long weekend paid quite hefty amount nights average experience overall staff new go back manager check everything asked food average ice available day pool average drinks counter near pool closed rooftop pub spa closed property located quite far beach view good rooms choose ignore garbage lying hill initially gave us room ground floor smell washroom change rooms breakfast average property main road steep climb gate overall want relax take rest rooms occasional tour beach car also getting rooms rs approx breakfast good otherwise skipped",
                "think best option stay family including elderly person nice location hill top overlooking small town clear wide view arabian sea almost degrees view staffs young energetic friendly response time quick property also well equipped required things restaurant like dinning next sea nice open well lighted full marks location ambience staffs overall great place stay relax",
                "hill overlooking ocean good view best taken lemon tree hotels somethings operational like pool went rooms really nice service excellent food especially breakfast options could better little far main nodes town cell network zero throughout kms radius",
                "location nice rooms also clean maintained mr thapa staff also good thing need improve quality variety food",
                "pleasant experience hotel rooms comfortable offered beautiful sea views however ongoing renovations within hotel premises unfortunately impressed restaurant food fresh service slow quite expensive"
            ]
        },
        {
            "name": "Whistling Waves Beach Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Savane Beach, Anjarle - Aade Rd, Dapoli, Tadachakond, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "This could be one of the best stays in that belt or in Anjarle at least. Beach side location is most attractive. Rooms are just average, good coastal cuisine with not much variety but staff is friendly and cordial. Overall decent and comfortable stay for couples or families.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed for 2 nights. We liked everything about the resort right from the rooms, service, surroundings and food. A clean private-type beach nearby makes this resort stand out. This is a great place especially if you are on a digital detox getaway as there is no network in the surrounding areas. The resort does have a wifi though which is good enough to make phone calls. The local people in the surrounding areas were very warm, affectionate and hospitable. We had a car breakdown and the resort staff along with local people were selfless while helping us. We would surely visit here again.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Mixed review 3.5-3.8/5...good place if you have your own large group\n1. Decent rooms\n2. Excellent service\n3. Beach nearby with very little crowd\nCan improve on food taste consistency.\nAlso lawn needs improvement,\nCleanliness can be better in common areas\nCharges are on higher side as compared to facilities. Can do better on that front\nGood ppl",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed at Whistling Waves Resort for a delightful three-night getaway. The rooms were impeccably clean and maintained to the highest standards of hygiene. What truly sets this place apart is the serene atmosphere and the added bonus of having the beach just a mere 150 meters away from the resort.\n\nOne of the standout features of this resort is its pet-friendly policy, and they charge a nominal fee for them. Our girl had a fantastic time here and even made a new friend - Milli.\n\nThe food at Whistling Waves Resort deserves special mention; we tasted all their thalis - the fish, chicken, vegetarian, and egg options. Make sure to place your food orders in advance as the food is made fresh.  The real charm of this place is having the entire beach practically to yourself, as it's blissfully unburdened by hordes of tourists or locals. If you're someone who relishes peace and seclusion, this destination is tailor-made for you.\n\nThe staff at the resort are exceptionally friendly and always ready to assist with any requests. The property is beautifully landscaped and exceptionally well-maintained. Ample parking space with secure gates ensures that you won't have to worry about your vehicle's safety.\n\nOur stay at Whistling Waves Resort was a tranquil and rejuvenating experience and would definitely visit again in future. We wholeheartedly recommend this  place to everyone seeking a peaceful retreat away from the bustling crowds.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I visited Whistling Waves resort recently.\nIt was a very nice place, it is good for families as well as bachelors.\nThe beach is just a min away from this place, you can see beach view from the first floor rooms.\nThe food quality is very nice. Veg and nonveg available, specially fish thalis are very nice. They also provid barbeque if you want.\nThe service is good, Vijay is the person who was serving us was amazing.\nOverall a very good experience we had at Whistling Waves resort.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "could one best stays belt anjarle least beach side location attractive rooms average good coastal cuisine much variety staff friendly cordial overall decent comfortable stay couples families",
                "stayed nights liked everything resort right rooms service surroundings food clean privatetype beach nearby makes resort stand great place especially digital detox getaway network surrounding areas resort wifi though good enough make phone calls local people surrounding areas warm affectionate hospitable car breakdown resort staff along local people selfless helping us would surely visit",
                "mixed review good place large group decent rooms excellent service beach nearby little crowd improve food taste consistency also lawn needs improvement cleanliness better common areas charges higher side compared facilities better front good ppl",
                "stayed whistling waves resort delightful threenight getaway rooms impeccably clean maintained highest standards hygiene truly sets place apart serene atmosphere added bonus beach mere meters away resort one standout features resort petfriendly policy charge nominal fee girl fantastic time even made new friend milli food whistling waves resort deserves special mention tasted thalis fish chicken vegetarian egg options make sure place food orders advance food made fresh real charm place entire beach practically blissfully unburdened hordes tourists locals youre someone relishes peace seclusion destination tailormade staff resort exceptionally friendly always ready assist requests property beautifully landscaped exceptionally wellmaintained ample parking space secure gates ensures wont worry vehicles safety stay whistling waves resort tranquil rejuvenating experience would definitely visit future wholeheartedly recommend place everyone seeking peaceful retreat away bustling crowds",
                "visited whistling waves resort recently nice place good families well bachelors beach min away place see beach view first floor rooms food quality nice veg nonveg available specially fish thalis nice also provid barbeque want service good vijay person serving us amazing overall good experience whistling waves resort"
            ]
        },
        {
            "name": "Lemon Tree Hotel Dapoli",
            "rating": [
                4.4
            ],
            "address": [
                "Bypass Road, Harnai, Dapoli, Maharashtra 415713, India"
            ],
            "reviews": [
                {
                    "text": "My stay at Lemon Tree Hotel Dapoli was really enjoyable! The hotel is surrounded by lots of trees, which makes it feel really calm and quiet. The rooms are nice and big, and the beds are comfortable. I loved waking up in the morning and looking out at the beautiful sea, which is rare to see anywhere else. The breakfast they gave us was really tasty, with lots of things to eat. Requires to travel extra 2km which I think totally worth as we also get view from the top of the Harnai, beach & fort in a single frame & attaching more photos. I had such a nice experience there, and I'll consider another visit soon.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Overall, a pleasant stay. The location was convenient, close to many attractions. The room was comfortable, although it could have been a bit cleaner. The staff were friendly. The breakfast buffet had a good selection, but it was crowded during peak hours. Decent value for the price",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Upon arrival, I was greeted by the warm and friendly staff who ensured a seamless check-in process. The hotel's aesthetic charm immediately caught my eye, with its tastefully decorated interiors and lush green surroundings.\n\nThe room provided a cozy sanctuary, impeccably clean and thoughtfully appointed with all the necessary amenities for a comfortable stay. The plush bedding ensured a restful night's sleep, while the picturesque views from the window added to the overall ambiance.\n\nOne of the highlights of my stay was the delectable dining experience at the hotel's restaurant. From traditional Konkani delicacies to continental fare, the menu offered a diverse range of culinary delights to tantalize the taste buds. The attentive service and scenic backdrop made each meal a memorable affair.\n\nFor those seeking relaxation, the hotel's spa facilities provided the perfect escape.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Perched atop a scenic hilltop, this hotel boasts breathtaking sea views that are simply unparalleled. From the moment you step into the lobby, you're greeted by a sense of tranquility and elegance that sets the tone for your stay. The well-appointed rooms offer panoramic vistas of the azure waters, providing a constant reminder of the beauty that surrounds you.\n\nOne of the standout features of this hotel is its impressive swimming pool, which not only offers a refreshing respite from the sun but also overlooks the shimmering sea below. Whether you're lounging by the poolside  or taking a leisurely swim, the experience is nothing short of sublime.\n\nHowever, what truly sets this hotel apart is its exceptional staff. From the warm welcome at check-in to the attentive service throughout your stay, every member of the team goes above and beyond to ensure your comfort and satisfaction. Whether you need recommendations for local attractions or assistance with any requests, the staff is always ready to assist with a smile.\n\nOverall, this hotel on the hill with its stunning sea view, inviting swimming pool, and exemplary staff is a true gem that promises an unforgettable stay for anyone seeking a slice of paradise.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at the Lemon Tree Hotel, and it was an experience worth sharing. From the moment I stepped into the lobby, I was greeted by a vibrant and inviting atmosphere. The staff were incredibly welcoming and efficient, making check-in a breeze.\n\nThe room itself was spacious, clean, and well-equipped with all the amenities one could need for a comfortable stay. The bed was plush and provided a restful night's sleep, while the modern bathroom added a touch of luxury to the experience.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay lemon tree hotel dapoli really enjoyable hotel surrounded lots trees makes feel really calm quiet rooms nice big beds comfortable loved waking morning looking beautiful sea rare see anywhere else breakfast gave us really tasty lots things eat requires travel extra km think totally worth also get view top harnai beach fort single frame attaching photos nice experience ill consider another visit soon",
                "overall pleasant stay location convenient close many attractions room comfortable although could bit cleaner staff friendly breakfast buffet good selection crowded peak hours decent value price",
                "upon arrival greeted warm friendly staff ensured seamless checkin process hotels aesthetic charm immediately caught eye tastefully decorated interiors lush green surroundings room provided cozy sanctuary impeccably clean thoughtfully appointed necessary amenities comfortable stay plush bedding ensured restful nights sleep picturesque views window added overall ambiance one highlights stay delectable dining experience hotels restaurant traditional konkani delicacies continental fare menu offered diverse range culinary delights tantalize taste buds attentive service scenic backdrop made meal memorable affair seeking relaxation hotels spa facilities provided perfect escape",
                "perched atop scenic hilltop hotel boasts breathtaking sea views simply unparalleled moment step lobby youre greeted sense tranquility elegance sets tone stay wellappointed rooms offer panoramic vistas azure waters providing constant reminder beauty surrounds one standout features hotel impressive swimming pool offers refreshing respite sun also overlooks shimmering sea whether youre lounging poolside taking leisurely swim experience nothing short sublime however truly sets hotel apart exceptional staff warm welcome checkin attentive service throughout stay every member team goes beyond ensure comfort satisfaction whether need recommendations local attractions assistance requests staff always ready assist smile overall hotel hill stunning sea view inviting swimming pool exemplary staff true gem promises unforgettable stay anyone seeking slice paradise",
                "recently pleasure staying lemon tree hotel experience worth sharing moment stepped lobby greeted vibrant inviting atmosphere staff incredibly welcoming efficient making checkin breeze room spacious clean wellequipped amenities one could need comfortable stay bed plush provided restful nights sleep modern bathroom added touch luxury experience"
            ]
        },
        {
            "name": "Appa's Beach Resort",
            "rating": [
                4.2
            ],
            "address": [
                "Padale Beach Rd, Near swami vivekand pratikruti, Padale, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "Food Quality: The resort offers a decent variety of dishes with generally good taste. While it might not reach the culinary heights of higher-end resorts, the meals are satisfying and cater to a diverse palate.\n\n**Location:** The resort's location is convenient, providing easy access to nearby attractions. Whether it's a beach, cultural sites, or shopping areas, the resort is strategically situated for guests to explore the surroundings.\n\n**Service:** The staff is generally attentive and friendly, creating a welcoming atmosphere. However, occasional inconsistencies may be observed, with service levels varying depending on the specific team or time of day.\n\n**Room:** The rooms are clean and comfortable, meeting the expectations of a 3-star resort. While not overly luxurious, they provide a cozy and functional space for guests to unwind after a day of activities.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The resort is right next to the beach and rooms have very basic setup but otherwise clean. Not very lavish but okay okay arrangements . The food they serve is tasty and the service is good. The road to this resort is very narrow and at a time only one car can go. 5 star for service. We were 5 friends visiting and a dog there joined us and was with us till we left the place. Shall visit again.\n\nIt's kind of a home stay and don't go by the word Resort 😄",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It is a hidden gem, a must visit place. The beach view from the room is just awesome. The staff cook the food very tasty, a very peaceful place without any interference or disturbance around.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best resorts to stay for those who want to feel and experience the real beauty of nature from an excellent beach face room.\n\nMust try if you are a foodie and love to have real kokani taste.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Serene area, rooms only for bed + to get fresh.\nFood awesome..sea shore and greenery is the real ambience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food quality resort offers decent variety dishes generally good taste might reach culinary heights higherend resorts meals satisfying cater diverse palate location resorts location convenient providing easy access nearby attractions whether beach cultural sites shopping areas resort strategically situated guests explore surroundings service staff generally attentive friendly creating welcoming atmosphere however occasional inconsistencies may observed service levels varying depending specific team time day room rooms clean comfortable meeting expectations star resort overly luxurious provide cozy functional space guests unwind day activities",
                "resort right next beach rooms basic setup otherwise clean lavish okay okay arrangements food serve tasty service good road resort narrow time one car go star service friends visiting dog joined us us till left place shall visit kind home stay dont go word resort ð\u009f\u0098\u0084",
                "hidden gem must visit place beach view room awesome staff cook food tasty peaceful place without interference disturbance around",
                "one best resorts stay want feel experience real beauty nature excellent beach face room must try foodie love real kokani taste",
                "serene area rooms bed get fresh food awesomesea shore greenery real ambience"
            ]
        },
        {
            "name": "Ashoka Water Park & Resort",
            "rating": [
                3.6
            ],
            "address": [
                "Ashoka Water Park & Resort, At Post Harnai, Near Vakdi Bhend Road, Harnai, Dapoli, Harnai, Maharashtra 415713, India"
            ],
            "reviews": [
                {
                    "text": "Worst experience  ever  at ashoka water park  . The rides were good but the staff was rude and non cooperative.  The manager   named pednekar was rude and didn't  allow  us to do the things which were avaliable. The water was unclean and there were lot of shells there. There wasn't  light in the room and the room was not that great .the service was  also  not that great. And there were a lot of mosquitoes  there . Worst experience ever  I and my family had",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Hotel is nice as well rooms but the hotel staff was very rude and their food was also not fine, we visit with the group of 60 people but hotel chief made worst food on that day and we eated outside at that night and payed for that worst food",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Rooms were good and clean suitable for 3 adults and 2 kids\nFood is clean,good. Food felt overpriced for me.\nWater resort is good and maintened and prices are less kids enjoyed a lot.\nStaff - is very supportive I will give five star for staff.\nPrice - are bit higher but may be due to holiday period.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Manager is kind and supportive. Staff is also helpful. Resort location is precious.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Food is average but rooms and place is awesome",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst experience ever ashoka water park rides good staff rude non cooperative manager named pednekar rude didnt allow us things avaliable water unclean lot shells wasnt light room room great service also great lot mosquitoes worst experience ever family",
                "hotel nice well rooms hotel staff rude food also fine visit group people hotel chief made worst food day eated outside night payed worst food",
                "rooms good clean suitable adults kids food cleangood food felt overpriced water resort good maintened prices less kids enjoyed lot staff supportive give five star staff price bit higher may due holiday period",
                "manager kind supportive staff also helpful resort location precious",
                "food average rooms place awesome"
            ]
        },
        {
            "name": "Prime Beach Resort",
            "rating": [
                4.8
            ],
            "address": [
                "R3XQ+66Q, Anjarle, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "We recently visited Anjarle, and we had a stay in Prime Beach Resort. It's an awesome place, it is located just near the sea, best room service. I feel that this resort is the best choice if you are visiting this place.\n\nThe food is really very tasty, but you need to tell them in advance about the food. Locality is very good and the place is also maintained nicely. Lot of efforts are been taken to give the customers the best experience.\n\nI have a small suggestion, it would be nice if there is a mosquito net door attached to the balcony doors, so that we can keep the room ventilated.\n\nIf you visit this place, please do not miss the dolphin ride! It's a very nice experience of sailing into the sea for an hour watching dolphins.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The room was right opposite the beach,amazing view but it needs maintenance as the name says resort and not home stay. The beds had cigarette holes, and n fan was full of dust. No wardrobe , no mirror in the room.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Awesome place... Beach accessible right in front of the resort... Scenic view... Cool and quiet atmosphere.\n\nWe asked the owner to cook the food... That too was cooked at a reasonable price... Also the cooked food had an authentic Konkani taste...",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Best place to stay in Anjarle. It's right opposite to the Anjarle Beach. Rooms are well maintained and clean. The place is run by Kelaskar family. All are very cooperative and helpful. They prefer families to stay at their resort. Food served is absolutely delicious - Bhendi fry, Ghavan Chutney, and all other veg delicacies. You can buy fish from Harne port and they will cook for you at a cost 400/kg. Konkani style fish fry and curry is just lovely. Superb location and stay for family trip. I will surely visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Anjarle's hidden gem! Prime Beach Resort is totally worth your time. Quiet spot, incredible beach views, and Aditya's top-notch hospitality. Every visit here is as mesmerizing as the last.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently visited anjarle stay prime beach resort awesome place located near sea best room service feel resort best choice visiting place food really tasty need tell advance food locality good place also maintained nicely lot efforts taken give customers best experience small suggestion would nice mosquito net door attached balcony doors keep room ventilated visit place please miss dolphin ride nice experience sailing sea hour watching dolphins",
                "room right opposite beachamazing view needs maintenance name says resort home stay beds cigarette holes n fan full dust wardrobe mirror room",
                "awesome place beach accessible right front resort scenic view cool quiet atmosphere asked owner cook food cooked reasonable price also cooked food authentic konkani taste",
                "best place stay anjarle right opposite anjarle beach rooms well maintained clean place run kelaskar family cooperative helpful prefer families stay resort food served absolutely delicious bhendi fry ghavan chutney veg delicacies buy fish harne port cook cost kg konkani style fish fry curry lovely superb location stay family trip surely visit",
                "anjarles hidden gem prime beach resort totally worth time quiet spot incredible beach views adityas topnotch hospitality every visit mesmerizing last"
            ]
        },
        {
            "name": "SagarSparsha",
            "rating": [
                4.8
            ],
            "address": [
                "Padale, Bhandarwada, Dapoli, Padale, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "Beach front property with affordable cost.\n\nDon't expect hotel like hospitality but service is good enough with respect to the costing.\n\nWe did found some good reviews about food but we found it bit higher than average. On making complaint about lunch preparation then definitely showed improvement in dinner preparation.\n\nThey take 400 per kg cooking charges for fish that we can buy from Harne port which is approx 10 km away.\n\nParking space is available to accommodate 4-5 cars.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very beautiful place, great ambience, lovely authentic kokani food and great host. A must visit if you're looking for a place away from chaos and crowd, with your close friends or partner. Amazing beach from near Sagar sparsha hotel great ful beach and hotel.❤️",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Excellent place for relaxing. Must visit by group who really want peace.\nSpecious & clean sea facing rooms.\nNewly constructed hotel with affordable rate.\nDelicious food with Best room service.\nLess crowded beach..feels like just a private beach.\nCaretaker Mr.Pravin is so much helpful",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Seaside accommodation with excellent hospitality and well-maintained rooms. The food is also noteworthy. A tip: Bring your own fish before check-in, as there are no nearby options for purchase. They charge 400 INR per kilogram to cook it. Additionally, grocery shops are a considerable distance away from the location.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The hotel location is superb. The beach is beautiful and very clean.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beach front property affordable cost dont expect hotel like hospitality service good enough respect costing found good reviews food found bit higher average making complaint lunch preparation definitely showed improvement dinner preparation take per kg cooking charges fish buy harne port approx km away parking space available accommodate cars",
                "beautiful place great ambience lovely authentic kokani food great host must visit youre looking place away chaos crowd close friends partner amazing beach near sagar sparsha hotel great ful beach hotelâ\u009d¤ï¸\u008f",
                "excellent place relaxing must visit group really want peace specious clean sea facing rooms newly constructed hotel affordable rate delicious food best room service less crowded beachfeels like private beach caretaker mrpravin much helpful",
                "seaside accommodation excellent hospitality wellmaintained rooms food also noteworthy tip bring fish checkin nearby options purchase charge inr per kilogram cook additionally grocery shops considerable distance away location",
                "hotel location superb beach beautiful clean"
            ]
        },
        {
            "name": "Mallhar Cottages",
            "rating": [
                4
            ],
            "address": [
                "Plot No 15, Sr.No 25/1/41 Murdi, Tal, Dapoli, Maharashtra 415714, India"
            ],
            "reviews": [
                {
                    "text": "We were in the deluxe rooms which were excellent. Location -wise, it is far from the beach and you have to inform the restaurant well in advance at what time you'll want breakfast and what you'll be eating. The staff is very caring and helpful.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A very quiet and serene place, 15mins from Anjarle beach. I personally like the property, it's clean , has all facilities, location is good and on top of everything food is fantastic.\nMr. Vivek , the host is helpful and understanding , and in the property u will meet Mr. Pankaj who is one of the sweetest person I have met 😁\nYou get the best food here in the adjoining restaurant Varad Aamrai, and Mr. Pankaj makes sure to arrange evrything that u would want to have.\nThe food served here is THE BEST in the area.\nOverall the hospitality is top-notch .\nIt would be a good decision booking this property 😁",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Location is good , tariff is reasonable , we liked the place but out of 3 nights we stayed 3rd night experience was horrible.\nIf you know there is electricity outage issue the owner should atleast have a disel generator as a backup. Investors run only for 1 or 2 hours .\n\nRooms are not well maintained, no knob for fan it runs on slow speed, lot of bugs.\nElectricity goes lot of times and there is no generator facility.\nWe had booked for 3 nights 4 days out of which 3 times there was no electricity,  invertor works for few hours then it goes off . On 3rd night there was no electricity for 12 hours when complained to the owner he said we should checked out if we had problem that too at night and also abused when we asked to adjust the 3rd night tariff with food and homestay\n\nWe had paid full room tariff one day after we reached. Once we complained regarding the electricity issue owner was not picking up the phone.\n\nWe had to stay at home stay opposite it\nOwner of home stay offered for help looking at our condition since we had 2 kids also with us.\n\nService providers are really good\nBut owner doesn't care about the property",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "My recent stay at the Malhar Cottages was a wonderful experience. The hospitality was top-notch and the staff were very friendly and accommodating. The rooms & washroom were  very clean and comfortable, and the food was amazing. I had a great meal at the restaurant during my stay, everything was nicely cooked and presented. The menu had a nice variety of food to choose from, and they even had a few specialities that I had never tried before. The desserts were especially delicious. All in all, I had a great experience, and I would definitely recommend this hotel to anyone looking for a pleasant stay.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We have stayed 2 nights in the top AC room, the feel of room & view was amazing. From top room you get the Sea view.\nIt rained during our visit which attracted some insects but after few hours all was normal.\nI feel the top room washroom can be more cleaned but it was manageable.\nSince it is lil far from beach you will find peaceful surroundings.\nPajpandhari Sunset point was amazing.\nSharing some clicks to help.\nEnjoy :)",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "deluxe rooms excellent location wise far beach inform restaurant well advance time youll want breakfast youll eating staff caring helpful",
                "quiet serene place mins anjarle beach personally like property clean facilities location good top everything food fantastic mr vivek host helpful understanding property u meet mr pankaj one sweetest person met ð\u009f\u0098\u0081 get best food adjoining restaurant varad aamrai mr pankaj makes sure arrange evrything u would want food served best area overall hospitality topnotch would good decision booking property ð\u009f\u0098\u0081",
                "location good tariff reasonable liked place nights stayed rd night experience horrible know electricity outage issue owner atleast disel generator backup investors run hours rooms well maintained knob fan runs slow speed lot bugs electricity goes lot times generator facility booked nights days times electricity invertor works hours goes rd night electricity hours complained owner said checked problem night also abused asked adjust rd night tariff food homestay paid full room tariff one day reached complained regarding electricity issue owner picking phone stay home stay opposite owner home stay offered help looking condition since kids also us service providers really good owner doesnt care property",
                "recent stay malhar cottages wonderful experience hospitality topnotch staff friendly accommodating rooms washroom clean comfortable food amazing great meal restaurant stay everything nicely cooked presented menu nice variety food choose even specialities never tried desserts especially delicious great experience would definitely recommend hotel anyone looking pleasant stay",
                "stayed nights top ac room feel room view amazing top room get sea view rained visit attracted insects hours normal feel top room washroom cleaned manageable since lil far beach find peaceful surroundings pajpandhari sunset point amazing sharing clicks help enjoy"
            ]
        }
    ]
}