{
    "places_with_reviews": [
        {
            "name": "Bheemas Regency",
            "rating": [
                3.7
            ],
            "address": [
                "20/29(P),V.B.S ROAD, HBG Nagar, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Rooms were dusty, cleaning only in the morning. Toilet had leaky pipes. Door of the toilet had no stopper so automatically closing & also floor is very slippery. While vacating charged Rs.20 extra for each day of stay. They say free breakfast in their site but they never gave anything for 4 days of my stay. No mention by any of the recepyionist there. This happened in Nov'23.\nNow in Dec'23 when I was forced to book a room there they say no room but in online sites they are showing the same. Overall disappointing experience. Romm also has cockroaches. Maintenance very poor.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I have visited this place for my business purposes. The ambiance of this residence is very old and service is very bad. More over I have faced a problem I.e I got checked in at night. At that time he said some charges for that I accepted but after getting checkout another person said that they said the amount in by mistake. They charged more in the morning and also he is arguing with me.\nSo please check it out while getting in to this residence. And also they are not providing water too for that they are charging water bottles with cost. They are charging more price comparing with the price which they are shown in online.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good service,  friendly staff old building but satisfied 😁😁 very reasonable price",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good place, convenient location, budget hotel, friendly staff.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Everything is superb osm feeling good service location every thing.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms dusty cleaning morning toilet leaky pipes door toilet stopper automatically closing also floor slippery vacating charged rs extra day stay say free breakfast site never gave anything days stay mention recepyionist happened nov dec forced book room say room online sites showing overall disappointing experience romm also cockroaches maintenance poor",
                "visited place business purposes ambiance residence old service bad faced problem ie got checked night time said charges accepted getting checkout another person said said amount mistake charged morning also arguing please check getting residence also providing water charging water bottles cost charging price comparing price shown online",
                "good service friendly staff old building satisfied ð\u009f\u0098\u0081ð\u009f\u0098\u0081 reasonable price",
                "good place convenient location budget hotel friendly staff",
                "everything superb osm feeling good service location every thing"
            ]
        },
        {
            "name": "Rajshri Hotelires pvt ltd",
            "rating": [
                4.2
            ],
            "address": [
                "Railway Station Road, HBG Nagar, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Rajshri Hotelires Pvt Ltd exceeded all my expectations! From the moment I stepped in, I was greeted with warmth and professionalism. The staff went above and beyond to ensure my stay was comfortable and memorable. The rooms were impeccably clean, and the amenities provided were top-notch. The food served at the restaurant was absolutely delicious, offering a diverse range of options to cater to every palate. The attention to detail and level of service truly set this hotel apart. Whether you're traveling for business or leisure, I highly recommend Rajshri Hotelires Pvt Ltd for an exceptional experience!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rajshri Hotelires pvt ltd is offering premium services at budget prices.\nI personally experienced this while my stay at one of their properties. Spacious and squeaky clean room, neat and tidy washroom, quick room service were some highlights during my stay. Its a really good option if you plan to stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best hospitality i have ever soon, Room service was good and bathrooms were hygienic. staff was very cooperative and their behavior was too supportive",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "My recent stay here was exceptional. From the moment I arrived, the staff greeted me warmly and made me feel right at home. Spacious and tidy rooms with all amenities.\nSuperb food and staff behaviour. Would recommend to everyone looking for a memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I had two days stay here in Rajshri hoteliers, I found that the staff has very gentle and warm approaches to me, smooth check-in and check-out. A genuine kind of room service I received in these two days of halt. Rooms are very tidy and clean and I found very timely availability of room service, and punctuality in good quality meal offering. Honestly, this made my mind very peaceful. Thanks for this nice service.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rajshri hotelires pvt ltd exceeded expectations moment stepped greeted warmth professionalism staff went beyond ensure stay comfortable memorable rooms impeccably clean amenities provided topnotch food served restaurant absolutely delicious offering diverse range options cater every palate attention detail level service truly set hotel apart whether youre traveling business leisure highly recommend rajshri hotelires pvt ltd exceptional experience",
                "rajshri hotelires pvt ltd offering premium services budget prices personally experienced stay one properties spacious squeaky clean room neat tidy washroom quick room service highlights stay really good option plan stay",
                "one best hospitality ever soon room service good bathrooms hygienic staff cooperative behavior supportive",
                "recent stay exceptional moment arrived staff greeted warmly made feel right home spacious tidy rooms amenities superb food staff behaviour would recommend everyone looking memorable stay",
                "two days stay rajshri hoteliers found staff gentle warm approaches smooth checkin checkout genuine kind room service received two days halt rooms tidy clean found timely availability room service punctuality good quality meal offering honestly made mind peaceful thanks nice service"
            ]
        },
        {
            "name": "Hotel Chekuri Residency",
            "rating": [
                4.1
            ],
            "address": [
                "Aspari road (Bangalore, Land mark :, road, near new bus stand, Indra Nagar, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Good location with good parking facilities. Neat and clean rooms. Good food options and a supermarket in the same building helped save a lot of time for us.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very good place.. clean rooms and bathroom.. convenient location.. value for money..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hotel Chekuri Residency is a decent place to stay with family and kids. Rooms are clean and spacious. AC options are good. Helping staff. Location is convenient. They have very good and secure parking space.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hotel is at the right location and rooms are tidy and value for the money.\n\nIt has good parking with security",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Great hotel very near by for bus stand and railway station\nVery good staff nice stay",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good location good parking facilities neat clean rooms good food options supermarket building helped save lot time us",
                "good place clean rooms bathroom convenient location value money",
                "hotel chekuri residency decent place stay family kids rooms clean spacious ac options good helping staff location convenient good secure parking space",
                "hotel right location rooms tidy value money good parking security",
                "great hotel near bus stand railway station good staff nice stay"
            ]
        },
        {
            "name": "Hotel Brundavan Grand Innlodge, restaurant and bar",
            "rating": [
                3.9
            ],
            "address": [
                "J8H3+75W, beside batte maremma temple, Thirumala Nagar, Adoni, Andhra Pradesh 518302, India"
            ],
            "reviews": [
                {
                    "text": "Nice place to stay and hangout with friends and family near the approach from  town.\nCalm and peaceful location,\n\nService is great.\nAmple parking facility.\nservice menu is good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Worst Chef...Panner is very Hard to Eat... Especially PANEER MAJESTIC I Experienced very bad Taste here..Chef Can't  cook the RECIPE as per Customer Requests.. but prices are More than high if compared with RED CHILLY in Town..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Highway side restaurant. Small setup. No wheel chair access. Food quality and service can grossly improve",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Over night stay from a long drive will be better. Nice and silent place with good aminities..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Lowest Rate But Highly Arrangements. I Love It This Place. Brindavan is too much Good for Facilities and cooperative staff. Valuable Hotel in Adoni Andhra Pradesh.\nUnique Hotel in Lowest Tarriff.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place stay hangout friends family near approach town calm peaceful location service great ample parking facility service menu good",
                "worst chefpanner hard eat especially paneer majestic experienced bad taste herechef cant cook recipe per customer requests prices high compared red chilly town",
                "highway side restaurant small setup wheel chair access food quality service grossly improve",
                "night stay long drive better nice silent place good aminities",
                "lowest rate highly arrangements love place brindavan much good facilities cooperative staff valuable hotel adoni andhra pradesh unique hotel lowest tarriff"
            ]
        },
        {
            "name": "Hotel Dwarka",
            "rating": [
                4
            ],
            "address": [
                "J7CG+53C, HBG Nagar, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "The lodge is really nice, with clean beds, and it's super close to the train station. This makes it one of the best places to stay. The beds are not just comfy but also really clean. Being so near the railway station is a big plus because it's convenient for travelers. So, if you want a cozy place with comfy beds that's also near the train station, this lodge is a great choice.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hey it s a  good theatre with dolby sound faxility and neatly maintained surroundings and service also good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice place food available in reasonable price cleaning staff neatness al so good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "GOOD LODGE IN ADONI TOWN &&VERY  NEAT LODGE NEAR TO ADONI RAILWAY STATION & COURT& MUNICIPAL OFFICE & NEAR OLD BUS STAND.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's not hotel dwaraka.. it's v celluloid... Not clean, no hygiene, nothing special,,",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "lodge really nice clean beds super close train station makes one best places stay beds comfy also really clean near railway station big plus convenient travelers want cozy place comfy beds thats also near train station lodge great choice",
                "hey good theatre dolby sound faxility neatly maintained surroundings service also good",
                "nice place food available reasonable price cleaning staff neatness al good",
                "good lodge adoni town neat lodge near adoni railway station court municipal office near old bus stand",
                "hotel dwaraka v celluloid clean hygiene nothing special"
            ]
        },
        {
            "name": "Capital O 61155 Chekuri Residency",
            "rating": [
                3.9
            ],
            "address": [
                "SH 33, RTC Colonly, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Clean place, good staff behaviour, nice stay",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is the definition of how a hotel room should be. After a long time and many travels across many cities, I find this hotel to be perfect in cleanliness, 24 hr hot water, spacious room, an AC that works in silence.\nTowel and soap provided.\nI felt it's worth paying for this hotel, usually used to stay expensive but dirty mantralayam or raichur hotels.\n\nCons:\nparking is on road side,\nI didn't ask for wifi service since we were on pilgrimage,\nThe restaurant next to this which used to serve awesome avakai biryani has closed down,\nIt's an hour and a half to mantralayam, 2hrs to kallur Lakshmi temple.\n\nI just hope they maintain this hotel with the same cleanliness and be a model for Raichur, mantralayam and kurnool hotels.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Superb rooms",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice and spacious,",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Soooo",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean place good staff behaviour nice stay",
                "definition hotel room long time many travels across many cities find hotel perfect cleanliness hr hot water spacious room ac works silence towel soap provided felt worth paying hotel usually used stay expensive dirty mantralayam raichur hotels cons parking road side didnt ask wifi service since pilgrimage restaurant next used serve awesome avakai biryani closed hour half mantralayam hrs kallur lakshmi temple hope maintain hotel cleanliness model raichur mantralayam kurnool hotels",
                "superb rooms",
                "nice spacious",
                "soooo"
            ]
        },
        {
            "name": "Vimala Regency",
            "rating": [
                5
            ],
            "address": [
                "1/602, Bypass road, Adoni, Andhra Pradesh 518302, India"
            ],
            "reviews": [
                {
                    "text": "Any vacancy...?? Whatever work\nReply me sir",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Mice atmosphere",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Delicious",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "vacancy whatever work reply sir",
                "mice atmosphere",
                "good",
                "delicious"
            ]
        },
        {
            "name": "Basamma Hotel & Hostel",
            "rating": [
                4.2
            ],
            "address": [
                "4-343-6-1, Near smb function hall Ramajala, Road, Aranjyothi Nagar, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "4-5 sharing room\nCost is ok\nFood quality is very good",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It feels like a house. Tha owners are Move like a family . Food quality is excellent. I spent 2.5 years in this mess.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's have good abians",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good place to eat food especially for hotel people... it's 🍵 tea point also...",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very bat",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sharing room cost ok food quality good",
                "feels like house tha owners move like family food quality excellent spent years mess",
                "good abians",
                "good place eat food especially hotel people ð\u009f\u008dµ tea point also",
                "bat"
            ]
        },
        {
            "name": "Gokar janda",
            "rating": [
                4
            ],
            "address": [
                "J7JG+WH8, PN Rd, Marati street, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Mind bowling",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mind bowling"
            ]
        },
        {
            "name": "Raju bhai hotel",
            "rating": [
                3.8
            ],
            "address": [
                "Kowdelpet, NEAR, police station, Old Town, Adoni, Andhra Pradesh 518301, India"
            ],
            "reviews": [
                {
                    "text": "Tasty Tiffins...Fast service",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Ok",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Super",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "tasty tiffinsfast service",
                "ok",
                "super"
            ]
        }
    ]
}