{
    "places_with_reviews": [
        {
            "name": "Hotel Amit Park International",
            "rating": [
                4
            ],
            "address": [
                "26, Shivnath Complex, Beside Nigam, G. E. Road, Dist, Akash Ganga, Supela, Bhilai, Chhattisgarh 490023, India"
            ],
            "reviews": [
                {
                    "text": "Undoubtedly the best place to stay at Bhilai in terms of luxury, comfort and value for money. This is located very close to the highway. The rooms are spacious. The check in process was very smooth. The staff was polite. The hotel is clean and well maintained. The hotel has its own restaurant and a bar. There is also a fitness centre in the adjacent building. The complimentary breakfast provided was tasty. There are plenty of options on the menu for in room dining. The prices are very reasonable. They have ample parking space and also parking at the basement. Overall, a good stay experience and would want to stay here again.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This is a luxury hotel and the ambience is great. Food quality and taste is always awesome. However, when it comes to service, it's very poor. Most of the serving staff of the restaurant is over worked and it takes them a lot of time to serve your food. About 50- 60 minutes. So visit this place only if you have a lot of time.\nAlso, they switched off the lights in the lobby, wash room and most of the restaurant before they served our food. At least four other families were having their dinner at that time.\nIf there was minus marking for service I would have given that.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place to dine in Bhilai. Atharv venue is awesome for party and celebration. Very tasty and delicious veg and non-veg food. Courteous, decent, well-mannered staff and very quick service. Management is too good. Free and guided parking. Would highly recommend this place for party, celebration and dining also.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Reception people are hopeless. I have asked for checkout at 7.35 am and ask for luggage. Just after chasing I could get my luggage from room at 8.19 am. Such a poor service.\nLights in toilet is not sufficient\nFood quality is good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The food is average, and degrading day by day... the parking is only available for 4-5 cars, with no valer service, parking here is a pain, with guards only sending from one place to other, and will have to walk under dark if you're here to attend an evening event... Pathetic experience regarding parking and with food quality degrading, management sure has to review the arrangements",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "undoubtedly best place stay bhilai terms luxury comfort value money located close highway rooms spacious check process smooth staff polite hotel clean well maintained hotel restaurant bar also fitness centre adjacent building complimentary breakfast provided tasty plenty options menu room dining prices reasonable ample parking space also parking basement overall good stay experience would want stay",
                "luxury hotel ambience great food quality taste always awesome however comes service poor serving staff restaurant worked takes lot time serve food minutes visit place lot time also switched lights lobby wash room restaurant served food least four families dinner time minus marking service would given",
                "best place dine bhilai atharv venue awesome party celebration tasty delicious veg nonveg food courteous decent wellmannered staff quick service management good free guided parking would highly recommend place party celebration dining also",
                "reception people hopeless asked checkout ask luggage chasing could get luggage room poor service lights toilet sufficient food quality good",
                "food average degrading day day parking available cars valer service parking pain guards sending one place walk dark youre attend evening event pathetic experience regarding parking food quality degrading management sure review arrangements"
            ]
        },
        {
            "name": "Grand Dhillon",
            "rating": [
                3.9
            ],
            "address": [
                "A-1, Nehru Nagar Square, G.E. Road, Priyadarsani Parisar West, Priyadarsani Parisar West, Bhilai, Chhattisgarh 490020, India"
            ],
            "reviews": [
                {
                    "text": "During my stay at Hotel Grand Dhillon, Mr. Tushar, Mr. Deepak, and Ms. Mehek, along with the excellent housekeeping staff, went above and beyond to make me feel at home. Despite being a three-star hotel, their exceptional service exceeded all expectations. From check-in to checkout, they provided personalized attention and assistance, making my stay truly memorable. Their warmth and professionalism, combined with the hotel's comfortable accommodations, created a welcoming atmosphere. Additionally, the ala carte menu for room service was also excellent, adding to the overall experience. I highly recommend Hotel Grand Dhillon to anyone seeking a memorable and enjoyable stay in Bhillai.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Dhillon recently opened a cafe on the first floor. I went on a work date with a friend. It’s a quite place to work and charging points are also available. You’ll usually find wraps filled with mediocre cold cuts and limp lettuce but the wrap I had was lil spiced with vibrant ingredients. Hot chocolate was first-rate with balanced sweetness. Croissant was wispy. Would recommend this place if you are looking for a change to work.\nP.S. - got a complimentary brownie.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We had a fantastic experience during our stay. We thoroughly enjoyed the service, facilities, courteous staff, and especially the delicious food. Chef Naresh's recommendations were absolutely outstanding.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I recently had the pleasure of dining at the 7th Floor Bar and Restaurant in Bhilai and I must say, it was an exceptional experience. The ambiance of the restaurant is simply stunning, with a breathtaking view from the 7th floor. The decor is modern and stylish, creating a very inviting atmosphere.\n\nThe food was absolutely delicious. I tried a variety of dishes from their menu and each one was expertly prepared and bursting with flavor. The presentation of the dishes was also very impressive, showcasing the attention to detail that goes into every meal.\n\nThe service was top-notch as well. The staff was attentive, friendly, and knowledgeable about the menu. They made sure that my dining experience was nothing short of perfect.\n\nOverall, I would highly recommend the 7th Floor Bar and Restaurant.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel was very clean, from the lobby to the restaurant, bar, and each room, and every detail of our request was promptly responded to with a smile. I had a very comfortable stay. A big thank you to Annu, Hema, Mehak, Deepak, Vinay and all the hotel staff.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay hotel grand dhillon mr tushar mr deepak ms mehek along excellent housekeeping staff went beyond make feel home despite threestar hotel exceptional service exceeded expectations checkin checkout provided personalized attention assistance making stay truly memorable warmth professionalism combined hotels comfortable accommodations created welcoming atmosphere additionally ala carte menu room service also excellent adding overall experience highly recommend hotel grand dhillon anyone seeking memorable enjoyable stay bhillai",
                "dhillon recently opened cafe first floor went work date friend itâ\u0080\u0099s quite place work charging points also available youâ\u0080\u0099ll usually find wraps filled mediocre cold cuts limp lettuce wrap lil spiced vibrant ingredients hot chocolate firstrate balanced sweetness croissant wispy would recommend place looking change work ps got complimentary brownie",
                "fantastic experience stay thoroughly enjoyed service facilities courteous staff especially delicious food chef nareshs recommendations absolutely outstanding",
                "recently pleasure dining th floor bar restaurant bhilai must say exceptional experience ambiance restaurant simply stunning breathtaking view th floor decor modern stylish creating inviting atmosphere food absolutely delicious tried variety dishes menu one expertly prepared bursting flavor presentation dishes also impressive showcasing attention detail goes every meal service topnotch well staff attentive friendly knowledgeable menu made sure dining experience nothing short perfect overall would highly recommend th floor bar restaurant",
                "hotel clean lobby restaurant bar room every detail request promptly responded smile comfortable stay big thank annu hema mehak deepak vinay hotel staff"
            ]
        },
        {
            "name": "Empyrean hotels & resort",
            "rating": [
                4.2
            ],
            "address": [
                "Durg Bypass, Padmanabhpur, Pushpak Nagar, 6856+QCJ, near Maruti Suzuki Arena, Durg Padmanabhpur, Bhilai, Chhattisgarh 490020, India"
            ],
            "reviews": [
                {
                    "text": "Very good place for any large scale function,  family functions eg. Marriage,  birthday,  seminars,  social events,  institutional events.\nLocation is good,  in the outskirts of city,No problem of traffic jam . Just besides the National highway.\nLarge parking space.\nBeautiful Hall.\nGood lawn area.\nCost Not calibrated.\nDecisions at own  discretion.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The atmosphere at the resort is nothing short of magical. Surrounded by lush greenery and serenaded by the melody of nature, guests are transported to a realm of relaxation. The architecture seamlessly blends with the natural surroundings, creating an ambiance that is both sophisticated and inviting. Whether lounging by the pool or strolling through the manicured gardens, the atmosphere exudes a sense of serenity.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Awesome place for large size marriage function.\nInfact multiple marriage party can be organised at a time.\nFood 👌, parking 👌, ambience 👌",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Ample indoor and outdoor space.There is variety in the menu card. The food is also delicious, it feels good to get value for money.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Empyrean Hotel should be on top of your list of hotels it is Suitable for all your needs.\nSpacious for all functions and events\nARC has opened up with big upcoming plans, one of the best bars in Bhilai-Durg",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place large scale function family functions eg marriage birthday seminars social events institutional events location good outskirts cityno problem traffic jam besides national highway large parking space beautiful hall good lawn area cost calibrated decisions discretion",
                "atmosphere resort nothing short magical surrounded lush greenery serenaded melody nature guests transported realm relaxation architecture seamlessly blends natural surroundings creating ambiance sophisticated inviting whether lounging pool strolling manicured gardens atmosphere exudes sense serenity",
                "awesome place large size marriage function infact multiple marriage party organised time food ð\u009f\u0091\u008c parking ð\u009f\u0091\u008c ambience ð\u009f\u0091\u008c",
                "ample indoor outdoor spacethere variety menu card food also delicious feels good get value money",
                "empyrean hotel top list hotels suitable needs spacious functions events arc opened big upcoming plans one best bars bhilaidurg"
            ]
        },
        {
            "name": "Samaira Inn",
            "rating": [
                3.7
            ],
            "address": [
                "Plot No. - 19\\22, Ward No. 23, Pragati Nagar, Risali, Bhilai, Chhattisgarh 490006, India"
            ],
            "reviews": [
                {
                    "text": "The entire hotel was covered with glass with no AC on and hence it was difficult to sit in the corridors.  Also, the basic amenities were missing like Geyser  was not funtioning, following were not provided (soap,Shampoo,Dental kit,etc). The key card of the doors were not working properly. Only good thing was food. The food was delicious",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Didn't like the place at all. When we got there and ordered food, starters came around 45 mins late. The main course came around 1 hour after the starters.\n\nA new restaurant opened inside Samaira Inn on 14th February which made non-veg dishes available there, we all were excited to try them out. But almost all the chicken and fish dishes we ordered whether starters or main course, came improperly cooked and bland in taste.\n\nNot at all satisfied with the service. We ordered dal tadka, but they gave us dal fry. At that point we all were too hungry to reorder it. We ordered steamed rice which took 20-30 mins to arrive.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Horrible experience with the hotel. The staff is very rowdy and rude in behavior. The property was badly maintained, including amenities. Geysers in rooms don’t work; they provide an immersion rod to heat water. My in-laws, who came from Northeastern India, were inadvertently harassed by hotel staff for burning a towel with an immersion rod, and Rs 500 has been taken as compensation. These kinds of hotels give a bad name to Bhilai, and they lack professionalism to work in the hospitality sector. Please stay away!",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I recently organized a marriage reception event at Samaira Inn, my overall experience is very pathetic, all the staff are uneducated and not even the management team, the general manager is overall unresponsive, all my guests in my 600 person wedding reception Waiting for food from last 1 hour but hotel team is not serving food, please Bhilai people do not make this hotel for any wedding reception function, all my guests, even my brother in law are imagining your staff.....\n\nThankyou\nSuresh bisoi\nPune",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Just for the restaurant in it. It smelled and didn't have a variety of food options. Also waiters were not knowledgeable in serving portions.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "entire hotel covered glass ac hence difficult sit corridors also basic amenities missing like geyser funtioning following provided soapshampoodental kitetc key card doors working properly good thing food food delicious",
                "didnt like place got ordered food starters came around mins late main course came around hour starters new restaurant opened inside samaira inn th february made nonveg dishes available excited try almost chicken fish dishes ordered whether starters main course came improperly cooked bland taste satisfied service ordered dal tadka gave us dal fry point hungry reorder ordered steamed rice took mins arrive",
                "horrible experience hotel staff rowdy rude behavior property badly maintained including amenities geysers rooms donâ\u0080\u0099t work provide immersion rod heat water inlaws came northeastern india inadvertently harassed hotel staff burning towel immersion rod rs taken compensation kinds hotels give bad name bhilai lack professionalism work hospitality sector please stay away",
                "recently organized marriage reception event samaira inn overall experience pathetic staff uneducated even management team general manager overall unresponsive guests person wedding reception waiting food last hour hotel team serving food please bhilai people make hotel wedding reception function guests even brother law imagining staff thankyou suresh bisoi pune",
                "restaurant smelled didnt variety food options also waiters knowledgeable serving portions"
            ]
        },
        {
            "name": "Hotel Central Park",
            "rating": [
                3.9
            ],
            "address": [
                "29, Shivnath Complex, GE Road, Supela, Akash Ganga, Supela, Bhilai, Chhattisgarh 490023, India"
            ],
            "reviews": [
                {
                    "text": "Reception was too good for a hotel like this but they also provide hall services for family events so it's understandable. Hotel rooms are just good. Nothing exceptional. Basic amenities like water bottles, glasses, towels, body wash, hair shampoo, hand wash were already their. But the quality of TV (under average Chinese TV) and cable service provider was meeh. Complementary breakfast was a time saver for me. They also have a restaurant where you can choose either dine in or order to room. Prices are slightly higher than outside but quality definitely justifies the price. Getting hot water immediately is tricky. You've to waste a whole bucket of water to get hot water which I don't like. They're probably using solar water heaters for all the rooms so. Cleanliness was pretty good. They cleaned the room next day while I was at work without my permission. They didn't even called me to ask and yes, I had the room key with me. It's a good thing for me but for those who like some privacy of their stuff would be annoying. Overall it was a pleasant stay and the cost was alright. Staff behaviour was good. Location of the hotel is pretty good too.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "We had a party in the banquet hall. Overall it is ok. Not an impressive management. It is not the worst I would say but as impressive as well.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Their food tastes the worst of all time. The behaviour of the staff is very bad They make bad comments on girls as misbehaved.They don't even listen to complaints. And the food is yuck 🤮.\nThey don't have manners to talk and behave with their guest.\n\nIf you're a student or planning to do any kind of party don't do it here .",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Visited the restaurant for lunch.\nFood was pretty good in taste but service was a bit of a problem.\nThe place was pretty empty and only one staff member was available which could only take and bring order and couldn't find time for service. Other staff were busy in sudden party, as conveyed.\nNever ever try a mocktail here , it's totally packaged mixing and no original flavours.Roasted papad was medium sized, normally it's large one and the papad were old enough. Spring rolls were almost zero oil , that was very nice and surprising but it's small cutting threw all the stuffing out. Soups were pretty good.\nSnacks were good in taste. Rotis were cold, due to high service time. Cooking time was more, hence the delay between snacks and lunch.\nThe ambience is neat and good. Once in a while can visit with groups. Portion size is good enough.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice ambience.nice food..supportive staff.rooms are spacious..hygene maintenance good..,,",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "reception good hotel like also provide hall services family events understandable hotel rooms good nothing exceptional basic amenities like water bottles glasses towels body wash hair shampoo hand wash already quality tv average chinese tv cable service provider meeh complementary breakfast time saver also restaurant choose either dine order room prices slightly higher outside quality definitely justifies price getting hot water immediately tricky youve waste whole bucket water get hot water dont like theyre probably using solar water heaters rooms cleanliness pretty good cleaned room next day work without permission didnt even called ask yes room key good thing like privacy stuff would annoying overall pleasant stay cost alright staff behaviour good location hotel pretty good",
                "party banquet hall overall ok impressive management worst would say impressive well",
                "food tastes worst time behaviour staff bad make bad comments girls misbehavedthey dont even listen complaints food yuck ð\u009f¤® dont manners talk behave guest youre student planning kind party dont",
                "visited restaurant lunch food pretty good taste service bit problem place pretty empty one staff member available could take bring order couldnt find time service staff busy sudden party conveyed never ever try mocktail totally packaged mixing original flavoursroasted papad medium sized normally large one papad old enough spring rolls almost zero oil nice surprising small cutting threw stuffing soups pretty good snacks good taste rotis cold due high service time cooking time hence delay snacks lunch ambience neat good visit groups portion size good enough",
                "nice ambiencenice foodsupportive staffrooms spacioushygene maintenance good"
            ]
        },
        {
            "name": "Hotel Nikhil Regency",
            "rating": [
                4.2
            ],
            "address": [
                "NH53, near Power House, Janjgiri, Bhilai, Chhattisgarh 490001, India"
            ],
            "reviews": [
                {
                    "text": "Recently I visited the Property and surprisingly it was good to notice the atmosphere at the Property. First of all the cleanliness was excellent which refreshed the exertion after long travel. Secondly the reception staff behaviour was excellent. Specially their gesture and helping nature. It was a very good experience at the Property. Due to official works I couldn't stay long but the overall experience was too good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good place for overnight stops. Pet friendly. (They charge ₹500 for pet). Room service ok.. in room free breakfast is good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I stayed in Nikhil Regency during my recent visit to Bhilai.\n\nPro:\n1. The hotel location is at the highway so thats a plus point for them.\n2. It is not very expensive hotel.\n3. Goibibo allowed me to book it for 1₹ initially and did not forced ne to pay the whole amount while booking.\n4. Beautiful hall for party and function.\n\nCons:\n1. The front desk staff is not professional at all. They are actually rude.\n2. They charge GST on all items. Even on items with MRP(All taxes are by default included in MRP)\n3. I don’t think they changed rooms bedsheets regularly.\n4. Unhygienic Bathroom.\n5. They provided some random brand water bottles for guests.\n6. No in house parking.\n7. They will ask stupid questions about the guests staying in same room irrespective of their age.\n8. Even after submitting identity proof they will ask you to self-attest the copies. There is no need/law for this.\n9. No scenic view from room window.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The very bad experience in this hotel.They don't know the meaning of hospitality .Their manager named toshiq doesn't know how to talk with guest. I am sharing my experience with him when I and my guest was going to my room he shout from the reception and said me what about payment.This is very bad. Service was very pathetic.I called from my room twice that wi fi is not working and the staff said that electrician is coming but no body came. And in morning at the time I talked to Mr Toshiq who was manager at that time said that wire of wi fi is loose.But in last strange this is that they don't know the meaning of higen.when I was leaving from reception I saw that the packets of milk and curd was lying on the floor. I advise you that please don't visit this place if you have harden money",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I recently stayed at this hotel, and I must say I was quite disappointed with my experience. The receptionist's behavior was completely rude and unprofessional. It felt like she had no idea how to speak with customers, and her attitude left a lot to be desired.\n\nFurthermore, the rooms were surprisingly small. I felt cramped and uncomfortable throughout my stay, which didn't make for a pleasant experience. Overall, I wouldn't recommend this hotel based on my recent visit. It's essential for a hotel to provide a welcoming atmosphere and comfortable accommodations, and unfortunately, this one fell short on both fronts.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently visited property surprisingly good notice atmosphere property first cleanliness excellent refreshed exertion long travel secondly reception staff behaviour excellent specially gesture helping nature good experience property due official works couldnt stay long overall experience good",
                "good place overnight stops pet friendly charge â\u0082¹ pet room service ok room free breakfast good",
                "stayed nikhil regency recent visit bhilai pro hotel location highway thats plus point expensive hotel goibibo allowed book â\u0082¹ initially forced ne pay whole amount booking beautiful hall party function cons front desk staff professional actually rude charge gst items even items mrpall taxes default included mrp donâ\u0080\u0099t think changed rooms bedsheets regularly unhygienic bathroom provided random brand water bottles guests house parking ask stupid questions guests staying room irrespective age even submitting identity proof ask selfattest copies needlaw scenic view room window",
                "bad experience hotelthey dont know meaning hospitality manager named toshiq doesnt know talk guest sharing experience guest going room shout reception said paymentthis bad service pathetici called room twice wi fi working staff said electrician coming body came morning time talked mr toshiq manager time said wire wi fi loosebut last strange dont know meaning higenwhen leaving reception saw packets milk curd lying floor advise please dont visit place harden money",
                "recently stayed hotel must say quite disappointed experience receptionists behavior completely rude unprofessional felt like idea speak customers attitude left lot desired furthermore rooms surprisingly small felt cramped uncomfortable throughout stay didnt make pleasant experience overall wouldnt recommend hotel based recent visit essential hotel provide welcoming atmosphere comfortable accommodations unfortunately one fell short fronts"
            ]
        },
        {
            "name": "Hotel Himalaya Park",
            "rating": [
                3.9
            ],
            "address": [
                "Akash Ganga Market, Supela Chowk, Akash Ganga, Supela, Bhilai, Chhattisgarh 490023, India"
            ],
            "reviews": [
                {
                    "text": "I had a disappointing experience at this  hotel. The night staff seemed unprofessional, making me feel uneasy. To add to the frustration, none of the facilities were working, and when I requested basic amenities like water and hot water for a shower, the staff denied assistance. Additionally, there was an unexpected demand for extra cash. Overall, a regrettable stay with subpar service. 🚫⚠️\n#UnpleasantExperience #CustomerServiceMatters",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is ok but the hotel management is very bad, the general manager talks like a peon and is very rude, that's why I gave 1 star. Very bad experience even ye log review v na Karne dete hai",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "One of the landmark hotel of the city. Placed in a good location along the highway. Amid the market to fulfill shopping desire as well satisfy hunger. Parking is also available.\n\nCity and market view from the hotel. Rooms are cozy, decorations are average could be trendy.\n\nRecommended place for a day or two day visits. Staff is well behaved and co-operative.\n\nRound the clock service. Transportation available on demand.\n\nSome of the amenities are at par to market standards, some needs to be upgraded.\n\nOverall, a good place to spend time for personal as well as business visits. Suitable for family.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel stay was pleasant and the staff were friendly, local transportation is available,",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Not recommended. Smelly and uncleaned rooms. Dirty blankets and bed sheets. Not worth the price they charge.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "disappointing experience hotel night staff seemed unprofessional making feel uneasy add frustration none facilities working requested basic amenities like water hot water shower staff denied assistance additionally unexpected demand extra cash overall regrettable stay subpar service ð\u009f\u009a « â\u009a ï¸\u008f unpleasantexperience customerservicematters",
                "hotel ok hotel management bad general manager talks like peon rude thats gave star bad experience even ye log review v na karne dete hai",
                "one landmark hotel city placed good location along highway amid market fulfill shopping desire well satisfy hunger parking also available city market view hotel rooms cozy decorations average could trendy recommended place day two day visits staff well behaved cooperative round clock service transportation available demand amenities par market standards needs upgraded overall good place spend time personal well business visits suitable family",
                "hotel stay pleasant staff friendly local transportation available",
                "recommended smelly uncleaned rooms dirty blankets bed sheets worth price charge"
            ]
        },
        {
            "name": "Bhilai Niwas (Formerly Bhilai Hotel)",
            "rating": [
                4
            ],
            "address": [
                "58GQ+V7W, Civic Centre Area Rd, Civic Center Area, Sector 5, Bhilai, Chhattisgarh 490006, India"
            ],
            "reviews": [
                {
                    "text": "It's a very good place to stay two/three days. Rooms are quite spacious, service good. Scenic beauty good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Indian coffee restaurant takes too much time to serve. I just ordered 2 coffee and 1 tea and it took them 30 minutes.Taste was very fabulous. I would recommend others to try this place once",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Previously it was managed by Bhilai Steel Plant now this niwas is maintained by an Indian coffee house.\nWell maintained like food and other facilities by the coffee house.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food is good and tasty. Well behaved staffs. Neat and clean and quiet ambience an added advantage.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I know nothing about the rooms here. But the food is awesome. Service is good.\nLocation is A-class.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay twothree days rooms quite spacious service good scenic beauty good",
                "indian coffee restaurant takes much time serve ordered coffee tea took minutestaste fabulous would recommend others try place",
                "previously managed bhilai steel plant niwas maintained indian coffee house well maintained like food facilities coffee house",
                "food good tasty well behaved staffs neat clean quiet ambience added advantage",
                "know nothing rooms food awesome service good location aclass"
            ]
        },
        {
            "name": "Hotel Amit International",
            "rating": [
                4
            ],
            "address": [
                "B-C/3, Shivnath Vistar Vyavsayik Yojana, G.E.Road, 6946+X3Q, National Highway 6, Supela, next to Maurya Talkies, Shastri Nagar, Bhilai, Chhattisgarh 490023, India"
            ],
            "reviews": [
                {
                    "text": "We were there to attend a party.. 4th floor banquet hall is spacious just the washrooms are somehow inappropriate. Lift landing area is also very congested.\n\nFood is delicious..❤️\nJeera rice, Dal fry and aaloo gobhi matar just amazing...\n\nLastly I would suggest to improve service staff, uniform standards and basic service courtesy..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Though banquet halls are not very big but it is good place for 200 something people for small parties/birthday/anniversaries etc , food has both veg/non veg options , prices are as per prevailing rates in area, taste of food is decent and service is good",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place for staying in Steel City Bhilai\nClose to National Highway. The dining facilities are nice, the staff is very nice and the cleanliness is decent.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Service is very good, staff is very cordial, well trained 👍🏆",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "ambience is good.\nfood at the restaurant is good. service and presentability can be better.\nstaff is not professional. need more education on customer service",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "attend party th floor banquet hall spacious washrooms somehow inappropriate lift landing area also congested food deliciousâ\u009d¤ï¸\u008f jeera rice dal fry aaloo gobhi matar amazing lastly would suggest improve service staff uniform standards basic service courtesy",
                "though banquet halls big good place something people small partiesbirthdayanniversaries etc food vegnon veg options prices per prevailing rates area taste food decent service good",
                "best place staying steel city bhilai close national highway dining facilities nice staff nice cleanliness decent",
                "service good staff cordial well trained ð\u009f\u0091\u008dð\u009f\u008f\u0086",
                "ambience good food restaurant good service presentability better staff professional need education customer service"
            ]
        },
        {
            "name": "Hotel Seventh Sense",
            "rating": [
                4
            ],
            "address": [
                "Behind Dhulewale Showroom, Hotel Seventh Sense, Shivnath Complex, GE Rd, near Maurya Taklies Square, Akash Ganga, Supela, Bhilai, Chhattisgarh 490023, India"
            ],
            "reviews": [
                {
                    "text": "Worst place ,,,\nworst location\nRidiculous place\nRude staff\ni am writing this review again because every time owner ask to that so called chhapri berojgar yuva neta to delete this review\nthere were some students , actualluy i must say some foolish , uneducated students ,,,,who dont know how to talk even ,,,, they were in hotel ,,,by giving 500 which they collected by asking chanda , and doing some ghatiya party ,,, lots of noise ,,,lot of weird and strange activites.\nkalyan college ridiculous student. so mr owner you need to improve the services.\nand Mr berojgar chhapri yuva neta if you have guts then directly connect me.\nYou are not even worth the dust of my slippers",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great experience my all friends thanks to me find this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The hotel service is excellent, making this a better choice. Their attempts to make your stay as comfortable as possible are praiseworthy.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very good experience, good food, good staff, nice behaviour",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A great place to stay. FAMILY FRIENDLY WITH GREAT FOOD 👍\nwe were traveling from Rourkela to Bangalore by road and stayed here for one night. The room condition was just WOW and very neat and clean while the dinner served was amazing. They also got a extra bed at no extra cost. Morning we had to leave early around 6 am they also arranged to pack us breakfast complimentary along with some fresh fruits .\n\nIf you plan to visit Bhillai please opt for this place you will not regret.\n\nLocation wise ths is located at a good place just on highway and great shopping place around 😀",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst place worst location ridiculous place rude staff writing review every time owner ask called chhapri berojgar yuva neta delete review students actualluy must say foolish uneducated students dont know talk even hotel giving collected asking chanda ghatiya party lots noise lot weird strange activites kalyan college ridiculous student mr owner need improve services mr berojgar chhapri yuva neta guts directly connect even worth dust slippers",
                "great experience friends thanks find hotel",
                "hotel service excellent making better choice attempts make stay comfortable possible praiseworthy",
                "good experience good food good staff nice behaviour",
                "great place stay family friendly great food ð\u009f\u0091\u008d traveling rourkela bangalore road stayed one night room condition wow neat clean dinner served amazing also got extra bed extra cost morning leave early around also arranged pack us breakfast complimentary along fresh fruits plan visit bhillai please opt place regret location wise ths located good place highway great shopping place around ð\u009f\u0098\u0080"
            ]
        }
    ]
}