{
    "places_with_reviews": [
        {
            "name": "Radisson Blu Resort & Spa - Alibaug, India",
            "rating": [
                4.5
            ],
            "address": [
                "Gondhalpada, Varasoli, Alibag, Maharashtra 402209, India"
            ],
            "reviews": [
                {
                    "text": "Great place with a huge and maintained pool. Not too far from the beach. Food is costly but very tasty. Great facility for kids to spend those sunny afternoons. One big issue I had is that they still keep giving plastic bottled water. Every big hotel has gone green in that aspect and serves drinking water in rooms and in restaurants in glass bottles. Same goes for utilities in bathrooms etc. Something to look into urgently!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "A perfect gateway from Mumbai. Loved the ambiance and hotel rooms and food. Only the service is little slow on crowded days.\nAlso good place with kiddos as the play zone and swimming pool is awesome",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at this hotel, and I must say, it was an absolutely amazing experience. The hotel's ambiance is awesome, providing a sense of tranquility and relaxation from the moment you step in. The panoramic view from the hotel is breathtaking, offering a spectacular vista of the surroundings.\n\nWhat impressed me the most was the sheer size of the property. It's vast and well-designed, ensuring that guests have more than enough space to explore and enjoy their time. The maintenance of the hotel is impeccable, with every corner spotlessly clean and well-kept.\n\nOne of the standout features of this hotel is the variety of activities it offers. There are so many things to do within the premises that you'll never find a dull moment. Whether you prefer to lounge by the pool, indulge in spa treatments, or engage in outdoor sports, the options are endless.\n\nMoreover, for guests who love to explore the area, the hotel provides bicycles, allowing you to roam around conveniently and at your own pace. This added amenity truly enhances the overall experience, making it easy to venture out and discover the beauty of the surroundings.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice hotel. The rooms are very spacious. Housekeeping is very good but other services are a little bit immature. Food is not so great in the main restaurant, whereas the south Indian restaurant is very tasty. This property is a bit far away from the actual Alibaug beach (4.5 km).",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The rooms & property are well maintained. The breakfast buffet is good. The taste of A la carte items were ranging from good to salty. The room service especially housekeeping should be a bit more prompt. We've to call the reception for WiFi details. Generally they are placed in the room in other hotels. Plus point - Cleaning of rooms are done daily without reminders. Personally, I was disappointed when the surprise element was missing even after confirming our tentative arrival time. Since it's a top end hotel,one expects more perfection. More dustbins should be placed across the property for ease in waste disposal.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great place huge maintained pool far beach food costly tasty great facility kids spend sunny afternoons one big issue still keep giving plastic bottled water every big hotel gone green aspect serves drinking water rooms restaurants glass bottles goes utilities bathrooms etc something look urgently",
                "perfect gateway mumbai loved ambiance hotel rooms food service little slow crowded days also good place kiddos play zone swimming pool awesome",
                "recently pleasure staying hotel must say absolutely amazing experience hotels ambiance awesome providing sense tranquility relaxation moment step panoramic view hotel breathtaking offering spectacular vista surroundings impressed sheer size property vast welldesigned ensuring guests enough space explore enjoy time maintenance hotel impeccable every corner spotlessly clean wellkept one standout features hotel variety activities offers many things within premises youll never find dull moment whether prefer lounge pool indulge spa treatments engage outdoor sports options endless moreover guests love explore area hotel provides bicycles allowing roam around conveniently pace added amenity truly enhances overall experience making easy venture discover beauty surroundings",
                "nice hotel rooms spacious housekeeping good services little bit immature food great main restaurant whereas south indian restaurant tasty property bit far away actual alibaug beach km",
                "rooms property well maintained breakfast buffet good taste la carte items ranging good salty room service especially housekeeping bit prompt weve call reception wifi details generally placed room hotels plus point cleaning rooms done daily without reminders personally disappointed surprise element missing even confirming tentative arrival time since top end hotelone expects perfection dustbins placed across property ease waste disposal"
            ]
        },
        {
            "name": "Tropicana Resort & Spa Alibaug",
            "rating": [
                4.2
            ],
            "address": [
                "Chondi Naka, Mapgaon, Alibag, Sogaon, Maharashtra 402201, India"
            ],
            "reviews": [
                {
                    "text": "First things first, this place has two routes to get in and out of here. One is really narrow and you may find heavy vehicles weaving in and out of this route. The second, leads to the city and is 1km long, though this one is better than the first in terms of traffic and not the quality of road. Secondly, The property in itself is still developing the last we checked but the developed part o it is really nice with outdoor spots to relax and enjoy the environment even during the day. Thirdly, the pool area was nice with pool for kids and adults with a lounging area nearby and its quiet. The rooms are comfortable, and the layout from the perspective of a blind individual is quite straightforward and I liked that, since I myself am totally blind. The premises is built in a township like manner and I liked walking around with my companions around it. There is adequate space for parking and one can book the villas as well though it is beneficial when there's a large group like let's say of 8 or 10 people. The individual rooms are quite nice as well.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice place for a quite retreat. Close to the beach, however the roads leading to the Resort is in very bad shape.\nWell maintained pool & gardens.\nFood (as part of the Club Mahindra) was very delicious, and the staffs are professional, courteous and helpful.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We were a big grp went to this resort looking at all the reviews with very high expectations and paying a good amt. We were very much disappointed with their service, food and also hospitality. I will not recommend this resort to anyone. Room service, food and cleanliness all were disappointing. Games in club house were all broken. Just big DISAPPOINTMENT. They took all the payment but didn't give us clean rooms instead of making prior bookings we got the rooms by 2 and we only had to go and follow up with housekeeping to clean our villa, all this took approx more 2.5 hrs. We had kids with us and all of us were waiting in bad heat to start with our holiday. Same thing happened next day for room cleaning and pool cleaning. Not happy.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best resorts I’ve ever been. Spreaded in a very large area, parking by the villas and it only gets more breathtaking when you walk in. High quality rooms, clean washroom, a personal swimming pool and high quality service. Big green areas and parks all over the place. One can enjoy cycling, do adventure sports and other small games around the campus (Reasonable Charges applicable).Overall it was a pleasure to be at this resort. Please do visit and experience the magic when in Alibaug.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice, cosy and luxurious. Stayed in a pool villa - independent, includes four large bedrooms. Excellent for a big family get together. Just a minor issue that I faced, the villa does not have any way to let the occupants know that someone is waiting outside if each of them are inside the bedrooms.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "first things first place two routes get one really narrow may find heavy vehicles weaving route second leads city km long though one better first terms traffic quality road secondly property still developing last checked developed part really nice outdoor spots relax enjoy environment even day thirdly pool area nice pool kids adults lounging area nearby quiet rooms comfortable layout perspective blind individual quite straightforward liked since totally blind premises built township like manner liked walking around companions around adequate space parking one book villas well though beneficial theres large group like lets say people individual rooms quite nice well",
                "nice place quite retreat close beach however roads leading resort bad shape well maintained pool gardens food part club mahindra delicious staffs professional courteous helpful",
                "big grp went resort looking reviews high expectations paying good amt much disappointed service food also hospitality recommend resort anyone room service food cleanliness disappointing games club house broken big disappointment took payment didnt give us clean rooms instead making prior bookings got rooms go follow housekeeping clean villa took approx hrs kids us us waiting bad heat start holiday thing happened next day room cleaning pool cleaning happy",
                "one best resorts iâ\u0080\u0099ve ever spreaded large area parking villas gets breathtaking walk high quality rooms clean washroom personal swimming pool high quality service big green areas parks place one enjoy cycling adventure sports small games around campus reasonable charges applicableoverall pleasure resort please visit experience magic alibaug",
                "nice cosy luxurious stayed pool villa independent includes four large bedrooms excellent big family get together minor issue faced villa way let occupants know someone waiting outside inside bedrooms"
            ]
        },
        {
            "name": "Akshi Beach",
            "rating": [
                4.2
            ],
            "address": [
                "JVFP+8GG, Akshi, Maharashtra 402204, India"
            ],
            "reviews": [
                {
                    "text": "One of the most peaceful and safe beach i have ever visited. Do visit this beach if you want to spend a peaceful time in the evening, enjoy the view with a beautiful sunset! There is no food option available here. Make sure to keep this place clean.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Best beach in alibagh in terms of peaceful and non cowded nature. Also their is a good hotel attached to this beach (Samara sea view homestay) if you like to stay near the beach. So you can never miss the sunset view.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This is one of the most peaceful and clean beaches near Alibag. It is very less crowded in the morning and evening. There are no water sports activities. If you really want to get a feel of Konkan, Akshi beach is the place to be. There are a few eating options available near the beach as well.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Relaxing beach with textured sandy shore that gives you a wave pool like experience during high tide. Value for money. And we stayed at the palace of peace located within a 20 minute walk from the beach. Truly an unexpected and unforgettable experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It is the best beach in Alibag ,hands down. This large beach lies on the side of a serene Konkan village amidist palm trees , it is so beautiful. If you are looking for a quiet beach with not much people running around and are someone who is looking for tranquility please head to no other beach but this one.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one peaceful safe beach ever visited visit beach want spend peaceful time evening enjoy view beautiful sunset food option available make sure keep place clean",
                "best beach alibagh terms peaceful non cowded nature also good hotel attached beach samara sea view homestay like stay near beach never miss sunset view",
                "one peaceful clean beaches near alibag less crowded morning evening water sports activities really want get feel konkan akshi beach place eating options available near beach well",
                "relaxing beach textured sandy shore gives wave pool like experience high tide value money stayed palace peace located within minute walk beach truly unexpected unforgettable experience",
                "best beach alibag hands large beach lies side serene konkan village amidist palm trees beautiful looking quiet beach much people running around someone looking tranquility please head beach one"
            ]
        },
        {
            "name": "Casuarina The Beach Resort",
            "rating": [
                4.1
            ],
            "address": [
                "Suruche Ban, Satad Bandar, Dist, Nagaon, Maharashtra 402203, India"
            ],
            "reviews": [
                {
                    "text": "Resort is close to the beach. Well maintained, peaceful resort. Good staff, good breakfast, clean rooms. A swimming pool is available.\nBreakfast is included in the package and variety is served that is the best part.\n\nOnly suggestion is to extend the time of dinner to 11.30PM as people come to relax so being flexible is helpful for visitors. And atleast have shade parking for Car.\n\nOverall had a good experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This weekend we visited in this place\nBest location with huge area.\nPositive points :\nTasty Food\nClean swimming pool\nGood maintenance\nPolite staffs\nBeach touch resort\n\nNegative points :\n1) Poor Service\n2) Charges are higher as compared to rooms and service\n3) charges that we paid its just accommodation others things are not included in that\n4)They mentioned many things in menu card but half think’s are not available.\n5) swing’s are only 2 in resort.\n\nThey should improve service and\nAlso need to improve rules for the break fast, lunch and dinner\nOtherwise Good location and resort to chill",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We booked the property for a day picnic and we were allotted one room. The rooms are spacious and clean. The washroom is also clean.\n\nThe food is okay but the canteen looks like a normal public canteen. Moderate cleanliness. The worst part is pathetic service. The common washroom and toilet is pathetic.\n\nThe property location is superb and the lawn and swimming pools is maintained. The beach access from the property is the best part.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent resort by the beach\nJust 2 min walk n u r in clean and pestine beach.\nRooms are clean and mainted\nThey have beautiful lawn with coconut trees giving cool breeze and Goa vibes\nAll watersports is just 10 min away so once u r in resorts u do not had go anywhere.\nPerfect for families\nService is good\nAlso we want Jain food in b/f\nSo they specially prepared  poha for us\nFood is good and with good quantity.\nTo our surprise as it was weekend there was live music\nWhich was excellent\nAlso midnight  around 2-30pm\nWe were in need of medicine which we got easily from reception.\nOverall it's wonderful property with all facilities\nSwimming pool, indoor games\nAnd walkable by beach\nTruly recommendable",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Location is very good. Adjacent to the beach.\nRooms are clean and spacious\n\nService is okay, can be improved. Food quality is decent.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort close beach well maintained peaceful resort good staff good breakfast clean rooms swimming pool available breakfast included package variety served best part suggestion extend time dinner pm people come relax flexible helpful visitors atleast shade parking car overall good experience",
                "weekend visited place best location huge area positive points tasty food clean swimming pool good maintenance polite staffs beach touch resort negative points poor service charges higher compared rooms service charges paid accommodation others things included mentioned many things menu card half thinkâ\u0080\u0099s available swingâ\u0080\u0099s resort improve service also need improve rules break fast lunch dinner otherwise good location resort chill",
                "booked property day picnic allotted one room rooms spacious clean washroom also clean food okay canteen looks like normal public canteen moderate cleanliness worst part pathetic service common washroom toilet pathetic property location superb lawn swimming pools maintained beach access property best part",
                "excellent resort beach min walk n u r clean pestine beach rooms clean mainted beautiful lawn coconut trees giving cool breeze goa vibes watersports min away u r resorts u go anywhere perfect families service good also want jain food bf specially prepared poha us food good good quantity surprise weekend live music excellent also midnight around pm need medicine got easily reception overall wonderful property facilities swimming pool indoor games walkable beach truly recommendable",
                "location good adjacent beach rooms clean spacious service okay improved food quality decent"
            ]
        },
        {
            "name": "HOTEL MAPLE IVY",
            "rating": [
                4
            ],
            "address": [
                "MV4Q+729, near Krushival Press, Dalinagar, Alibag, Maharashtra 402209, India"
            ],
            "reviews": [
                {
                    "text": "Rooms spacious. Swimming pool well maintained. Good service.\nExcellent Restaurant, must try their thin crust pizza. It was amazing. Resturant staff was very courteous. Overall good relaxing experience. Also, had small kids play area.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Pool has a nice shade so water is cool. It even has nice jacuzzi. Food is also good. I booked this hotel during my second visit as well",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotel. Good hygeine. Helpful staff. Decent food. Nice pool.\n\nOverall good experience but midlly on the expensive side. Prices can be a bit lower.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A nice hotel. Had a pleasant stay for 2 nights and it was warm. Nice rooms and very clean bathroom with continuous hotwater. Food is very tasty in the in house restaurant Saffron. Swimming pool is indoors and kept clean. Breakfast buffet is good and reasonable.\nService was good with responsive staff. Overall reasonably priced hotel for family",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "this hotel is ok for 2 to 3 days... if you are here for more than a week.. you will get to know how hygiene this hotel and room is.. i am here for more than 15 days due to some work. and in the name of cleaning they are just passing their time. even the wash room they clean once in a week .just flush it and wash it through water...\ni came here because i saw many good reviews...but after 2 to 3 days they started showing their originality ,even they will return your laundry in same used bag which you have given. some time they don't wash it just iron it without washing and give it to you.\n\nthese are only 4 pics that i am adding here...there are lots of such example...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms spacious swimming pool well maintained good service excellent restaurant must try thin crust pizza amazing resturant staff courteous overall good relaxing experience also small kids play area",
                "pool nice shade water cool even nice jacuzzi food also good booked hotel second visit well",
                "good hotel good hygeine helpful staff decent food nice pool overall good experience midlly expensive side prices bit lower",
                "nice hotel pleasant stay nights warm nice rooms clean bathroom continuous hotwater food tasty house restaurant saffron swimming pool indoors kept clean breakfast buffet good reasonable service good responsive staff overall reasonably priced hotel family",
                "hotel ok days week get know hygiene hotel room days due work name cleaning passing time even wash room clean week flush wash water came saw many good reviewsbut days started showing originality even return laundry used bag given time dont wash iron without washing give pics adding herethere lots example"
            ]
        },
        {
            "name": "Outpost@Alibaug",
            "rating": [
                4.3
            ],
            "address": [
                "Alibag, Chorande, Mapgaon, Sogaon, Maharashtra 402201, India"
            ],
            "reviews": [
                {
                    "text": "\"Outpost at Alibaug is a slice of paradise nestled amidst nature's bounty! The property boasts spacious surroundings and lush greenery, creating a serene ambiance. The highlight is definitely the expansive swimming pool, perfect for a refreshing dip. With three in-house restaurants offering a variety of delicacies, dining here is a culinary delight.\n\nFor entertainment, the resort offers a plethora of options including a gaming room equipped with classic board games, pool table, squash court, and table tennis. Fitness enthusiasts can make use of the well-equipped gymnasium, while the badminton court adds to the fun. And who can forget the charming treehouse, adding a touch of whimsy to the experience.\n\nThe rooms are impeccably clean and comfortable, ensuring a relaxing stay. But what truly sets Outpost apart is its exceptional staff, whose hospitality is second to none. Highly recommend this haven for anyone seeking a memorable retreat in Alibaug!\"",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Went here for lunch today on a recommendation by a known person. We were a group of 25 people. The service was pathetic. Waiters don't turn up to take your order. Food takes an hour to come, after reminding them about your order that was placed an hour ago.\n\nTotally avoid. They don't know how to run a place. 4 waiters at the sample place totally clueless on what's happening around!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A luxury retreat with calm and peaceful vibes. Never anticipated something of this sort in Alibaug. Definitely worth every penny. Their in-house Italian restaurant is one of the best, in fact never had such authentic Italian cuisine before. The pool side restaurant is relaxing. They have a spa, squash, table tennis, pool within their premises which adds to the whole package.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Stayed at Outpost over Xmas weekend. The rooms are Ill-maintained and overpriced. They need a fresh coat of paint and a whole lot of repair work ( random areas with Rust and wood chipping). Food at Terra was fine. Location is quite far from all beaches and any attractions.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The property is very far from the beaches or any other attractions. Since there were not many rooms occupied in the breakfast they didn’t keep buffet. So had to order from menu which wasn’t chargeable but then didn’t get more options to eat. The property is not maintained at all. The pricing for rooms are very high.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "outpost alibaug slice paradise nestled amidst natures bounty property boasts spacious surroundings lush greenery creating serene ambiance highlight definitely expansive swimming pool perfect refreshing dip three inhouse restaurants offering variety delicacies dining culinary delight entertainment resort offers plethora options including gaming room equipped classic board games pool table squash court table tennis fitness enthusiasts make use wellequipped gymnasium badminton court adds fun forget charming treehouse adding touch whimsy experience rooms impeccably clean comfortable ensuring relaxing stay truly sets outpost apart exceptional staff whose hospitality second none highly recommend anyone seeking memorable retreat alibaug",
                "went lunch today recommendation known person group people service pathetic waiters dont turn take order food takes hour come reminding order placed hour ago totally avoid dont know run place waiters sample place totally clueless whats happening around",
                "luxury retreat calm peaceful vibes never anticipated something sort alibaug definitely worth every penny inhouse italian restaurant one best fact never authentic italian cuisine pool side restaurant relaxing spa squash table tennis pool within premises adds whole package",
                "stayed outpost xmas weekend rooms illmaintained overpriced need fresh coat paint whole lot repair work random areas rust wood chipping food terra fine location quite far beaches attractions",
                "property far beaches attractions since many rooms occupied breakfast didnâ\u0080\u0099t keep buffet order menu wasnâ\u0080\u0099t chargeable didnâ\u0080\u0099t get options eat property maintained pricing rooms high"
            ]
        },
        {
            "name": "White House Beach Resort",
            "rating": [
                4
            ],
            "address": [
                "Nagaon Bandar Rd, Nagaon, Maharashtra 402204, India"
            ],
            "reviews": [
                {
                    "text": "I regret to inform you that my recent stay at the White House Resort was far from satisfactory. As a guest who has frequented numerous resorts, I am accustomed to a certain standard of service and amenities, which unfortunately were lacking during my visit.\n\nFirstly, upon arrival, I was dismayed by the lack of attention from the staff. There seemed to be a disorganized check-in process, with no one readily available to assist guests with their luggage or provide any information about the resort facilities.\n\nFurthermore, the condition of the room left much to be desired. It was evident that cleanliness was not a priority, as there were noticeable stains on the bedding and an unpleasant odor lingering in the air. Additionally, the furniture appeared worn-out and in need of replacement.\n\nThe dining experience was another disappointment. The restaurant was understaffed, leading to long wait times for both seating and service. The quality of the food was subpar, with several dishes being overcooked and lacking in flavor.\n\nOverall, my experience at the White House Resort fell far short of expectations. I had hoped for a relaxing and enjoyable stay, but instead, I left feeling frustrated and dissatisfied. I urge management to address these issues promptly to ensure that future guests do not encounter similar",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Resort is near the beach and because of wonderful facilities we booked it for second time. This resort is very nice. We had a booking for 2 days which we had to cancel after 1 day due to our child not being well. The hotel refunded our 1 day amount of Rs 3500 to us. The food and other services of the hotel are good. the staff is polite and ready to help",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very unhygienic and unclean.\n1. Commod came off\n2. Door latches broken\n3. Curtain pipe fell off\n4. No hanging hooks in washroom\n5. Cockroaches and mosquitoes in the room\n6. Unclean swimming pool with hair and what not\n7. Unprofessional 'chapri' staff\n8. The bedsheets and blankets weren't clean.\n9. A fan's regulator was not working.\n10. 2 of the lights were not working.\n\nThey do not have any hospitality, the room has cockroaches so you can guess what the kitchen must look like and the food would give you diarrhoea.\nThe staff was not talking nicely at all.\nThis place cannot even be called a resort. The whole place is run down as compared to what you see in pictures online. The pictures from Google look like from when this place was built.. we booked deluxe room and it was totally run down.  Just don't go here!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "NEVER BEFORE EXPERIENCE\nHad been to this place last weekend with my group of friends n kids.\nWe needed a break from our busy schedule... all working professional ladies.\nDINNER was not laid completely till 11pm.\nHeated arguments followed.\nMany slept without eating.\nDecided to leave the place at 1 am night...but gave a second thought....being group of ladies n kids.\nLeft next morning without tea,though had paid till afternoon lunch.\nArrogant owner.\nNo Courtesy towards ladies n kids.\nBasic amenities.. unsatisfactory.\nBe careful.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food is pathetic. We ordered non veg starters and it felt like prepared in the morning. Had to call the manager atleast 4 times to take the dinner order. We also provided feed back after the dinner but he was least bothered instead asked us to pay it same time. They could have included it in the room stay charges. Rooms are not clean. Overall below average except for location which is near beach. Suggest to look for better options nearby.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "regret inform recent stay white house resort far satisfactory guest frequented numerous resorts accustomed certain standard service amenities unfortunately lacking visit firstly upon arrival dismayed lack attention staff seemed disorganized checkin process one readily available assist guests luggage provide information resort facilities furthermore condition room left much desired evident cleanliness priority noticeable stains bedding unpleasant odor lingering air additionally furniture appeared wornout need replacement dining experience another disappointment restaurant understaffed leading long wait times seating service quality food subpar several dishes overcooked lacking flavor overall experience white house resort fell far short expectations hoped relaxing enjoyable stay instead left feeling frustrated dissatisfied urge management address issues promptly ensure future guests encounter similar",
                "resort near beach wonderful facilities booked second time resort nice booking days cancel day due child well hotel refunded day amount rs us food services hotel good staff polite ready help",
                "unhygienic unclean commod came door latches broken curtain pipe fell hanging hooks washroom cockroaches mosquitoes room unclean swimming pool hair unprofessional chapri staff bedsheets blankets werent clean fans regulator working lights working hospitality room cockroaches guess kitchen must look like food would give diarrhoea staff talking nicely place even called resort whole place run compared see pictures online pictures google look like place built booked deluxe room totally run dont go",
                "never experience place last weekend group friends n kids needed break busy schedule working professional ladies dinner laid completely till pm heated arguments followed many slept without eating decided leave place nightbut gave second thoughtbeing group ladies n kids left next morning without teathough paid till afternoon lunch arrogant owner courtesy towards ladies n kids basic amenities unsatisfactory careful",
                "food pathetic ordered non veg starters felt like prepared morning call manager atleast times take dinner order also provided feed back dinner least bothered instead asked us pay time could included room stay charges rooms clean overall average except location near beach suggest look better options nearby"
            ]
        },
        {
            "name": "Coconut Ivy Resort & Spa",
            "rating": [
                3.5
            ],
            "address": [
                "Chendre, Alibag - Revas Rd, opp. M.I.D.C. Office, Alibag, Maharashtra 402201, India"
            ],
            "reviews": [
                {
                    "text": "It was a nice experience here. Whenever I called for any services, the staff was ready to provide it. I was sitting outside my room and one of the staff approached me from far away with a chair and asked me to sit on the chair. It didn't end here, he asked me whether I need a table or not. I had a problem with my AC Remote, I specifically told the person that if it's not possible, leave it. His words were that you paid for all the services, you deserve all those. I called the room service, there was a problem with the telephone, the person on the other side shared his personal number and asked me to call whenever I needed anything throughout the night. I wonder why people here are posting negative negative reviews for the services. I didn't try the food here but as I've heard about it, it's not that good.\nI will definitely recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Service is pathetic, may be due to staff shortage. Attendant are also not well versed with items available with Kitchen / service.\nIn the morning also, tea is not available till 7.30am.\nDinner preparations are good but need to improve service/ presentation to ensure exclusivity ie different from a DHABA.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Location is easily accessible. Property is good. Rooms have scope for improvement. We had booked super deluxe with bath tub but still not upto the mark compared to rates which they charge. Bar and restaurant add value to the property. Service is good.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Broken swimming pool\nPoorly maintained\nLow class gentry.\nArrogant staff\nNo food option\nToo costly for the price",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Resort is nice and very close to market, beaches and Alibaug stand. Food is amazing and there are few popular restaurants right outside the resort too. Pool and surroundings are neat and clean however rooms are very old style and looks shady.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice experience whenever called services staff ready provide sitting outside room one staff approached far away chair asked sit chair didnt end asked whether need table problem ac remote specifically told person possible leave words paid services deserve called room service problem telephone person side shared personal number asked call whenever needed anything throughout night wonder people posting negative negative reviews services didnt try food ive heard good definitely recommend place",
                "service pathetic may due staff shortage attendant also well versed items available kitchen service morning also tea available till dinner preparations good need improve service presentation ensure exclusivity ie different dhaba",
                "location easily accessible property good rooms scope improvement booked super deluxe bath tub still upto mark compared rates charge bar restaurant add value property service good",
                "broken swimming pool poorly maintained low class gentry arrogant staff food option costly price",
                "resort nice close market beaches alibaug stand food amazing popular restaurants right outside resort pool surroundings neat clean however rooms old style looks shady"
            ]
        },
        {
            "name": "Acons Palm Beach",
            "rating": [
                4.5
            ],
            "address": [
                "Gondhalpada, Varasoli, Alibag, Maharashtra 402201, India"
            ],
            "reviews": [
                {
                    "text": "The Rooms were very clean and hygienic. The surroundings was peaceful enough to give break from the hustle & bustle of the city. Games room was exceptional. In house Food items are there but limited. Nevertheless, you can order food from the nearby restaurants. Overall a good, affordable and value for money stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We had booked 2 deluxe rooms during week days and had a great experience. Rooms were spacious and well maintained, service was good, staff was cooperative. Decent options in play area as well. Pricing is quite reasonable with respect to the area of room.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I had a fabulous stay at Acons Palm Beach.  It's a full one bedroom apartment. So the space is very big and spacious. The place is very clean and tidy. The staff were extremely polite. The receptionist was helpful with suggestions for places to visit in Alibaug. Lovely stay and we spent most of our evenings there. Looking forward to my next trip here",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very neat and clean spacious room. They have super polite staff for servicing. It was a great experience, definitely would recommend to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Comfortable stay. Rooms are spacious and clean, 1bhk is sufficient for 2-3 people. Location is bit outskirt from main market and bus stand, but can be reached via maps. Getting public transport is bit challenging but property has few auto drivers number, can contact and call them to location. Staff is generous, polite and responsive.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms clean hygienic surroundings peaceful enough give break hustle bustle city games room exceptional house food items limited nevertheless order food nearby restaurants overall good affordable value money stay",
                "booked deluxe rooms week days great experience rooms spacious well maintained service good staff cooperative decent options play area well pricing quite reasonable respect area room",
                "fabulous stay acons palm beach full one bedroom apartment space big spacious place clean tidy staff extremely polite receptionist helpful suggestions places visit alibaug lovely stay spent evenings looking forward next trip",
                "neat clean spacious room super polite staff servicing great experience definitely would recommend anyone",
                "comfortable stay rooms spacious clean bhk sufficient people location bit outskirt main market bus stand reached via maps getting public transport bit challenging property auto drivers number contact call location staff generous polite responsive"
            ]
        },
        {
            "name": "Bouganvillea Boutique Beach House",
            "rating": [
                4.3
            ],
            "address": [
                "Nagaon Bandar Rd, Nagaon, Maharashtra 402204, India"
            ],
            "reviews": [
                {
                    "text": "I had a fantastic experience at this hotel with my family. Despite staying in a dorm due to high demand, the facilities were excellent. The clean swimming pool, diverse play area, and well-maintained surroundings impressed us. The restaurant served delicious food, and the 10-minute walk to the seashore added to the overall charm. Highly recommended for a family stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had amazing stay at Bouganvillea Boutique Beach House last weekend...\nI would highly highly recommend this property for stay as well as for good lip smacking food.\n\nHereby sharing my detailed feedback\n1) Rooms - We booked group room...Room was neat & tidy , airy , spacious , cozy provided with all necessary amenities & toiletries inside..hot water 24*7 was available.Beds were clean & spacious.\n\n2) Staff - Every staff including housekeeping , reception , restaurant was polite , kind , PROMPT , helpful , giving their best in every possible way.\n\n3) Food - Veg & non veg food was outstanding , quantity was good..n service was fast..we had babies with us ...meal was also provided considering babies..\nComplimentary Breakfast had many options with good taste.\nFor NON - VEGETARIANS it's a delight don't miss on it!\nSeafood is a must try here!\nBaby high chair is provided for feeding babies at the restaurant.\n\n4) Ambience - kids area is good with kids activities..Indoor activities for adults  are good , swimming pool is maintained, over all hygiene is maintained well everywhere.\n\nExcellent for kids and family stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We stayed with family here and must say experience was delightful. Rooms were neat and clean. Food was great. Staff was courteous and cooperative. Location is few minutes from Nagaon beach. Overall amazing experience.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel amenities are good and worth the price you pay for. The swimming pool is clean and well maintained. The rooms are clean and cleaned everyday. The staff is cordial and prompt.\nWe interacted with Shravan at the front desk - he was very helpful and was very prompt with his work and also helped us with transport on the day of our check out.\nNavjeet - helped us on all the days in the in house restaurant while serving us delicious food. He was very courteous and was well trained in hospitality.\nThe ambience is just so peaceful - well suited for a get away from the busy city life.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Had nice stay last weekend at Bouganvillea, Nagaon. Very well maintained property, clean, lush green, well maintained plants everywhere and very professional, attentive and friendly staff. The place offers cool and calm vibes. Restaurant is good, serving tasty food, complimentary breakfast was awesome! Room service is prompt. Rooms, although bit small for a family of 4, are neat and clean, offering outdoor seating at back side for drinks and small party. However, they must renovate and improve infrastructure of the room for the tariff they charge. Game zone is okay. Swimming pool and surrounding lighting looks very beautiful in the evening. Overall satisfying experience and would like to recommend travellers to stay at Bouganvillea for hassle-free, smooth and lovely stay.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fantastic experience hotel family despite staying dorm due high demand facilities excellent clean swimming pool diverse play area wellmaintained surroundings impressed us restaurant served delicious food minute walk seashore added overall charm highly recommended family stay",
                "amazing stay bouganvillea boutique beach house last weekend would highly highly recommend property stay well good lip smacking food hereby sharing detailed feedback rooms booked group roomroom neat tidy airy spacious cozy provided necessary amenities toiletries insidehot water availablebeds clean spacious staff every staff including housekeeping reception restaurant polite kind prompt helpful giving best every possible way food veg non veg food outstanding quantity goodn service fastwe babies us meal also provided considering babies complimentary breakfast many options good taste non vegetarians delight dont miss seafood must try baby high chair provided feeding babies restaurant ambience kids area good kids activitiesindoor activities adultsâ good swimming pool maintained hygiene maintained well everywhere excellent kids family stay",
                "stayed family must say experience delightful rooms neat clean food great staff courteous cooperative location minutes nagaon beach overall amazing experience",
                "hotel amenities good worth price pay swimming pool clean well maintained rooms clean cleaned everyday staff cordial prompt interacted shravan front desk helpful prompt work also helped us transport day check navjeet helped us days house restaurant serving us delicious food courteous well trained hospitality ambience peaceful well suited get away busy city life",
                "nice stay last weekend bouganvillea nagaon well maintained property clean lush green well maintained plants everywhere professional attentive friendly staff place offers cool calm vibes restaurant good serving tasty food complimentary breakfast awesome room service prompt rooms although bit small family neat clean offering outdoor seating back side drinks small party however must renovate improve infrastructure room tariff charge game zone okay swimming pool surrounding lighting looks beautiful evening overall satisfying experience would like recommend travellers stay bouganvillea hasslefree smooth lovely stay"
            ]
        }
    ]
}