{
    "places_with_reviews": [
        {
            "name": "Hotel Ganapathi",
            "rating": [
                3.8
            ],
            "address": [
                "Ward No -16, Old N.H -6, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "Absolutely delighted with the newly renovated minimalist cafe! The food here is unparalleled, setting a new standard for dining in town. The ambience is inviting and serene, setting the perfect tone for a relaxed meal. The staff's impeccable manners truly enhance the entire experience. If this exceptional quality continues, undoubtedly, this cafe will reign as the best in town!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Absolutely amazing hotel at Bargarh. Great hospitality and affectionate attitude. Sincerely recommended. The food is delicious and drinks are so pocket friendly.. .. amazing 😍... Walk in without a hitch... Coming back soon 😀",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good hotel. Service could be improved. Like using gloves and having uniform. But quality of food was delicious. Rooms are spacious and location of the hotel is best part. Ganapati is one of heritage brand of Bargarh city. Parking space is adequate",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "A good hotel stay and excellent service and behaviour of staff,I am glad to stay there☺️☺️",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Visited the restaurant of this hotel one week ago. Food was nice and cost effective. 4 years back I had stayed in this hotel. At that time their service was not so good. But the rooms are spacious and clean to some extent. Rent was easily affordable. This time I found has been renovated and refurbished. The restaurant was well maintained and was looking classy compared to the size of the town Bargarh. From the outer view and the restaurant I assume they must have improved their quality of service and other related things of a good hotel. I would recommend to take a chance.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "absolutely delighted newly renovated minimalist cafe food unparalleled setting new standard dining town ambience inviting serene setting perfect tone relaxed meal staffs impeccable manners truly enhance entire experience exceptional quality continues undoubtedly cafe reign best town",
                "absolutely amazing hotel bargarh great hospitality affectionate attitude sincerely recommended food delicious drinks pocket friendly amazing ð\u009f\u0098\u008d walk without hitch coming back soon ð\u009f\u0098\u0080",
                "good hotel service could improved like using gloves uniform quality food delicious rooms spacious location hotel best part ganapati one heritage brand bargarh city parking space adequate",
                "good hotel stay excellent service behaviour staffi glad stay thereâ\u0098ºï¸\u008fâ\u0098ºï¸\u008f",
                "visited restaurant hotel one week ago food nice cost effective years back stayed hotel time service good rooms spacious clean extent rent easily affordable time found renovated refurbished restaurant well maintained looking classy compared size town bargarh outer view restaurant assume must improved quality service related things good hotel would recommend take chance"
            ]
        },
        {
            "name": "Hotel Tuli",
            "rating": [
                3.8
            ],
            "address": [
                "Opposite, Canal Ave, Private Bus Stand, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "Hotel Tuli - below average, service staff are hard working but the owner or the management is seems not interested in providing any good facilities to Tuli guest, never expect warm water here, one of the stare was full of all wastes like a municipality garbage, they are giving single blanket for a double bed AC room, after objection they will give another single blanket seems they don't have any double blankets, you need to ask for everything to the service staff then they may provide.\nNot recommended if they are charging >1000",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Well behaved staffs , clean well equipped hygienic rooms, FB manager Ramanand , like keshhas done good job.\nBut no discount offered and Breakfast is also not included in room rent .",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Well maintained rooms with all amenities needed at a good price point , do give it a try",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel servicing was very much pleasing. Staffs were cordial and everything was smooth. Thanks Mr Nanda and Mr Sagar for your cooperation during the stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Mr.Nanda,\nI m happy with ur service and good response and goosee the room. I m ur customer since 2014 but I  have no corporate discount or complimentary.\n\nIf u have arrange, it's better for me.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel tuli average service staff hard working owner management seems interested providing good facilities tuli guest never expect warm water one stare full wastes like municipality garbage giving single blanket double bed ac room objection give another single blanket seems dont double blankets need ask everything service staff may provide recommended charging",
                "well behaved staffs clean well equipped hygienic rooms fb manager ramanand like keshhas done good job discount offered breakfast also included room rent",
                "well maintained rooms amenities needed good price point give try",
                "hotel servicing much pleasing staffs cordial everything smooth thanks mr nanda mr sagar cooperation stay",
                "mrnanda happy ur service good response goosee room ur customer since corporate discount complimentary u arrange better"
            ]
        },
        {
            "name": "HOTEL VD PALACE",
            "rating": [
                3.6
            ],
            "address": [
                "WARD NO 1, Bhatli Rd, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "The location of this hotel is probably the best feature.Overall, if you are just passing through town, and need somewhere to stay one night, this hotel probably would be convenient and easy. You would probably be wiser to find something nicer and better value for any longer stays.\nNot a bad place just to sleep. Rooms were not as clean as possible, but adaquate. On site restaurant was ok, serving Indian food. It looks like a great place for a big party. Plenty of room for this. Rooms were big and on the first floor, at least, had shower facilities.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Friendly staffs.\nDelicious food in affordable price.\nMust visit this place.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very bad experience.\nAs they wanted me to book from there hotel.\nSo they said no rooms available.\nBut i already booked from Oyo.\nIf no rooms were there then how the booking got confirmed.\nOyo should take up such matter and investigate..\nPeople coming from far places expecting to take some rest get such response. Its a worst experience.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Nice environment... a must visit place",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "pls release those  birds  ,,dont  punish them  inside a cage ,,,they are not  circus  participants, entertainer of  ur hotel",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location hotel probably best featureoverall passing town need somewhere stay one night hotel probably would convenient easy would probably wiser find something nicer better value longer stays bad place sleep rooms clean possible adaquate site restaurant ok serving indian food looks like great place big party plenty room rooms big first floor least shower facilities",
                "friendly staffs delicious food affordable price must visit place",
                "bad experience wanted book hotel said rooms available already booked oyo rooms booking got confirmed oyo take matter investigate people coming far places expecting take rest get response worst experience",
                "nice environment must visit place",
                "pls release birds dont punish inside cage circus participants entertainer ur hotel"
            ]
        },
        {
            "name": "Hotel Royal Palace",
            "rating": [
                3.9
            ],
            "address": [
                "Railway Station, Trinath Nagar, Near, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "1. The Royal Palace : They take the booking, without any detail discussion or clearcut defined pricing. Even if they would have tell you somthing while booking, they change their stance.\nLater they bring many policies of their hotel, to make sure the price is increased to 2 fold, and  you don't have any option to switch to another place in the short time.\n2. Bookings : At the begining, around august last year, we made a booking when they said 23K for the hall booking, lawn they said, we can book later which is a minimal charges of 10 to 15K around(probably the price was less that time) but before 15 days of the event, they mentioned that the lawn is 23K and hall is 30K for entire event. We had booked around 20 hotel rooms for 2 days, as they increased the price, we reduced the room for 2nd day to 15. The manager was fine with it. But, looks like their target income came down, so they came up with 1 days hall booking is 30k, so 1 additional day we have to pay 20K extra. We didnt have any other option at this last momemt, so we have to agree to their terms.\n3. Check-in time: They said for event booking, they respect 24 hours stay. I asked them to put checkin and checkout time for each guest. They agreed, but even if they had these columns to be filled, the staff didnt fill checkin and checkout time. Later, the manager said its 11am to 11am timing. Our checkins were around 8PM, and next day checkouts were 6PM. But they charged 1 day extra for multiple rooms.\n4. Conference Room: I am not sure, if 30K is the price for the half backed room. They didnt complete the LEDs at roof, the bath room is not complete. The power backup in conference hall not at all good. It ruined the previous day DJ event. We could not even play they music properly. In other party halls in Bargarh which is of same size(and fully constructed), the charges are around 10-15K per day.\n5. The Room Condition: Many room AC is not working. Mosr of the hooks in bothroom doors are broken, so you cannot close it.\nIf you visit these rooms, they will show you, 1 or 2 good rooms, but most of these rooms are not maintained well. They promised to give us newly constructed room, but gave us old rooms.\n6. No Store Room: We had to book a hotel room for 3 days for storing stuff at full price. Even they acknowledged that AC is not working in this room, still they charged for AC room tarrif. Though manager said that they will deduct the price, but he didnt while billing.\n7. No Kitchen Room: Its a mess, they place which they give for Kitchen are approachable to Dogs and Cows. If its rains and windy its even worse.\n8. The Reneger Manager: The manager changes his stance in few mins. He knew from begining that we have 2 days event, we explained him what when where in detail multiple time. Initially he charged 30K for hall, and later 50K when the event approached D-Day. He was offering us a suite room for 1 day. When we insisted he agreed to give it for 3 days. He said for host he can give complementary. After coming out of the discussion room, he gave us keys for normal rooms, and said why to pay extra 500 for suite toom. This is not just once, mutiple time he changed his stance if few mins.\n9. The Greedy MD : He did acknowledge many of the issues, but didnt gave any concession either for the newly build half backed hall, bad condition rooms, bad power backup, or the store room. He was even very rude while discussing about the checkin time and said its 7am to 7am( the manager said 11am to 11am).\n10. We ended of paying 1.5lakhs for the 2 days event, which supposed to be around 80-90k as per the initial discussion. We felt cheated.\n\nIt's our personal opinion that the place is not at all suitable for big events like weddings or other ceremonies mainly because of the unprofessional management(though the ground staffs are very nice) and you have pay extra for Tent Kitchen set up even a proper store room, they don't have any in built set up to ease your burden further the hotel management as well as maintenance is not upto the mark.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I booked this hotel, confirming that they allow pets. However, upon arrival at 9:30 pm after traveling from Pune, they unexpectedly refused, despite my two-night stay in Shiridi and Nagpur without any issues. The service was disappointing in Bargarh.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Located near Baragarh road railway station.Though a small hotel very neat and clean and staffs are excellent.Nice ambience.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Location is worst ,the road are totally destroyed . parking is specious but the party area /lounge isn't that big . toilet are so dirty and it's feel like you/we  are in govt toilet of railway station .",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "One of the best hotels close to Bargarh road station. Suite Rooms are quite good, clean and spacious. Service was good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "royal palace take booking without detail discussion clearcut defined pricing even would tell somthing booking change stance later bring many policies hotel make sure price increased fold dont option switch another place short time bookings begining around august last year made booking said k hall booking lawn said book later minimal charges k aroundprobably price less time days event mentioned lawn k hall k entire event booked around hotel rooms days increased price reduced room nd day manager fine looks like target income came came days hall booking k additional day pay k extra didnt option last momemt agree terms checkin time said event booking respect hours stay asked put checkin checkout time guest agreed even columns filled staff didnt fill checkin checkout time later manager said timing checkins around pm next day checkouts pm charged day extra multiple rooms conference room sure k price half backed room didnt complete leds roof bath room complete power backup conference hall good ruined previous day dj event could even play music properly party halls bargarh sizeand fully constructed charges around k per day room condition many room ac working mosr hooks bothroom doors broken close visit rooms show good rooms rooms maintained well promised give us newly constructed room gave us old rooms store room book hotel room days storing stuff full price even acknowledged ac working room still charged ac room tarrif though manager said deduct price didnt billing kitchen room mess place give kitchen approachable dogs cows rains windy even worse reneger manager manager changes stance mins knew begining days event explained detail multiple time initially charged k hall later k event approached dday offering us suite room day insisted agreed give days said host give complementary coming discussion room gave us keys normal rooms said pay extra suite toom mutiple time changed stance mins greedy md acknowledge many issues didnt gave concession either newly build half backed hall bad condition rooms bad power backup store room even rude discussing checkin time said manager said ended paying lakhs days event supposed around k per initial discussion felt cheated personal opinion place suitable big events like weddings ceremonies mainly unprofessional managementthough ground staffs nice pay extra tent kitchen set even proper store room dont built set ease burden hotel management well maintenance upto mark",
                "booked hotel confirming allow pets however upon arrival pm traveling pune unexpectedly refused despite twonight stay shiridi nagpur without issues service disappointing bargarh",
                "located near baragarh road railway stationthough small hotel neat clean staffs excellentnice ambience",
                "location worst road totally destroyed parking specious party area lounge isnt big toilet dirty feel like youwe govt toilet railway station",
                "one best hotels close bargarh road station suite rooms quite good clean spacious service good"
            ]
        },
        {
            "name": "Hotel Vinayak",
            "rating": [
                3.7
            ],
            "address": [
                "Hospital Rd, Ward No-5, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "hotel vinayak rooms are very clean and fresh.. friendly staff.. very Best hotel in bargarh... walkable distance to market. ... foods are so delicious.. there is new resturant . name - New sai Resturant .newly open ... breakfast.lunch snacks  .dinner available.. So nice hotel famlilier hotel. best for bussinessmen and family... . . and everybody should visit here. according me its best hotel... ...",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location wise is good but the rooms are so dirty. Online it was showing 500 for the normal room so I booked the Suit room for 1400 but the rooms were so so so dirty. Water is coming out from the AC and there is no light in the bathroom . When I complained in the reception they said they will arrange but there was no response. The bedsheet was dirty. The overall experience is very bad.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good rooms, staff well behaved and helpful",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "As price this hotel is too good. And friendly behavior of them. We like too much. Thanks Hotel vinayak",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It’s a fraud hotel . Please don’t book the hotel. Very bad experience. I lost my 1000/- rupees. Don’t book. Fraud hotel 😡😡😡😡",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel vinayak rooms clean fresh friendly staff best hotel bargarh walkable distance market foods delicious new resturant name new sai resturant newly open breakfastlunch snacks dinner available nice hotel famlilier hotel best bussinessmen family everybody visit according best hotel",
                "location wise good rooms dirty online showing normal room booked suit room rooms dirty water coming ac light bathroom complained reception said arrange response bedsheet dirty overall experience bad",
                "good rooms staff well behaved helpful",
                "price hotel good friendly behavior like much thanks hotel vinayak",
                "itâ\u0080\u0099s fraud hotel please donâ\u0080\u0099t book hotel bad experience lost rupees donâ\u0080\u0099t book fraud hotel ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡"
            ]
        },
        {
            "name": "Hotel Mangalam Palace",
            "rating": [
                3.9
            ],
            "address": [
                "9J24+25Q, Bhatli Rd, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "About it's restaurant ..I will say..... The cost is much more as compare to its quantity . I visited 1st time and ordered Chicken Lotpot The price was Rs. 209 and the chicken pieces are hard 5 piece which are broken a d of smal size of 2x3 cm.  Even some small  restaurants with Rs. 120 are much better then this. I will not visit here again.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is the best place for organising thread ceremony, Birth day party, Marriage function.\nEnvironment also good and rooms are also clean and staff also very supportive..Price is also affordable..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Modorete budget hotel, suitable for small domestic functions",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Verry nice place for family function",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Worst hotel for marriage party. Very small area no parking.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "restaurant say cost much compare quantity visited st time ordered chicken lotpot price rs chicken pieces hard piece broken smal size x cm even small restaurants rs much better visit",
                "best place organising thread ceremony birth day party marriage function environment also good rooms also clean staff also supportiveprice also affordable",
                "modorete budget hotel suitable small domestic functions",
                "verry nice place family function",
                "worst hotel marriage party small area parking"
            ]
        },
        {
            "name": "Hotel Swastik",
            "rating": [
                3.5
            ],
            "address": [
                "Hotel Swastik, Road, near Gurudwara Chowk, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "Wastage of Money.. . Rooms are very bad.. Please don't go to this hotel. Charges are too high.. But services are very poor...",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "👍",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "I've booked 2 suite room for 4. Rooms are huge and fully furnished. A little dust due to lack of employees as of Covid 19 Lockdown. Though the food is awesome and great response by the managing team. Thanks ...",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Room are not so good...but looking at the price point and location.  You just need to bring your own bedsheets and travelling pillow....except that its value for money.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Very friendly staffs also good parking place is available only the problem is for not being a busy city less efort is applying by the management so rooms are not cleaned properly and not the maintenance is done properly.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wastage money rooms bad please dont go hotel charges high services poor",
                "ð\u009f\u0091\u008d",
                "ive booked suite room rooms huge fully furnished little dust due lack employees covid lockdown though food awesome great response managing team thanks",
                "room goodbut looking price point location need bring bedsheets travelling pillowexcept value money",
                "friendly staffs also good parking place available problem busy city less efort applying management rooms cleaned properly maintenance done properly"
            ]
        },
        {
            "name": "Hotel Anurag Inn",
            "rating": [
                3.8
            ],
            "address": [
                "Barahagoda, Jamurda, Odisha 768040, India"
            ],
            "reviews": [
                {
                    "text": "Perfect for marriage parties/ celebration 🥳 🎉\nRoom booking, food, restaurant etc..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Mandi food FACILITY  superb...",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Situated on the outskirts of bargarh, in barahguda. The room provided was well furnished but the tv did not work.\nThe service was good . Location was it is easy to access. The food provided was okay but unfortunately while we visited there, we found 2 insects laying on it, that must have fell on the food after the preparation, care must be taken towards it.\nIt's restaurant Biriyani wala 2.0 is the first in bargarh to serve mandi biriyani.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I had really a great experience in this hotel\nEnjoyed a lot\nLots of greenery\nA very nice and decent environment\nClean and nice decoration of rooms\nStaff behaviour was very good\nVery nice service\nAll the priorities has been given for the cleanliness\nVechile facility is also provided for the customers\nThey had a huge banquet for marriage and other programs\nHuge parking space\nHuge size of lawn\nBut the restaurant was closed\nI hope your restaurant starts soon\nOverall i'm fill satisfied\n5 star to\nHotel Anurag Inn\nAll The Best",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It was of that kind as i expected!! First, main priority was given for hygiene, everything was well-maintained, service was good, food was nice, didn't face any problem for water or room related, luxurious rooms with ac provided ata very adorable price, overall nice and fascinating hotel😌😌",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "perfect marriage parties celebration ð\u009f¥³ ð\u009f\u008e\u0089 room booking food restaurant etc",
                "mandi food facility superb",
                "situated outskirts bargarh barahguda room provided well furnished tv work service good location easy access food provided okay unfortunately visited found insects laying must fell food preparation care must taken towards restaurant biriyani wala first bargarh serve mandi biriyani",
                "really great experience hotel enjoyed lot lots greenery nice decent environment clean nice decoration rooms staff behaviour good nice service priorities given cleanliness vechile facility also provided customers huge banquet marriage programs huge parking space huge size lawn restaurant closed hope restaurant starts soon overall im fill satisfied star hotel anurag inn best",
                "kind expected first main priority given hygiene everything wellmaintained service good food nice didnt face problem water room related luxurious rooms ac provided ata adorable price overall nice fascinating hotelð\u009f\u0098\u008cð\u009f\u0098\u008c"
            ]
        },
        {
            "name": "Nikki's Residency",
            "rating": [
                3.8
            ],
            "address": [
                "Railway Station - Gurudwara Chowk Rd, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic Experience in fooding. The restaurant dont have their regular vegetables like onion ,lemon if u ask for these item they said we don't have these in our stocks. I m suggesting everyone not to visit. Not satisfied with staff behaviour.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Standard Hotel in Bargarh Odhisa Town.On Main Road.Rooms are clean.But hot water not available in evening.only on request in the morning hot water is given. Breakfast is same items daily boring..and food not much choice available. Just to stay here okay",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Other than location,all services needs to be improved. Room Service very poor. No Bell boy to support moving luggage to room,need to arrange yourself.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very good hotel for night stay.\n\nRestaurant here has very tasty food.\n\nBut the area nearby has lots of noice.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food quality vary bad\nService is also not on time\nStaf communication skill is very worst\nDon’t book as my opinion",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic experience fooding restaurant dont regular vegetables like onion lemon u ask item said dont stocks suggesting everyone visit satisfied staff behaviour",
                "standard hotel bargarh odhisa townon main roadrooms cleanbut hot water available eveningonly request morning hot water given breakfast items daily boringand food much choice available stay okay",
                "locationall services needs improved room service poor bell boy support moving luggage roomneed arrange",
                "good hotel night stay restaurant tasty food area nearby lots noice",
                "food quality vary bad service also time staf communication skill worst donâ\u0080\u0099t book opinion"
            ]
        },
        {
            "name": "Hotel Meera 🏩",
            "rating": [
                3.8
            ],
            "address": [
                "Govindpali Rd, near Kali Mandir Chowk, Bargarh, Odisha 768028, India"
            ],
            "reviews": [
                {
                    "text": "One of the worse hotel I have experienced in my life ever...",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Never have i ever been in a hotel worse than this. The owner’s attitude will piss you off,both father and son seems illiterate piece of garbage. Staff other than owner is quite well mannered and welcoming. But owners behaves as if they are your boss. Damn, mr. owner, we are paying to stay, don’t treat your customers as if they are indebt by you allowing them to stay. Although rates were fine. 400 for a room of 2 is all right. You may get a discount of 10% or so if you stay for long like 12 to 15 days or so. It’s good in terms of price as compared to other hotels (maharaja hotel, vinayak hotel, abhinandan hotel etc.) nearby but the behaviour just kills the mood to stay. Don’t expect any good service either. Mosquitoes were another problem, making it nearly impossible to get a good night’s sleep. Rooms were fine though for an average person. Not recommended at all. Not for the next 60-70 years until the owner and his son dies and hopefully owner’s grandson doesn’t turn out be a money eating lunatic.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good affordable but room's are no clean",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Toilets are not cleared routinely. But living rooms are cleaned timely. They should provide bedsheet.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very bad experience 😕😕",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one worse hotel experienced life ever",
                "never ever hotel worse ownerâ\u0080\u0099s attitude piss offboth father son seems illiterate piece garbage staff owner quite well mannered welcoming owners behaves boss damn mr owner paying stay donâ\u0080\u0099t treat customers indebt allowing stay although rates fine room right may get discount stay long like days itâ\u0080\u0099s good terms price compared hotels maharaja hotel vinayak hotel abhinandan hotel etc nearby behaviour kills mood stay donâ\u0080\u0099t expect good service either mosquitoes another problem making nearly impossible get good nightâ\u0080\u0099s sleep rooms fine though average person recommended next years owner son dies hopefully ownerâ\u0080\u0099s grandson doesnâ\u0080\u0099t turn money eating lunatic",
                "good affordable rooms clean",
                "toilets cleared routinely living rooms cleaned timely provide bedsheet",
                "bad experience ð\u009f\u0098\u0095ð\u009f\u0098\u0095"
            ]
        }
    ]
}