{
    "places_with_reviews": [
        {
            "name": "Hotel Heritage Plaza",
            "rating": [
                4.2
            ],
            "address": [
                "Thalayazham, Vaikom - Vechoor Rd, Vaikom, Thalayazham, Kerala 686613, India"
            ],
            "reviews": [
                {
                    "text": "The hotel staff's attitude is incredibly disappointing and non-cooperative. If you're considering hosting an event here, beware of their lackadaisical approach. The management and other employees display a blatant disregard for customer satisfaction. It's evident they couldn't care less about losing patrons. Regrettably, this seems to be a recurring issue, as evidenced by similar complaints in numerous Google reviews.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very clean throughout, with luxury rooms of a high standard. Peaceful surroundings. About 4km from Vaikom town and beach but easy with autorickshaw. Well maintained hotel. Restaurant was closed for an inspection. Staff need a bit more training regarding client facing skills.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Location is easy accessible.\nPricing is just fair.\nAttitude of staff needs improvement.\nTaste of food is the same with normal restaurants. With better hygiene.\nHave good parking facilities.\nNight lighting and arrangements are good.\nRooms are not so advanced, has facilities of only 2 star or below.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I've stayed in many 5 star and 4 star hotels in Kerala. There's a manager in heritage plaza . He thinks it is the only good hotel in kerala. The well maintained aesthetic beauty of the property is just ruined by his horrific attitude to customers. We pay for the service not for his attitude. The management must rethink about having such a bad mannered staff.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stopped in at this place around 5:00pm today for tea and snacks, walked into an empty restaurant with no one attending, sat there for some time before a gentleman walks in speaking on the phone and walks out, the same chap still on the phone gives us the menue and walks out again, felt like they are doing me a favour. Left the place immediately and drove into a small tea shack down the road, it was a much better experience there and friendly folks having tea there.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel staffs attitude incredibly disappointing noncooperative youre considering hosting event beware lackadaisical approach management employees display blatant disregard customer satisfaction evident couldnt care less losing patrons regrettably seems recurring issue evidenced similar complaints numerous google reviews",
                "clean throughout luxury rooms high standard peaceful surroundings km vaikom town beach easy autorickshaw well maintained hotel restaurant closed inspection staff need bit training regarding client facing skills",
                "location easy accessible pricing fair attitude staff needs improvement taste food normal restaurants better hygiene good parking facilities night lighting arrangements good rooms advanced facilities star",
                "ive stayed many star star hotels kerala theres manager heritage plaza thinks good hotel kerala well maintained aesthetic beauty property ruined horrific attitude customers pay service attitude management must rethink bad mannered staff",
                "stopped place around pm today tea snacks walked empty restaurant one attending sat time gentleman walks speaking phone walks chap still phone gives us menue walks felt like favour left place immediately drove small tea shack road much better experience friendly folks tea"
            ]
        },
        {
            "name": "KTDC Kumarakom Gateway",
            "rating": [
                4
            ],
            "address": [
                "Thanneermukkom, Cherthala, Alappuzha, Thanneermukkom, Kerala 688527, India"
            ],
            "reviews": [
                {
                    "text": "We visited this place last week, It has a very good ambience and a good location with a great view  next to the Vembanad Lake, extraordinary sunrise views.The resort Staff were very hospitable. Food at the resort was good. Overall a Wonderful experience.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Great location with a great view, quiet and serene for family vacation, staycation, The resort Staff were very hospitable. They were helpful with local eat outs recommendation. Food at the resort was good, homely and fresh. Overall had a happy stay. Cleanliness in rooms could be improved. Would like to return again.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We loved our stay at this KTDC resort. The food was exceptional!! The resort is right next to the Vembanad Lake, so you get quite extraordinary sunrise views.\n\nThe views come at a cost as this resort is a 40 minute drive away from Alleppey town area.\n\nAll the staff are helpful.\n\nI just wish that KTDC would get more funds to maintain the rooms!\n\nOur stay was pleasant, so would recommend!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We had our  engineering batch re union this weekend .Glad to share a wonderful and superb feedback on the arrangements provided  by the team there. They were always supportive and made sure for us to have a wonderful stay. The food was really awesome too..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good service and a great location. There is a lot of potential to make it a great spot, but a lot needs to be done. There is no pool, which makes it tough for families to entertain themselves.\n\nFood is good but nothing special about it.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited place last week good ambience good location great view next vembanad lake extraordinary sunrise viewsthe resort staff hospitable food resort good overall wonderful experience",
                "great location great view quiet serene family vacation staycation resort staff hospitable helpful local eat outs recommendation food resort good homely fresh overall happy stay cleanliness rooms could improved would like return",
                "loved stay ktdc resort food exceptional resort right next vembanad lake get quite extraordinary sunrise views views come cost resort minute drive away alleppey town area staff helpful wish ktdc would get funds maintain rooms stay pleasant would recommend",
                "engineering batch union weekend glad share wonderful superb feedback arrangements provided team always supportive made sure us wonderful stay food really awesome",
                "good service great location lot potential make great spot lot needs done pool makes tough families entertain food good nothing special"
            ]
        },
        {
            "name": "Lake vechoor villas Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Ambika Market near Kumarakom, Vechoor, Kottayam, Kerala 686144, India"
            ],
            "reviews": [
                {
                    "text": "I have been in relationships with this property  last three year's. My guests enjoys each and every day with stayed at lake vechoor villas. Best location for viewing  sun set.nice rooms and restaurant with Kerala food  .Nice to stay",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best villa to stay and enjoy your day with backwaters and  sun set and sun rise, ponds for fishing and natural  background, old Kerala traditional with modern amenities. If someone want to see Kerala must visit lakevechoorvillas. Best place to be in a peaceful and  Kerala stye.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Pleasant experience with nice hospitality in kerala style  villas with nice food to eat with kerala  traditions. Best place to enjoy fishing and  fruits  to eat like banana,coconut and more. Friendly staff with honesty and noble.i recommended for all the people who have been in kerala.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best location and best place to see sun set.nice staff and prompt response and services , good food great Room and affordable prices.i suggest a complete travel solution for Kerala visit. Would love to come again.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Kerala is the best place to visit and see,but. Lake vechoor villas is most welcome place to visit and enjoy natural Beauty with backwaters. Recommended to everyone who is interested in Kerala .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "relationships property last three years guests enjoys every day stayed lake vechoor villas best location viewing sun setnice rooms restaurant kerala food nice stay",
                "best villa stay enjoy day backwaters sun set sun rise ponds fishing natural background old kerala traditional modern amenities someone want see kerala must visit lakevechoorvillas best place peaceful kerala stye",
                "pleasant experience nice hospitality kerala style villas nice food eat kerala traditions best place enjoy fishing fruits eat like bananacoconut friendly staff honesty noblei recommended people kerala",
                "best location best place see sun setnice staff prompt response services good food great room affordable pricesi suggest complete travel solution kerala visit would love come",
                "kerala best place visit seebut lake vechoor villas welcome place visit enjoy natural beauty backwaters recommended everyone interested kerala"
            ]
        },
        {
            "name": "Kathakali Heritage",
            "rating": [
                4.1
            ],
            "address": [
                "PCM7+PM3, Thalayazham, Kerala 686613, India"
            ],
            "reviews": [
                {
                    "text": "Excellent ambiance and good services",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Love thise please",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent ambiance good services",
                "good place",
                "love thise please",
                "nice"
            ]
        },
        {
            "name": "Kottayam",
            "rating": [
                3.5
            ],
            "address": [
                "P9CV+J3M, Vaikom, Kerala 686606, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "SNV",
            "rating": [
                4.1
            ],
            "address": [
                "Q92W+32X, Vaikom, Kerala 686141, India"
            ],
            "reviews": [
                {
                    "text": "A great vegetarian restaurant located very close to the west gate of Vaikom Mahadeva Temple. They offer delicious Dosa, Idli, crispy vadas, puttu, and poori for breakfast. The Poori masala has a delightful taste. The food is flavorsome, and the staff is well-behaved, providing excellent service.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A veg restaurant which started decades ago and is a no-nonsense place even this day. Ghee dosa, banana fry, vada and coffee were all yummy. Well behaved staff and the place wasn’t crowded on a late Saturday afternoon. Highly recommend for vegetarian dishes near to the Mahadeva temple.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Oldest vegetarian hotel in vaikom,situated near to vaikom mahadeva temple",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good vegetarian restaurant,affordable and very close to the temple",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "One of the oldest and best vegetarian hotel in Vaikom.  Situated near Vaikom Mahadeva temple.  We will get testy dosa,idlis puttu etc. Meals tastes just awesome in a very low price.  For evening we can have Vadas with chutney, banana fry etc. Coffee,tea,black tea and black coffee are available.. Average sitting capacity.. Very polite staffs and good&hygienic atmosphere..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great vegetarian restaurant located close west gate vaikom mahadeva temple offer delicious dosa idli crispy vadas puttu poori breakfast poori masala delightful taste food flavorsome staff wellbehaved providing excellent service",
                "veg restaurant started decades ago nononsense place even day ghee dosa banana fry vada coffee yummy well behaved staff place wasnâ\u0080\u0099t crowded late saturday afternoon highly recommend vegetarian dishes near mahadeva temple",
                "oldest vegetarian hotel vaikomsituated near vaikom mahadeva temple",
                "good vegetarian restaurantaffordable close temple",
                "one oldest best vegetarian hotel vaikom situated near vaikom mahadeva temple get testy dosaidlis puttu etc meals tastes awesome low price evening vadas chutney banana fry etc coffeeteablack tea black coffee available average sitting capacity polite staffs goodhygienic atmosphere"
            ]
        },
        {
            "name": "Navaneetham",
            "rating": [
                "Unknown"
            ],
            "address": [
                "M9JM+H4M, Kokothamangalam, Kerala 688527, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Olala Houseboats",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Thanneermukkom, Kerala 688527, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Das Brothers HOTEL & TEA SHOP",
            "rating": [
                "Unknown"
            ],
            "address": [
                "PC59+3FF, Vaikom - Vechoor Rd, Thalayazham, Kerala 686607, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "SWATHI HOTEL",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Vechoor, Kumarakom, Kerala 686144, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}