{
    "places_with_reviews": [
        {
            "name": "Laxmi Vilas Palace",
            "rating": [
                4.3
            ],
            "address": [
                "Old Agra Achhnera Road, Kakaji Ki Kothi, Geeta Colony, Bharatpur, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "Laxmi Vilas Palace is a true gem in the heart of India. From the moment I stepped foot into this majestic hotel, I was blown away by its grandeur and elegance. The architecture is simply breathtaking, with its intricate designs and majestic domes that showcase the rich history and culture of India.\n\nThe staff at Laxmi Vilas Palace are incredibly warm and welcoming, making every guest feel like royalty from the moment they arrive. Their attention to detail and willingness to go above and beyond to ensure a seamless and memorable stay is truly commendable. I felt like a cherished guest throughout my entire visit.\n\nThe rooms are beautifully appointed, combining traditional Indian decor with modern amenities. The luxurious bedding and furnishings provided a comfortable and relaxing retreat after a day of exploring the nearby attractions. I particularly enjoyed the stunning views of the surrounding landscapes from my room, which added an extra layer of tranquility to my stay.\n\nThe dining experience at Laxmi Vilas Palace was excellent.\n\nThe hotel's grounds are well maintained, with gardens and pathways that invite guests to take leisurely strolls and soak in the natural beauty that surrounds the property.\n\nLaxmi Vilas Palace is well situated for those eager to explore the nearby attractions. Whether it's visiting historic sites, immersing oneself in the local arts and crafts, or embarking on nature expeditions, the hotel's location provides easy access to a myriad of enriching experiences.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We had an excellent stay in Bharatpur at Laxmi Vilas Palace. The rooms, ambience, service and hospitality is superb. Food is delicious and menu is prepared meticulously  for each meal. The owners themselves take a lot of pain to ensure that everything is taken care of for the guests.\nSimply loved staying here and would definitely revisit.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great Heritage property to stay. Very close to the bird sanctuary( around 5-7 minutes by car). Extremely good service and  good buffet in all meals. If there is less occupancy, then there is no buffet, but the à la carte options are equally good.\nStaff was polite and helpful. There's a nice gift shop there as well, a bit pricey but nice stuff.\nWent in December end, so it was cold, but there is warm running water available non-stop.\nBe wary of lots of mosquitos outdoors in the evening, but that is due to the greenery and a challenge in other resorts too. Ensure to get your room sprayed for a peaceful night's sleep .",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Hotel is nice .. stayed for 1 day .. service was good, food also good. Mosquito problem is basic problem although hotel has taken all precautions to tackle it. Still I suggest carry your own mosquito repellent creams. Else service was nice",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Horrible Experience. Attended a marriage in family there. Booked around 30-40 rooms there for 3 nights. On the last night, i slipped in washroom n fell on shower cubicle, Surprisingly, a portion of cubicle gave away n blasted leaving me unconscious and covered in glass, got a deep cut in left wrist n bruises all over the body including face n head, as i was bleeding profusely, family members called hotel management n asked for medical help, shockingly we wr told there is no such facility available in the hotel n we have to take the patient to the hospital ourselves . Parking is about a 1km away from the room n they took 45 min to search provide a wheelchair. Lucky for me A Doctor was attending the function from bride side n helped me the first aid. In morning i contacted the front desk n as a good samaritan offered to pay for the glass which normally cost around 3600 only, though it was no fault of mine, to my disbelief they slapped a bill for 45000 for the damages. It was after lot of negotiations n pressure from friends it was settled for 20000. I got 4 stitches on wrist after reaching back Delhi same day. It really hurts to see such inhumane behaviour of the hotel management, a life could have been lost that day but all they cared for the damages. I could have asked compensation simply by saying the i just held the door handle n partition fell on me resulting in serious injuries.\nBut they decided to encash this accident as business opportunity",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "laxmi vilas palace true gem heart india moment stepped foot majestic hotel blown away grandeur elegance architecture simply breathtaking intricate designs majestic domes showcase rich history culture india staff laxmi vilas palace incredibly warm welcoming making every guest feel like royalty moment arrive attention detail willingness go beyond ensure seamless memorable stay truly commendable felt like cherished guest throughout entire visit rooms beautifully appointed combining traditional indian decor modern amenities luxurious bedding furnishings provided comfortable relaxing retreat day exploring nearby attractions particularly enjoyed stunning views surrounding landscapes room added extra layer tranquility stay dining experience laxmi vilas palace excellent hotels grounds well maintained gardens pathways invite guests take leisurely strolls soak natural beauty surrounds property laxmi vilas palace well situated eager explore nearby attractions whether visiting historic sites immersing oneself local arts crafts embarking nature expeditions hotels location provides easy access myriad enriching experiences",
                "excellent stay bharatpur laxmi vilas palace rooms ambience service hospitality superb food delicious menu prepared meticulously meal owners take lot pain ensure everything taken care guests simply loved staying would definitely revisit",
                "great heritage property stay close bird sanctuary around minutes car extremely good service good buffet meals less occupancy buffet ã la carte options equally good staff polite helpful theres nice gift shop well bit pricey nice stuff went december end cold warm running water available nonstop wary lots mosquitos outdoors evening due greenery challenge resorts ensure get room sprayed peaceful nights sleep",
                "hotel nice stayed day service good food also good mosquito problem basic problem although hotel taken precautions tackle still suggest carry mosquito repellent creams else service nice",
                "horrible experience attended marriage family booked around rooms nights last night slipped washroom n fell shower cubicle surprisingly portion cubicle gave away n blasted leaving unconscious covered glass got deep cut left wrist n bruises body including face n head bleeding profusely family members called hotel management n asked medical help shockingly wr told facility available hotel n take patient hospital parking km away room n took min search provide wheelchair lucky doctor attending function bride side n helped first aid morning contacted front desk n good samaritan offered pay glass normally cost around though fault mine disbelief slapped bill damages lot negotiations n pressure friends settled got stitches wrist reaching back delhi day really hurts see inhumane behaviour hotel management life could lost day cared damages could asked compensation simply saying held door handle n partition fell resulting serious injuries decided encash accident business opportunity"
            ]
        },
        {
            "name": "Regenta Resort Bharatpur",
            "rating": [
                4.1
            ],
            "address": [
                "Regenta Resort, Agra Rd, Bharatpur, Nagla Gopal Rural, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "Location is really beautiful and magnetic view . Hygienic rooms available at very affordable prices. Food is also good but there is scope of improvement. Above all very fine experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Only thing missed is Hospitality & Service. 4m Start till end, they never missed a chance to remind you that they are not from Service industry. All staff member are the most dumbest & errogent team seen so far. It seems owner/company of this Resort has left this place on mercy of GOD as customers are not welcome /treated as God . i suggest to Avoid",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It is 4 star hotel but service is not upto the mark.\nFir extra bed they are giving mattresses only, no beds like other hotels.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Regenta Resort Bharatpur offers a delightful escape into serenity, making it a standout destination for both leisure and business travelers. Nestled in the heart of Bharatpur, this resort seamlessly combines modern amenities with a touch of traditional charm.\n\nThe resort's architecture is a visual treat, blending contemporary design with local influences, creating a welcoming ambiance. The rooms are spacious, well-appointed, and exude a sense of comfort. The attention to detail in the decor showcases a commitment to guest satisfaction.\n\nThe culinary experience at Regenta Resort Bharatpur is a gastronomic journey. The on-site restaurants serve a diverse array of dishes, each crafted with precision and using high-quality ingredients. From local delicacies to international cuisine, the culinary offerings cater to varied tastes.\n\nThe resort's amenities are designed to cater to both relaxation and recreation. The swimming pool and spa provide moments of rejuvenation, while the well-equipped fitness center appeals to fitness enthusiasts. Additionally, the conference facilities make it an ideal choice for business events.\n\nThe staff at Regenta Resort Bharatpur deserves special mention for their warm hospitality and attentive service. From the moment of arrival to departure, the staff ensures that guests feel pampered and valued.\n\nOverall, Regenta Resort Bharatpur is a haven of luxury in a picturesque setting. Whether you seek a tranquil retreat or a venue for a special event, this resort exceeds expectations, making it a top choice for those seeking a memorable stay in Bharatpur.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's a decent place to stay for a couple of days.\n\n- Food is just ok\n- Staff might be untrained, but extremely well behaved. They just didn't know a lot about hospitality.\n- Rooms and resort is well maintained",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location really beautiful magnetic view hygienic rooms available affordable prices food also good scope improvement fine experience",
                "thing missed hospitality service start till end never missed chance remind service industry staff member dumbest errogent team seen far seems ownercompany resort left place mercy god customers welcome treated god suggest avoid",
                "star hotel service upto mark fir extra bed giving mattresses beds like hotels",
                "regenta resort bharatpur offers delightful escape serenity making standout destination leisure business travelers nestled heart bharatpur resort seamlessly combines modern amenities touch traditional charm resorts architecture visual treat blending contemporary design local influences creating welcoming ambiance rooms spacious wellappointed exude sense comfort attention detail decor showcases commitment guest satisfaction culinary experience regenta resort bharatpur gastronomic journey onsite restaurants serve diverse array dishes crafted precision using highquality ingredients local delicacies international cuisine culinary offerings cater varied tastes resorts amenities designed cater relaxation recreation swimming pool spa provide moments rejuvenation wellequipped fitness center appeals fitness enthusiasts additionally conference facilities make ideal choice business events staff regenta resort bharatpur deserves special mention warm hospitality attentive service moment arrival departure staff ensures guests feel pampered valued overall regenta resort bharatpur luxury picturesque setting whether seek tranquil retreat venue special event resort exceeds expectations making top choice seeking memorable stay bharatpur",
                "decent place stay couple days food ok staff might untrained extremely well behaved didnt know lot hospitality rooms resort well maintained"
            ]
        },
        {
            "name": "Udai Vilas Palace",
            "rating": [
                4.1
            ],
            "address": [
                "NH 11, Fatehpur Sikri Road, Bharatpur, Jatoli Ghana, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful colonial property.\nVery well kept. Lovely rooms, great restaurant for breakfast and dinner.\nBit noisy as work being carried out, but our favourite in India so far. Reception staff could be more welcoming. It’s amazing",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Went on for a reception, the place is quiet and food here is tasty.  There's pool area to cool down too. Worth the money you spend.\nThough experiences differ based on the time and season of the year.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We booked a suite. The room was a little different than the pictures shown on the website so we were a bit disappointed. The bathroom tap was working but was broken from one side. The shower area had rust, so none of us used it.\nFood was good overall.\nThe service left a lot to be desired. The only thing they were prompt about was ensuring that we left the property as soon as the time was up. Not bad people, just not trained as hotel staff should be, so it was quite frustrating.\nNo air purifier, but mentioned on the website.\nThere was a dog roaming around in the property, both days. Friendly, but still.\nFor the price charged, definitely not up to the mark.\nThere were other issues as well, but you get the picture.\nWon't be staying here again unfortunately.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very spacious rooms, cleanliness is at highest lebel. Room service is also good, party lawn is comparatively small but good enough for a gathering of 250-300 pax. Valet parking was there but they were parking cars on the street / road side parking. 90 rooms are there.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Great rooms with beautiful ambience. Cleanliness is commendable. The staff is friendly and take good care of the guests. The hotel property is kid friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful colonial property well kept lovely rooms great restaurant breakfast dinner bit noisy work carried favourite india far reception staff could welcoming itâ\u0080\u0099s amazing",
                "went reception place quiet food tasty theres pool area cool worth money spend though experiences differ based time season year",
                "booked suite room little different pictures shown website bit disappointed bathroom tap working broken one side shower area rust none us used food good overall service left lot desired thing prompt ensuring left property soon time bad people trained hotel staff quite frustrating air purifier mentioned website dog roaming around property days friendly still price charged definitely mark issues well get picture wont staying unfortunately",
                "spacious rooms cleanliness highest lebel room service also good party lawn comparatively small good enough gathering pax valet parking parking cars street road side parking rooms",
                "great rooms beautiful ambience cleanliness commendable staff friendly take good care guests hotel property kid friendly"
            ]
        },
        {
            "name": "The Bagh",
            "rating": [
                4.3
            ],
            "address": [
                "Old Agra, 6G4J+F8W, Achnera Rd, Pakka bagh, Bharatpur, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "We were a large group of 33 people of an age range from 6yrs to 80yrs. We had a wonderful time, it lives up to it's name of being a large beautiful garden with lots of birds and greenery, the rooms are large and spacious, great amenities like a heating AC, which kept our room nice and warm. You get the feel of staying in the holiday retreat of a king. The owner Mr Vishnu Singh took personal care and the staff, especially the manager Mr Bhoopinder are very helpful and courteous. We had asked for vegetarian onion garlic free food and they agreed to our demands and served very tasty and good variety food. Nestled in the lap of nature, they have their own nature walk where you see a variety of birds and plants. There are peacocks roaming freely all over the place. There is a puppet show and bonfire too. They even served us morning tea around a bonfire. I have already recommended it to my Dr friends and would love to visit it again.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "An exhilarating experience! The place is almost 3.5 hour drive from Delhi. You will wake up to the sound of chirping of birds and peacocks dancing outside your room. The place is beautifully lit up at night. The rooms are spacious and the staff is very courteous and helpful. The Bharatpur bird sanctuary is located about 7 mins from this place.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A place away from city noise. Very peaceful and quiet. You'll encounter enough peacocks and many birds closely.\nHotel staff is very accomodating and friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Located in the outer of bharatpur. Visited with the team for a corporate get together. Nice place and very well maintained. The owner is quite friendly. The rooms and overall place are very good. Very quiet and peaceful environment. Best place for relaxing. Food is good and tasty. You can also go just for dinner or lunch.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This has been one of the best stays I have ever had. Good location, excellent property. Rooms are spacious, neat and clean. Staff is very polite and friendly. Food is good with lot of variety in buffet.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "large group people age range yrs yrs wonderful time lives name large beautiful garden lots birds greenery rooms large spacious great amenities like heating ac kept room nice warm get feel staying holiday retreat king owner mr vishnu singh took personal care staff especially manager mr bhoopinder helpful courteous asked vegetarian onion garlic free food agreed demands served tasty good variety food nestled lap nature nature walk see variety birds plants peacocks roaming freely place puppet show bonfire even served us morning tea around bonfire already recommended dr friends would love visit",
                "exhilarating experience place almost hour drive delhi wake sound chirping birds peacocks dancing outside room place beautifully lit night rooms spacious staff courteous helpful bharatpur bird sanctuary located mins place",
                "place away city noise peaceful quiet youll encounter enough peacocks many birds closely hotel staff accomodating friendly",
                "located outer bharatpur visited team corporate get together nice place well maintained owner quite friendly rooms overall place good quiet peaceful environment best place relaxing food good tasty also go dinner lunch",
                "one best stays ever good location excellent property rooms spacious neat clean staff polite friendly food good lot variety buffet"
            ]
        },
        {
            "name": "Hotel Surya Vilas palace",
            "rating": [
                3.8
            ],
            "address": [
                "NH21, Nagla Gopal Rural, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "The property is beautiful, kept very clean. Great service by the staff. The food was excellent!\nThe Location is perfect, from the Bird sanctuary and city! Huge lawn to spend time with family, friends and groups of you are traveling.\nWe really loved the place and people!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I only write reviews when the experience is great or horrific. Unfortunately this time it’s the latter. Simply put if you are in Bharatpur for leisure and worry free stay stay away from this property. Let alone the H of a Heritage property, it doesn’t even tick the basics of hygiene and welcoming staff. We checked out within 1 hour. That sums it all 🫡😅 and that was the wisest decesion.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We planned my brother's wedding at this place & the experience was amazing & very satisfying. The staff is very cooperative including Dinesh ji, Gupta ji & Jagan ji. They were always ready to help. Glad to choose you! Thankyou Diwan ji to deliver what you promised. I would definitely suggest this place to people. The aesthetic of the property is also unbeatable",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Located nicely on NH 21. Suitable for wedding functions as it comprises a big open lawn, hall and sufficient number of rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "On the highway but rooms are not up to mark. Maintenance is poor, bathrooms are clean but stinky. No fridge in the room. Staying here for a marriage function. Service is good. Food is ok.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property beautiful kept clean great service staff food excellent location perfect bird sanctuary city huge lawn spend time family friends groups traveling really loved place people",
                "write reviews experience great horrific unfortunately time itâ\u0080\u0099s latter simply put bharatpur leisure worry free stay stay away property let alone h heritage property doesnâ\u0080\u0099t even tick basics hygiene welcoming staff checked within hour sums ð\u009f « ¡ð\u009f\u0098 wisest decesion",
                "planned brothers wedding place experience amazing satisfying staff cooperative including dinesh ji gupta ji jagan ji always ready help glad choose thankyou diwan ji deliver promised would definitely suggest place people aesthetic property also unbeatable",
                "located nicely nh suitable wedding functions comprises big open lawn hall sufficient number rooms",
                "highway rooms mark maintenance poor bathrooms clean stinky fridge room staying marriage function service good food ok"
            ]
        },
        {
            "name": "Pride Kadamb Kunj Resort Bharatpur",
            "rating": [
                4
            ],
            "address": [
                "NH 11, Fatehpur Sikri Road, near Bird Sanctuary, Bharatpur, Nagla Gopal Rural, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "I've never experienced such disappointment with a hotel. Despite paying for a 4-star resort, it felt like anything but. The services and staff were incredibly disappointing. My room's TV wasn't recharged, the intercom didn't work, and the AC was malfunctioning. To make matters worse, they failed to communicate my room service order, leaving me waiting late into the night. When I raised these issues with the front office personnel (evening), they were unwilling to even acknowledge me, let alone address my concerns. I definitely won't be recommending this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Stayed here 3 nights to access Keoladeo Park only 10 mins away. The food was mediocre with limited choices but the staff were attentive at least. There was loud music playing far too often. My room was not well cleaned but there was plenty of hot water.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Excellent service, the staff was very sweet and accommodating.\n\nThe rooms were strictly okay.\n\nThe food really needs improvement, too oily, not the right preparation method for most things.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice place and great ambiance. Rooms were clean , food and service was also good. Recommended.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Lovely resort in bharatpur i visit with my family in February.24. lovely pool and cosy room. Food was amazing. smoothly check in and check out with smile face. Heartly warm welcome with welcome drink. I hingly recommended i give 5 star !!!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ive never experienced disappointment hotel despite paying star resort felt like anything services staff incredibly disappointing rooms tv wasnt recharged intercom didnt work ac malfunctioning make matters worse failed communicate room service order leaving waiting late night raised issues front office personnel evening unwilling even acknowledge let alone address concerns definitely wont recommending hotel",
                "stayed nights access keoladeo park mins away food mediocre limited choices staff attentive least loud music playing far often room well cleaned plenty hot water",
                "excellent service staff sweet accommodating rooms strictly okay food really needs improvement oily right preparation method things",
                "nice place great ambiance rooms clean food service also good recommended",
                "lovely resort bharatpur visit family february lovely pool cosy room food amazing smoothly check check smile face heartly warm welcome welcome drink hingly recommended give star"
            ]
        },
        {
            "name": "Hotel Saaras",
            "rating": [
                3.7
            ],
            "address": [
                "saras chouraha, Agra - Jaipur Rd, Pushp Vatika Colony, Bharatpur, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "Rooms need immediate renovation as huge dampness in cupboards, electric firti gs in rooms in poor conditions. Linen ok. Food arrangement is also just OK. The best advantage is location and proximity to KNP. Bird sanctuary.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very good hotel to stay in Bharatpur at Saras Chauraha. Very peaceful, at prime location and very spacious rooms at reasonable price. Staff is also well mannered and hotel is well maintained. Manage by RSTDC.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The place is very unhiggenic, restaurant staffs are very rude, we ordered food,and waited about 1 hour and he said I am not in a mood to serve you, 1 staff was sleeping at the dining table, and this is my 2nd visit to this govt property,  I don't understand why govt is not taking action against these people,",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Perfectly located. Food and beverages served were good but the service could have been better",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This RTDC hotel is in urgent need of renovation . Except the Excellent location and huge room size with lower price , nothing actually works .\nRestaurant food is not good , service is non existent .  Door of the toilet can't be closed . It impossible to list all the problems of the hotel .",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms need immediate renovation huge dampness cupboards electric firti gs rooms poor conditions linen ok food arrangement also ok best advantage location proximity knp bird sanctuary",
                "good hotel stay bharatpur saras chauraha peaceful prime location spacious rooms reasonable price staff also well mannered hotel well maintained manage rstdc",
                "place unhiggenic restaurant staffs rude ordered foodand waited hour said mood serve staff sleeping dining table nd visit govt property dont understand govt taking action people",
                "perfectly located food beverages served good service could better",
                "rtdc hotel urgent need renovation except excellent location huge room size lower price nothing actually works restaurant food good service non existent door toilet cant closed impossible list problems hotel"
            ]
        },
        {
            "name": "The Birder's Inn",
            "rating": [
                4.1
            ],
            "address": [
                "314, Bird Sanctuary Colony, Vijay Nagar colony, Rajendra Nagar, Bharatpur, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "Pros; The property is conveniently situated just 400 meters from the National Bird Sanctuary, making it easily accessible by foot. However, what sets it apart is the availability of E-rickshaws right in front of the hotel, which are used for bird safaris. The property is meticulously maintained and spotlessly clean. While the rooms are reminiscent of those in a 4-star hotel, they may be slightly compact, yet tastefully decorated and impeccably clean.On a positive note, the staff is exceptionally courteous and helpful.\nCons;One drawback is the limited and bland food options available, which are also overpriced, leading to a disappointing dining experience. The food experience is highly disappointing.800 Rupees for each person each meal with no taste in food .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A quaint yet comfortable place to stay if the bird sanctuary is your purpose of visit. This hotel is located a stone's throw from the sanctuary gate. The reception gives you a very welcoming feel, unlike the business  types we see in modern hotels now a days.  The restaurant is especially good, I found the dining experience very nice as the buffet meals are not ostentatious or over the top yet tastefully made with a decent spread. HOWEVER , during peak season the rates of the Hotel shoot up & it  appears to be catering  to foreign tourists only. It's only after March that it becomes available to the local folk. Overall, a good  choice for stay in  Bharatpur",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I travelled with am 8 year and 2 year old kids to Birders inn. The resort is beautiful, peaceful, the staff was very helpful. My review would cover different aspect. Location is superb, just 200mts from the bird sanctuary – 10/10, cleanliness – the resort was very clean 10/10\nHowever, when it came to services, I was a little disappointed since the lunch was not served at the room this is for the reason that I travelled with my kids since morning and was tired. In the restaurant, one has to take care of the kids more. Anyways, I had also included dinner in my meal. However, at the time of dinner also, I was little disappointed since, firstly, the food was not good. Secondly, even though I had paid for dinner there was no buffet and it was a fixed menu. In the non veg item the chef had kept a Chinese gravy dish which was difficult to have with chapati unlike a Mughlai dish (which goes better with chapati). In the morning as well, breakfast buffet had limited food menu. This is the only thing which I didn’t like otherwise, the resort and overall experience was extremely pleasant. Sharing pics",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We stayed for two nights three days occupying room numbers 1,2 and 3.\nOverall experience is excellent, very nice property, rooms are large and well maintained. Staff is very good and polite. Food, though quite expensive but good.\nShashank is very nice person and extremely helpful.\nWill highly recommend to anyone willing to visit Bharatpur bird sanctuary.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Wish these \"Intelligent  people\"  warned us that the time to get to the airport would take a minimum of 2 hours as against what the google mentions as one hour. Most of my friends who stayed at other hotels were warned about it correctly. Charged a good 4000 rupees (way too expensive) for sending a driver who had no sense of urgency or idea how to get to the airport . The food was very average . I would avoid this place next time.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pros property conveniently situated meters national bird sanctuary making easily accessible foot however sets apart availability erickshaws right front hotel used bird safaris property meticulously maintained spotlessly clean rooms reminiscent star hotel may slightly compact yet tastefully decorated impeccably cleanon positive note staff exceptionally courteous helpful consone drawback limited bland food options available also overpriced leading disappointing dining experience food experience highly disappointing rupees person meal taste food",
                "quaint yet comfortable place stay bird sanctuary purpose visit hotel located stones throw sanctuary gate reception gives welcoming feel unlike business types see modern hotels days restaurant especially good found dining experience nice buffet meals ostentatious top yet tastefully made decent spread however peak season rates hotel shoot appears catering foreign tourists march becomes available local folk overall good choice stay bharatpur",
                "travelled year year old kids birders inn resort beautiful peaceful staff helpful review would cover different aspect location superb mts bird sanctuary â\u0080\u0093 cleanliness â\u0080\u0093 resort clean however came services little disappointed since lunch served room reason travelled kids since morning tired restaurant one take care kids anyways also included dinner meal however time dinner also little disappointed since firstly food good secondly even though paid dinner buffet fixed menu non veg item chef kept chinese gravy dish difficult chapati unlike mughlai dish goes better chapati morning well breakfast buffet limited food menu thing didnâ\u0080\u0099t like otherwise resort overall experience extremely pleasant sharing pics",
                "stayed two nights three days occupying room numbers overall experience excellent nice property rooms large well maintained staff good polite food though quite expensive good shashank nice person extremely helpful highly recommend anyone willing visit bharatpur bird sanctuary",
                "wish intelligent people warned us time get airport would take minimum hours google mentions one hour friends stayed hotels warned correctly charged good rupees way expensive sending driver sense urgency idea get airport food average would avoid place next time"
            ]
        },
        {
            "name": "Hotel Anokhi",
            "rating": [
                3.9
            ],
            "address": [
                "Jaipur-Mathura Highway, 1st, RJ SH 14, opp. Transport Nagar, Subhash Nagar, Bharatpur, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "We take dinner here in a trip. Good quality food in test. I recommend this hotel",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The Place Is Best the staff Is Well trained and the Taste Is fab. Also They Have *Nothing Before Coffee* with them so It's Great",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Poor customer service, could not deliver foods orders, missed two items, time taken to serve os very high. Arrogant service people. Avoid, cost is not justified for quantity served.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I had a good experience ...only had a cappuccino but ambience was the way I like...\n\nSo you can try once..😊",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Went there for Office function, FOOD AND SERVICE IS PATHETIC. STAFF IS NOT FRIENDLY WITH CUSTOMERS . PRICES OF FOOD IS MUCH HIGHER COMPARISON TO QUALITY.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "take dinner trip good quality food test recommend hotel",
                "place best staff well trained taste fab also nothing coffee great",
                "poor customer service could deliver foods orders missed two items time taken serve os high arrogant service people avoid cost justified quantity served",
                "good experience cappuccino ambience way like try onceð\u009f\u0098\u008a",
                "went office function food service pathetic staff friendly customers prices food much higher comparison quality"
            ]
        },
        {
            "name": "Geetanjali Hotel & motel",
            "rating": [
                4.1
            ],
            "address": [
                "N H.11, Agra Rd, Bharatpur, Nagla Gopal Rural, Rajasthan 321001, India"
            ],
            "reviews": [
                {
                    "text": "I have a fair experience at this property. The property itself is huge. The sprawling lawn just in front of the hotel looks outstanding. Here, you would also find many species of birds.\nThe rooms are comfortable, and there is a lift that would help, especially the elders. I didn't get a chance to taste their food, but I got a chance to experience their hospitality, which is good.\nI would like to visit the place again.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very nice 🏨hotel. Very nice room. Very good for marriage and party",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "In our social life, we celebrate various festivals, occasions, and events. These allow us to enjoy. The wedding ceremony is such a joyous occasion. A few days ago I attended a wedding ceremony. It was my cousin’s wedding. The event was held at their village home. It was a very interesting event. The whole house was decorated with colored paper and flowers. The house was illuminated with multi-colored electric lights. A beautiful gate was made at the entrance of the house to welcome the bride.\n\nThe groom arrived at 3 p.m. He was wearing a gorgeous wedding dress. He was the main attraction. He looked very smart and cheerful. I exchanged courtesy with him. He also greeted me. Hundreds of guests from both sides were present at the ceremony. I was assigned to take pictures. I have sincerely performed my duties and carefully photographed the special moments. Then, according to the rules of our religion, the marriage ceremony is completed amicably.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Big sized rooms with ample bathroom space. Second floor under construction currently.\nNicely behaved staff and Manager. Price is reasonable than it's neighborhood hotels.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Bharatpur Rajasthan in near best hotel is geetanjli hotel 🛏️🏨 best services and best rooms available",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fair experience property property huge sprawling lawn front hotel looks outstanding would also find many species birds rooms comfortable lift would help especially elders didnt get chance taste food got chance experience hospitality good would like visit place",
                "nice ð\u009f\u008f¨hotel nice room good marriage party",
                "social life celebrate various festivals occasions events allow us enjoy wedding ceremony joyous occasion days ago attended wedding ceremony cousinâ\u0080\u0099s wedding event held village home interesting event whole house decorated colored paper flowers house illuminated multicolored electric lights beautiful gate made entrance house welcome bride groom arrived pm wearing gorgeous wedding dress main attraction looked smart cheerful exchanged courtesy also greeted hundreds guests sides present ceremony assigned take pictures sincerely performed duties carefully photographed special moments according rules religion marriage ceremony completed amicably",
                "big sized rooms ample bathroom space second floor construction currently nicely behaved staff manager price reasonable neighborhood hotels",
                "bharatpur rajasthan near best hotel geetanjli hotel ð\u009f\u009b\u008fï¸\u008fð\u009f\u008f¨ best services best rooms available"
            ]
        }
    ]
}