{
    "places_with_reviews": [
        {
            "name": "Aamby Valley City",
            "rating": [
                4.4
            ],
            "address": [
                "Aamby Valley Internal Road, near Post Office Ambavane, taluka Mulshi, Lonavla, Maharashtra 410401, India"
            ],
            "reviews": [
                {
                    "text": "For a peaceful retreat, the experience and the location are excellent altogether. The room service was attractive, and the rooms themselves were wonderful.This place is gorgeous, with amazing views, architecture, and nature. The lake view area and the large swings were great draws. The personnel was amiable, focused, and went above and beyond to make sure that the customer had an amazing experience. The service was flawless. My visit was made extremely pleasurable by the attention to detail in every element, from the amenities and facilities to the caliber of the meals. To anyone looking for a lovely combination of top-notch service and a picturesque setting, I heartily suggest this.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The ambiance and setting are ideal for a tranquil retreat. The accommodations were pleasing, and the room service was commendable. The lakeside vista and expansive swings were particularly captivating, set amidst stunning surroundings with breathtaking scenery and architecture. Service was flawless; the staff was affable, attentive, and exceeded expectations to create an unforgettable experience. Attention to detail was evident in every aspect, from amenities to culinary offerings, making my stay thoroughly enjoyable. I enthusiastically endorse this destination to anyone in search of exceptional service combined with a scenic backdrop.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The experience and the overall place is really nice for a quiet getaway. The rooms were nice and the room service was also pretty.The lake view area and the big swings were a major attraction and the location is stunning, offering breathtaking scenery/views/architecture. The service was impeccable; the staff was friendly, attentive, and went above and beyond to ensure a memorable visit. The attention to detail in every aspect, from amenities/facilities to the quality of the food made my stay truly enjoyable. I highly recommend this to anyone seeking a delightful blend of excellent service and a picturesque setting.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Place is just heaven and well maintained. It could be fairy garden in rainy days. It's too beautiful. Just roam around by walking, gives peace.\nService is bit not up to mark as we struggle much on cottage access and also we face some water and food service issue.\nOverall staff is very friendly and helpful as they immediately act on issue and tried to resolve.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Well-maintained beautiful landscaped environment. Good rooms but service takes long given the distances. Food also is very expensive, even more than 5 star rates. Excellent place for a rejuvenating weekend stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "peaceful retreat experience location excellent altogether room service attractive rooms wonderfulthis place gorgeous amazing views architecture nature lake view area large swings great draws personnel amiable focused went beyond make sure customer amazing experience service flawless visit made extremely pleasurable attention detail every element amenities facilities caliber meals anyone looking lovely combination topnotch service picturesque setting heartily suggest",
                "ambiance setting ideal tranquil retreat accommodations pleasing room service commendable lakeside vista expansive swings particularly captivating set amidst stunning surroundings breathtaking scenery architecture service flawless staff affable attentive exceeded expectations create unforgettable experience attention detail evident every aspect amenities culinary offerings making stay thoroughly enjoyable enthusiastically endorse destination anyone search exceptional service combined scenic backdrop",
                "experience overall place really nice quiet getaway rooms nice room service also prettythe lake view area big swings major attraction location stunning offering breathtaking sceneryviewsarchitecture service impeccable staff friendly attentive went beyond ensure memorable visit attention detail every aspect amenitiesfacilities quality food made stay truly enjoyable highly recommend anyone seeking delightful blend excellent service picturesque setting",
                "place heaven well maintained could fairy garden rainy days beautiful roam around walking gives peace service bit mark struggle much cottage access also face water food service issue overall staff friendly helpful immediately act issue tried resolve",
                "wellmaintained beautiful landscaped environment good rooms service takes long given distances food also expensive even star rates excellent place rejuvenating weekend stay"
            ]
        },
        {
            "name": "SaffronStays Fragrant Sun",
            "rating": [
                4.7
            ],
            "address": [
                "GCRQ+VPH, Unnamed Road, Paud, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "This probably is the best home-stays i have ever been to.\nFrom location to the cottages, the hosts, beautiful dining spaces, and the Food, everything was amaazing.\nWe spent a couple of nights there and were blown away by this artsy, earthy, perfectly curated place.\nThe hosts Sanjeev, Kavita and their team are so nice and friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Awesome place,food and Hospitality 10/10.. Owner of resort are very cool and friendly..Staff is very nice..we stayed 2 days and had super experience..would definately like to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "We had an amazing time at Fragrant Sun during our recent holidays. Accompanied by friends and three toddlers, everyone thoroughly enjoyed the experience. The serene and stunning lake, just a short walk away, added to the beauty of the place. The delectable food, made with quality ingredients from nearby farms, was a delight. The labor of love from Sanjiv and Kavita was evident in every thoughtful element, from antique furniture to room decor and food choices. Seeing the pictures of the place's transformation only added to our admiration for their perseverance and passion. We highly recommend Fragrant Sun and can't wait to visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This was one of the most beautiful homestays that we have stayed in in Maharashtra.\nEverything was impeccable - the rooms were huge and came with beautiful views of the Mulshi lake, the food was absolutely scrumptious (and they veganised it too) and the staff was ever so courteous and kind.\n\nThe whole property, every little nook and corner, has been so thoughtfully curated that you would find yourself at peace everywhere. Thank you once again for the absolutely calming and peaceful stay, we will keep coming back for more.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Serene. Peaceful. Delicious food. Calm lake. Need I say more.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "probably best homestays ever location cottages hosts beautiful dining spaces food everything amaazing spent couple nights blown away artsy earthy perfectly curated place hosts sanjeev kavita team nice friendly",
                "awesome placefood hospitality owner resort cool friendlystaff nicewe stayed days super experiencewould definately like visit",
                "amazing time fragrant sun recent holidays accompanied friends three toddlers everyone thoroughly enjoyed experience serene stunning lake short walk away added beauty place delectable food made quality ingredients nearby farms delight labor love sanjiv kavita evident every thoughtful element antique furniture room decor food choices seeing pictures places transformation added admiration perseverance passion highly recommend fragrant sun cant wait visit",
                "one beautiful homestays stayed maharashtra everything impeccable rooms huge came beautiful views mulshi lake food absolutely scrumptious veganised staff ever courteous kind whole property every little nook corner thoughtfully curated would find peace everywhere thank absolutely calming peaceful stay keep coming back",
                "serene peaceful delicious food calm lake need say"
            ]
        },
        {
            "name": "Inodaya Retreat",
            "rating": [
                4.8
            ],
            "address": [
                "GAT 182, Village, Barpe Bk., Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "Property is luxury and beautiful. Also good and  hygiene but there's no parking facility.. no food Variety..after paying 20k no facility.\nU need to pay If u reach half n hour early u need to pay 2000 for early check-in per hour.. I will not recommend this to anybody.. in 20k u can get good facilities and food varieties.. other retreat or resort they don't charge for early check-in. In other resort they charge for extra amusement activities only.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very serene location, excellent vibe, lovely hosts and delicious food!\nWe went on a weekday for an overnight stay and got lucky as there were no other guests. Right from handholding us to take the correct route to setting up a special birthday surprise for my wife, everything minute detail was sorted by Shailja and Siddharth! The place has been very thoughtfully set up looks like a fairyland when the lights come on at night. The rooms had a great view, the bathrooms are super with an open air bath tub.\nAll 3 meals were excellent and we ended up overeating every time.\nOverall it is a great place to go and relax and blend with nature!",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Even though I just went for a night came back with wonderful memories and will surely be going back\nThe location is fabulous ri stayed in a tent which was very clean comfortable and right on the edge of the hill .. watched a stunning sunrise from my tent !!! The property is beautiful and has a rustic and homely feel .. the staff were very attentive and efficient\nEspecially the hosts Siddharth and Shailja .. food was great .. wonderful getaway with family / friends / solo\nWill visit again soon ..",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I had a wonderful time at Inodaya Retreat! It's a small gem tucked away in a peaceful corner. The staff was incredibly friendly and made me feel at home from the moment I arrived. They know what luxury is and how to provide it!\n\nThe cottages were clean, cozy, and had a calming atmosphere. The natural surroundings were breathtaking, and it was the perfect place to unwind and rest.\n\nThe food was delicious, and I loved the variety of healthy options they offered. It felt like they genuinely cared about my well-being during my stay.\n\nOverall, Inodaya Retreat exceeded my expectations, and I can't wait to visit again. If you're looking for a peaceful getaway with warm hospitality, this is the place to be!\n\nHighly recommended!",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "\"Amidst mountains that tell tales and a lake that reflects serenity, Inodaya Retreat weaved moments into memories, creating a sanctuary uniquely ours. The hospitality, breathtaking views, idyllic location, delectable food, and cozy stay exceeded our expectations. A heartfelt thank you to Shailja and Siddharth for making us feel like home. Already counting the days until our next visit.\"😊",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property luxury beautiful also good hygiene theres parking facility food varietyafter paying k facility u need pay u reach half n hour early u need pay early checkin per hour recommend anybody k u get good facilities food varieties retreat resort dont charge early checkin resort charge extra amusement activities",
                "serene location excellent vibe lovely hosts delicious food went weekday overnight stay got lucky guests right handholding us take correct route setting special birthday surprise wife everything minute detail sorted shailja siddharth place thoughtfully set looks like fairyland lights come night rooms great view bathrooms super open air bath tub meals excellent ended overeating every time overall great place go relax blend nature",
                "even though went night came back wonderful memories surely going back location fabulous ri stayed tent clean comfortable right edge hill watched stunning sunrise tent property beautiful rustic homely feel staff attentive efficient especially hosts siddharth shailja food great wonderful getaway family friends solo visit soon",
                "wonderful time inodaya retreat small gem tucked away peaceful corner staff incredibly friendly made feel home moment arrived know luxury provide cottages clean cozy calming atmosphere natural surroundings breathtaking perfect place unwind rest food delicious loved variety healthy options offered felt like genuinely cared wellbeing stay overall inodaya retreat exceeded expectations cant wait visit youre looking peaceful getaway warm hospitality place highly recommended",
                "amidst mountains tell tales lake reflects serenity inodaya retreat weaved moments memories creating sanctuary uniquely hospitality breathtaking views idyllic location delectable food cozy stay exceeded expectations heartfelt thank shailja siddharth making us feel like home already counting days next visitð\u009f\u0098\u008a"
            ]
        },
        {
            "name": "Aussie Rooms",
            "rating": [
                4.1
            ],
            "address": [
                "J97R+HFX, Aamby Valley City, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic place. Very bad service. The rooms between aussie and Spanish are so far away (5-6 kms) and they keep making you wait for car facilities. We had to wait for one hour. Only to get the same service delivered after paykng the cab drivers money.\nThe hotel's food and rooms are pathetic as well.\nThere are rats in the rooms.\n\nProperty isnt maintained at all!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms are good and spacious but are noisy since they are made of wood. The cracking sounds comes when the upstairs guest walks on the floor. Can be irritating in the night.\n\nFood is expensive.\n\nNeed to have car to roam around.\n\nNeed cart from room to car parking. Need to call and wait for the cart to arrive which can be frustating if they are late.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We came here with a group of 200+ for our annual get together for a couple of days. Had heard about this place. Found it 2x better. Must go to place about 25km from Lonavala",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Leaky bathroom ceiling, could have showered sitting on the commode. Chairs knocked over in the balcony. Table glass top lying carelessly on the balcony floor",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The location of Amby Valley, while great, the upkeep is very poor now. Rooms as well as the common areas are in need of lot of maintenance.\nThe water was leaking on ground floor room during the last stay from the bathroom above.\nAnd the AC ducts seems have never been cleaned.\nThe phone extension in room does not work and to even get a bottle of water is a stretch.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic place bad service rooms aussie spanish far away kms keep making wait car facilities wait one hour get service delivered paykng cab drivers money hotels food rooms pathetic well rats rooms property isnt maintained",
                "rooms good spacious noisy since made wood cracking sounds comes upstairs guest walks floor irritating night food expensive need car roam around need cart room car parking need call wait cart arrive frustating late",
                "came group annual get together couple days heard place found x better must go place km lonavala",
                "leaky bathroom ceiling could showered sitting commode chairs knocked balcony table glass top lying carelessly balcony floor",
                "location amby valley great upkeep poor rooms well common areas need lot maintenance water leaking ground floor room last stay bathroom ac ducts seems never cleaned phone extension room work even get bottle water stretch"
            ]
        },
        {
            "name": "Bhosale Farm Mulshi",
            "rating": [
                4.7
            ],
            "address": [
                "Sarve no 20/2 , Shirvali, Village, Mulshi, Pomgaon, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "The Best Place to spend your weekends and have the most amazing time of your life....\nHas the best scenic view...\nBest food...\nBest Location...\nAmazing Food...",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "DIFFICULT ROADS OFTEN LEADS TO BEAUTIFUL DESTINATIONS….",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It is a very nice place to visit.",
                    "languageCode": "en-US",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best place spend weekends amazing time life best scenic view best food best location amazing food",
                "difficult roads often leads beautiful destinationsâ\u0080¦",
                "nice place visit"
            ]
        },
        {
            "name": "Aussie Suite",
            "rating": [
                4
            ],
            "address": [
                "Unnamed Road, J97R+F28, Aamby Valley City, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "Nice comfortable and spacious rooms built using pine wood. A bit of walk from the reception - electric buggies are available. The climb to the upper rooms is a bit steep. You need to be careful of the monkeys around. Service is a bit slow - expect 30 to 45 minutes for any room service order. Food is also quite expensive, starting from Rs 800 plus for any dish.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I have recently visited Aamby valley city and had a stay in Aussie Chalet, the ambiance of the chalet was great! There are many activities to do in Aamby Valley but what I have experienced is they don’t have knowledgeable staff to guide you about the city so you miss many activities and the food menu in all the restaurants in the city is regular menu with three times prices ,quality of the food is disgusting! So basically you are just paying for the stay and good amenities and Instagram worth pics that’s all !",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Honest review, the location is beautiful,inside Aamby its very peaceful,  but travelling inside Aamby is a little headache if you don't have your car.  Aussie villa is huge and beautiful but of course its made if wood so it has a smell to it.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Definitely Aamby Valley is not a good place to be. They charged ₹15000 for an Aussie room but I have to go and park my own car. Wait for the Buggy to come for another 10min. Leave my car in parking and then enter the room areas.\nIf by any chance I forget anything in  car I have to call the buggy first, sit in it and go to my car and then come back again the same way.\n\nPathetic handling by Aamby Valley.\n\nALSO OUTSIDE LIQUOR IS NOT ALLOWED. WHY ?\n\nEven the Taj and Marriott’s of the world allow outside liquor\n\nWhat kind of pathetic money making SCHEME is this ?",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Terrible place to stay. It's a terrible room. The balcony doors barely lock, space is used poorly (like the cupboard and locker being in the bathroom), there was Chiwda fallen in the sofa-cum-bed. One of our room's AC was heating up the room instead of cooling. The room was very unhygienic with stains on the hand towels, tears and stains on the below bed footrest, and the aforementioned Chiwda (I cannot speak about COVID cleaning). The service was bad as well. They didn't pick up the phone at all and took too long to do send room service (the food came from the Woodpecker which is whole another story) , make the sofa-cum-bed, and other arrangements. After all of this, consider the price. The place is far too expensive to be this bad. 0/10 would not recommend",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice comfortable spacious rooms built using pine wood bit walk reception electric buggies available climb upper rooms bit steep need careful monkeys around service bit slow expect minutes room service order food also quite expensive starting rs plus dish",
                "recently visited aamby valley city stay aussie chalet ambiance chalet great many activities aamby valley experienced donâ\u0080\u0099t knowledgeable staff guide city miss many activities food menu restaurants city regular menu three times prices quality food disgusting basically paying stay good amenities instagram worth pics thatâ\u0080\u0099s",
                "honest review location beautifulinside aamby peaceful travelling inside aamby little headache dont car aussie villa huge beautiful course made wood smell",
                "definitely aamby valley good place charged â\u0082¹ aussie room go park car wait buggy come another min leave car parking enter room areas chance forget anything car call buggy first sit go car come back way pathetic handling aamby valley also outside liquor allowed even taj marriottâ\u0080\u0099s world allow outside liquor kind pathetic money making scheme",
                "terrible place stay terrible room balcony doors barely lock space used poorly like cupboard locker bathroom chiwda fallen sofacumbed one rooms ac heating room instead cooling room unhygienic stains hand towels tears stains bed footrest aforementioned chiwda speak covid cleaning service bad well didnt pick phone took long send room service food came woodpecker whole another story make sofacumbed arrangements consider price place far expensive bad would recommend"
            ]
        },
        {
            "name": "The White Valley farm",
            "rating": [
                5
            ],
            "address": [
                "SR/No , 20/2 , Shirvali, Village, Mulshi, Pomgaon, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "From the moment we arrived, we were blown away by the beauty of the surroundings\nThe staff at the White Valley were exceptional. They were friendly, helpful, and went above and beyond to make our stay comfortable and enjoyable.\nThe natural beauty of the surroundings, the luxurious accommodations, and the exceptional staff all contributed to an unforgettable stay. We would highly recommend this property to anyone looking for a peaceful and rejuvenating getaway.",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "It was an amazing experience......this place is so amazing nd all staff is polite nd caring........nd ofcs food was so delicious.....🤩🤩🤩🤩🥳🥳🥳",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "moment arrived blown away beauty surroundings staff white valley exceptional friendly helpful went beyond make stay comfortable enjoyable natural beauty surroundings luxurious accommodations exceptional staff contributed unforgettable stay would highly recommend property anyone looking peaceful rejuvenating getaway",
                "amazing experiencethis place amazing nd staff polite nd caringnd ofcs food deliciousð\u009f¤©ð\u009f¤©ð\u009f¤©ð\u009f¤©ð\u009f¥³ð\u009f¥³ð\u009f¥³"
            ]
        },
        {
            "name": "Shiv malhar",
            "rating": [
                "Unknown"
            ],
            "address": [
                "J93M+FVV, Aamby Valley City, Maharashtra 412108, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Amol mane",
            "rating": [
                "Unknown"
            ],
            "address": [
                "J95P+8H8, Aamby Valley City, Maharashtra 412108, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Forest View Farm And Cottage",
            "rating": [
                5
            ],
            "address": [
                "HCR3+2RQ, Lonavala Aamby Valley Rd, Kumbhori, Maharashtra 412108, India"
            ],
            "reviews": [
                {
                    "text": "Nice place for vaccination",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place vaccination",
                "nice"
            ]
        }
    ]
}