{
    "places_with_reviews": [
        {
            "name": "CHITHRAPURI Heritage Hotel",
            "rating": [
                3.9
            ],
            "address": [
                "MF4Q+R99, Kazhani, Kavasseri-II, Kerala 678543, India"
            ],
            "reviews": [
                {
                    "text": "Ambience is awesome. Best service. Very tasty food. Different experience. You have to try it once. Vehicle parking, homely atmosphere,etc. I love this place 😍😍😍😍😍",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is a beautiful place to unwind with the traditional vibe to take you back to the olden times. Loved the place and the ambience. However the restaurant staff could do  better job..they seemed confused and were not able to manage our large group.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The worst place I’ve stayed in my life! WASTE OF MONEY AND TIME.\nBEWARE OF THESE SCAMMERS\nChecked into 3 rooms with family - around 6pm they blasted music right outside our rooms and when we asked them to be considerate the manager was so RUDE and INCONSIDERATE. Customer service is non existent here\nAlso if you are with family and little kids - I would definitely not recommend this place from a safety perspective as well. Random people have access to rooms/ area we were in.\nFood was also below average",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I really loved the place where the resort  is located, the staffs were very good and hardworking especially the GM. His service was so excellent. However, the food disappointed me. I did expect a great taste but it was not really good enough to enjoy.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I recently celebrated my son's birthday at Chitra Puri, and I couldn't be more pleased with the experience. The service was impeccable—attentive and prompt, making us feel truly special. The ambiance created for the occasion was warm and inviting, turning a meal into a memorable celebration. The manager's positive attitude and personal touch added an extra layer of joy to the evening. The overall vibes of the restaurant made it a perfect choice for such a special day. Thank you, Chitrapuri, for making my son's birthday truly extraordinary",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ambience awesome best service tasty food different experience try vehicle parking homely atmosphereetc love place ð\u009f\u0098\u008dð\u009f\u0098\u008dð\u009f\u0098\u008dð\u009f\u0098\u008dð\u009f\u0098\u008d",
                "beautiful place unwind traditional vibe take back olden times loved place ambience however restaurant staff could better jobthey seemed confused able manage large group",
                "worst place iâ\u0080\u0099ve stayed life waste money time beware scammers checked rooms family around pm blasted music right outside rooms asked considerate manager rude inconsiderate customer service non existent also family little kids would definitely recommend place safety perspective well random people access rooms area food also average",
                "really loved place resort located staffs good hardworking especially gm service excellent however food disappointed expect great taste really good enough enjoy",
                "recently celebrated sons birthday chitra puri couldnt pleased experience service impeccableâ\u0080\u0094attentive prompt making us feel truly special ambiance created occasion warm inviting turning meal memorable celebration managers positive attitude personal touch added extra layer joy evening overall vibes restaurant made perfect choice special day thank chitrapuri making sons birthday truly extraordinary"
            ]
        },
        {
            "name": "PAZHAMBALACODE Centre",
            "rating": [
                4.3
            ],
            "address": [
                "MFW7+GQ4, Pazhambalacode, Kerala 678544, India"
            ],
            "reviews": [
                {
                    "text": "I fell in love with a girl named Soumya and invited her into my life",
                    "languageCode": "en-US",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fell love girl named soumya invited life"
            ]
        },
        {
            "name": "RADHA ROOMS",
            "rating": [
                4.4
            ],
            "address": [
                "Athipotta, Tarur-II, Kerala 678544, India"
            ],
            "reviews": [
                {
                    "text": "Near to temple and good hospitality",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This is near to the temple. Good service.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice ,good and comfortable",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "near temple good hospitality",
                "near temple good service",
                "nice good comfortable"
            ]
        },
        {
            "name": "SOWPARNIKA HOTELS & RESORTS PRIVATE LIMITED",
            "rating": [
                5
            ],
            "address": [
                "Sreelakshmi, Chundarath house, Kongalakode, Pathanpuram, Kavassery, Kavasseri-I, Kerala 678543, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL ARJUN",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Padur, Kerala 680587, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL ROYAL",
            "rating": [
                "Unknown"
            ],
            "address": [
                "JFR6+CC8, Vadakkanchery - Padur Rd, Padur, Kerala 678687, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL SREELAKSHMI PURE VEGETARIAN",
            "rating": [
                "Unknown"
            ],
            "address": [
                "MF9J+5PP, Mangottu Kaavu Rd, Athipotta, Kerala 678544, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "ഗോപാലേട്ടന്റെ കട",
            "rating": [
                4.5
            ],
            "address": [
                "PF6F+W29, Lakkidi - Pazhambalakkode Rd, Chulanur, Peringottukurissi South, Kerala 678574, India"
            ],
            "reviews": [
                {
                    "text": "Village tea shop, Wall art on shop. Nostalgic felling, nadan item available,",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "village tea shop wall art shop nostalgic felling nadan item available"
            ]
        },
        {
            "name": "ശ്രീ ചീരമ്പ ഭഗവതി ക്ഷേത്രം",
            "rating": [
                "Unknown"
            ],
            "address": [
                "MG37+2C8, Kavassery Anamari Rd, Pathanpuram, Kavassery, Kavasseri-I, Kerala 678543, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}