{
    "places_with_reviews": [
        {
            "name": "Hotel Krishna Classic",
            "rating": [
                3.7
            ],
            "address": [
                "V2MJ+49W, Bangalore - Mangalore Hwy, Behind Bus Stand, B.C Road, Bantwal, Karnataka 574219, India"
            ],
            "reviews": [
                {
                    "text": "Location is great as it's center on B C road . Fish food is good. Muru tawa fry and fish meals recommended. Bangude pulimunchi was bad biryani was decent.\n\nThis place has veg restaurant and bar with non veg also. Comparatively good pricing and AC options eventhough th ehotel looks Pale with old ambience. Good place for a dinner and lunch",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Tasty and Amazing breakfast. The veg Krishnima restaurant, with which the hotel is equipped is easy to recommend to anyone who wants to satisfy their tastebuds with great authentic South Indian Delicacies like Rava Sheera, Masala Dosa and the list goes on.....\nGreat Staff too.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This is a 1 star hotel with no amenities. No Wifi or internet. Please stay away from this hotel. Staff and receptionist lady is rude and not welcoming! Book at Birwa or some decent hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Tasty food.\nTried dilkush, jelly with icecream and triple sunde.\nDilkush 5*\nTriple sunde 4*\nJelly with icecream : 2*\n(In jelly with icecream there are more jellys than icecream)\nPrice: reasonable",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The room was comfortable and fairly clean. Ac working well. Hot water in tap and toilet was fairly clean.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location great center b c road fish food good muru tawa fry fish meals recommended bangude pulimunchi bad biryani decent place veg restaurant bar non veg also comparatively good pricing ac options eventhough th ehotel looks pale old ambience good place dinner lunch",
                "tasty amazing breakfast veg krishnima restaurant hotel equipped easy recommend anyone wants satisfy tastebuds great authentic south indian delicacies like rava sheera masala dosa list goes great staff",
                "star hotel amenities wifi internet please stay away hotel staff receptionist lady rude welcoming book birwa decent hotel",
                "tasty food tried dilkush jelly icecream triple sunde dilkush triple sunde jelly icecream jelly icecream jellys icecream price reasonable",
                "room comfortable fairly clean ac working well hot water tap toilet fairly clean"
            ]
        },
        {
            "name": "Krishnananda Lodging",
            "rating": [
                4.5
            ],
            "address": [
                "W22R+GQ8, Amtady, Karnataka 574211, India"
            ],
            "reviews": [
                {
                    "text": "Lodge has AC and Non-AC rooms, With Geyser Installed so we can get 24/7 hot water facility.\nRooms are well maintained and has wardrobe, TV and Balcony.\nParking space available in Basement.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good new place. Good rooms. Great food. Good friendly service. Clean",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Best room in Bantwal at reasonable price. Well maintained compared to others lodges like Krishnim and Akshaya. Lift is not built completely yet, but rooms are well maintained and clean",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Near and tidy place. New building work ample parking",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Foods was very nice and service also speed",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "lodge ac nonac rooms geyser installed get hot water facility rooms well maintained wardrobe tv balcony parking space available basement",
                "good new place good rooms great food good friendly service clean",
                "best room bantwal reasonable price well maintained compared others lodges like krishnim akshaya lift built completely yet rooms well maintained clean",
                "near tidy place new building work ample parking",
                "foods nice service also speed"
            ]
        },
        {
            "name": "Pearl Residency",
            "rating": [
                4.6
            ],
            "address": [
                "V2HC+WP7, Mangalore - Dharmastala Hwy, B.C Road, Bantwal, Karnataka 574219, India"
            ],
            "reviews": [
                {
                    "text": "A very hood and best recident place  in bcroad it is  opposit mittabail juma masjid",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "My Instagram ID please follow me@mr_adesh_raj",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good 👍",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "how can i book a solo room? any contact details of this hotel?",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good place",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hood best recident place bcroad opposit mittabail juma masjid",
                "instagram id please follow memradeshraj",
                "good ð\u009f\u0091\u008d",
                "book solo room contact details hotel",
                "good place"
            ]
        },
        {
            "name": "Srinivas Residency",
            "rating": [
                3.5
            ],
            "address": [
                "V2MG+55V, B.C Road, Bantwal, Karnataka 574219, India"
            ],
            "reviews": [
                {
                    "text": "Been here once and I had a bad experience.\nLocation is easy to find on the highway and has ample parking facility. The rooms are okish with nothing to complain. The only time I have been here, I had a troublesome night due to bed bugs.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Hotel is in good location. But Ac rooms are not maintained properly. No TV connection, water leakage in bathroom.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Old building, most of the time vacant... stayed there for 1 night...food is horrible...just threw it in bin... room service guy gives lecture about hotel policy and what not they serve...no blankets available for AC room LOL.....no hot water....no cable tv....there is nothing available....",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "One of the best restaurants in B.C.Road. service is really slow but food is great. I would recommend to try Ghee roast and vuruval at this place.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "It's awesome. Food are delicious. Rooms are pretty clean and quiet good.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience location easy find highway ample parking facility rooms okish nothing complain time troublesome night due bed bugs",
                "hotel good location ac rooms maintained properly tv connection water leakage bathroom",
                "old building time vacant stayed nightfood horriblejust threw bin room service guy gives lecture hotel policy serveno blankets available ac room lolno hot waterno cable tvthere nothing available",
                "one best restaurants bcroad service really slow food great would recommend try ghee roast vuruval place",
                "awesome food delicious rooms pretty clean quiet good"
            ]
        },
        {
            "name": "Hotel Sri Mahammayi",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Shop No -4-23, Taluk, opp. Taluk Adalitha Soudha, B.C Road, Bantwal, Karnataka 574219, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL SAGAR",
            "rating": [
                "Unknown"
            ],
            "address": [
                "V2FV+6WF, Panemangalore Rd, Panemangalore, Karnataka 574231, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "BADRIDS HOTEL",
            "rating": [
                "Unknown"
            ],
            "address": [
                "V29Q+GQP, Nandavara Rd, Nandavara, Karnataka 574231, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "HOTEL RAHMANIYA",
            "rating": [
                "Unknown"
            ],
            "address": [
                "V29Q+FJX, Nandavara Rd, Nandavara, Karnataka 574231, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}