{
    "places_with_reviews": [
        {
            "name": "MTDC Ajanta Fardapur",
            "rating": [
                3.8
            ],
            "address": [
                "Major State Highway 8, Fardapur, Thana, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "MTDC Ajanta was one of the most luxurious stays we ever had. We were the only family booked the room for the entire property. Think, how good the property is. I checked the Google reviews, YouTube videos and booked. However, the real time experience is astounding/astonishing. The property is very close to the Highway and Ajanta caves. The hotel staff were friendly and helpful. The property has good space for parking and walking which I loved. However, the rooms are very very old and if you come during monsoon season, come with an umbrella/rainbow jacket to tackle the water inside the room. Rooms are with cracks, lizards, centipedes, black ants, small insects. There are a lot of monkeys in the property. The bathroom is very smelly, like entering into a public toilet. Better avoid this property if you have any choice.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The non ac rooms are newly built, I checked out the AC family suites, which are old. Located on the highway and whole night one has to face traffic sound. Otherwise everything was pretty good. Stayed here for a night during my Ajanta cave visit.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Newly renovated. Rooms are spacious. Cleanliness needs an upgrade. Good service. Ample parking. In house restaurant operates for breakfast and dinner. On the highway and close to Ajanta caves.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Location is very close to Ajanta caves. Rooms are decent, but hot water issues exist. There were black ants too, but didn’t find it too problematic. One can park their cars adjacent to rooms and it is really a plus. Restaurant food is tasty and service was very nice.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I recently stayed at MTDC in Fardapur for a day during the last week of December.\n\nThe proximity to Ajanta Caves provides a stunning view, but there are some notable drawbacks.\n\nThe room rent is on the higher side (₹4.5k+ per night), and unfortunately, the service falls short of expectations.\n\nThe reception staff's lack of English proficiency creates communication challenges, especially for guests from South India who aren't fluent in Hindi.\n\nThe phone numbers listed on their website were unresponsive, making it difficult to reach the staff.\n\nService-wise, it was disappointing. For instance, there was no AC remote in the room initially. After requesting one, we were initially told to manage without it, and only after insistence, they provided a remote.\n\nMoreover, the continental breakfast is limited to Upma and Poha, and the à la carte items are relatively expensive. These issues impact the overall guest experience and could be improved.\n\nDespite the fantastic location, the high room rent, poor service, and communication barriers make it challenging to fully recommend this stay. I hope these concerns are addressed for a better guest experience. Thank you.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mtdc ajanta one luxurious stays ever family booked room entire property think good property checked google reviews youtube videos booked however real time experience astoundingastonishing property close highway ajanta caves hotel staff friendly helpful property good space parking walking loved however rooms old come monsoon season come umbrellarainbow jacket tackle water inside room rooms cracks lizards centipedes black ants small insects lot monkeys property bathroom smelly like entering public toilet better avoid property choice",
                "non ac rooms newly built checked ac family suites old located highway whole night one face traffic sound otherwise everything pretty good stayed night ajanta cave visit",
                "newly renovated rooms spacious cleanliness needs upgrade good service ample parking house restaurant operates breakfast dinner highway close ajanta caves",
                "location close ajanta caves rooms decent hot water issues exist black ants didnâ\u0080\u0099t find problematic one park cars adjacent rooms really plus restaurant food tasty service nice",
                "recently stayed mtdc fardapur day last week december proximity ajanta caves provides stunning view notable drawbacks room rent higher side â\u0082¹k per night unfortunately service falls short expectations reception staffs lack english proficiency creates communication challenges especially guests south india arent fluent hindi phone numbers listed website unresponsive making difficult reach staff servicewise disappointing instance ac remote room initially requesting one initially told manage without insistence provided remote moreover continental breakfast limited upma poha ã la carte items relatively expensive issues impact overall guest experience could improved despite fantastic location high room rent poor service communication barriers make challenging fully recommend stay hope concerns addressed better guest experience thank"
            ]
        },
        {
            "name": "MTDC Guest House",
            "rating": [
                4
            ],
            "address": [
                "Ajanta caves, Thana, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "Best location .. ambience is too good...rooms are neat and clean ..old one but well maintained..very much specious.. You can see Greenary,Birds,Monkeys.\n\nRoom service is available. No restaurant.cook will prepare the food as per your order.. breakfast is complimentary .. lunch is not available.. only dinner is available as per your order . We visited in the end of March. it is hot season.. in the morning climate is very much pleasant.. but after 10 o'clock it's too hot.. the air around you is also too hot. So better to visit from the month of November to February...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The property is at a very beautiful and convenient location if visiting the Ajanta caves is the prime objective. It's easy enough to see the caves in half a day and then spend the rest of it sightseeing some other viewpoints. However, expect the usual govt neglect when staying here. It's too understaffed to be maintained properly but the people on duty did everything they could to make our stay comfortable. The dinner was good, the people were friendly and the room and washroom were clean. Overall, the stay was comfortable and peaceful.\nThere's no WiFi here so we were completely cut off from the world for a couple of days because Airtel doesn't work in this area. But it was a welcome break from the phones.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Only good thing about it is size of the accommodation. Food is very average in quality & quantity but costs as if it's a 5 star hotel. 1 roti / chapati costs Rs.20/-.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice pleasant stay. Cottages are good. Nice plan. Those who love to stay on lonely location will love this place. There is Lake beside so nice morning walk. In night saw neelgay nearby. Lots of parking space. Huge rooms. Breakfast and dinner is good. Washrooms needs to be little clean.\nPlace is very near to caves bus start point. There is one fox in campus, kids love to see it. Must visit in rainy season.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "If you want to stay closest to Ajanta Caves entrance, this is it. The rooms are reasonably clean and rustic, offerring bare bone comfort Ours had working A/C. Shower water was good pressure and hot, though floor drain very slow. The grounds and admin office are in decline. The kitchen is like a well worn fishing boat galley. It would be a good idea to schedule a deep cleaning. The all roles chef did make us a decent breakfast and milk coffee. Staff is attentive and courteous. Installing WIFI for guests would be an important improvement since Airtel signal is weak in the area.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best location ambience goodrooms neat clean old one well maintainedvery much specious see greenarybirdsmonkeys room service available restaurantcook prepare food per order breakfast complimentary lunch available dinner available per order visited end march hot season morning climate much pleasant oclock hot air around also hot better visit month november february",
                "property beautiful convenient location visiting ajanta caves prime objective easy enough see caves half day spend rest sightseeing viewpoints however expect usual govt neglect staying understaffed maintained properly people duty everything could make stay comfortable dinner good people friendly room washroom clean overall stay comfortable peaceful theres wifi completely cut world couple days airtel doesnt work area welcome break phones",
                "good thing size accommodation food average quality quantity costs star hotel roti chapati costs rs",
                "nice pleasant stay cottages good nice plan love stay lonely location love place lake beside nice morning walk night saw neelgay nearby lots parking space huge rooms breakfast dinner good washrooms needs little clean place near caves bus start point one fox campus kids love see must visit rainy season",
                "want stay closest ajanta caves entrance rooms reasonably clean rustic offerring bare bone comfort working ac shower water good pressure hot though floor drain slow grounds admin office decline kitchen like well worn fishing boat galley would good idea schedule deep cleaning roles chef make us decent breakfast milk coffee staff attentive courteous installing wifi guests would important improvement since airtel signal weak area"
            ]
        },
        {
            "name": "Hotel ajanta green restaurant & resort",
            "rating": [
                4.5
            ],
            "address": [
                "ajanta caves, near Ajanta caves parking at post, Fardapur, Thana, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "A very good  place to have your meals. Food was fresh and tasty. They gave us only veg-menu but later we found out that they also serve eggs.\nThe whole place was clean and hygienic.\nThe toilets were neat and clean.\nAmple parking outside.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Awesome hotel near Ajanta caves. Staff were super friendly and welcoming, Rooms and bedding were really clean. Fridge in room was cold, as was the AC. Food was great.  Awesome work - keep it up!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Had a decent lunch at this place, nice and clean lunch area, clean washroom. Reasonable price for food and location is right on the highway near Ajanta Caves.\nHas ample parking space also. Coffee was really good.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very clean compared to most hotels In India. Staff are super helpful, friendly and welcoming. They even washed our Tuk Tuk. Nice and close to the caves.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The only PVT. hotel & resto promoting by MTDC staff wrongly by taking comission from this hotel owner .\nMTDC STAFF pushing there customer to this hotel & resto for comission.\nMTDC hotel ajanta are next to this property.\n\nThis hotel owner was earlier contractor for MTDC kitchen canteen.\n\nOnly few rooms they have . TV sattelite not working. Sooooo  early chek out 9.00 am morning . No logic behind it.\nRestaurant thali starts from Rs. 300 /- without any taste to food ... vegetables not boiling properly . Food quality is not good.\n\nHotel doesnt hv any greenery in surrounding area. .",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place meals food fresh tasty gave us vegmenu later found also serve eggs whole place clean hygienic toilets neat clean ample parking outside",
                "awesome hotel near ajanta caves staff super friendly welcoming rooms bedding really clean fridge room cold ac food great awesome work keep",
                "decent lunch place nice clean lunch area clean washroom reasonable price food location right highway near ajanta caves ample parking space also coffee really good",
                "clean compared hotels india staff super helpful friendly welcoming even washed tuk tuk nice close caves",
                "pvt hotel resto promoting mtdc staff wrongly taking comission hotel owner mtdc staff pushing customer hotel resto comission mtdc hotel ajanta next property hotel owner earlier contractor mtdc kitchen canteen rooms tv sattelite working sooooo early chek morning logic behind restaurant thali starts rs without taste food vegetables boiling properly food quality good hotel doesnt hv greenery surrounding area"
            ]
        },
        {
            "name": "Hotel Pawan & Lodging - Ajanta",
            "rating": [
                4.2
            ],
            "address": [
                "Aurangabad - Ajanta - Jalgaon Rd, opposite Pavan Dhaba, Ajanta, Maharashtra 431117, India"
            ],
            "reviews": [
                {
                    "text": "Food here is one of the best on this highway. Good quality with taste and quick service. Ample parking, price are reasonable, quantity is good, The best dinning experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stopped here on the way to Ajanta Caves for food and rest a bit. Food was served hot and in a hefty portion. Puri Bhajji, Poha and tea we chose which was up to the mark. The staff were very polite.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Chicken handi by sheru must have dish.... even shev sabji is also so tasty",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice 👍  quality 1.pure veg restaurant. 2.Parking good 😊 3. Clean toilet",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "This hotel food is good but no room service. Staff behavior is not good & not cleanness room complimentry like towel, soap, etc. Is not provided.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food one best highway good quality taste quick service ample parking price reasonable quantity good best dinning experience",
                "stopped way ajanta caves food rest bit food served hot hefty portion puri bhajji poha tea chose mark staff polite",
                "chicken handi sheru must dish even shev sabji also tasty",
                "nice ð\u009f\u0091\u008d quality pure veg restaurant parking good ð\u009f\u0098\u008a clean toilet",
                "hotel food good room service staff behavior good cleanness room complimentry like towel soap etc provided"
            ]
        },
        {
            "name": "HOTEL ARYADEEP LODGING & FAMILY RESTAURANTS",
            "rating": [
                4.5
            ],
            "address": [
                "AURANGABAD JALGAON HIGHWAY, near AJANTA CAVES, Fardapur, Thana, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "One of the few best hotels you’ll find on this highway. It’s just on road so you will not spend time finding this hotel.\nSuper clean and very decent food. Staff is courteous and I would highly recommend this hotel if you’re planning to stay on this highway during your next road trip.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "On my recent trip to Ajanta caves, I wanted to find a stay closer so that it would be easier for us to unpack our riding gears and visit the location.\n\nThis hotel seemed to be the only viable choice from their photos and review. Most other stay in the surrounding are poor in hygiene.\n\nAnd it stood up to it. 👍\n\nThe rooms were neat and tidy, bathroom fixtures were all new and clean with hot water shower available any time.\n\nWe inadvertently opted for the terrace while booking which meant we had to climb 3 floors. They don't have an elevator/lift so this means you have to climb a lot. Rooms are available 1st floor upwards, ground floor is a bar. So it may not be kid or family friendly atmosphere. However rooms and bed are large enough for a family with kid.\n\nRoom service: They do provide room service on request, our luggage was carried by their staff and even helped checkout smoothly in the dawn the next day as we had to ride early.\n\nFood service: They have a bar downstairs and their food is average at best and too oily and spicy to the core.🔥 We had an upset stomach the next day, suggesting people explicitly mention to dial down the oil and spice before ordering here.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "For a place like Fardapur, it exceeded my expectation. Location is very convenient as it nearby the point from where one needs to get the shuttle service to Ajanta caves. The room is neat and clean with all basic amenities in place. There is no room service for dinner, but they serve tea snacks in the room. They served us dinner at the first floor restaurant / conference hall as ground floor restaurant is open to all. Food was okay and reasonably priced. I found the room rent a bit on the higher side. Wifi was not working most of the times. Staff is very polite and helpful. Very good for a short stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Its bar ...rates r high like mumbai or any other city .. its near  ajanta  fardapur village ..rates of whisky and berrs r high ..non ac bar.\n\nServing local muttton half  handi 700/- and chiken handi.\n\nKitchen is dirty . Non hygenic.\n\nLodging rooms r small with high prices Rs.2500/- chk out 11.00am.\n\nAjanta - jalgaon rd.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very neat and clean place. Hotel service is great and staff is also good.\nThe location is really good Near Ajanta caves. Rooms are very nice and comfortable",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "one best hotels youâ\u0080\u0099ll find highway itâ\u0080\u0099s road spend time finding hotel super clean decent food staff courteous would highly recommend hotel youâ\u0080\u0099re planning stay highway next road trip",
                "recent trip ajanta caves wanted find stay closer would easier us unpack riding gears visit location hotel seemed viable choice photos review stay surrounding poor hygiene stood ð\u009f\u0091\u008d rooms neat tidy bathroom fixtures new clean hot water shower available time inadvertently opted terrace booking meant climb floors dont elevatorlift means climb lot rooms available st floor upwards ground floor bar may kid family friendly atmosphere however rooms bed large enough family kid room service provide room service request luggage carried staff even helped checkout smoothly dawn next day ride early food service bar downstairs food average best oily spicy coreð\u009f\u0094¥ upset stomach next day suggesting people explicitly mention dial oil spice ordering",
                "place like fardapur exceeded expectation location convenient nearby point one needs get shuttle service ajanta caves room neat clean basic amenities place room service dinner serve tea snacks room served us dinner first floor restaurant conference hall ground floor restaurant open food okay reasonably priced found room rent bit higher side wifi working times staff polite helpful good short stay",
                "bar rates r high like mumbai city near ajanta fardapur village rates whisky berrs r high non ac bar serving local muttton half handi chiken handi kitchen dirty non hygenic lodging rooms r small high prices rs chk ajanta jalgaon rd",
                "neat clean place hotel service great staff also good location really good near ajanta caves rooms nice comfortable"
            ]
        },
        {
            "name": "Hotel Padmapani Park",
            "rating": [
                3.8
            ],
            "address": [
                "National Highway No. 753 F Close to Ajanta caves, Fardapur, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "Terrible Experience at Hotel Padmapani Park\n\nMy recent experience with Hotel Padmapani Park was nothing short of a nightmare. Despite having a confirmed booking, my stay at this establishment was marred by the appalling behavior of the management.\n\nUpon reaching the hotel for check-in, we were shocked to be told that no rooms were available, despite having a confirmed reservation. The manager's dismissive attitude was incredibly frustrating, as he not only refused to accommodate us but also displayed a complete lack of empathy for our situation.\n\nTo add insult to injury, the management made no effort to find an alternative solution for us, such as arranging accommodation in nearby hotels. This was particularly distressing as it was already 7:30 PM, and we were exhausted from our visit to Ajanta.\n\nThe rudeness and lack of professionalism exhibited by the hotel's management were truly disappointing. When we inquired about the reason for this inconvenience, we were informed that the hotel prioritizes bulk bookings over individual reservations. While this may be a business decision, the complete lack of communication about this policy prior to our arrival is inexcusable.\n\nA simple courtesy of informing us beforehand would have allowed us to make alternative arrangements. Instead, we were left stranded and had to scramble to find accommodation in an unfamiliar place.\n\nIn conclusion, my stay at Hotel Padmapani Park was a frustrating and disheartening experience. I would strongly advise against booking with this hotel unless you enjoy the prospect of being denied a room without any prior notice or assistance. The management's behavior reflects poorly on the establishment, and it is clear that customer satisfaction is not a priority for them.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "We booked hotel online but during check in, the owner said- no room available but if you cancel your booking I can give you room. And the cost was double that we initially paid. At this remote area, you don't have much option & other hotels were also full that time. Forcefully we stayed there. At night it was a horrible experience.\nTo the hotel owner- For extra money, you ruined our ajanta trip, time & money also. You are the worst person I have ever met. Very bad experience.\n\nFor extra money he sold, prepaid & pre-booked room. Be aware friend",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Had stayed in this hotel while returning from a wedding function, must say the stay was very pleasant Specially the hotel staff with name of Mr Wasim was very helpful and the hotel owner as well who literally went beyond his way and offered discount on stay . Will definitely visit again.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "The hospitality and cooperation that we received at this hotel needs special mention. The room that was alloted to us was excellent. The cook personally asked for our opinion regarding the food served. All staff were extremely friendly and helpful.A stay in this hotel will enhance the enjoyment of the trip.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very Bad experience the hotel is infested with insects. The owner of this hotel is very idiotic person did not talk politely with customer and asking for large sum of money for staying one day. Food price is high and taste is not up to the mark. Pillows are covered with hair. Keu Jate Ar kono din ei hotel ta choose kore.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "terrible experience hotel padmapani park recent experience hotel padmapani park nothing short nightmare despite confirmed booking stay establishment marred appalling behavior management upon reaching hotel checkin shocked told rooms available despite confirmed reservation managers dismissive attitude incredibly frustrating refused accommodate us also displayed complete lack empathy situation add insult injury management made effort find alternative solution us arranging accommodation nearby hotels particularly distressing already pm exhausted visit ajanta rudeness lack professionalism exhibited hotels management truly disappointing inquired reason inconvenience informed hotel prioritizes bulk bookings individual reservations may business decision complete lack communication policy prior arrival inexcusable simple courtesy informing us beforehand would allowed us make alternative arrangements instead left stranded scramble find accommodation unfamiliar place conclusion stay hotel padmapani park frustrating disheartening experience would strongly advise booking hotel unless enjoy prospect denied room without prior notice assistance managements behavior reflects poorly establishment clear customer satisfaction priority",
                "booked hotel online check owner said room available cancel booking give room cost double initially paid remote area dont much option hotels also full time forcefully stayed night horrible experience hotel owner extra money ruined ajanta trip time money also worst person ever met bad experience extra money sold prepaid prebooked room aware friend",
                "stayed hotel returning wedding function must say stay pleasant specially hotel staff name mr wasim helpful hotel owner well literally went beyond way offered discount stay definitely visit",
                "hospitality cooperation received hotel needs special mention room alloted us excellent cook personally asked opinion regarding food served staff extremely friendly helpfula stay hotel enhance enjoyment trip",
                "bad experience hotel infested insects owner hotel idiotic person talk politely customer asking large sum money staying one day food price high taste mark pillows covered hair keu jate ar kono din ei hotel ta choose kore"
            ]
        },
        {
            "name": "Hotel Royal Ajanta Park",
            "rating": [
                4.9
            ],
            "address": [
                "Building No. 1201, Aurangabad Jalgaon Road Fardapur, Taluka, Soygaon, Fardapur, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "Hotel is in the prime location nearest to Ajanta.. One of the best hotel with super service.. Room is neat and clean.. Staffs r humble and friendly.. View from room, tarrace is too nice.. Room service is also good..",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Best hotel near to ajanta we styed for one night food is owsome good quality food",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Very nice staff , very helpful\nRoom very clean\n2km from Ajanta caves\nGood wifi",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We met Ali and he showed us the best places to see around the caves and the market where we met the family business. He was very accomodating and told us about a different route to see the caves with less people and a great viewpoint. Clean beds, nice room, lovely stay. Thank you!!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Without doubt one of the favourite hotels that we stayed in during our time travelling around India. Upon arrival we were warmly welcomed by the staff and the manager. The staff were attentive, professional and friendly. The chef cooked excellent food and was very flexible which we appreciated. The manager spoke excellent English and was able to offer advice and help whenever it was needed. Our bedroom was ample size, with a comfortable bed and TV, our bathroom was clean and tidy with running hot water, everything you could want in a hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel prime location nearest ajanta one best hotel super service room neat clean staffs r humble friendly view room tarrace nice room service also good",
                "best hotel near ajanta styed one night food owsome good quality food",
                "nice staff helpful room clean km ajanta caves good wifi",
                "met ali showed us best places see around caves market met family business accomodating told us different route see caves less people great viewpoint clean beds nice room lovely stay thank",
                "without doubt one favourite hotels stayed time travelling around india upon arrival warmly welcomed staff manager staff attentive professional friendly chef cooked excellent food flexible appreciated manager spoke excellent english able offer advice help whenever needed bedroom ample size comfortable bed tv bathroom clean tidy running hot water everything could want hotel"
            ]
        },
        {
            "name": "Hotel Tirupati Lodging & Restaurant",
            "rating": [
                4.6
            ],
            "address": [
                "Jalgoan pune, highway, near Ajanta Caves, Fardapur, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "Road touch restaurant and lodge. Quality food they prepare immediately and serve. Staff is very kind. Even owner cooks in the restaurant and i have seen owner eating the same food. 👌👌 Amazing experience. 😍✨",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very good hotel with good parking place and a very clean restaurant with good food.\nThe simple dishes and delicious food is USP…\nRooms are good with all basic needs.\nFor the price offered, this place scores very high on value for money..\nSurely will visit again and highly recommend…\n\nThank you…",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Excellent room very clean,neat and tidy place.they have maintained it well despite the surrounding being rural area.all rooms.all rooms bathroom,linen are etc hygienec.food is tasty near Ajanta best place",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We Stayed Fardapur For 4 days and used to go this restaurant for breakfast to dinner.. We tasted several dish including Maharashtrian delicacy.. Each n every dish was too yummy..They also serve us complimentary foods as it was the time of holi.. The manager n staffs r so so humble.. Cleanliness is on point.. Love the food people vibe everything.. ❤❤❤",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "A good place for food while going to Chhatrapati Sambhaji Nagar must try the misal,Puri Bhaji &poha.\nA Budget hotel and value restaurant must visit. there is an attached rooms for people staying overnight, budget rooms&satisfactory service near ajanta caves",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "road touch restaurant lodge quality food prepare immediately serve staff kind even owner cooks restaurant seen owner eating food ð\u009f\u0091\u008cð\u009f\u0091\u008c amazing experience ð\u009f\u0098\u008dâ\u009c¨",
                "good hotel good parking place clean restaurant good food simple dishes delicious food uspâ\u0080¦ rooms good basic needs price offered place scores high value money surely visit highly recommendâ\u0080¦ thank youâ\u0080¦",
                "excellent room cleanneat tidy placethey maintained well despite surrounding rural areaall roomsall rooms bathroomlinen etc hygienecfood tasty near ajanta best place",
                "stayed fardapur days used go restaurant breakfast dinner tasted several dish including maharashtrian delicacy n every dish yummythey also serve us complimentary foods time holi manager n staffs r humble cleanliness point love food people vibe everything â\u009d¤â\u009d¤â\u009d¤",
                "good place food going chhatrapati sambhaji nagar must try misalpuri bhaji poha budget hotel value restaurant must visit attached rooms people staying overnight budget roomssatisfactory service near ajanta caves"
            ]
        },
        {
            "name": "Agrawals restaurant and lodging",
            "rating": [
                4.2
            ],
            "address": [
                "near ajanta caves jalgaon aurangabad highway, Fardapur, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "They have parking and a restaurant downstairs. Clean bedsheet and washrooms. A bit old. Courteous staff. Good  value for night to visit the caves nearby. They accept foreigners.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I had a fantastic stay at this modest, unpretentious hotel. Don't expect great luxury, but the rooms have everything you need -- it's clean and the staff are extremely attentive and responsive. Rooms at the back are better because they have balconies and don't face the main road where you hear the traffic. Special mention must be made of the restaurant. Really excellent food, reasonably priced. I stayed there for four days and ate like a king. Location is excellent for getting to the Ajanta caves, which are a miracle absolutely worth seeing. Overall excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms still under slight reconstruction, so experience could have been better. But the service of the staff, the warm hospitality and the delicious fresh and warm food made by them, made the stay easier. It's in a good location, near the bus stand and the Ajanta view point. Although fewer shops are available nearby, the the hotel provied us with everything essential. Overall a good place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Extremely poor service.....food quality is so poor I had never eaten such worst quality food.prices are overhyped in menu card ..there is so foul smell in the room as well as corridor....no lift is there... extremely disappointed..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very convenient location from Ajanta caves. We went  there for dinner and were delighted to find that our food was freshly prepared in home style. They even customised our food as per requirements. We loved the taste of the  food and ordered a double serving of mix veg dry and dal fry. The chef makes excellent phulkas(indian bread) which are served hot. The owner pays attention to the food preparation and service which seems to maintain the quality. Would recommend to anyone looking for fresh and tasty food.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "parking restaurant downstairs clean bedsheet washrooms bit old courteous staff good value night visit caves nearby accept foreigners",
                "fantastic stay modest unpretentious hotel dont expect great luxury rooms everything need clean staff extremely attentive responsive rooms back better balconies dont face main road hear traffic special mention must made restaurant really excellent food reasonably priced stayed four days ate like king location excellent getting ajanta caves miracle absolutely worth seeing overall excellent",
                "rooms still slight reconstruction experience could better service staff warm hospitality delicious fresh warm food made made stay easier good location near bus stand ajanta view point although fewer shops available nearby hotel provied us everything essential overall good place stay",
                "extremely poor servicefood quality poor never eaten worst quality foodprices overhyped menu card foul smell room well corridorno lift extremely disappointed",
                "convenient location ajanta caves went dinner delighted find food freshly prepared home style even customised food per requirements loved taste food ordered double serving mix veg dry dal fry chef makes excellent phulkasindian bread served hot owner pays attention food preparation service seems maintain quality would recommend anyone looking fresh tasty food"
            ]
        },
        {
            "name": "Hotel Murli Monohar",
            "rating": [
                3.8
            ],
            "address": [
                "HPMG+C3H, Fardapur, Thana, Maharashtra 431118, India"
            ],
            "reviews": [
                {
                    "text": "Nice veg food cooked in best oil.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Located about a 10 minute walk from the Ajant Tee Point, Hotel Murli Manohar is a wonderful budget choice. The rooms are simple, but well maintained and come with flat screen TV (with a good selection of Indian and international channels), hot showers and very fast WiFi. The bed linen and towels were clean as was my bathroom which was absolutely spotless. Despite it's on road location there was little traffic or street noise and the atmosphere was calm and peaceful.\n\nThere is a restaurant attached and food is available in rooms also.\n\nStaff were friendly and helpful. The hotel is fine for solo women travellers also.\n\nThis is an amazing budget option in a great location.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Value for money & nice restaurant.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good accodamation . Hotel taste is soo good .if you want visit ajinta you must stay in this one unique",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Booked the place through Justdial when travelled to ajanta ellora caves. Had a pleasant and cost effective stay. For food relied on dhabas nearby.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice veg food cooked best oil",
                "located minute walk ajant tee point hotel murli manohar wonderful budget choice rooms simple well maintained come flat screen tv good selection indian international channels hot showers fast wifi bed linen towels clean bathroom absolutely spotless despite road location little traffic street noise atmosphere calm peaceful restaurant attached food available rooms also staff friendly helpful hotel fine solo women travellers also amazing budget option great location",
                "value money nice restaurant",
                "good accodamation hotel taste soo good want visit ajinta must stay one unique",
                "booked place justdial travelled ajanta ellora caves pleasant cost effective stay food relied dhabas nearby"
            ]
        }
    ]
}