{
    "places_with_reviews": [
        {
            "name": "Hotel Corbett Paradise",
            "rating": [
                4.2
            ],
            "address": [
                "Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Great place\nGood food\nRooms are so good and spacious.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The location is excellent, but it is expensive considering the services offered. The food is satisfactory, although they do not have any Tandoor items. They do provide parking facilities, and the venue is particularly well-suited for wedding functions. However, the support staff lacks cooperation and should be more proactive in addressing consumer concerns.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "There is no parking in the hotel. They park your vehicle in the government forest land. This is not safe.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good for hosting party or for marriage",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice wedding hall & very nice & best hotel at Kotdwara",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great place good food rooms good spacious",
                "location excellent expensive considering services offered food satisfactory although tandoor items provide parking facilities venue particularly wellsuited wedding functions however support staff lacks cooperation proactive addressing consumer concerns",
                "parking hotel park vehicle government forest land safe",
                "good hosting party marriage",
                "nice wedding hall nice best hotel kotdwara"
            ]
        },
        {
            "name": "Hotel Grand Kailash",
            "rating": [
                4.7
            ],
            "address": [
                "Kailash Shopping Complex, Najibabad Road, Jhanda Chowk, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Had great experience of staying here. So neat and clean luxurious rooms, so good staff, scenic views and great quality delicious food. What else anyone will ek for? ☺",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "I hope this message finds you well. During my recent stay at this hotel, I encountered an issue with room allocation. Despite we were staying so long, hotel staff asked us to leave the rooms as they were having some reservation, we was not provided with the room we had requested to adjust us time being, which was disappointing and inconvenient. The receptionist is just money oriented and not co-operative. We believe it’s crucial to ensure accurate room assignments to uphold guest satisfaction but they have this kind of practice to ask to leave the room in every stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very impressed by the amazing hospitality, good food and, clean and spacious rooms. Beautiful interior. Highly recommended!\n\nNote to the staff: The QR code on the contact card is not working properly. Might want to check the cause.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Very Good Rroms And Staff Behaviour is very polite and helpful And the food is fantastic..",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good place with good amenity and parking\nOnly issue is heated water as it's on solar so if it's not sunny in winter than it's become a issue\nRest a very decent place with awesome service",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great experience staying neat clean luxurious rooms good staff scenic views great quality delicious food else anyone ek â\u0098º",
                "hope message finds well recent stay hotel encountered issue room allocation despite staying long hotel staff asked us leave rooms reservation provided room requested adjust us time disappointing inconvenient receptionist money oriented cooperative believe itâ\u0080\u0099s crucial ensure accurate room assignments uphold guest satisfaction kind practice ask leave room every stay",
                "impressed amazing hospitality good food clean spacious rooms beautiful interior highly recommended note staff qr code contact card working properly might want check cause",
                "good rroms staff behaviour polite helpful food fantastic",
                "good place good amenity parking issue heated water solar sunny winter become issue rest decent place awesome service"
            ]
        },
        {
            "name": "Relaxx Hotel & Restaurant, Kotdwar - Best Hotel in Kotdwar | Best Restaurant In Kotdwar",
            "rating": [
                4
            ],
            "address": [
                "Manpur, near Pencil Factory, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "I stopped four to five times in the relax hotel\nBut today I booked two rooms I mean with my friend and with my friends, we had booked two rooms with 106 and 108 !\n106 room numbers. In the Dustbin, I can not write here and see the page joining. Let us not have any problem, we should have money, but dirt was so dirt that I can not write it in it, we will come up with our family, then all this thing will come out here. What should I tell you? It should be seen less than the hotel's office, it should be said to your staff when you are taking the price, it is taking a rental in the hotel. Good cleaning is also good.There was very much dirt and this move is very dirty",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Ambience and location is nice, needs improvement in cooking. Chicken was half cooked, coffee not upto the mark but vegetarian dishes like Paneer Tikka dry was good. They have a common toilet for male and female 🙄. Overall not a pleasant experience 😒.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very very disappoint the behaviour of receptionist & electrician. We have taken 10 rooms , their was not worked of room'& intercom telephone, TV & water supply. People saying it will be take sometime but Two days they're not taken a action. Who are responsible about it we are paying all then facilities are not given.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "BEST Service   and good performance  foe caption (Siddharth) nd food quality  is superb",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "good food Good  service very clean and hygiene room very comfortable stay",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stopped four five times relax hotel today booked two rooms mean friend friends booked two rooms room numbers dustbin write see page joining let us problem money dirt dirt write come family thing come tell seen less hotels office said staff taking price taking rental hotel good cleaning also goodthere much dirt move dirty",
                "ambience location nice needs improvement cooking chicken half cooked coffee upto mark vegetarian dishes like paneer tikka dry good common toilet male female ð\u009f\u0099\u0084 overall pleasant experience ð\u009f\u0098\u0092",
                "disappoint behaviour receptionist electrician taken rooms worked room intercom telephone tv water supply people saying take sometime two days theyre taken action responsible paying facilities given",
                "best service good performance foe caption siddharth nd food quality superb",
                "good food good service clean hygiene room comfortable stay"
            ]
        },
        {
            "name": "MIX Grand Hotel Restaurant & Banquet",
            "rating": [
                4
            ],
            "address": [
                "Devi Rd, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Fantastic Retirement party experience! The venue was lively, the staff was attentive, and the atmosphere was vibrant. From the well-decorated space , it made  a memorable celebration. Highly recommend for anyone looking to host a lively event.\nSpecial thanks to Mr Sp Sharma and team.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I would have rated this a 10 star for the service provided by the staff.\nVery polite and accommodating staff.\nFood was really good.\nClean rooms.\nThe manager and front dest staff were very polite and cheerful.\nMade out stay a happy and free of hassles.\nThank you so much team mix grand.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Hakka noodles - the taste is good, they add a lot of veggies which makes it better, the quantity is good. One bowl is fit for 3 people.\n\nFrench fries - 7 out of 10, were crispy.\n\nManchow soup - 8 out of 10.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Sonu shamra is great host.\nHe is fabulous. He is best in take caring of guest.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We went to this restaurant for birthday party.  We enjoyed the party with great food and good service. Thanks to Mr. Sonu Sharma and Mr. Deepak for providing good service.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fantastic retirement party experience venue lively staff attentive atmosphere vibrant welldecorated space made memorable celebration highly recommend anyone looking host lively event special thanks mr sp sharma team",
                "would rated star service provided staff polite accommodating staff food really good clean rooms manager front dest staff polite cheerful made stay happy free hassles thank much team mix grand",
                "hakka noodles taste good add lot veggies makes better quantity good one bowl fit people french fries crispy manchow soup",
                "sonu shamra great host fabulous best take caring guest",
                "went restaurant birthday party enjoyed party great food good service thanks mr sonu sharma mr deepak providing good service"
            ]
        },
        {
            "name": "Ambience Garden Resort",
            "rating": [
                3.8
            ],
            "address": [
                "QG4G+JJ2, Kotdwar - Pauri Rd, Shivpur, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "It was a mesmerising trip. Went there for a marriage of my cousin. Food, ambience was truly awesome. People who serve at venue are very helpful and polite. Attaching the pic of chai wale uncle, made and served awesome tea.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Beautiful place and wonderful service. Suitable for meetings and conferences. Food is really delicious.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very good place for marriage and partying g. Only draw back is lack of parking place, and approach road is quite narrow.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Great hospitality and services. Very friendly people. 100% recommend!",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Got engaged at Ambience Resort. Wonderful place with an amazing view.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mesmerising trip went marriage cousin food ambience truly awesome people serve venue helpful polite attaching pic chai wale uncle made served awesome tea",
                "beautiful place wonderful service suitable meetings conferences food really delicious",
                "good place marriage partying g draw back lack parking place approach road quite narrow",
                "great hospitality services friendly people recommend",
                "got engaged ambience resort wonderful place amazing view"
            ]
        },
        {
            "name": "Capital O Sangam Hotel And Resort",
            "rating": [
                3.8
            ],
            "address": [
                "o, Balasaur Rd, Ratanpur Sukhro, sukhro, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Location is just okay. They have ample space for parking. Party lawn is spacious too. Decorations are good and night views are good. Food is below average and hygiene has been an issue. Rooms are just okay but clean. Wardrooms doesn’t have hot water in basin. Major pain area is quality of food and cutlery. Their food was served cold and food heaters were not working",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Have attended wedding function , superb food, and what a variety 👌",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good place to host small functions or wedding. Decorations are nice, location is nice & easy to reach but at the same time food is pretty bad.\nThey don't have sense of keeping veg & non veg food in organised manner. Everything placed badly & unorganised.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good place for marriage and party",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst service ever! It has been pathetic experience.\nNo room service, telecoms not working. You will not even get water when asked. And please never plan a wedding there.They will ruin it !You will have to do all the work on behalf of waiters.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location okay ample space parking party lawn spacious decorations good night views good food average hygiene issue rooms okay clean wardrooms doesnâ\u0080\u0099t hot water basin major pain area quality food cutlery food served cold food heaters working",
                "attended wedding function superb food variety ð\u009f\u0091\u008c",
                "good place host small functions wedding decorations nice location nice easy reach time food pretty bad dont sense keeping veg non veg food organised manner everything placed badly unorganised",
                "good place marriage party",
                "worst service ever pathetic experience room service telecoms working even get water asked please never plan wedding therethey ruin work behalf waiters"
            ]
        },
        {
            "name": "Hotel Bharat Bhoomi",
            "rating": [
                3.7
            ],
            "address": [
                "PGV9+3RW, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Very bad experience.  Staff is un qualfied and un trained, rough talking staff sue to lack of training.  Not interested again.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "worst hotel ever.!!!\n1. No hygiene in the rooms , cutlery and bedsheets.\n2. No proper maintenance of bathroom equipments like gyser , flush and shower\n3. When reach out to the hotel staff for maintainance, they start to be defensive rather than work on the solution.\n4. Ni wifi connection available all the time\n5. No laundry service there\n6. Just Visit kitchen , you will find ,how unhygienic it is.\n7. No fork ,no knief is served, no milk is served, no tissue paper is served, just tasteless food is served.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "It’s a decent place to stay for a halt. Room size is big but washrooms are average. The staff is very good. It is right next to the bus stop and very close to the local market",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The staff is very co-operative and respectful, the rooms are well cleaned and maintained as always. It's a delight to stay here even for a night.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "We had a good experience here yes I admit price was too high we had occupied 2 rooms that cost us 2600 but it was clean , hygiene, service was good room were clean.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience staff un qualfied un trained rough talking staff sue lack training interested",
                "worst hotel ever hygiene rooms cutlery bedsheets proper maintenance bathroom equipments like gyser flush shower reach hotel staff maintainance start defensive rather work solution ni wifi connection available time laundry service visit kitchen find unhygienic fork knief served milk served tissue paper served tasteless food served",
                "itâ\u0080\u0099s decent place stay halt room size big washrooms average staff good right next bus stop close local market",
                "staff cooperative respectful rooms well cleaned maintained always delight stay even night",
                "good experience yes admit price high occupied rooms cost us clean hygiene service good room clean"
            ]
        },
        {
            "name": "HOTEL TRILOK",
            "rating": [
                3.4
            ],
            "address": [
                "Near ICICI Bank, Devi Road, Sitabhpur, Motor Nagar, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Very excelent room. Condition is top notch. Food is amazing must visit again. Food is amazing",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "No water in bathrooms  taps... It's 5th time I am calling reception for same issue.. fake 4 rating cirtificate on goibigo.  No t.v. subscription.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "This place is in the heart of this small city. That being said, it will hold true for all nearby hotels as well. Cleanliness is okay. Food was good. The stay was expensive. One thing that their blankets don't have covers - it's a hygiene issue. We didn't have to stay the night so, we didn't bother. All rooms are open for smoking",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "A very nice hotel in Kotdwar, very near to the Route of Lansdowne with nice basic amenities. food at restaurant is delicious. Staff is friendly. They can arrange for your onward journey as well... We stayed here in exegency as the Local police doesn't allow vehicles to Lansdowne from Kotdwar after 10pm and before 4 am... But the stay was pleasant...",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "This is really a pathetic experience. I will not recommend this hotel. They are charging more on the name of Luxury but they don't know the meaning of luxury.\n\n1. Not sufficient lighting in the room.\n2. Untrained staff.\n3. They have charged me more as compare to\ntarrif displayed on site.\n4. Cable wasn't working.\n5. Smell in Bathroom.\n6. Open Parking.\n\nif you really looking any hotel in Kotdwar for stay then this is a bad choice.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excelent room condition top notch food amazing must visit food amazing",
                "water bathrooms taps th time calling reception issue fake rating cirtificate goibigo tv subscription",
                "place heart small city said hold true nearby hotels well cleanliness okay food good stay expensive one thing blankets dont covers hygiene issue didnt stay night didnt bother rooms open smoking",
                "nice hotel kotdwar near route lansdowne nice basic amenities food restaurant delicious staff friendly arrange onward journey well stayed exegency local police doesnt allow vehicles lansdowne kotdwar pm stay pleasant",
                "really pathetic experience recommend hotel charging name luxury dont know meaning luxury sufficient lighting room untrained staff charged compare tarrif displayed site cable wasnt working smell bathroom open parking really looking hotel kotdwar stay bad choice"
            ]
        },
        {
            "name": "HOTEL CROWN RESIDENCY",
            "rating": [
                4.5
            ],
            "address": [
                "Hotel Crown residency beladat gharat road lalpur, kotdwar, Kotdwar, Shivpur, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "A decent place for rooms, the owner is very polite and helpful.\nWe were very late at night but the owner tried his best to get us hassle free navigation along with these arranged basic amenities.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Very good stay at a very reasonable cost. Experienced a very neat and clean and safe stay. Facilities and their way to treat guests is also nice. We highly recommend crown residency for staying if one visits kotdwar.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I have had a peaceful stay at this place. Staffs were cooperative. Location is about 2-3km from Kotdwar. Overall, the stay was good that I went back to the same hotel next day to stay for 1 more night. I would recommend this place to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Hotel building and rooms are neat and clean.toilets are also too clean.but they don't have restaurant but they arrange food by swiggy for you.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It is a good place in Kotdwar. It can be useful for party rooms weddings and many occasions. But it's located inside of the city. You can stay here when there are any other options you don't have.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "decent place rooms owner polite helpful late night owner tried best get us hassle free navigation along arranged basic amenities",
                "good stay reasonable cost experienced neat clean safe stay facilities way treat guests also nice highly recommend crown residency staying one visits kotdwar",
                "peaceful stay place staffs cooperative location km kotdwar overall stay good went back hotel next day stay night would recommend place anyone",
                "hotel building rooms neat cleantoilets also cleanbut dont restaurant arrange food swiggy",
                "good place kotdwar useful party rooms weddings many occasions located inside city stay options dont"
            ]
        },
        {
            "name": "HOTEL SURYA PLAZA",
            "rating": [
                3.7
            ],
            "address": [
                "Badrinath Marg, Mohabewala Industrial Area, Kotdwar, Uttarakhand 246149, India"
            ],
            "reviews": [
                {
                    "text": "Wonderful place for family and friends,good atmosphere for celebrations with family and your loveing one",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This hotel is located on the main road of Kotdwar to Lansdowne, it is just ~1.5hrs drive to Lansdown from here. Surrounding area is good and a nearby petrol pump is as well there. even famous Shri koteshwar mahadev temple is nearby. you can do Lansdown in just 4-5 hours including your lunch from here.\nHotel rooms are good enough for a 3 star hotel. Bathrooms were clean and food was very tasty. Parking is available just outside the hotel .   We stayed in their suite room and it was big enough to accommodate 4 of us.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Great place to have a beer with your friend.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Best hotel in the city. The manager Mr. Dhasmana is a very friendly and hospitable person. He personally attended to us. The food in the hotel is very delicious and best in the town all while being reasonably priced. Highly recommended for everyone who plans to visit Kotdwara.\nThe staff was very well behaved.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Hotel Surya Plaza is a budget property located at a distance of 0.5 km from Kotdwara pauri garhwal Railway Station.\n\nThis property offers a comfortable stay to the guests. Guests at this property are accommodated in 15 well-maintained rooms spread across 1 floor.\n\nIn-room amenities include premium bedding, adjustable windows, bottled drinking water, television and an attached bathroom.\n\nRound the clock room service is offered at Hotel Surya Plaza. Front desk assistance is also available at the hotel.\n\nMajor tourist attractions includes\n*Shree Balaji Mandir (1 km)\n*Shree sidhbali baba dham mandir( 4km)   *Durga devi Mandir (8km),\n*lansdowne Garhwal rifels cantontment  area (40km),\n*Bhulla Tal (41 km), and\n*Bhairav garhi mandir\n*Tadkeshwar mahadev mandir\n*Mahabgarh Mahadev (50 km).\n\nThis property is 1 km from Motor Nagar Bus Stand, 92 km from Rishikesh Railway Station and 105 km from Jolly Grant Airport.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wonderful place family friendsgood atmosphere celebrations family loveing one",
                "hotel located main road kotdwar lansdowne hrs drive lansdown surrounding area good nearby petrol pump well even famous shri koteshwar mahadev temple nearby lansdown hours including lunch hotel rooms good enough star hotel bathrooms clean food tasty parking available outside hotel stayed suite room big enough accommodate us",
                "great place beer friend",
                "best hotel city manager mr dhasmana friendly hospitable person personally attended us food hotel delicious best town reasonably priced highly recommended everyone plans visit kotdwara staff well behaved",
                "hotel surya plaza budget property located distance km kotdwara pauri garhwal railway station property offers comfortable stay guests guests property accommodated wellmaintained rooms spread across floor inroom amenities include premium bedding adjustable windows bottled drinking water television attached bathroom round clock room service offered hotel surya plaza front desk assistance also available hotel major tourist attractions includes shree balaji mandir km shree sidhbali baba dham mandir km durga devi mandir km lansdowne garhwal rifels cantontment area km bhulla tal km bhairav garhi mandir tadkeshwar mahadev mandir mahabgarh mahadev km property km motor nagar bus stand km rishikesh railway station km jolly grant airport"
            ]
        }
    ]
}