{
    "places_with_reviews": [
        {
            "name": "Haritha Hill Resort (Mayuri)",
            "rating": [
                4
            ],
            "address": [
                "Near to RTC Complex, Tribal Museum, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "I selected this resort based on the google reviews and various YouTube videos available about the resorts in Araku. Though this resort is run by APTDC, a government organization, this place is maintained well. The building is old and needs maintenance and beautification. But overall experience is very good. Tribal museum and coffee museum are at walking distance. The in house restaurant has specific timing for breakfast, lunch and dinner and breakfast is complimentary. The food is good, though not super-tasty. I would recommend eating from this restaurant as food outside may not be healthy and hygienic. And the best about this restaurant is the mini bar attached to this, where beer (only kingfisher) and few verities of liquor are available. The location is very ideal to spend with your family or friends. The balcony is very spacious and you can enjoy the view of the valley very well.\n\nThe management needs to repair the seepage issues and paint the whole hotel. Lift and Wi-Fi are required for the better comfort of guests. Otherwise, this is the best place to stay in Araku",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I stayed in an AC room in 4th floor. The room and bathroom are pretty clean. The service is ok. There is no Lift which is a pretty big let down for a hotel of this size. The balcony is big and has pretty good valley view. You can get a campfire for 1500rs which is a bit costly which is provided by employees privately but the service is good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Booked an A/c deluxe room here during 1st week of January. Room was good, balcony was bigger than necessary. Didn't order room service, used the restaurant in the ground floor. I don't think there is a lift here.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The place where this hotel is situated has one of the best views in Araku. The hotel has a great architectural design and the Deluxe A/C rooms have the biggest balconies I have ever seen in a hotel offering great views of the nature. It also has a small garden where children can play and have fun. Overall, liked my stay here.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Quite resort. It's a govt owned property so the room services are not so great.  The food is ls also below par.  The location is great. Take the non AC room which comes with a big balcony. The resort also has a big get together place with camp fire facility. They charge extra for that",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "selected resort based google reviews various youtube videos available resorts araku though resort run aptdc government organization place maintained well building old needs maintenance beautification overall experience good tribal museum coffee museum walking distance house restaurant specific timing breakfast lunch dinner breakfast complimentary food good though supertasty would recommend eating restaurant food outside may healthy hygienic best restaurant mini bar attached beer kingfisher verities liquor available location ideal spend family friends balcony spacious enjoy view valley well management needs repair seepage issues paint whole hotel lift wifi required better comfort guests otherwise best place stay araku",
                "stayed ac room th floor room bathroom pretty clean service ok lift pretty big let hotel size balcony big pretty good valley view get campfire rs bit costly provided employees privately service good",
                "booked ac deluxe room st week january room good balcony bigger necessary didnt order room service used restaurant ground floor dont think lift",
                "place hotel situated one best views araku hotel great architectural design deluxe ac rooms biggest balconies ever seen hotel offering great views nature also small garden children play fun overall liked stay",
                "quite resort govt owned property room services great food ls also par location great take non ac room comes big balcony resort also big get together place camp fire facility charge extra"
            ]
        },
        {
            "name": "Araku Haritha Valley Resort",
            "rating": [
                3.9
            ],
            "address": [
                "Araku, Opp. Araku Police Station, Visakhapatnam, Main Road, Araku Valley, Andhra Pradesh 531151, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are quite spacious... But still I'm rating it 4 star cause the bathrooms aren't spacious enough.. Overall a good resort... They also have tennis courts and swimming pool.. They do have hot water facility at swimming pool.. So for me it's a big thumbs up👍!!",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "So the rooms of the place were great but the location not that much because like you really don’t have a view or anything like that. The management was very supportive but did not provide any bills for the expenses that were made there which is kinda a pain on a company get together. The food was ok and the meeting hall was large and fine.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is well maintained except for the play area in the lawn. They have started to rust. Hope they continue to maintain it that way. Swimming pool is chargeable.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Spacious rooms and corridors with scenic balcony views, well maintained lawns and parking spaces amidst lush green mountains... a comfortably beautiful place to stay during a vacation. The dining hall is mention worthy with chic interiors.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "All good but food quantity low. They provide you fixed menu they prepare for that day and every time ask money for food payment no option to pay at the time of check out",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms quite spacious still im rating star cause bathrooms arent spacious enough overall good resort also tennis courts swimming pool hot water facility swimming pool big thumbs upð\u009f\u0091\u008d",
                "rooms place great location much like really donâ\u0080\u0099t view anything like management supportive provide bills expenses made kinda pain company get together food ok meeting hall large fine",
                "well maintained except play area lawn started rust hope continue maintain way swimming pool chargeable",
                "spacious rooms corridors scenic balcony views well maintained lawns parking spaces amidst lush green mountains comfortably beautiful place stay vacation dining hall mention worthy chic interiors",
                "good food quantity low provide fixed menu prepare day every time ask money food payment option pay time check"
            ]
        },
        {
            "name": "Casa Holiday Resorts",
            "rating": [
                4.5
            ],
            "address": [
                "Araku - Visakhapatnam Rd, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "Sorry for such a delayed review...\n\nWe stayed here during the December Christmas holidays and i found this on google maps; read lot of reviews and finally booked this.\n\nThe location is ideal right on the Araku-Vizag highway!\n\nDecent parking lot but gets cramped up very quickly - the main reason is the restaurant!\n\nRoom was below average but served our purpose; i wish i did not stay for 2 nights here but cannot help now!\n\nThe staff are OK but main USP is location and restaurant!\n\nMe, wife, daughter and son stayed here for 2 nights.\n\nThey tried very hard to setup the place but still needs maintenance and trained staff!\n\nRoom service is OK; we got hot water but no TV nor any heater to beat the cold weather!\n\nThey also had bonfires and a projector setup on the 1st floor but not sure if it paid or free!\n\nI will not go back but I do recommend you guys to please do try the stay here and add your pics/review so it is helpful for others!",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I have reserved Casa Holiday Resort after reading google review and it was right decision. Location, Room, Service, Food all were excellent. Staff was always smiley. Manager Raju helped us by guiding as required. It was excellent stay. I will recommend anyone to book this place.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Every aspect related to the Hotel was amazing. The food here was amazingly delicious and reasonable, there was a projector display on the terrace in evening, the rooms were clean with daily service and the staff were very courteous and responsive. I stayed here for 3 days straight. The staff - Chandu, Ramanna and Poorna were there at every step to guide us and make our stay a pleasant one. I highly recommend the stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "This hotel is an average hotel. We booked from MakeMyTrip. The booking price was 4.5k. But got very average facilities. One one person was there at the front desk. He was working in a agile mode. He was doing all the work alone. I appreciate him. Room is not so big. We got room on the 1st floor. There was a big terrace. Morning breakfast was very good.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Hotel is in good condition, the WiFi for first floor doesn’t work, and even after complains they did not fix it.\nThere is a scam around the local drivers that happen, where they charge a very heavy amount, don’t even go with hotel recommendations on this, have you own vehicle or go for auto.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "sorry delayed review stayed december christmas holidays found google maps read lot reviews finally booked location ideal right arakuvizag highway decent parking lot gets cramped quickly main reason restaurant room average served purpose wish stay nights help staff ok main usp location restaurant wife daughter son stayed nights tried hard setup place still needs maintenance trained staff room service ok got hot water tv heater beat cold weather also bonfires projector setup st floor sure paid free go back recommend guys please try stay add picsreview helpful others",
                "reserved casa holiday resort reading google review right decision location room service food excellent staff always smiley manager raju helped us guiding required excellent stay recommend anyone book place",
                "every aspect related hotel amazing food amazingly delicious reasonable projector display terrace evening rooms clean daily service staff courteous responsive stayed days straight staff chandu ramanna poorna every step guide us make stay pleasant one highly recommend stay",
                "hotel average hotel booked makemytrip booking price k got average facilities one one person front desk working agile mode work alone appreciate room big got room st floor big terrace morning breakfast good",
                "hotel good condition wifi first floor doesnâ\u0080\u0099t work even complains fix scam around local drivers happen charge heavy amount donâ\u0080\u0099t even go hotel recommendations vehicle go auto"
            ]
        },
        {
            "name": "USHODAYA RESORTS",
            "rating": [
                4.5
            ],
            "address": [
                "Padmapuram, 8VQG+G3X, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "This resort is excellent in terms of location, ambience and service; though the way to enter the compound is clumsy, narrow and not very pleasant, but once you enter, it's really good with lots of greenery. Rooms are value for money, clean, spacious and comfortable. Service is also very good, you can call the reception for something and someone will come in a few minutes. Didn't enjoy the food much, but food items available there was mostly same everywhere out side also, so not much of a variety in taste or form ☹️ Don't expect north/east/west Indian food. The tea was nice though.\n\nPeople visit in groups during weekends and holidays to party and enjoy in this ambience, and some of them played loud music late in the night, surprised to see there was no restriction. If you want to wander around in the night inside the compound, you will be annoyed by the loud music. Inside rooms, it was not much of a problem, though our rooms were a bit farther from the place where music was played.\n\nOverall this will be an excellent stay for 1-2 days, I will recommend the resort, contact them also for Araku sight seeing, they have contacts with very friendly and professional car service providers.\n\nTip: Just left to the entrance of the resort entrance, there goes a narrow road that takes you up-hill. Take a walk if you wish 😉 it will be great experience walking up the hills and take a look around. Be safe around the rocks and cliffs, and come back to the resort while there is day light. We wandered this place by ourselves just out of curiosity. This area is not part of the resort's compound, so you have to ensure your own safety and you are on your own.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Staff Behavior is worst. The response is good until you book rooms post you will not get any response. We faced lot of issues with staff and Rooms.\n\nNote: They are charging extra money for everything except rooms.\n\nPlease find the charges requested, as part of facilities camp fire is mentioned but they asked money. As per initial discussion extra cot will be provided for 3rd person but they gave bed on floor. When I asked the same they demanded extra money. The response from the staff is very poor. We have to go 3 or 4 times for same thing. Initially they provided one room but in washrooms water is clogging, even after reporting to the reception no response. After 4 follow up they changed the room. The new room that provided doesn't have soap stand, broken sink and no holder for hand flush tap. When we informed these issues also no response from the team. Do you need any additional information?",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We booked a month in advance and had a pleasant stay. Rooms are clean and spacious. The staffs are really good especially Shiva and Diwakar. The restaurant food is good l, but had limited breakfast option. The vegetarian stuffs were good and their prices are reasonable.  Just one disadvantage, the road that leads to the resort is not that great, you have open drainage on both sides,  around 200 to 300 metersl, post you enter you have a luxurious resort with ample parking. We had a wonderful stay and will visit again",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Went there to enjoy along with family and friends. It's been a wonderful experience. Rooms are good and staff are so friendly. Campfire is available and there was a play area available for children to enjoy.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice place, nice people's, nice rooms, helpful staff,good service,,only about the 200 mtrs narrow road to reach out  to the resort, other than that every thing is fine here ,you won't get  disappointed  going in groups or couples or family. Had nice experience with family recently days ago. I give 4 🌟 🤩 ⭐️ 🌠 💫 ✡️",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "resort excellent terms location ambience service though way enter compound clumsy narrow pleasant enter really good lots greenery rooms value money clean spacious comfortable service also good call reception something someone come minutes didnt enjoy food much food items available mostly everywhere side also much variety taste form â\u0098¹ï¸\u008f dont expect northeastwest indian food tea nice though people visit groups weekends holidays party enjoy ambience played loud music late night surprised see restriction want wander around night inside compound annoyed loud music inside rooms much problem though rooms bit farther place music played overall excellent stay days recommend resort contact also araku sight seeing contacts friendly professional car service providers tip left entrance resort entrance goes narrow road takes uphill take walk wish ð\u009f\u0098\u0089 great experience walking hills take look around safe around rocks cliffs come back resort day light wandered place curiosity area part resorts compound ensure safety",
                "staff behavior worst response good book rooms post get response faced lot issues staff rooms note charging extra money everything except rooms please find charges requested part facilities camp fire mentioned asked money per initial discussion extra cot provided rd person gave bed floor asked demanded extra money response staff poor go times thing initially provided one room washrooms water clogging even reporting reception response follow changed room new room provided doesnt soap stand broken sink holder hand flush tap informed issues also response team need additional information",
                "booked month advance pleasant stay rooms clean spacious staffs really good especially shiva diwakar restaurant food good l limited breakfast option vegetarian stuffs good prices reasonable one disadvantage road leads resort great open drainage sides around metersl post enter luxurious resort ample parking wonderful stay visit",
                "went enjoy along family friends wonderful experience rooms good staff friendly campfire available play area available children enjoy",
                "nice place nice peoples nice rooms helpful staffgood serviceonly mtrs narrow road reach resort every thing fine wont get disappointed going groups couples family nice experience family recently days ago give ð\u009f\u008c\u009f ð\u009f¤© â­\u0090ï¸\u008f ð\u009f\u008c ð\u009f\u0092 « â\u009c¡ï¸\u008f"
            ]
        },
        {
            "name": "V Resort Araku",
            "rating": [
                4.1
            ],
            "address": [
                "531151 Rana jaladi water Falls Road, Araku Valley, Andhra Pradesh 531151, India"
            ],
            "reviews": [
                {
                    "text": "The property is huge with good maintained ambiance. The garden has to be fully grown to fully enjoy it's view. Rooms are spacious with good balcony views. The property is located at a secluded area but not very far from the city. It will be a little challenging to find a good breakfast spot with seating ambiance near by as the property doesn't provide breakfast. Lunch and dinner were provided when informed earlier. But there is a huge communication gap between the restaurant and management staff. We are disappointed that we have to repeat our requests more times for fulfillments. Little things like hot water supply, dinning areas and room service after checking in should be taken care, else everything seemed decent.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Was here for a day and resort is lovely. Great view and resort interiors are good. Deluxe AC room is spacious. They charged for 3 people, however was charging money when asked for extra bed for the 3rd person, as the bed was queen size only. Hot water can be improved. Breakfast is not available here. No in room wifi, it is available only in the reception lobby.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The worst part of the resort is the Kalyaana Mandapam in side the resort campus.\nDuring marriages/events lot of disturbance to guests.\n\nSwimming pool is only for babies. Not enough depth and not for adults. No privacy to pool area.\n\nRestaurant is unsatisfactory.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We booked 2 suite rooms, in this freezing cold there was absolutely no hot water . They keep telling you but it never came, after a long tiring day it was totally unworth the money to be in this hotel. Though it’s not a great place and still charge a lot , but hot water is a must!!!!",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Worst room service. Staff behaviour is very rude. Very good ambience is being spoiled by staff behaviour. When asked the staff, they are behaving as if we are staying at free of cost. Property owners to look in to and set the staff right.\n\nStaff behaviour and respect to customers is too bad.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "property huge good maintained ambiance garden fully grown fully enjoy view rooms spacious good balcony views property located secluded area far city little challenging find good breakfast spot seating ambiance near property doesnt provide breakfast lunch dinner provided informed earlier huge communication gap restaurant management staff disappointed repeat requests times fulfillments little things like hot water supply dinning areas room service checking taken care else everything seemed decent",
                "day resort lovely great view resort interiors good deluxe ac room spacious charged people however charging money asked extra bed rd person bed queen size hot water improved breakfast available room wifi available reception lobby",
                "worst part resort kalyaana mandapam side resort campus marriagesevents lot disturbance guests swimming pool babies enough depth adults privacy pool area restaurant unsatisfactory",
                "booked suite rooms freezing cold absolutely hot water keep telling never came long tiring day totally unworth money hotel though itâ\u0080\u0099s great place still charge lot hot water must",
                "worst room service staff behaviour rude good ambience spoiled staff behaviour asked staff behaving staying free cost property owners look set staff right staff behaviour respect customers bad"
            ]
        },
        {
            "name": "Nature's Nest Araku",
            "rating": [
                4.3
            ],
            "address": [
                "Main road Araku ,Ravvalaguda, Visakhapatnam, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "In every corner of this hotel, from its elegant rooms to its world-class amenities, there is a sense of magic and wonder that captivates the imagination and leaves a lasting impression. It is a place where dreams come true and memories are made, where every moment is infused with a sense of enchantment and delight. In conclusion, this hotel is not simply a place to stay; it is a destination in itself, where luxury, comfort, and unparalleled service come together to create an experience that is truly unforgettable. So indulge your senses, escape the ordinary, and discover the magic of this extraordinary hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Booked the room for 3 people in Amazon. Was worth every penny. It was simple & neat. Evenings are especially good with the songs & projector ON. Went on normal days, crowded day will be more special.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice hotel, service also good. First I feel fear about araku hotels based on reviews. But the nature nest is good . It's 4 km from araku railway station. Price calculated for 24 hours. Nice hotel. Rabits also there 😊",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "My stay at Nature Nest's Resort in Araku Valley was nothing short of delightful. Situated conveniently on the main road, the resort offers easy access to all the nearby tourist attractions. The comfortable accommodation provided a perfect retreat after exploring the scenic beauty of Araku.\n\nOne standout feature is the resort's accessibility to various tourist spots, making it a strategic choice for travelers. Additionally, the option for camping, albeit at an extra cost, adds an adventurous touch to the stay. The well-maintained facilities and courteous staff contribute to a hassle-free and enjoyable experience.\n\nOverall, Nature Nest's Resort is a good choice for those seeking a comfortable and well-connected stay in the heart of Araku Valley. I would recommend it for anyone looking to combine tranquility with accessibility during\ntheir visit to this picturesque destination.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "One of the finest stays in Araku!\nIf you want a combination of cozy stay and delicious food in Araku I would highly recommend this!! 😄\nThey stand out in terms of Quality and class.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "every corner hotel elegant rooms worldclass amenities sense magic wonder captivates imagination leaves lasting impression place dreams come true memories made every moment infused sense enchantment delight conclusion hotel simply place stay destination luxury comfort unparalleled service come together create experience truly unforgettable indulge senses escape ordinary discover magic extraordinary hotel",
                "booked room people amazon worth every penny simple neat evenings especially good songs projector went normal days crowded day special",
                "nice hotel service also good first feel fear araku hotels based reviews nature nest good km araku railway station price calculated hours nice hotel rabits also ð\u009f\u0098\u008a",
                "stay nature nests resort araku valley nothing short delightful situated conveniently main road resort offers easy access nearby tourist attractions comfortable accommodation provided perfect retreat exploring scenic beauty araku one standout feature resorts accessibility various tourist spots making strategic choice travelers additionally option camping albeit extra cost adds adventurous touch stay wellmaintained facilities courteous staff contribute hasslefree enjoyable experience overall nature nests resort good choice seeking comfortable wellconnected stay heart araku valley would recommend anyone looking combine tranquility accessibility visit picturesque destination",
                "one finest stays araku want combination cozy stay delicious food araku would highly recommend ð\u009f\u0098\u0084 stand terms quality class"
            ]
        },
        {
            "name": "At Home Prakruthi Resorts",
            "rating": [
                3.9
            ],
            "address": [
                "Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "Location was really beautiful, hotel staff were good.really loved it. Food is not available here, we need to go 3km to araku valley to get food. Food is also nice there. Finally five star rating.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This so-called Resort is located just close to the Railway Track which is mostly used for goods trains so at night every hour  you will listen to the  train horn. During my stay the room was not very clean, Bedsheet was spotted. Standard rooms and washrooms are compact.Food quality is just average with very limited options. The owner lady's behaviour is very rude.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I must say it was an amazing stay, the location the food, the service and the calmness of this property, surrounded by mountains.\nA must visit if you're coming to Araku.\nI want to mention two names here Jeevan the Manager and Ramakrishna excellent👏",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is okay. The rooms are big but a bit old. The room service is nice but the restaurant is not. If you are expecting good South Indian pure veg food it is not available(To be fair it is a general problem in Araku and you at least have pure veg food). The resort is close to the main road and near our room we could see the train track (not sure if you can see it from other rooms but you can walk to the train track)and take photos when the train passes by. Overall I recommend you to go to other resorts if you can.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Prakruthi Resorts in Araku Valley often receives positive reviews for its serene ambiance, beautiful surroundings, and comfortable accommodation options. Visitors appreciate the resort's picturesque location amidst nature, offering a peaceful escape from city life. The property typically features well-maintained cottages or rooms, providing a cozy stay for guests. The resort's staff is usually friendly and attentive, contributing to a pleasant experience for visitors. Additionally, some reviewers highlight the delicious local cuisine served at the resort. However, occasional feedback might mention maintenance issues or suggest improvements in certain amenities. Overall, Prakruthi Resorts is favored by many for its tranquil setting and a relaxing stay amid the scenic beauty of Araku Valley.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location really beautiful hotel staff goodreally loved food available need go km araku valley get food food also nice finally five star rating",
                "socalled resort located close railway track mostly used goods trains night every hour listen train horn stay room clean bedsheet spotted standard rooms washrooms compactfood quality average limited options owner ladys behaviour rude",
                "must say amazing stay location food service calmness property surrounded mountains must visit youre coming araku want mention two names jeevan manager ramakrishna excellentð\u009f\u0091\u008f",
                "okay rooms big bit old room service nice restaurant expecting good south indian pure veg food availableto fair general problem araku least pure veg food resort close main road near room could see train track sure see rooms walk train trackand take photos train passes overall recommend go resorts",
                "prakruthi resorts araku valley often receives positive reviews serene ambiance beautiful surroundings comfortable accommodation options visitors appreciate resorts picturesque location amidst nature offering peaceful escape city life property typically features wellmaintained cottages rooms providing cozy stay guests resorts staff usually friendly attentive contributing pleasant experience visitors additionally reviewers highlight delicious local cuisine served resort however occasional feedback might mention maintenance issues suggest improvements certain amenities overall prakruthi resorts favored many tranquil setting relaxing stay amid scenic beauty araku valley"
            ]
        },
        {
            "name": "AKSHAYA INN",
            "rating": [
                4.1
            ],
            "address": [
                "Main Road, opp. MRO Office, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "It was a good place for food and for parking too. But the service didn't meet the expectations due to the delay in food or others. As this restaurant is run by students they were facing this issue and didn't make out to give all the orders which we have ordered due to that my family was disappointed. But the food is absolutely fine.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Had lunch here only. Lunch was served fresh and was very good. Biriyani was decent. Bamboo chicken was good and could have been better.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Loot loot loot. This is in Araku Valley and every precious site is far away from this location. Think once before booking room in Araku valley. I suggest to book a room in Ananthagiri . Here Rooms are well maintained and ambience is good. Out of this everything is bad. Prices are too high. They cant provide two extra beds in a room instead they will tell us to book extra room. Very arrogant. For a two or three members it is a good choice. But 4 or 5 members it is not a good choice. Hotel and inside and outside looks exactly in the photos they shared in the site. Good location.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Had chicken biryani, fired rice, and curd rice. Food was excellent, they have sufficient parking. If you are in Araku, try the roadside bamboo chicken or if you are looking for a proper resturant then this place is a good choice",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The Most attitude Guy in the Reception the way he was talking to the customers was too Bad\nMy wife is a doctor am advocate the way he spoke to us he so senseless\nWhen i complained him am about the cleanliness of the hotel he was saying post any where you want\n\nI do have proof for everything which am posting",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place food parking service didnt meet expectations due delay food others restaurant run students facing issue didnt make give orders ordered due family disappointed food absolutely fine",
                "lunch lunch served fresh good biriyani decent bamboo chicken good could better",
                "loot loot loot araku valley every precious site far away location think booking room araku valley suggest book room ananthagiri rooms well maintained ambience good everything bad prices high cant provide two extra beds room instead tell us book extra room arrogant two three members good choice members good choice hotel inside outside looks exactly photos shared site good location",
                "chicken biryani fired rice curd rice food excellent sufficient parking araku try roadside bamboo chicken looking proper resturant place good choice",
                "attitude guy reception way talking customers bad wife doctor advocate way spoke us senseless complained cleanliness hotel saying post want proof everything posting"
            ]
        },
        {
            "name": "Alluri Resorts",
            "rating": [
                4.6
            ],
            "address": [
                "Ravvalaguda, Araku valley, Araku - Visakhapatnam Rd, opposite to ITI (govt, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "The rooms are excellent and Clean. There is no scenic view from the window though. The resort doesn't have a restaurant. The service is just ok. Overall recommended for family and 3000/- worthy",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Rooms like a 5* hotel . In season rent is very high. Non-season rent is very low. I highly recommend it. Back side valley view and railway line. Good car and bike parking available. Outside food is also allowed.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Hi!\nThis is the worst resort I have seen, and I request those who are reading this review to stay away from this resort. We made a booking through MMT and paid money online 3 days before our arrival for a suite room. But after traveling from Hyderabad almost 900km when we reached, we found that they had sold that room to someone else. We asked the manager, and he simply told us what we would do with the room, and that was not required of us. And they just bluntly told us that we should take the refund and search room somewhere else. Or they can give us a non-ac room where we can stay.\nAnd that manager was like this is an option do whatever you want to we don't care kind of attitude.\nSo, if you wanna ruined your holidays or stay this is best hell to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "My stay at ALLURI RESORTS  was fantastic! The rooms were spacious, and the bathrooms were spotless. The only downside was that the restaurant wasn't open yet. Overall, a great experience!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Go for it 👍\nAmazing experience and too Good location, courteous staff. They have arranged a tribal dance and camp fire for free of cost and it was a great experience. Food facility should have also been added to make it even better.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms excellent clean scenic view window though resort doesnt restaurant service ok overall recommended family worthy",
                "rooms like hotel season rent high nonseason rent low highly recommend back side valley view railway line good car bike parking available outside food also allowed",
                "hi worst resort seen request reading review stay away resort made booking mmt paid money online days arrival suite room traveling hyderabad almost km reached found sold room someone else asked manager simply told us would room required us bluntly told us take refund search room somewhere else give us nonac room stay manager like option whatever want dont care kind attitude wan na ruined holidays stay best hell stay",
                "stay alluri resorts fantastic rooms spacious bathrooms spotless downside restaurant wasnt open yet overall great experience",
                "go ð\u009f\u0091\u008d amazing experience good location courteous staff arranged tribal dance camp fire free cost great experience food facility also added make even better"
            ]
        },
        {
            "name": "Hotel Aaradhya",
            "rating": [
                4.1
            ],
            "address": [
                "Beside Cinema Hall, Padmapuram Jn, Araku Valley, Andhra Pradesh 531149, India"
            ],
            "reviews": [
                {
                    "text": "The hotel I have seen in araku with well maintained and fixed prices in any season. Attached restaurant is an added advantage to this hotel. Everything is available nearby within walking distance.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Restuarant atmosphere is excellent no doubt ,but in total araku tour with my family, Average food quality here.They don't listen customer words.I ordered chicken snacks ,it is worst still no one care about it.. three stars for hotel atmosphere",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place in Araku to have lunch. Pretty close to the railway station as well. Tried egg biriyani and paneer biriyani which is good. Little too crowded during lunch time and hence the service is little delayed",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent service & good location.Balcony View also really good,Response also very nice,we stayed here one day..totally good..I highly recommend this hotel..for families..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The hotel ambience is good except the washroom is quite congested. The serving team was also slow and did not deliver raita and curry for the egg fried rice ordered. I waited till I finished my meal😞",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel seen araku well maintained fixed prices season attached restaurant added advantage hotel everything available nearby within walking distance",
                "restuarant atmosphere excellent doubt total araku tour family average food quality herethey dont listen customer wordsi ordered chicken snacks worst still one care three stars hotel atmosphere",
                "good place araku lunch pretty close railway station well tried egg biriyani paneer biriyani good little crowded lunch time hence service little delayed",
                "excellent service good locationbalcony view also really goodresponse also nicewe stayed one daytotally goodi highly recommend hotelfor families",
                "hotel ambience good except washroom quite congested serving team also slow deliver raita curry egg fried rice ordered waited till finished mealð\u009f\u0098\u009e"
            ]
        }
    ]
}