{
    "places_with_reviews": [
        {
            "name": "Hotel Kanha Shyam, Prayagraj",
            "rating": [
                4.1
            ],
            "address": [
                "22/1, Strachey Road, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "It is a nice hotel but slightly over priced as most of the rooms are not bad is spacious according to the the money there charging 8 to 10000 in normal days and 15000 to 20000 in peak season their charge for a room recharge it will move and this is what we don't like it and the food is and drinks a British expensive there if you want to enjoy the food and drink you can walk down the length they are many bars and foods restaurants",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Located on Civil Lines close to Prayagraj station and a lot of shopping options on a hustle bustle street. The building stands out as a beautiful structure amidst all the commercial properties. The property has a proper 4* feel with well maintained interiors and well trained staff.\n\nStayed in the Deluxe room and it was outrageously spacious with a big bed, sofa bed, 3 seater dining and a desk without even cramping the room. The staff was courteous and helpful, working with smiles (no one was rude like some reviews mention). We were staying with a small baby and had a lot of demands which were taken care of with smiles.\n\nThe food is good, the spreads are limited but everything was well prepared (we didn't get stomach upsets or acidity like most hotel foods do) and the taste was good as well.\n\nOverall a good stay, would myself stay here for any future trips and recommend people travelling to Allahabad as well",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I have stayed in the best hotels of India. Kanha Shyam is always on the top of the list of best stays/experiences ever. This time I also gave my family this experience.\n\nAfter smooth reservation, they were extremely accommodating and allowed us to check in as early at 7.30 am.\n\nRoom was clean, beautiful & stylish. The staff were really helpful and courteous. Food quality and taste was fantastic. Hotel Taxi was too good.\n\nWe were really pleased with our stay at this hotel. I hope to be back for a longer visit in the future.\n\nSpecial thanks to Mr Pranav Dubey for his efficient and delightful help.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stayed on 9th April for a night. It was nice experience Hotel interiors, rooms and ambience were very good. Staff were very polite, generous and served very well.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It was such a fabulous experience. The room is amazing. Service really good. My infant baby broke a glass there, and the staff was so humble in cleaning up.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice hotel slightly priced rooms bad spacious according money charging normal days peak season charge room recharge move dont like food drinks british expensive want enjoy food drink walk length many bars foods restaurants",
                "located civil lines close prayagraj station lot shopping options hustle bustle street building stands beautiful structure amidst commercial properties property proper feel well maintained interiors well trained staff stayed deluxe room outrageously spacious big bed sofa bed seater dining desk without even cramping room staff courteous helpful working smiles one rude like reviews mention staying small baby lot demands taken care smiles food good spreads limited everything well prepared didnt get stomach upsets acidity like hotel foods taste good well overall good stay would stay future trips recommend people travelling allahabad well",
                "stayed best hotels india kanha shyam always top list best staysexperiences ever time also gave family experience smooth reservation extremely accommodating allowed us check early room clean beautiful stylish staff really helpful courteous food quality taste fantastic hotel taxi good really pleased stay hotel hope back longer visit future special thanks mr pranav dubey efficient delightful help",
                "stayed th april night nice experience hotel interiors rooms ambience good staff polite generous served well",
                "fabulous experience room amazing service really good infant baby broke glass staff humble cleaning"
            ]
        },
        {
            "name": "Hotel Rama Continental",
            "rating": [
                4.2
            ],
            "address": [
                "37, 29, Tashkent Marg, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Very comfortable rooms with all luxury amenities. The check in process was so easy with the efficient front desk. Food at the restaurant was also tasty.( had dinner and breakfast) There were variety of food and the restaurant staff was also ready for any assistance. Dont remember the name of the lady staff at the restaurant who was helping and also explaining about the food, of course we asked abt it. Very polite and helpful.\nReally enjoyed the stay at this Hotel and sure will recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Great ambiance, stay, comfort & hospitality. A hotel cum home where you feel staying again and again. It is located in the heart of the city & the food is very sumptuous U can plan your party or any celebrations. without second thought..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We held our wedding events here and outstation guests were accomodated in the hotel as well. The hotel management went above and beyond to accommodate all our requests and never saying no to anything. The decor for the rooftop haldi event was outstanding in particular and the food was complimented by all. Special thanks to Piyoosh bhaiya (Manging Director) who just doesn't say no to any requests and was personally involved to ensure that the wedding was grand success.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Food is not up to the mark as per the rate, cost is high and not tasty, spring roll was very spicy n sour in taste whereas in Alfredo pasta there was not penne pasta, it was a mix of macroni n twisted pasta and it tasted more like the maggie cheese pasta available in the market. Overall the food is not good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "There is no parking space here. If there is any wedding or event planned on the day you are arriving, you will have to park the vehicle on the other side of the road.\n\nThe person at the reception was not very attentive, we had to carry our own bags till room, and the key was not working.\n\nRooms are good and clean though.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "comfortable rooms luxury amenities check process easy efficient front desk food restaurant also tasty dinner breakfast variety food restaurant staff also ready assistance dont remember name lady staff restaurant helping also explaining food course asked abt polite helpful really enjoyed stay hotel sure recommend",
                "great ambiance stay comfort hospitality hotel cum home feel staying located heart city food sumptuous u plan party celebrations without second thought",
                "held wedding events outstation guests accomodated hotel well hotel management went beyond accommodate requests never saying anything decor rooftop haldi event outstanding particular food complimented special thanks piyoosh bhaiya manging director doesnt say requests personally involved ensure wedding grand success",
                "food mark per rate cost high tasty spring roll spicy n sour taste whereas alfredo pasta penne pasta mix macroni n twisted pasta tasted like maggie cheese pasta available market overall food good",
                "parking space wedding event planned day arriving park vehicle side road person reception attentive carry bags till room key working rooms good clean though"
            ]
        },
        {
            "name": "Max Hotels Prayagraj",
            "rating": [
                3.8
            ],
            "address": [
                "Multi Functional Complex , Civil Lines Railway Station Compound, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic experience during our stay. We have conducted a workshop-cum-training program for government officials here for three days. Location wise it is beside the Allahabad Railway station, and 24 hours you can hear the engine honking. Rooms size is adequate but most of the room in 1st floor is dampened. Stinking smells in the room. No provision of cupboard inside the room. The hotel don’t provide toiletries complementary one have to pay for that. On the first day I faced water logging in the bathroom. Bathroom doesn’t have tap water provision, only shower present.\nThe conference and buffet food arrangement  is good. Some of the staffs are cooperative and helpful.\nI recommend hotel must work on the room part as it is under the polo tower group. I have stayed in the north east part of the country in Polo Tower properties and never have such a pathetic experience. Certain renovations are required.\nOverall speaking our guest were also not satisfied during their stay.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Nothing fancy - Just a basic hotel with necessities done right at a good budget.\nGreat location with erickshaws available. Booked a room with breakfast included, food was decent.\nDecent service.\nBed linens, condition of room etc wasn't too good or posh by any means. Bare basics done right.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Worst of all hotels across India. This hotel doesn't have basic knowhow of hospitality. Generally hotels allow early check-in if rooms are available however this hotel refused despite of having empty rooms. The logic is that if someone comes and pay more cost then the room can be given to the other person. Rooms are not at all good. Lots of train noise inside the rooms. My wife wanted to use washroom desparately and she requested for a room for 10min, hotel staff refused for the same as well. They were adamant that checkin can be done only at 1pm and check out at 10am. There is no waiver. When I asked them to cancel the booking and refund me the amount, hotel refused for the same as well.\nIf you want to have a piece of mind and safe and enjoyable stay at Prayagraj then stay away from this hotel or you might be in a tough situation like me and waste your money and time. I wasted 3hrs and INR4000/- with this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Excellent place beautiful and clean rooms , very smooth check in process.The front staff is very helpful especially sapna she provides each and every information about the hotel like about restaurant room service.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Pro - Clean and comfortable bed, all tv channels, excellent reception and housekeeping staff. Excellent location, Good food.\n\nCons - old infrastructure with defective locks, broken lockers, broken washbasin, defective ac remote systems, open parking at railway parking. Highly overpriced.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic experience stay conducted workshopcumtraining program government officials three days location wise beside allahabad railway station hours hear engine honking rooms size adequate room st floor dampened stinking smells room provision cupboard inside room hotel donâ\u0080\u0099t provide toiletries complementary one pay first day faced water logging bathroom bathroom doesnâ\u0080\u0099t tap water provision shower present conference buffet food arrangement good staffs cooperative helpful recommend hotel must work room part polo tower group stayed north east part country polo tower properties never pathetic experience certain renovations required overall speaking guest also satisfied stay",
                "nothing fancy basic hotel necessities done right good budget great location erickshaws available booked room breakfast included food decent decent service bed linens condition room etc wasnt good posh means bare basics done right",
                "worst hotels across india hotel doesnt basic knowhow hospitality generally hotels allow early checkin rooms available however hotel refused despite empty rooms logic someone comes pay cost room given person rooms good lots train noise inside rooms wife wanted use washroom desparately requested room min hotel staff refused well adamant checkin done pm check waiver asked cancel booking refund amount hotel refused well want piece mind safe enjoyable stay prayagraj stay away hotel might tough situation like waste money time wasted hrs inr hotel",
                "excellent place beautiful clean rooms smooth check processthe front staff helpful especially sapna provides every information hotel like restaurant room service",
                "pro clean comfortable bed tv channels excellent reception housekeeping staff excellent location good food cons old infrastructure defective locks broken lockers broken washbasin defective ac remote systems open parking railway parking highly overpriced"
            ]
        },
        {
            "name": "Hotel Placid Tagore town",
            "rating": [
                4.1
            ],
            "address": [
                "161, 48, Anukool Chandra Banarjee Marg, near Tagore Murti Chauraha, Tagore Town, Prayagraj, Uttar Pradesh 211002, India"
            ],
            "reviews": [
                {
                    "text": "Hotel is located in one of the residential areas in Allahabad.\nRooms were quite spacious and service was good too, although water could have been cheaper, as they were providing water at ₹53/litre.\nFood was good, they had in house cafe, restaurant and a bar.\n\nOne of the biggest pro of the hotel location is that it is located just 2.5kms from The Ghats and local transportation was easily Available for sight seeing.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We visited this hotel in Mar 2024 and it’s pathetic.  The rooms are spacious with OLD furniture, furnishings and bathrooms are worst.  The food is horrible and the staff don’t seem to be interested to listen to the customers in the restaurant.  Horrible experience.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Bit expensive.  Location of hotel is perfect. Service is average.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good ambience in the room. Service need to be improved. Overall Hotel & Services are good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent place to stay with family. Room size and cleanliness is excellent.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel located one residential areas allahabad rooms quite spacious service good although water could cheaper providing water â\u0082¹litre food good house cafe restaurant bar one biggest pro hotel location located kms ghats local transportation easily available sight seeing",
                "visited hotel mar itâ\u0080\u0099s pathetic rooms spacious old furniture furnishings bathrooms worst food horrible staff donâ\u0080\u0099t seem interested listen customers restaurant horrible experience",
                "bit expensive location hotel perfect service average",
                "good ambience room service need improved overall hotel services good",
                "excellent place stay family room size cleanliness excellent"
            ]
        },
        {
            "name": "Millennium Inn, Prayagraj",
            "rating": [
                4.2
            ],
            "address": [
                "Hasting Road, High Court, 07F/06A, Nyaya Marg, near Hanuman Mandir, Canton, Dhoomanganj, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "A fantastic play to stay in. The hotel is well furnished and the facilities are top notch. One will fully enjoy true luxury in this hotel. All services are provided starting from three meals a day to cleaning every day.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "A bit of a disaster. Stayed in 3 rooms. The first room had noise from the kitchen downstairs till 3am. The next room they sprayed with toxic cockroach repellent which I ended up smelling the whole night. I read the bottle the next day, and it said \"do not smell.\" So who knows what kind of damage this did to my physical health. The third room was fine. The staff was by and large incompetent, and the waiting staff took it to a whole other level. But all the staff was friendly and was incompetent with a smile. I would rate the hotel 7-8 if I didn't have problems with the rooms. They were otherwise clean and pleasant.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "My stay at the Millennium Hotel was nothing short of fantastic. The staff were incredibly welcoming and accommodating, the room was spacious and well-appointed, and the amenities were top-notch. The hotel's central location made it convenient to explore the city. I highly recommend the Millennium Hotel for a luxurious and comfortable stay. Can't wait to return!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The stay was so pleasant. I went their with my family and enjoyed every moment. The rooms and washrooms were cleaned regularly and very well maintained, staff are helpful, hotel is located at a nice place on the main road with good parking space. Breakfast was good.\nFor lunch and dinner we preferred to go at the opposite veg restaurant as they cook very delicious food at reasonable price.\nAllahabad/Prayagraj is a happening place for me because the stay had been smooth and good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stayed for 1 night . Left next day in the evening. Clean rooms although the carpets need to be updated. Excellent service, well you always enjoy room service in India, the restaurant in the hotel dishes up some great vegetarian food. Only negative being the hotel's proximity to the high court, the traffic is intolerable , with black coats streaming everywhere and ignoring the law and parking on the street. Requesting the hotel management to please install trash cans outside the hotel , know its the government's reaponsibility , but we can make a start after all our country' s cleanliness is our responsibility.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "fantastic play stay hotel well furnished facilities top notch one fully enjoy true luxury hotel services provided starting three meals day cleaning every day",
                "bit disaster stayed rooms first room noise kitchen downstairs till next room sprayed toxic cockroach repellent ended smelling whole night read bottle next day said smell knows kind damage physical health third room fine staff large incompetent waiting staff took whole level staff friendly incompetent smile would rate hotel didnt problems rooms otherwise clean pleasant",
                "stay millennium hotel nothing short fantastic staff incredibly welcoming accommodating room spacious wellappointed amenities topnotch hotels central location made convenient explore city highly recommend millennium hotel luxurious comfortable stay cant wait return",
                "stay pleasant went family enjoyed every moment rooms washrooms cleaned regularly well maintained staff helpful hotel located nice place main road good parking space breakfast good lunch dinner preferred go opposite veg restaurant cook delicious food reasonable price allahabadprayagraj happening place stay smooth good",
                "stayed night left next day evening clean rooms although carpets need updated excellent service well always enjoy room service india restaurant hotel dishes great vegetarian food negative hotels proximity high court traffic intolerable black coats streaming everywhere ignoring law parking street requesting hotel management please install trash cans outside hotel know governments reaponsibility make start country cleanliness responsibility"
            ]
        },
        {
            "name": "Hotel Milan Palace",
            "rating": [
                3.9
            ],
            "address": [
                "4/2, Govind Tower, Stretchy Rd, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Our stay at Milan Palace was cozy and comfortable.  They have kept the rooms super clean. Things are well organized here. We had breakfast included in our stay. They have a wide range of food served for breakfast and everything that they served was tasty and yummy. Staff is polite and helpful. They made our stay Memorable! Thank you to the entire team of Milan Palace for all the efforts 🙏",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This is a budget hotel but the location is very good and handy to big market place. There is a family store and also Bikanerwala eatery. Very handy location to various amenities.\nThe management needs to improve on cleanliness of corridors. Guests had left soiled dishes with leftovers outside their rooms and nobody cleared them until next morning. The corridors stink and look ugly with several soiled plates left outside.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel has great vibe . Everything was satisfactory. I felt that charges are higher than usual. But that's not a big deal. It was quite comfortable",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This hotel is disgusting. The rooms smell really bad, when we asked to get the smell checked out the said they are all this way. I asked them to mop the floor and they brought a 30 year old mop and made the smell even worse. Service is terrible, asked for extra towels and they said no. Asked for a room air freshener twice and never got it. I’d rather sleep in the car, if you’re a tourist from another country trust me you do not want to stay here. Location is pretty decent.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "My recent stay at this hotel was quite underwhelming. To begin with, the absence of basic toiletries in the bathroom was frustrating. It's disappointing when a hotel doesn't provide even the essentials.\n\nFurthermore, the breakfast options were extremely limited, making it difficult to find something suitable. Given the price I paid, I expected a more varied and satisfying breakfast experience.\n\nLastly, the cost of the stay seemed excessive when compared to the overall quality of the hotel. It felt like I was paying a premium for a lower-class experience.\n\nIn summary, the lack of toiletries, limited breakfast choices, and the high cost relative to the hotel's quality made my stay less than enjoyable. I'd advise exploring other options.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay milan palace cozy comfortable kept rooms super clean things well organized breakfast included stay wide range food served breakfast everything served tasty yummy staff polite helpful made stay memorable thank entire team milan palace efforts ð\u009f\u0099\u008f",
                "budget hotel location good handy big market place family store also bikanerwala eatery handy location various amenities management needs improve cleanliness corridors guests left soiled dishes leftovers outside rooms nobody cleared next morning corridors stink look ugly several soiled plates left outside",
                "hotel great vibe everything satisfactory felt charges higher usual thats big deal quite comfortable",
                "hotel disgusting rooms smell really bad asked get smell checked said way asked mop floor brought year old mop made smell even worse service terrible asked extra towels said asked room air freshener twice never got iâ\u0080\u0099d rather sleep car youâ\u0080\u0099re tourist another country trust want stay location pretty decent",
                "recent stay hotel quite underwhelming begin absence basic toiletries bathroom frustrating disappointing hotel doesnt provide even essentials furthermore breakfast options extremely limited making difficult find something suitable given price paid expected varied satisfying breakfast experience lastly cost stay seemed excessive compared overall quality hotel felt like paying premium lowerclass experience summary lack toiletries limited breakfast choices high cost relative hotels quality made stay less enjoyable id advise exploring options"
            ]
        },
        {
            "name": "The Legend Hotel",
            "rating": [
                4.2
            ],
            "address": [
                "23C, Thornhill Road, Civil Lines, Vivek Vihar Colony, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Nice place in the heart of city, ie Civil Lines. Well maintained hotel. Good ambiance of hotel as well as its Restaurant. Veg n non veg options in the menu.\nRates are little bit on higher side. Food quality and service satisfactory, if not excellent. A separate Bakery house.\nParking available at the front inside and outside premises",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We dined at this establishment, and it made quite an impression. The entrance was grand and attractive, featuring a charming gift shop on one side and a delightful bakery on the other. The restaurant itself was located on the first floor and boasted a fantastic ambiance. The service was prompt, with helpful servers guiding us through the menu. The flavors were enchanting, and the chefs exhibited their culinary prowess. We indulged in dishes like paneer and assorted naan, leaving our taste buds tingling with delight. Don't miss the opportunity to experience it for yourself. The drinks were excellent, and it offered great value for the money. We look forward to revisiting soon, appreciating the commendable service and the wonderful staff.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "\"After my recent stay at the Legend Hotel, I'm unfortunately only able to grant one star. The service fell below expectations, leaving me feeling dissatisfied with my overall visit. I hope the hotel can work on improving their service quality for future guests.\"",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "NICE PLACE TO VISIT NEAR SAI MANDIR AND ITS FOOD IS DELICIOUS TOO WITH MINIMUM COSTS WHICH ARE EASILY AFFORDABLE BY PERSON WHO GO TO EAT FOOD IN RESTAURANT. IT GIVE YOU FEEL LIKE A 5 STAR WITH MINIMUM COSTS WHICH I LIKE THE MOST ABOUT IT.💕💕💖💖👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "IT OFFERS YOU FANTASTIC DINNER WITH BEST SERVICES. I LIKE MOSTLY THEIR TASTE BUT IT IS THOUGH EXPENSIVE AS IT PROVIDES BEST SERVICES. WITH THIS I LIKE THE INFRASTRUCTURE OF THE HOTEL AND THE MALL.🌹🌹💕💕💕😍😍😍",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place heart city ie civil lines well maintained hotel good ambiance hotel well restaurant veg n non veg options menu rates little bit higher side food quality service satisfactory excellent separate bakery house parking available front inside outside premises",
                "dined establishment made quite impression entrance grand attractive featuring charming gift shop one side delightful bakery restaurant located first floor boasted fantastic ambiance service prompt helpful servers guiding us menu flavors enchanting chefs exhibited culinary prowess indulged dishes like paneer assorted naan leaving taste buds tingling delight dont miss opportunity experience drinks excellent offered great value money look forward revisiting soon appreciating commendable service wonderful staff",
                "recent stay legend hotel im unfortunately able grant one star service fell expectations leaving feeling dissatisfied overall visit hope hotel work improving service quality future guests",
                "nice place visit near sai mandir food delicious minimum costs easily affordable person go eat food restaurant give feel like star minimum costs like itð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0096ð\u009f\u0092\u0096ð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "offers fantastic dinner best services like mostly taste though expensive provides best services like infrastructure hotel mallð\u009f\u008c¹ð\u009f\u008c¹ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0098\u008dð\u009f\u0098\u008dð\u009f\u0098\u008d"
            ]
        },
        {
            "name": "Hotel Triveni Darshan",
            "rating": [
                4.1
            ],
            "address": [
                "32A, Yamuna Bank Rd, Kydganj, Prayagraj, Uttar Pradesh 211003, India"
            ],
            "reviews": [
                {
                    "text": "Ample space for wedding parties, rooms facing the Yamuna River, beautiful night view. Parking is available, service is good, and food is fine, good ambience. Quiet location.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Beautiful view of the river from the hotel premises and balcony.\nLocation is good. Staff behaviour is extremely polite and the service is quick.\nThe price of the food is reasonable, veg items are delicious and the restaurant service is quick.\n\nOverall, we had a pleasant stay however, I wish to stay here at least for a day to enjoy the evening by the river side and take a boat tour to Sangam.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A lovely place to stay if you are in Prayagraj. It is a government property and has big rooms and all amenities for the visitors.\n\nThis is situated on the river banks with magnificent views and long lawns.\n\nThe staff are hospitable and courteous.\n\nThe restaurant is an added advantage for this stay. The staff are very nice and the food extra special.\n\nIt is situated in that part of the city which has not much to offer for occasional shoppers and or entertainment seekers.\n\nThe hotel however is a good place for staying with family.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Worst hotel, I asked in asked receptionist for hotel room for my senior citizen relative who came for sangam Bath. He said jao jao room khali nhi hai apko samjh nhi aa raha hai.. his rude behavior I never seen in any hotel... I never recommend this hotel for any guests..zero Rating",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Got a chance to visit this place when going to Triveni Sangamam. Nice appearance in that locality. Not explored much though. It has a huge garden at the front.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ample space wedding parties rooms facing yamuna river beautiful night view parking available service good food fine good ambience quiet location",
                "beautiful view river hotel premises balcony location good staff behaviour extremely polite service quick price food reasonable veg items delicious restaurant service quick overall pleasant stay however wish stay least day enjoy evening river side take boat tour sangam",
                "lovely place stay prayagraj government property big rooms amenities visitors situated river banks magnificent views long lawns staff hospitable courteous restaurant added advantage stay staff nice food extra special situated part city much offer occasional shoppers entertainment seekers hotel however good place staying family",
                "worst hotel asked asked receptionist hotel room senior citizen relative came sangam bath said jao jao room khali nhi hai apko samjh nhi aa raha hai rude behavior never seen hotel never recommend hotel guestszero rating",
                "got chance visit place going triveni sangamam nice appearance locality explored much though huge garden front"
            ]
        },
        {
            "name": "Hotel Ajay international",
            "rating": [
                3.7
            ],
            "address": [
                "A/2/D, Lal Bahadur Shastri Marg, opp. GPO, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Worst and pathetic experience in this hotel.\n\nStarting with Staff:\n1. Receptionist does not even know how to manage things, they keep you waiting to provide basic needs like bedding and all. In fact i saw, there was a delay in Room check-in for many families over there when i was at reception. Staff is rude(specially Receptionist Santosh over there), he doesn't even know how to speak and accept their mistake of making things delayed.\n2. Stealing: One of the hotel staff stole the stola of one of my family member and we caught her while she was roaming wearing it. Informed the hotel about the same and they provided us back.\n\nFood:\n3. Food is good but late service of bringing the food at the table makes a bad experience of having lunch over there.\nIn all\nRooms:\n4. Most of the washroom of the rooms are smelly and had to call house keeping time to time for the freshener.\n\nIn all above 1 good thing was Mr. Tiwari - Manager , he was co-operative throughout and embarrassed at the same time due to his staff behaviour. He is courteous and sensible .\nSo, This star is for him only.\nLocation of the hotel is good.\n\nHowever, overall experience was very-very bad.\nI really do not recommend this hotel to stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Pathetic hotel worstever services. Rusted fittings and mirror in washroom no fridge in room as they show in their room details on all websites. No shower gel no moisturizer they provide dove shampoo pouches for washroom. Unprofessional staff like staff of cheap hotels in front of railway stations. No buffet for breakfast in you include in your booking only poori sabji is provided as breakfast. Worst over stay in this price range. Stay away from this hotel if you want a good and pleasent stay. They are not even provide facility and services like a normal Oyo hotels but charging for rooms as 3 or 4 star property.\n\nIn last my experience is pathetic",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good, big ,clean hotel at normal prise, staff is cool and situated at hearat of prayagraj.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Pathetic hotel and staff. The rooms are filthy, washrooms stink like public urinals. Not worthy of even 500 rupees unless in a dire need.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "it meets basic expectations without standing out. The service is decent, and the amenities are satisfactory, making it a reasonable choice for a straightforward stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst pathetic experience hotel starting staff receptionist even know manage things keep waiting provide basic needs like bedding fact saw delay room checkin many families reception staff rudespecially receptionist santosh doesnt even know speak accept mistake making things delayed stealing one hotel staff stole stola one family member caught roaming wearing informed hotel provided us back food food good late service bringing food table makes bad experience lunch rooms washroom rooms smelly call house keeping time time freshener good thing mr tiwari manager cooperative throughout embarrassed time due staff behaviour courteous sensible star location hotel good however overall experience veryvery bad really recommend hotel stay",
                "pathetic hotel worstever services rusted fittings mirror washroom fridge room show room details websites shower gel moisturizer provide dove shampoo pouches washroom unprofessional staff like staff cheap hotels front railway stations buffet breakfast include booking poori sabji provided breakfast worst stay price range stay away hotel want good pleasent stay even provide facility services like normal oyo hotels charging rooms star property last experience pathetic",
                "good big clean hotel normal prise staff cool situated hearat prayagraj",
                "pathetic hotel staff rooms filthy washrooms stink like public urinals worthy even rupees unless dire need",
                "meets basic expectations without standing service decent amenities satisfactory making reasonable choice straightforward stay"
            ]
        },
        {
            "name": "Grand Continental Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "13, Sardar Patel Marg, near PVR Cinemas, Civil Lines, Prayagraj, Uttar Pradesh 211001, India"
            ],
            "reviews": [
                {
                    "text": "Location:- Situated in the heart of Prayagraj, the Grand Continent Hotel and Restaurant boasts a prime location, making it convenient for both business and leisure travelers.\n\nAccommodation:- The hotel offers a range of accommodation options, from comfortable rooms to luxurious suites, catering to various preferences and budgets. The rooms are spacious, well-appointed, and designed for utmost comfort.\n\nDining:- The restaurant serves a delectable array of culinary delights, ranging from local specialties to international cuisine. Whether it's a hearty breakfast buffet or an intimate dinner, guests can expect a gastronomic experience that delights the senses.\n\nOverall Experience:- Grand Continent Hotel and Restaurant provides a seamless blend of comfort, convenience, and luxury. Whether traveling for business or leisure, guests can expect a memorable stay characterized by excellent service, top-notch amenities, and an inviting ambiance.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Vikash Agarwal, an esteemed alumni of NIFT and the visionary founder of Khadow, wholeheartedly recommends Hotel Grand Allahabad. Positioned strategically opposite Khadow on SP Marg, this budget-friendly accommodation option caters to travelers seeking comfort and affordability. With rates averaging around 5000 rupees per night, the hotel ensures a pleasant stay without compromising on quality.\n\nGuests at Hotel Grand Allahabad benefit from its prime location, offering convenient access to Khadow and other attractions. Vikash's endorsement, coupled with his Level 8 Google reviewer status, adds a layer of trust and credibility to the hotel's reputation for excellence.\n\nHospitality is at the forefront of the Hotel Grand Allahabad experience. From well-appointed accommodations to attentive service, every aspect is meticulously curated to exceed guest expectations. Visitors can explore the vibrant city of Allahabad with ease, knowing they have a comfortable haven awaiting their return.\n\nIn conclusion, Hotel Grand Allahabad, championed by Vikash Agarwal, presents an ideal fusion of comfort, affordability, and convenience. With its strategic location, warm hospitality, and Vikash's stamp of approval, it stands as a beacon of excellence in the heart of Allahabad.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Visited Grand Continental Hotel in Prayagraj from Pune. Rooms & Food excellent. Staff very courteous & helpful. Will come back again! Regds",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "A bit expensive, they said poolside rooms but pool there they have event place as well.\nNot so good experience 😕",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Awesome experience during my stay\nSpacious and vibrant Rooms\nFriendly staff\nGreat good\n\nThanks",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location situated heart prayagraj grand continent hotel restaurant boasts prime location making convenient business leisure travelers accommodation hotel offers range accommodation options comfortable rooms luxurious suites catering various preferences budgets rooms spacious wellappointed designed utmost comfort dining restaurant serves delectable array culinary delights ranging local specialties international cuisine whether hearty breakfast buffet intimate dinner guests expect gastronomic experience delights senses overall experience grand continent hotel restaurant provides seamless blend comfort convenience luxury whether traveling business leisure guests expect memorable stay characterized excellent service topnotch amenities inviting ambiance",
                "vikash agarwal esteemed alumni nift visionary founder khadow wholeheartedly recommends hotel grand allahabad positioned strategically opposite khadow sp marg budgetfriendly accommodation option caters travelers seeking comfort affordability rates averaging around rupees per night hotel ensures pleasant stay without compromising quality guests hotel grand allahabad benefit prime location offering convenient access khadow attractions vikashs endorsement coupled level google reviewer status adds layer trust credibility hotels reputation excellence hospitality forefront hotel grand allahabad experience wellappointed accommodations attentive service every aspect meticulously curated exceed guest expectations visitors explore vibrant city allahabad ease knowing comfortable awaiting return conclusion hotel grand allahabad championed vikash agarwal presents ideal fusion comfort affordability convenience strategic location warm hospitality vikashs stamp approval stands beacon excellence heart allahabad",
                "visited grand continental hotel prayagraj pune rooms food excellent staff courteous helpful come back regds",
                "bit expensive said poolside rooms pool event place well good experience ð\u009f\u0098\u0095",
                "awesome experience stay spacious vibrant rooms friendly staff great good thanks"
            ]
        }
    ]
}