{
    "places_with_reviews": [
        {
            "name": "Mayuka Family Restaurant",
            "rating": [
                4
            ],
            "address": [
                "V4Q6+W5R, Alampur Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [
                {
                    "text": "Visited in Dec 2022, stayed in Haritha hotel - it had no restaurant then. This hotel was life saver - ate there 3 times every day. No fancy food, but reasonably clean, prompt service, friendly owner, decent tiffin & meals. Curd rice & Chicken Fry dinner was good. About 2 km before Haritha. Five star considering it is in Alampur.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Please note this is not a file functional restaurant for dinner. When we went this restaurant was not open. After we went there, the owner was called and he came in ten minutes and opened the restaurant. After which we were given food. So better to try to call ahead before going to save your time.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Meal is good. its veg restaurant. Fresh and Tasty food.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This place is like an oasis in the desert.\n\nHygiene meals, good ambience and great service staff make it totally worth a visit.\n\nWashrooms could have been better.\n\nTaste - 5/5\nAmbience - 3/5\nPrice for Quality - 4/5",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's moderately good hotel. Also has AC section but we had lunch in non AC veg.\n\nCost around 90/- per one Veg meals. Quality and taste decent.\n\nIt's on main road to Jogulamba temple.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited dec stayed haritha hotel restaurant hotel life saver ate times every day fancy food reasonably clean prompt service friendly owner decent tiffin meals curd rice chicken fry dinner good km haritha five star considering alampur",
                "please note file functional restaurant dinner went restaurant open went owner called came ten minutes opened restaurant given food better try call ahead going save time",
                "meal good veg restaurant fresh tasty food",
                "place like oasis desert hygiene meals good ambience great service staff make totally worth visit washrooms could better taste ambience price quality",
                "moderately good hotel also ac section lunch non ac veg cost around per one veg meals quality taste decent main road jogulamba temple"
            ]
        },
        {
            "name": "Padma Hotel & lodge",
            "rating": [
                4.1
            ],
            "address": [
                "Alampur (P), Telangana 509152, India"
            ],
            "reviews": [
                {
                    "text": "Never judge a book by its cover.\nAbove quote absolutely suits this hotel, if you want to enjoy a homely food visit here. They serve good food, but the only problem is it's a small hotel, sitting option is limited.. takeaway is better option.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Had lunch of plate meals here. Very good taste. But no hygiene. They were serving food in steel plates which are washed and served to other people. And they are serving water in same steel glasses which are used by other people. I don't know if they wash plates properly or not.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food is excellent, Village style veg-meals. Serving persons are very patiently serving food. Owner is good person. Amdience is little congested.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good food, good service whatever u can get in a tourist place.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Affordable best food available here. Tiffin's( dosa, puri, idli etc) and tea available in mornings. Excellent meals( two curries, sambar, curd) available during lunch and dinner for 60 rupees.\nAccommodation is also available here\nThis place also have car rentals for travelling",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "never judge book cover quote absolutely suits hotel want enjoy homely food visit serve good food problem small hotel sitting option limited takeaway better option",
                "lunch plate meals good taste hygiene serving food steel plates washed served people serving water steel glasses used people dont know wash plates properly",
                "food excellent village style vegmeals serving persons patiently serving food owner good person amdience little congested",
                "good food good service whatever u get tourist place",
                "affordable best food available tiffins dosa puri idli etc tea available mornings excellent meals two curries sambar curd available lunch dinner rupees accommodation also available place also car rentals travelling"
            ]
        },
        {
            "name": "Srija mess",
            "rating": [
                4.3
            ],
            "address": [
                "V4JG+C3H, Alampur Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [
                {
                    "text": "Homely food. So tasty 😋.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Homely food and home atmosphere",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Pure vegetation homely food with much satisfaction. Eat your lunch here before visiting the Devi temple.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Homely Food Good Taste",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good food. Satisfied",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "homely food tasty ð\u009f\u0098\u008b",
                "homely food home atmosphere",
                "pure vegetation homely food much satisfaction eat lunch visiting devi temple",
                "homely food good taste",
                "good food satisfied"
            ]
        },
        {
            "name": "Anitha hotel",
            "rating": [
                4
            ],
            "address": [
                "V4HJ+JWM, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [
                {
                    "text": "Tasty food and good quality",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Delicious",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "tasty food good quality",
                "delicious"
            ]
        },
        {
            "name": "Sri Sai Hotel Tiffins & Meals",
            "rating": [
                4
            ],
            "address": [
                "jogulamba Devi, Temple Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Om jonna roti, bakshalu, chapati, curriespoint.",
            "rating": [
                5
            ],
            "address": [
                "Alampur Jogulamba Temple Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "New Amma mobile tiffin centre",
            "rating": [
                4
            ],
            "address": [
                "V4P9+857, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [
                {
                    "text": "Authentic South Indian breakfast on wheels.\n\nFood preparation looked hygienic, which is rare on any highways.\n\nHighlights:\n*vada\n*Idly\n*dosa",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "authentic south indian breakfast wheels food preparation looked hygienic rare highways highlights vada idly dosa"
            ]
        },
        {
            "name": "R.N Sweets Bekary",
            "rating": [
                "Unknown"
            ],
            "address": [
                "V4HM+H6P, Alampur Jogulamba Temple Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "SUGUNA Chicken",
            "rating": [
                "Unknown"
            ],
            "address": [
                "V4HM+XFR, Alampur Rd, Alampur (P), Telangana 509152, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "అద్భుతహా ఫాస్ట్ ఫుడ్ సెంటర్",
            "rating": [
                "Unknown"
            ],
            "address": [
                "Alampur (P), Telangana 509152, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}