{
    "places_with_reviews": [
        {
            "name": "Hotel Raj Palace",
            "rating": [
                4.1
            ],
            "address": [
                "Kota Rd, Civil Line, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Overall the hotel stay was good.  The room size is big with nice interior.  Cleanliness is good.  The hotel has ample four wheeler parking space.  Service is o.  Although it can be improved with professionalism, this JVVNL office is close to Kota Baran main road,",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is the worst hotel I have ever stayed. No backup did not work.\nRoom service is the worst room attended always tries to open the door on their own even if the door is locked.\nNo facility at all.\nThis is just a marriage place and they have build up the stay.\nPlace is not worth staying its simply waist of money and your temper.\nI stayed here for 2 nights and did not felt safe at all for single moment",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Nice hotel at very good location, rooms are well made, all facilities are good, parking is good, very good place for marriage, birthday, anniversary party, environment is also very good, service is good",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The best destination for all kind of Moods & to capture all functions",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Worst hotel that ever stayed in. The rooms, bed and bedsheet were very dirty. The balcony doors do not lock, so you always feel unsafe sleeping inside the rooms. The staff is very rude, and they don't even bother if you had a bad experience staying at the hotel, They would also try to charge you more. Don't stay in this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "overall hotel stay good room size big nice interior cleanliness good hotel ample four wheeler parking space service although improved professionalism jvvnl office close kota baran main road",
                "worst hotel ever stayed backup work room service worst room attended always tries open door even door locked facility marriage place build stay place worth staying simply waist money temper stayed nights felt safe single moment",
                "nice hotel good location rooms well made facilities good parking good good place marriage birthday anniversary party environment also good service good",
                "best destination kind moods capture functions",
                "worst hotel ever stayed rooms bed bedsheet dirty balcony doors lock always feel unsafe sleeping inside rooms staff rude dont even bother bad experience staying hotel would also try charge dont stay hotel"
            ]
        },
        {
            "name": "Shubham Hotel And Resort Jhalawar Road Baran",
            "rating": [
                4.4
            ],
            "address": [
                "3GM4+HMW, Amapura, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Perfect resort for marriage functions. Have huge open areas and nicely maintained halls. Open areas have beautifully designed stages. Rooms are of grand size with balcony and having all amenities.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently stayed at this hotel and it was fantastic. The room was really nice, with comfy furniture and a cool balcony. The staff were super friendly and helpful. Plus, the location was big and convenient. I had a really good time here!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The building is well maintained. The rooms are spacious and ventilation is good.\nThe view through the balcony is completely mesmerizing😍. It is definitely worth the price and I can't wait to spend another vacation stay there.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Nice Stay, rooms were super neat and clean",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I personally like it the most, there is 26 ac room, all are well furnished along with balcony, there is 1 ac hall which can accommodate 250 people and another hall of 5000 sq. Feets.. I have attached my recent visited photographs, it was a great experience",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "perfect resort marriage functions huge open areas nicely maintained halls open areas beautifully designed stages rooms grand size balcony amenities",
                "recently stayed hotel fantastic room really nice comfy furniture cool balcony staff super friendly helpful plus location big convenient really good time",
                "building well maintained rooms spacious ventilation good view balcony completely mesmerizingð\u009f\u0098\u008d definitely worth price cant wait spend another vacation stay",
                "nice stay rooms super neat clean",
                "personally like ac room well furnished along balcony ac hall accommodate people another hall sq feets attached recent visited photographs great experience"
            ]
        },
        {
            "name": "Hotel Shanti Vilas",
            "rating": [
                4.5
            ],
            "address": [
                "Mandi Road, opposite Government Hospital, Khati Colony, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Clean Spacious and well maintained rooms, Food quality and service also good. Best hotel in BARAN",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Given the limited availability of quality accommodation options in Baran, this establishment emerges as one of the finest choices for staying in Baran.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Room are good but service is not good",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Shanti Vilas  hotel is the best hotel in Baran. If you are travelling to Baran then you don't need to go any other hotel as this hotel is complete package for all services like fine dining restaurant for family (24*7), parking, banquet hall, terrace garden etc.. must visit 👍👍👍",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Hotel shanti vilas is very popular Hotel Rajasthan banana hotel is much facilities good located staff is very frankly mostly frant office Restaurant Daawat very nice tasting food I was staying 3 days I'm eating food some mocktail and shakes",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean spacious well maintained rooms food quality service also good best hotel baran",
                "given limited availability quality accommodation options baran establishment emerges one finest choices staying baran",
                "room good service good",
                "shanti vilas hotel best hotel baran travelling baran dont need go hotel hotel complete package services like fine dining restaurant family parking banquet hall terrace garden etc must visit ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "hotel shanti vilas popular hotel rajasthan banana hotel much facilities good located staff frankly mostly frant office restaurant daawat nice tasting food staying days im eating food mocktail shakes"
            ]
        },
        {
            "name": "Hotel Radhika",
            "rating": [
                3.9
            ],
            "address": [
                "National Highway 76, Kota Rd, Old Civil Line, Baran, Rajasthan 325215, India"
            ],
            "reviews": [
                {
                    "text": "Nice hotel delux room is for 900 only. Room size is Big. But I booked thru goibibo they charged 1500 for the same room. So friends I recommend to book room thru booking counter only. Owner is excellent. Staff is also very polite. There is no restaurant facility in this hotel. If we order food thru hotel they will charge 20% more on each item. Wines and bar are below 50feet only from this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Pathetic services. The condition of the mattresses provided is very bad and like that of a normal Dharamshala.\n\nA BIG NO FOR ANY ROOM STAY.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "My good experience in radhika hotel\nRooms is are very good condition\nRooms in TV and windows open are see\nA Baran",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "One of the best hotel in Baran City with reagrds to its customer service and location advantage.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Great staff, rooms big & clean, reasonable price",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice hotel delux room room size big booked thru goibibo charged room friends recommend book room thru booking counter owner excellent staff also polite restaurant facility hotel order food thru hotel charge item wines bar feet hotel",
                "pathetic services condition mattresses provided bad like normal dharamshala big room stay",
                "good experience radhika hotel rooms good condition rooms tv windows open see baran",
                "one best hotel baran city reagrds customer service location advantage",
                "great staff rooms big clean reasonable price"
            ]
        },
        {
            "name": "Bandhan marriage garden Baran",
            "rating": [
                4
            ],
            "address": [
                "3GM3+268, Amapura, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "If you seeking in demanding of big parking and big place for like 1500-2000 people this is very good place to book for marrige and other functions but there is another gardens also present those also comparatively good in this place price range",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good parking area, full space for any ceremony.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Has a nice and big garden.... useful for any kind of functions ....nice location and decoration",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's nice and beautiful place for marriage and parties.nice parking space in this garden",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A good marriage garden contain a vast area.\nA good facility of parking.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "seeking demanding big parking big place like people good place book marrige functions another gardens also present also comparatively good place price range",
                "good parking area full space ceremony",
                "nice big garden useful kind functions nice location decoration",
                "nice beautiful place marriage partiesnice parking space garden",
                "good marriage garden contain vast area good facility parking"
            ]
        },
        {
            "name": "Hotel Sanskar - Best Hotel, Budget Hotel In Baran",
            "rating": [
                3.9
            ],
            "address": [
                "Charmurti Chauraha, Kota Rd, Old Civil Line, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Location is at the best place for commute in Baran. Rooms are well equipped. Don't expect more than 'a place to stay'.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms and washroom are clean.\nOpen parking available at owners risk.\nLocation is at walking distance from bus stand and railway station.\nStaff is prompt and cooperative.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "One of the best hotel in Baran but washrooms are dirty",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is located in a busy area. There are many competitors in vicinity. There 2 wings with each having about 20 rooms. There is no scenic views around the hotel nor there is an option in rooms for it. There is no restaurant in hotel but option for tea is available. Hotel has their own parking space at a distance of about 100 meter. All basic amenities available for night stay at reasonable price.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I don't know how they are active and still standing.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location best place commute baran rooms well equipped dont expect place stay",
                "rooms washroom clean open parking available owners risk location walking distance bus stand railway station staff prompt cooperative",
                "one best hotel baran washrooms dirty",
                "hotel located busy area many competitors vicinity wings rooms scenic views around hotel option rooms restaurant hotel option tea available hotel parking space distance meter basic amenities available night stay reasonable price",
                "dont know active still standing"
            ]
        },
        {
            "name": "संस्था धर्मादा धर्मशाला Sanstha Dharmada Dharamshala Baran",
            "rating": [
                4.1
            ],
            "address": [
                "4G33+5FH, Hospital Rd, Panchavati Colony, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Excellent place at a very reasonable price for any type functions with staying option. Just washroom needs to be cleaned more.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Shree Dev Fartilaises And machinry Ajency.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good for madical test\nAt low cost",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "No proper arrangements of property. Toilets are closed and without taps. Bathroom on first floor are not usable, without tap and drainage system is blocked.  Yet they make it free for students, but not arranged for toilet and sanitation. Bad experience of free Hotelling.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good for seminar and little events in low cost. 250-300 members hall for the event.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place reasonable price type functions staying option washroom needs cleaned",
                "shree dev fartilaises machinry ajency",
                "good madical test low cost",
                "proper arrangements property toilets closed without taps bathroom first floor usable without tap drainage system blocked yet make free students arranged toilet sanitation bad experience free hotelling",
                "good seminar little events low cost members hall event"
            ]
        },
        {
            "name": "The Surya Hotel",
            "rating": [
                4.1
            ],
            "address": [
                "Railway Station Road, Old Civil Line, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "I have had the experience of staying in about 1000 hotels in my life. I have had the experience of staying in all types of hotels in my 10 years of career. But the dirtiest and most dirty experience has been received in this hotel!! Rooms with foul smell from gutters and spitting of gutka on the walls tell the plight of this hotel. And what was worse than all this was the way the staff talked!! A better place to stay is the tin shed near the railway station.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very nice hotel. Nice staff. Easily accessible from Bus Stand and Railway Station.\nService also good. Means complete stay hotel",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Stayed during Transit. Rooms are ok. The bathroom fitment doesn't work properly even AC of the room doesn't work.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Hotel Surya is located near Baran Railway station just within walking distance.\nRooms are very ok, no Genset backup.\nWe have arrived here on stromy night and there was no electricity only on fan and a light was working with inverter.\n\nThere is also no food service it's only give rooms.\nI have stayed in their Suite room which was big with living room.\nTv was not working but the mini fridge was.\n\nif you are looking for just to crash for a night it can be an option.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It's nice hotel, feel like home",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "experience staying hotels life experience staying types hotels years career dirtiest dirty experience received hotel rooms foul smell gutters spitting gutka walls tell plight hotel worse way staff talked better place stay tin shed near railway station",
                "nice hotel nice staff easily accessible bus stand railway station service also good means complete stay hotel",
                "stayed transit rooms ok bathroom fitment doesnt work properly even ac room doesnt work",
                "hotel surya located near baran railway station within walking distance rooms ok genset backup arrived stromy night electricity fan light working inverter also food service give rooms stayed suite room big living room tv working mini fridge looking crash night option",
                "nice hotel feel like home"
            ]
        },
        {
            "name": "Madhuvan Resort",
            "rating": [
                3.8
            ],
            "address": [
                "Lanka Colony, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Good space for function   near din dayal park baran",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "It is nice place for event. like marrige, fastival, birthday party, and it is one an only theatre",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best Resort for party, marriage events",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good place for small party",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Street connecting resort to main road is narrow and congested. There is much difficulty to pass through this street. But resort is much better than many other resorts in the city with sound parking lot.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good space function near din dayal park baran",
                "nice place event like marrige fastival birthday party one theatre",
                "best resort party marriage events",
                "good place small party",
                "street connecting resort main road narrow congested much difficulty pass street resort much better many resorts city sound parking lot"
            ]
        },
        {
            "name": "Krishna paradise hotel and resaurt",
            "rating": [
                4.3
            ],
            "address": [
                "3GM4+F2H, Amapura, Baran, Rajasthan 325205, India"
            ],
            "reviews": [
                {
                    "text": "Had a average experience in regards with the room facility and accommodation, however not well managed staff for all the needs like management of guards, cleaning staff, and during wedding they open the parking side gate due to which uninvited people enter the property, guards are not attentive, party needs to take care of most of the request on their on and need to look for management staff.\n\nThey might ask you a dedicated price at the time of booking, which may include the cleaning, decoration, guards price, etc as seen in image shared, however later they may ask you some extra amount at the time of your function.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very nice  hotel I love it 🥰",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Excellent place 👍 place for wedding purpose",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "average experience regards room facility accommodation however well managed staff needs like management guards cleaning staff wedding open parking side gate due uninvited people enter property guards attentive party needs take care request need look management staff might ask dedicated price time booking may include cleaning decoration guards price etc seen image shared however later may ask extra amount time function",
                "nice hotel love ð\u009f¥°",
                "excellent place ð\u009f\u0091\u008d place wedding purpose"
            ]
        }
    ]
}