{
    "places_with_reviews": [
        {
            "name": "Shri Charbhuja Palace",
            "rating": [
                3.7
            ],
            "address": [
                "Club Rd, opposite New Nagar Palika, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Hotel is good, since no other better options available in the city, however the hotel doesn't serve meal. For food you need to go nearby restaurants. The hotel only arranges Tea, Coffee, Milk and biscuits and for that you have to pay additionally. Nothing is complementary here. Room tariff is nominal. The Location of the hotel is prime, all roads are well connected from the hotel location. The Rules of the hotel administration are strict, the management put a list of rules in the room, of do'es and don'ts.. it's my second time visit in this hotel, overall experience is good 👍.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "I am giving four stars for the place provided standard service despite being in such a locality. Gazetted officers and other office bearers stay here and the hotel provides facilities accordingly. I have deducted 1 star for the unavailability of online or card payment options which can easily be arranged. Have been here previously too and experienced the same kind of facilities at the same price. Advising to book in advance as other places will not offer even half the quality.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Earlier rated 4, but now will rate 1. AC was off whole night but charged for it. Doesn't listen to logic. If you get late at night, have to stand outside for 5-10 minutes and pick keys ourselves. AC off image attached",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hotel, well maintained rooms and good facilities. Only the lift is bit faulty that the gate closes very soon and there is no sensor to detect a person is entering it so beware while entering it. Rest the hotel is very good.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very nice hotel and staff is good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel good since better options available city however hotel doesnt serve meal food need go nearby restaurants hotel arranges tea coffee milk biscuits pay additionally nothing complementary room tariff nominal location hotel prime roads well connected hotel location rules hotel administration strict management put list rules room donts second time visit hotel overall experience good ð\u009f\u0091\u008d",
                "giving four stars place provided standard service despite locality gazetted officers office bearers stay hotel provides facilities accordingly deducted star unavailability online card payment options easily arranged previously experienced kind facilities price advising book advance places offer even half quality",
                "earlier rated rate ac whole night charged doesnt listen logic get late night stand outside minutes pick keys ac image attached",
                "good hotel well maintained rooms good facilities lift bit faulty gate closes soon sensor detect person entering beware entering rest hotel good",
                "nice hotel staff good"
            ]
        },
        {
            "name": "Hotel Giriraj Grand",
            "rating": [
                4.2
            ],
            "address": [
                "8924+WG5, Ranchhod Rai Marg, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Room service bad and room not clean",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice hotels and staff is also good they provide good service. But  price is costly. 1800 per day",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Had a stay at this place rooms are nice and  clean. Had been to Alirajpur for a marriage. Was a wonderful experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good hotel in Alirajpur with clean rooms",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "So nice and beauty full place in this irea",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room service bad room clean",
                "nice hotels staff also good provide good service price costly per day",
                "stay place rooms nice clean alirajpur marriage wonderful experience",
                "good hotel alirajpur clean rooms",
                "nice beauty full place irea"
            ]
        },
        {
            "name": "Hotel Sai Resort & Avenue",
            "rating": [
                3.5
            ],
            "address": [
                "29, MG Road, Opp. Water Tank, Ground, near Bus Stand, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Worst service I have ever seen. The hotel owner locked the door after 10 pm and no one was available at reception at night. If some emergency condition occurs or you want to do checkout at night there will be no one to listen to you and to unlock the door.\n\nDo not book this hotel if you don't want to be kidnapped by them at night.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "I had to catch train at 4 am and for that purpose needed to check out from hotel at 2 am...but the the hotel staff slept selling all horses and lacked me inside the hotel...such type of irresponsible behaviour has never been seen by me....in my life..\nI kept shouting in lobby of hotel, plz open the shutter and let me go, even called the hotel staff but all in vain no one picked the call and no one listened my shouting voice...finally I missed my train...\nHighly condemnable behaviour by the hotel stafff",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Best place to stay in Alirajpur, very cooperative staff, offers nice service. I had been travelling for a long time, i had many clothes to be washed, tough they were not providing laundry service right now,but they still helped me out with my laundry.\n5 Stars for the open air restaurant.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Nice ambiance and clean rooms, toilets are not upto the mark though but not bad either. AC and Non AC both rooms are available at reasonable rates.  Room service is also good. Very convenient to reach from bus stand almost at walking distance. Kitchen/ Restaurant facility also available there. Theres also a lounge area at reception. You wont  feel regret about it.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Good room but staff is very poor\nRestaurant taste is also very good best in town but service is very poor. They just need to hire some good staff. I just have wait for 40 min to get my lunch..And plz ask them change towel and bad sheet",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst service ever seen hotel owner locked door pm one available reception night emergency condition occurs want checkout night one listen unlock door book hotel dont want kidnapped night",
                "catch train purpose needed check hotel ambut hotel staff slept selling horses lacked inside hotelsuch type irresponsible behaviour never seen mein life kept shouting lobby hotel plz open shutter let go even called hotel staff vain one picked call one listened shouting voicefinally missed train highly condemnable behaviour hotel stafff",
                "best place stay alirajpur cooperative staff offers nice service travelling long time many clothes washed tough providing laundry service right nowbut still helped laundry stars open air restaurant",
                "nice ambiance clean rooms toilets upto mark though bad either ac non ac rooms available reasonable rates room service also good convenient reach bus stand almost walking distance kitchen restaurant facility also available theres also lounge area reception wont feel regret",
                "good room staff poor restaurant taste also good best town service poor need hire good staff wait min get lunchand plz ask change towel bad sheet"
            ]
        },
        {
            "name": "होटल साँई कृपा",
            "rating": [
                4.5
            ],
            "address": [
                "8929+7F5, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "A good hotel to stay overnight onway to Vadodra/ Ahmedabad. No frill hotel at reasonable rates. This is right in middle of town and busy street with limited parking. Bathroom was clean and wish if keep plumbing also maintained in better condition.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Decent place",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "👌👌👌👌👌",
                    "languageCode": "hi",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel stay overnight onway vadodra ahmedabad frill hotel reasonable rates right middle town busy street limited parking bathroom clean wish keep plumbing also maintained better condition",
                "nice",
                "decent place",
                "ð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008cð\u009f\u0091\u008c"
            ]
        },
        {
            "name": "HOTEL CITY STAR PALACE",
            "rating": [
                3.8
            ],
            "address": [
                "Jama Masjid, near BUS STAND, opp. Jama Masjid Marg, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Hotel city star is located in heart of Alirajpur city near to bus stand. Good and clean rooms with AC facility.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best Hotel in Alirajpur...\nAwesome Rooms",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Very nice",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This is very good hotel and all types room available ac and non ac room with comfortable prices",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good 👍",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel city star located heart alirajpur city near bus stand good clean rooms ac facility",
                "best hotel alirajpur awesome rooms",
                "nice",
                "good hotel types room available ac non ac room comfortable prices",
                "good ð\u009f\u0091\u008d"
            ]
        },
        {
            "name": "Maa Chamunda Palace",
            "rating": [
                4.5
            ],
            "address": [
                "01, Umrali Rd, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are good but only problem is washrooms are not properly maintained.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good Service",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms good problem washrooms properly maintained",
                "good service"
            ]
        },
        {
            "name": "Hotel heera palace",
            "rating": [
                1
            ],
            "address": [
                "8923+GW3, MG Rd, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Very bed experience\nPlz nooooo",
                    "languageCode": "en",
                    "rating": [
                        1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bed experience plz nooooo"
            ]
        },
        {
            "name": "Government Rest House",
            "rating": [
                3.9
            ],
            "address": [
                "252, MG Rd, Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [
                {
                    "text": "Government  people  running  scam.. rooms are never available . I think  the local staff is letting it on hourly basis basis goons",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "PWD Rest House consists two rooms.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Bhrastachar of government servent",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Ok place",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Baba Mughalsariya Temple",
                    "languageCode": "en-US",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "government people running scam rooms never available think local staff letting hourly basis basis goons",
                "pwd rest house consists two rooms",
                "bhrastachar government servent",
                "ok place",
                "baba mughalsariya temple"
            ]
        },
        {
            "name": "राजेंद्र भोजनालय उमराली रोड अलीराजपुर",
            "rating": [
                5
            ],
            "address": [
                "Alirajpur, Madhya Pradesh 457887, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "अपना ढाबा & रेस्टोरेंट",
            "rating": [
                4.7
            ],
            "address": [
                "79WM+5JJ, Haraswat, Madhya Pradesh 457887, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}