{
    "places_with_reviews": [
        {
            "name": "HOTEL ELITE",
            "rating": [
                3.9
            ],
            "address": [
                "FGJH+797, Rishi Rd, Shanti Nagar, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "Rooms are properly maintained & is ok to to stay with family. Staff are well dressed & well mannered with no place to complain. Location wise it's in the centre of town on main road. Distance from alipurduar junction station is 4kms & public transport is easily available..\nWould stay there again in future visits..",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The worst hotel I have ever come across in terms of service. They forgot my order and I had to repeat them once after one hour, by that time one item was already finished. For every small things like toiletries, mosquito repellents etc you have to ask everytime. They don't let you have a menu card at room, but want orders for room service. Have a couple of items only for breakfast, but you have to come down and climb up for having the single item breakfast as they won't deliver in room and don't have a lift.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It was a really good experienced staying here with family.  Friendly environment, helpful and professional staffs, well maintained room and most importantly amazing foods, special thanks to Chef!",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Worst food , they served rotten mutton and rotten rice. Fish fry they gave normal fish and charged 200 , avoid these hotel find a better place to stay. They are just bunch of liars",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "The hotel is situated on the road. Good location. The rooms are excellent. The hotel staff are also good. Beds are cozy.\n\nThe disadvantages are that there is no lift facility. Bathroom fixtures are broken and lastly no remote of AC given to customers (which is weird).",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms properly maintained ok stay family staff well dressed well mannered place complain location wise centre town main road distance alipurduar junction station kms public transport easily available would stay future visits",
                "worst hotel ever come across terms service forgot order repeat one hour time one item already finished every small things like toiletries mosquito repellents etc ask everytime dont let menu card room want orders room service couple items breakfast come climb single item breakfast wont deliver room dont lift",
                "really good experienced staying family friendly environment helpful professional staffs well maintained room importantly amazing foods special thanks chef",
                "worst food served rotten mutton rotten rice fish fry gave normal fish charged avoid hotel find better place stay bunch liars",
                "hotel situated road good location rooms excellent hotel staff also good beds cozy disadvantages lift facility bathroom fixtures broken lastly remote ac given customers weird"
            ]
        },
        {
            "name": "OYO Hotel Chitra",
            "rating": [
                3.3
            ],
            "address": [
                "Puran Bazar, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "The service of this is too much bad....they take online booking but can't provide room on booking date and they also deny to refund the advanced money",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Most 3rd class behaviour including manager they drunk and shout loud at 3 P.  M. What happened in night if i stay . And stuff are thief . I recommend no one can stay or visit in this 3rd class hotel it's better than saty at railway stations.  I must say One word that all stuff are layer every second they need money from customers.The room are very dirty and unhygienic bathroom conditions are its like Guwahati bhorolu Nodi (  drain  )",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Bedrooms all cleared. Service is to good.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "This property is located approximately 4kms from Alipurduar Jn, and 2kms from New Alipurduar, rooms was very dirty, bed sheet were very dirty, contraceptive pills were lying here and there... At first I thought, what kind if hotel is this...\nWell somehow I had to spend the night here I was left with no choice...\nIf you want to stay in a safer place then this is not the place.\nThis property is not worth your hard earned money....",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Nice place to stay with Family and friends also..",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "service much badthey take online booking cant provide room booking date also deny refund advanced money",
                "rd class behaviour including manager drunk shout loud p happened night stay stuff thief recommend one stay visit rd class hotel better saty railway stations must say one word stuff layer every second need money customersthe room dirty unhygienic bathroom conditions like guwahati bhorolu nodi drain",
                "bedrooms cleared service good",
                "property located approximately kms alipurduar jn kms new alipurduar rooms dirty bed sheet dirty contraceptive pills lying first thought kind hotel well somehow spend night left choice want stay safer place place property worth hard earned money",
                "nice place stay family friends also"
            ]
        },
        {
            "name": "Hotel Bangabhumi",
            "rating": [
                4
            ],
            "address": [
                "Court More, GG2H+Q9X, BF Rd, Alipurduar, Paschim Jitpur, West Bengal 736122, India"
            ],
            "reviews": [
                {
                    "text": "I am updating my reviews based on Local standards. The hotel is pretty neat and clean. We stayed in the deluxe room and all amenities were functional. The staff especially the day manager, housekeeping staffs are very polite. The security guard who had the night duty was a gem.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The hotel was extremely noisy, specially on Saturday evening. The music from the hotel's roof top bar was so loud that it coud be even heard from their resturant on the 1st floor, it was quite disturbing, the whole building was vibrating with the bits of the loud music. It could be heard very clearly even from the close door room of 4th floor. Otherwise the hotel stay was good though the room rent was a little high compare to the facilities of the room. There's a good resturant inside the hotel and ther food taste was good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Restaurant's food is good... ambience is unique i.e cave type and well decorated..... their staff Mr. Lama Tamang bhai, your service is just awesome, special thanks to you.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food is great. Behaviour of stuffs are also good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms are neat & clean. Room service is good. Location is excellent. Individual food is costly but thali is reasonable.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "updating reviews based local standards hotel pretty neat clean stayed deluxe room amenities functional staff especially day manager housekeeping staffs polite security guard night duty gem",
                "hotel extremely noisy specially saturday evening music hotels roof top bar loud coud even heard resturant st floor quite disturbing whole building vibrating bits loud music could heard clearly even close door room th floor otherwise hotel stay good though room rent little high compare facilities room theres good resturant inside hotel ther food taste good",
                "restaurants food good ambience unique ie cave type well decorated staff mr lama tamang bhai service awesome special thanks",
                "food great behaviour stuffs also good",
                "rooms neat clean room service good location excellent individual food costly thali reasonable"
            ]
        },
        {
            "name": "Hotel Dooars Mountain",
            "rating": [
                3.9
            ],
            "address": [
                "BF Rd, New Town, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "Room needs some improvement. Blanket was smelling funky. Condition of the washroom was not ok at all, stains all over the toilet seat, water tap was dodgy and broken. Foods are too much tossed with sauces and spices. Mineral water bottle per litre is 35 without GST!!! However room service was ok.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Hotel Rooms are too old. Matters are not at all comfortable. The rating is only for complimentary Breakfast quality which is good. The rooms are not worth its getting charged. Management must improve room quality.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It is a very sweet & peace place in BUXA TGER RESERVE. Beside thd Homestay a small river with cirstal clear water. Gtest alaways enjoy in the river, kids r also enjoy. They play Footbal, Cricket, Batminton in the bank of the River.\nVarious type of tribel you find here, like Sawtal, Rava, Dukpa, Nepali, Mech, Garo etc.\nYou can enjoy there culture, Traditional dance and there hospitality also.\nFrom Break to Lanch you will get as you want, which is fully customise.\nHope you will fully enjoy & hope may be the best enjoyment in your hole life.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good hotel for lodging , foods and bar facilities available.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very bad experience...very bad hospitality and behavior...I have to wait at reception near about 2hrs...because of room cleaning...and rooms are not up to the mark...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "room needs improvement blanket smelling funky condition washroom ok stains toilet seat water tap dodgy broken foods much tossed sauces spices mineral water bottle per litre without gst however room service ok",
                "hotel rooms old matters comfortable rating complimentary breakfast quality good rooms worth getting charged management must improve room quality",
                "sweet peace place buxa tger reserve beside thd homestay small river cirstal clear water gtest alaways enjoy river kids r also enjoy play footbal cricket batminton bank river various type tribel find like sawtal rava dukpa nepali mech garo etc enjoy culture traditional dance hospitality also break lanch get want fully customise hope fully enjoy hope may best enjoyment hole life",
                "good hotel lodging foods bar facilities available",
                "bad experiencevery bad hospitality behaviori wait reception near hrsbecause room cleaningand rooms mark"
            ]
        },
        {
            "name": "Hotel Maa international",
            "rating": [
                4.4
            ],
            "address": [
                "manojit nag, bus terminus, subhashpally, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "Hotel Mana International offers an exceptional stay with comfortable, well-appointed rooms providing a peaceful retreat. The onsite restaurant delights guests with a diverse menu of delicious dishes prepared with skill and passion. However, what truly sets this hotel apart is its outstanding staff, whose warmth and attentiveness ensure that every guest feels valued and welcomed. With a perfect blend of comfort, cuisine, and hospitality, Hotel Mana International exceeds expectations, promising a memorable experience for all who visit.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "The rooms were clean, sanitized and comfortable. The staffs were amazing. They went over and beyond to help make our stay enjoyable. They were extremely accommodating and let us to check in at like 1 am in the morning. Moreover, they were kind enough to arrange dinner for us at that hour. We highly recommend this hotel for anyone visiting Alipurduar.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This hotel is location is great, on main road. Provides parking facility.  The rooms are excellent, clean and washrooms are with geysers. Staffs are polite and provide good service and their in-house restaurant food is fine too. Have lift facility also. We were on our road trip to Guwahati Meghalaya and stayed here on the day when we reached. We also stayed again while returning back.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This is a newly opened hotel & restaurant at Alipurduar located just beside the bus terminal on the highway. This is a one and only hotel & restaurant with a swimming pool. The restaurant is outstanding. The food served here is delicious. The staff are very caring and ready to help. The parking area is large enough.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good service.  We reached around 12 mid night. They cared to provide us with dinner, even when their restaurant was closed. Rooms are clean. Good and secure space for parking vehicle.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel mana international offers exceptional stay comfortable wellappointed rooms providing peaceful retreat onsite restaurant delights guests diverse menu delicious dishes prepared skill passion however truly sets hotel apart outstanding staff whose warmth attentiveness ensure every guest feels valued welcomed perfect blend comfort cuisine hospitality hotel mana international exceeds expectations promising memorable experience visit",
                "rooms clean sanitized comfortable staffs amazing went beyond help make stay enjoyable extremely accommodating let us check like morning moreover kind enough arrange dinner us hour highly recommend hotel anyone visiting alipurduar",
                "hotel location great main road provides parking facility rooms excellent clean washrooms geysers staffs polite provide good service inhouse restaurant food fine lift facility also road trip guwahati meghalaya stayed day reached also stayed returning back",
                "newly opened hotel restaurant alipurduar located beside bus terminal highway one hotel restaurant swimming pool restaurant outstanding food served delicious staff caring ready help parking area large enough",
                "good service reached around mid night cared provide us dinner even restaurant closed rooms clean good secure space parking vehicle"
            ]
        },
        {
            "name": "Hotel Shivam",
            "rating": [
                3.9
            ],
            "address": [
                "Samuktala Road,Near M.N. bus Terminus, Jalpaiguri Dist, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "I booked online for 1 day. The stay was very nice and was able to relax. The staff surely was awesome and helped us in all our requirements. The room was spacious and organized. Location is very nice. Lots of toto and bus available from the gate. Very good for family travel.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice hotel for budget conscious travelers. Parking space available for boarders. Good food. Helpful staffs. Recommended for middle class people.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at this luxurious hotel, and I must say, it exceeded all my expectations. From the moment I arrived, I was impressed by the elegant decor and warm welcome from the staff.\n\nMy room was spacious, beautifully furnished, and equipped with all modern amenities. The bed was incredibly comfortable, and I had a fantastic night's sleep. The bathroom was spotless and had complimentary toiletries, which was a nice touch.\n\nThe hotel's dining options were exceptional, with a fine-dining restaurant serving delicious meals made with fresh ingredients, a casual cafe with a great selection of coffee and snacks, and a rooftop bar with stunning views of the city. The staff was knowledgeable about the menu and catered to all dietary requirements.\n\nThe hotel's fitness center and spa were state-of-the-art, and the indoor pool was a great way to unwind after a long day. The staff was always on hand to assist with any requests and went above and beyond to ensure my stay was comfortable and enjoyable.\n\nOverall, I had an unforgettable experience at this hotel and would highly recommend it to anyone traveling for business or leisure. The exceptional service, world-class amenities, and prime location make it the perfect choice for a memorable stay.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good for various programs like marriage reception, birthday celebration etc.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice clean room. Very professional staff",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "booked online day stay nice able relax staff surely awesome helped us requirements room spacious organized location nice lots toto bus available gate good family travel",
                "nice hotel budget conscious travelers parking space available boarders good food helpful staffs recommended middle class people",
                "recently pleasure staying luxurious hotel must say exceeded expectations moment arrived impressed elegant decor warm welcome staff room spacious beautifully furnished equipped modern amenities bed incredibly comfortable fantastic nights sleep bathroom spotless complimentary toiletries nice touch hotels dining options exceptional finedining restaurant serving delicious meals made fresh ingredients casual cafe great selection coffee snacks rooftop bar stunning views city staff knowledgeable menu catered dietary requirements hotels fitness center spa stateoftheart indoor pool great way unwind long day staff always hand assist requests went beyond ensure stay comfortable enjoyable overall unforgettable experience hotel would highly recommend anyone traveling business leisure exceptional service worldclass amenities prime location make perfect choice memorable stay",
                "good various programs like marriage reception birthday celebration etc",
                "nice clean room professional staff"
            ]
        },
        {
            "name": "Hotel Sinchula",
            "rating": [
                3.8
            ],
            "address": [
                "FGMG+5VP Puran Bazar, SH12A, Shanti Nagar, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "The view is pretty and the room is just wonderful, though it would be great if they spray the mosquitoes. My experience there was delightful.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "A perfect place to stay in Alipurduar. Rooms are clean and food is authentic. Staffs are very friendly and cooperative.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "As per pricing hotel is good. Service is also good. And location is best nodoubt.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Everyone is nice. Food, stay, cleanliness are also very good.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good hotel with fast efficient service at prime location",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "view pretty room wonderful though would great spray mosquitoes experience delightful",
                "perfect place stay alipurduar rooms clean food authentic staffs friendly cooperative",
                "per pricing hotel good service also good location best nodoubt",
                "everyone nice food stay cleanliness also good",
                "good hotel fast efficient service prime location"
            ]
        },
        {
            "name": "OYO 62896 Hotel Ridhi Sidhi",
            "rating": [
                4
            ],
            "address": [
                "Bata More, FGHC+VV9, Station Rd, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "Pathetic.\nRun by unprofessional guys.\nBooked their best deluxe room and was surprised to see:\n1. Wardrobe full of dust and had an entire ants colony, which means that they doesn't even bother to clean rooms before checking in.\n2. Geyser was not working too well\n3. AC was leaking water, and went on leaking water for the entire night.\n4. Forget WiFi, you will get it only in the first floor.\n5. There is no lift present. Hence imagine the hassle after booking a room with elderly persons.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The location is seriously good, rooms would be more comfortable. Overall good.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Poorly managed. Rooms are very small with silly arrangement of furniture. However, the staff are cordial. Overall, my rating is average.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Rooms r pretty good, food is ok but room service takes a little longer to execute than expected. Still I'll go for this hotel if I have to stay at Alipurduar next time.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Wonderful stay.Rooms were a bit stuffy but its negotiable as compared to its price and location.Washroom and bedsheet  were clean.Ac was chilling.Food was outsourced as a result the quality of the food was not as good as the hotel itself.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "pathetic run unprofessional guys booked best deluxe room surprised see wardrobe full dust entire ants colony means doesnt even bother clean rooms checking geyser working well ac leaking water went leaking water entire night forget wifi get first floor lift present hence imagine hassle booking room elderly persons",
                "location seriously good rooms would comfortable overall good",
                "poorly managed rooms small silly arrangement furniture however staff cordial overall rating average",
                "rooms r pretty good food ok room service takes little longer execute expected still ill go hotel stay alipurduar next time",
                "wonderful stayrooms bit stuffy negotiable compared price locationwashroom bedsheet cleanac chillingfood outsourced result quality food good hotel"
            ]
        },
        {
            "name": "HOTEL TORSHA",
            "rating": [
                4.2
            ],
            "address": [
                "Puran Bazar, BF Rd, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "Best family hotels_and all staff is friendly staff and best hospitality industry best trening, best food and beverage ☕  ||actually alcohol is not available\nBest service staff IRD ROOM SERVICE VERY GOOD",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I stayed for two nights. Service is excellent. Beside BF Road. Food service is also available.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "The accomodation and service is satisfactory. Things like tv hot water is in there in the room but doesn't  work, so dont feel like value for money. It can be better location is good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very bad services./Experience 😞",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best family hotelsand staff friendly staff best hospitality industry best trening best food beverage â\u0098\u0095 actually alcohol available best service staff ird room service good",
                "stayed two nights service excellent beside bf road food service also available",
                "accomodation service satisfactory things like tv hot water room doesnt work dont feel like value money better location good",
                "bad servicesexperience ð\u009f\u0098\u009e",
                "good hospitality"
            ]
        },
        {
            "name": "SPOT ON 61322 Ganga Hotel",
            "rating": [
                3.2
            ],
            "address": [
                "FGRG+8GP, Alipurduar, Sobhaganj, West Bengal 736121, India"
            ],
            "reviews": [
                {
                    "text": "This place is good and located at a great location in the town. But the major problem in this hotel is that there are some difficulties organising any event like marriage party! Because this place doesn't allow loud music, and the space here is not so large.",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "Decent hotel, however the room, bed and washroom cleanliness is not upto the mark. Best for bag packers. Also have a good verandah to see outside view.",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "Location perfect 🤟🤟my room view perfect 🤟🤟the facility on such price is incomparable for anywhere 👏👏loved my peace there ❤️❤️🙂🙂🙏🙏",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "Very good hotel. Nice place to stay for official work. Room rate is also very reasonable.very clean rooms. Staff are very friendly with a smile always in their face",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                },
                {
                    "text": "Disgusting Hotel.The rooms are very dirty in this hotel.Bathroom is unclean.Totally Bad",
                    "languageCode": "en",
                    "rating": [
                        3.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "place good located great location town major problem hotel difficulties organising event like marriage party place doesnt allow loud music space large",
                "decent hotel however room bed washroom cleanliness upto mark best bag packers also good verandah see outside view",
                "location perfect ð\u009f¤\u009fð\u009f¤\u009fmy room view perfect ð\u009f¤\u009fð\u009f¤\u009fthe facility price incomparable anywhere ð\u009f\u0091\u008fð\u009f\u0091\u008floved peace â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fð\u009f\u0099\u0082ð\u009f\u0099\u0082ð\u009f\u0099\u008fð\u009f\u0099\u008f",
                "good hotel nice place stay official work room rate also reasonablevery clean rooms staff friendly smile always face",
                "disgusting hotelthe rooms dirty hotelbathroom uncleantotally bad"
            ]
        }
    ]
}