{
    "places_with_reviews": [
        {
            "name": "THE GAURIKUND HOTEL",
            "rating": [
                4.2
            ],
            "address": [
                "CGRQ+C2H, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Me & my family just have lunch in this HPTDC rest house and we are touched by their hospitality. They offered us gr8 food, inquire us why we haven't stay with them and also request us to stay next time with them. Our driver stays there and he confirm it is way better than any private guest house of bharmour.\nThe next mention is the view from Gaurikund's helipad, breathtaking. We will never know this if we do not go there to have our lunch. Be aware of hygiene in all bharmore, this place looks most hygienic to eat.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good location to stay with excellent views of mani mahesh.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "My stay at Hotel Gaurikund exceeded all expectations. It was a seamless blend of beauty, comfort, and exceptional service. I wholeheartedly recommend this hotel to anyone seeking an unforgettable experience, be it for spiritual or religious.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's basic room not for someone expecting 5star service or luxury. Caretaker managed property. At an amazing location. Though reaching here is bit tough and to-fro travel if with own car is impossible as the road leading to hotel is two way and very steep and narrow something that only locals can handle.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It's position is awesome.The hotel is located at the top of the hill just beside the helipad with 360° view of snow capped mountains. Sunrise can be seen from all the rooms.Each room has an attached bathroom fitted with all modern fittings. All types of food is available in their canteen but has to be ordered before-hand.During the Yatra from Janmastami to Radhastami helicopter service is available from the front of the hotel for visiting Manimahesh.Sureshji the caretaker is a very nice person. It is a must visit.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "family lunch hptdc rest house touched hospitality offered us gr food inquire us havent stay also request us stay next time driver stays confirm way better private guest house bharmour next mention view gaurikunds helipad breathtaking never know go lunch aware hygiene bharmore place looks hygienic eat",
                "good location stay excellent views mani mahesh",
                "stay hotel gaurikund exceeded expectations seamless blend beauty comfort exceptional service wholeheartedly recommend hotel anyone seeking unforgettable experience spiritual religious",
                "basic room someone expecting star service luxury caretaker managed property amazing location though reaching bit tough tofro travel car impossible road leading hotel two way steep narrow something locals handle",
                "position awesomethe hotel located top hill beside helipad â° view snow capped mountains sunrise seen roomseach room attached bathroom fitted modern fittings types food available canteen ordered beforehandduring yatra janmastami radhastami helicopter service available front hotel visiting manimaheshsureshji caretaker nice person must visit"
            ]
        },
        {
            "name": "HOTEL BHARMOUR VIEW",
            "rating": [
                3.9
            ],
            "address": [
                "Bharmani Chowk, 84 Road, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Hotel are OK Ok\n\nThis is my first experience with this hotel but There are very less facilities as compare to other hotels.\n\nAnd room services which they need to improve on you rest location are in good place\n\nyou can easily get cab for Bharmani Mata and Harsar directly at the door step……",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Considering the location, it's a decent place to stay. Owner and staffs are very polite and helpful. Special mention for Mr. Vipin. He is just a call away. Has been very supportive during my 3 days stay in this property.\nHope to meet soon.\nThank you!\nRoom is good. Location is also perfect",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Very good place to stay. Location is excellent, just walking distance from chaurasi temple. Staff is very cooperative. Mr Vipin  from hotel staff was very helpful and polite. Very good management. A 10 star from our side.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Excellent service. Rooms and other amenities where upto the mark...the host/manager Vipin is every helpful and enthusiastic and ready to help at all hours.\n\nLovely place...will definitely visit again.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I was stationed in this hotel for about 15-20 days. Firstly I would like to say that my stay at Bharmour View was comfortable. Since this place is located in the interiors, there may be power cuts or water issues that you may encounter in every other hotel you go in for. However Hotel Bharmour View has enough supply of water (they have 4-5 big syntex tankies) and a backup supply that can last for a few hours.\nMy room had a nice bed, tv,water heater, clean western toilet with jet spray.The rooms with the front view should be highly sought for(you will rise up to a beautiful view of snow mountains depending upon the cloud situations).\nThe staff includes Vipin who takes care of all your room service requirements and is extremely well behaved 21 year old boy with a great sense of responsibility towards your instructions.Dr.Atul is the hotel owner who is trying his best to cater to your needs and is very welcoming and hospitable towards the guests. People in this small town are extremely friendly and caring. Please do try the local vaishno dhaba a few meters away from the hotel(didn't run into stomach problems). You shall find a few confectioneries that serve basic omelette bread and nice tea. The Chaurasi Mandir nearby was built in the 7th century and has a warm vibe to it. People who are visiting Dalhousie and Chamba should definitely go to bharmour for finding peace and tranquility.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel ok ok first experience hotel less facilities compare hotels room services need improve rest location good place easily get cab bharmani mata harsar directly door stepâ\u0080¦â\u0080¦",
                "considering location decent place stay owner staffs polite helpful special mention mr vipin call away supportive days stay property hope meet soon thank room good location also perfect",
                "good place stay location excellent walking distance chaurasi temple staff cooperative mr vipin hotel staff helpful polite good management star side",
                "excellent service rooms amenities upto markthe hostmanager vipin every helpful enthusiastic ready help hours lovely placewill definitely visit",
                "stationed hotel days firstly would like say stay bharmour view comfortable since place located interiors may power cuts water issues may encounter every hotel go however hotel bharmour view enough supply water big syntex tankies backup supply last hours room nice bed tvwater heater clean western toilet jet spraythe rooms front view highly sought foryou rise beautiful view snow mountains depending upon cloud situations staff includes vipin takes care room service requirements extremely well behaved year old boy great sense responsibility towards instructionsdratul hotel owner trying best cater needs welcoming hospitable towards guests people small town extremely friendly caring please try local vaishno dhaba meters away hoteldidnt run stomach problems shall find confectioneries serve basic omelette bread nice tea chaurasi mandir nearby built th century warm vibe people visiting dalhousie chamba definitely go bharmour finding peace tranquility"
            ]
        },
        {
            "name": "Bharmour Home Stay",
            "rating": [
                4.1
            ],
            "address": [
                "Main Road, Bharmour, R.F.Moru, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Bharmour, also known as Machu Pichu of Himachal, formally known as Brahmpura, was the ancient capital of Chamba district in Himachal Pradesh, India. Situated at an altitude of 2,100 metres in the Budhil valley, forty miles to the south-east of Chamba, Bharmour is known for its scenic beauty and for its ancient temples. Some of the temples are believed to date from 10th century.\n\nAs the whole country around Bharmour is supposed to belong to lord Shiva, it is popularly spoken of as Shiva Bhumi, \"abode of lord Shiva\". It lies between the Pir-Panjal and Dhauladhar range, between Ravi and Chenab valley. The land is blessed with deep beauty of abundant alpine pastures and provides home for nomadic shepherds, known as Gaddis, thus also called Gadderan. The foothills are filled with orchards and terraced farmsteads. The epitome of spirituality lies in this land as it is endowed with ancient temples. The area goes through inhospitable terrain and severe climate changes. \"Kailash Vasio\" as the people of Bharmour are known are extremely courteous and welcomes visitors like their own family members. Along with its ethnic traditions, culture and ancient history, Bharmour forms the perfection of divine splendour.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It so lovely place so peaceful and calm greenery every where...really so Lovely place.. actually best place for trip. Nice scenery.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "We changed our stay to Hotel Chaurasi, which is decent among all hotels there. This hotel is very near parking (just walking distance) and near to Chaurasi temple and local shopping market. Near there is Punjabi dhaba, food quality is good. Bhamour home stay and Hotel Chaurasi both have beautiful views and chill winds. So enjoyed our stay a lot. Night view and sunrise 🌅 is awsome",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Its a 4 star place nice place to stay. Whenever you visit chamba go and find bharmour valley its sittuated on the bank of the ravi river. People are so nice and rich in culture. There outfit attract people. Mostly gaddi people live there.\nA must visit place.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Awesome place, excellent food and services 👌",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bharmour also known machu pichu himachal formally known asâ brahmpura ancient capital ofâ chamba districtâ inâ himachal pradesh india situated altitude metres budhil valley forty miles southeast ofâ chamba bharmour known scenic beauty ancient temples temples believed date th century whole country around bharmour supposed belong toâ lord shiva popularly spoken shiva bhumi abode lord shiva lies pirpanjal dhauladhar range betweenâ raviâ andâ chenabâ valley land blessed deep beauty abundant alpine pastures provides home nomadic shepherds known asâ gaddis thus also called gadderan foothills filled orchards terraced farmsteads epitome spirituality lies land endowed ancient temples area goes inhospitable terrain severe climate changes kailashâ vasio people bharmour known extremely courteous welcomes visitors like family members along ethnic traditions culture ancient history bharmour forms perfection divine splendour",
                "lovely place peaceful calm greenery every wherereally lovely place actually best place trip nice scenery",
                "changed stay hotel chaurasi decent among hotels hotel near parking walking distance near chaurasi temple local shopping market near punjabi dhaba food quality good bhamour home stay hotel chaurasi beautiful views chill winds enjoyed stay lot night view sunrise ð\u009f\u008c awsome",
                "star place nice place stay whenever visit chamba go find bharmour valley sittuated bank ravi river people nice rich culture outfit attract people mostly gaddi people live must visit place",
                "awesome place excellent food services ð\u009f\u0091\u008c"
            ]
        },
        {
            "name": "Manimahesh Hotel Bharmour",
            "rating": [
                4.6
            ],
            "address": [
                "Village Patty Post Office, Thesil, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Reasonable to the pocket. Very near by to bus stop. You can reach Hadsar with Rs 30/- . Which is a point from where you get horses and you can walk to Manimahesh track.\nOnly rooms are available. It's run by a family. They are very friendly. The staff is also very friendly. Food is available nearby.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very good place to stay. Great view if you take the mountain view. Room was big and comfortable. No food but there is Patyal restaurant nearby which is excellent and also delivers. Overall a good experience to stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Rooms are ok , service is not good, location is nice.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Have stayed here multiple times in 2019 and 2022. The rooms are clean and bright, all with excellent north-east views of the Bharmour valley. The owner and all staff are very friendly and accommodating. I'm particularly pleased  that the quality of the amenities has been consistently high over the years.\nThe location is especially peaceful as there is less traffic and honking in this part of town. It doesn't feel as crowded as the main Chaurasi area, but you can walk to the mandir complex in 10 minutes via a shortcut through the village (lots of uphill walking!). There are plenty of small stores and restaurants nearby. My favorite is Thakur Dhaba, about a 2 minute walk towards the bus stand.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Good Hotel with Great view and Location.\nStaff and owner is very friendly.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "reasonable pocket near bus stop reach hadsar rs point get horses walk manimahesh track rooms available run family friendly staff also friendly food available nearby",
                "good place stay great view take mountain view room big comfortable food patyal restaurant nearby excellent also delivers overall good experience stay",
                "rooms ok service good location nice",
                "stayed multiple times rooms clean bright excellent northeast views bharmour valley owner staff friendly accommodating im particularly pleased quality amenities consistently high years location especially peaceful less traffic honking part town doesnt feel crowded main chaurasi area walk mandir complex minutes via shortcut village lots uphill walking plenty small stores restaurants nearby favorite thakur dhaba minute walk towards bus stand",
                "good hotel great view location staff owner friendly"
            ]
        },
        {
            "name": "Bharmour villa,Home stay",
            "rating": [
                4.3
            ],
            "address": [
                "Kasba Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Travel date : Mar '23\n\nPros:\n- Excellent view, you will get a 360 view of mountains. We were surrounded by snow peaked mountains as well.\n- Very good service by Susil, the caretaker.\n- Food is homely and quite cheap.\n- Fully aloof, you won't have other properties near your side.\n- The market is available at a distance of 300-400 meters.\n- Various trek options are available from this place.\n\nCons:\n- We found some spiders , centipede, caterpillars and even rats in our rooms.\n- Roads leading to this place are quite difficult and hectic, so beware of that.\n\nWe took a cab from Bir, which included two stops for roaming around, and two stops for food, and it took us around 12 hours in total. So plan your travel accordingly.\n\nWe didn't get any snowfall in the month of March.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The place is amazing. Fantastic view and the bedroom all in wood. The owner is very nice and took me around the city. Only the food was a bit disappointing and late but I'm sure it will be resolved soon. Highly recommended",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Location good. Service very very very poor. No backup for electricity.  Daily goods not available nearby.  Even for morning tea u have too wait for milk",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Himachali guide is the most convenient and helpful guide services. With finding the best local food, experiencing local villages to the best view points, they provide you the best.\nLocations are amazing and you get the best vibe and view from your window!\nVisiting himachal is even better if you get it done with himachali guide! 🤍",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "A place which is aloof from the surroundings..it will be like you are living in heaven..but now they have closed the home stay..the owners are gem,sweet persons. Hope they start again their home stay as i feel demand will be great. A small tree house is also there where you can simply sit and enjoy reading a book. Overall a must stay place if they start again.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "travel date mar pros excellent view get view mountains surrounded snow peaked mountains well good service susil caretaker food homely quite cheap fully aloof wont properties near side market available distance meters various trek options available place cons found spiders centipede caterpillars even rats rooms roads leading place quite difficult hectic beware took cab bir included two stops roaming around two stops food took us around hours total plan travel accordingly didnt get snowfall month march",
                "place amazing fantastic view bedroom wood owner nice took around city food bit disappointing late im sure resolved soon highly recommended",
                "location good service poor backup electricity daily goods available nearby even morning tea u wait milk",
                "himachali guide convenient helpful guide services finding best local food experiencing local villages best view points provide best locations amazing get best vibe view window visiting himachal even better get done himachali guide ð\u009f¤\u008d",
                "place aloof surroundingsit like living heavenbut closed home staythe owners gemsweet persons hope start home stay feel demand great small tree house also simply sit enjoy reading book overall must stay place start"
            ]
        },
        {
            "name": "OYO 68650 hotel chourasi & restaurant",
            "rating": [
                4
            ],
            "address": [
                "Chourasi Road, Distt, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Budget hotel. Polite and cordial behaviour of staff. Nice view from the balcony. A shot from balcony after sunset is depicted",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Maybe it is one of the nicer places in Bharmour, and the staff are supportive, but our room was missing 2 windows (it is cold in late December!) and was certainly not cleaned for at least good few months..",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Sanjay the person working there is a one man army, really took care of us. Really appreciate the service provided except for the fact that some rooms are really really awful with no water facilities and some missing windows, which does freeze a person to death in the winters.Had to take one of their blankets and go DIY to protect myself from the cold.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Nice service, owner is very polite and helping .... and fabulous view from hotel balcony ... I am sharing the click as well ...",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This place is moderately good to stay..view is good room the window bt very congested.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "budget hotel polite cordial behaviour staff nice view balcony shot balcony sunset depicted",
                "maybe one nicer places bharmour staff supportive room missing windows cold late december certainly cleaned least good months",
                "sanjay person working one man army really took care us really appreciate service provided except fact rooms really really awful water facilities missing windows freeze person death wintershad take one blankets go diy protect cold",
                "nice service owner polite helping fabulous view hotel balcony sharing click well",
                "place moderately good stayview good room window bt congested"
            ]
        },
        {
            "name": "Waterfall hotel thala",
            "rating": [
                4
            ],
            "address": [
                "Vill luni market(thala, Bharmour, Panjsei, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Its a wonderful place but there was no one",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "wonderful place one"
            ]
        },
        {
            "name": "SPOT ON 38604 Japotra Homestay",
            "rating": [
                4.6
            ],
            "address": [
                "MDR52, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "They are in the mainlocality of bharmor.Awsome view.Sunrise viewpoint from balcony.Nice rooms.Amazing behaviour , Good and peaceful environment, friendly in nature,Totally awsome place to stay with affordable price .loved it .\nRooms are very nice with very nice view and environment are very peaceful and calm",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Excellent place, neat n clean rooms with 24 hrs service\nThe owner Mr. Japotra is such nice  person\nI will recommend to all my near n dear if they get a chance to vist shiv nagri \"\" bharmour \"\" then will make their trip easy with \"\"japotra home stay\"\" just a few steps away from 84 mandir n main bharmour chownk\n\nJai shankar  🙏",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very very very beautiful and clean rooms totally wood work were done with very big rooms.security for girls are also provided.l guess that this is the best hotel in bharmour.l feel like I am in heaven in this hotel because the view from this hotel is too too much beautiful.The best thing of this hotel is owner,he is so much helpfull and cooperative.you should go there and have this moment of heaven.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Nyc place to stay in bharmour\nBest room amezing mountain view staff is very helpfull i will highly recommend visit and spend your good time in jaborta homestay",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Room service was too too good. food was so much delicious and staff and owner is so much cooperative with their customers.....I Think you should go there....",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "mainlocality bharmorawsome viewsunrise viewpoint balconynice roomsamazing behaviour good peaceful environment friendly naturetotally awsome place stay affordable price loved rooms nice nice view environment peaceful calm",
                "excellent place neat n clean rooms hrs service owner mr japotra nice person recommend near n dear get chance vist shiv nagri bharmour make trip easy japotra home stay steps away mandir n main bharmour chownk jai shankar ð\u009f\u0099\u008f",
                "beautiful clean rooms totally wood work done big roomssecurity girls also providedl guess best hotel bharmourl feel like heaven hotel view hotel much beautifulthe best thing hotel ownerhe much helpfull cooperativeyou go moment heaven",
                "nyc place stay bharmour best room amezing mountain view staff helpfull highly recommend visit spend good time jaborta homestay",
                "room service good food much delicious staff owner much cooperative customersi think go"
            ]
        },
        {
            "name": "Hotel Mahadev",
            "rating": [
                4.1
            ],
            "address": [
                "Main Bazaar Bharmour, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Hotel Mahadev is best one with tariff and  accessibility. Hotel owner Sh Rajesh Thakur is too cooperative and giving  proper attention for Mani Mahesh yatra. He is boosting  us  to complete our yatra  by khachhar or by trek when bad weather halt the Chopper service.  Foods are provided as per our requirement by Restaurant running from hotel premises The Quality of food  is good one. Wish to visit agin.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place for vocational holidays. Chilled weather,best views,lots of history, lots of temples. And land of GOD SHIVA.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Another seasonal hotel at Bharmour. Located just behind the helipad and 100 meters away from Chaurasi temple.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Moderate. High rate during season.aug-sep)",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Excellent",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel mahadev best one tariff accessibility hotel owner sh rajesh thakur cooperative giving proper attention mani mahesh yatra boosting us complete yatra khachhar trek bad weather halt chopper service foods provided per requirement restaurant running hotel premises quality food good one wish visit agin",
                "good place vocational holidays chilled weatherbest viewslots history lots temples land god shiva",
                "another seasonal hotel bharmour located behind helipad meters away chaurasi temple",
                "moderate high rate seasonaugsep",
                "excellent"
            ]
        },
        {
            "name": "Dhruv Guest House & Restaurant",
            "rating": [
                4.4
            ],
            "address": [
                "CGRJ+X7P, NH 154A, Bharmour, Himachal Pradesh 176315, India"
            ],
            "reviews": [
                {
                    "text": "Nice guest house and good food good services",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Great place to stay ,",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Ok",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Wow heaven beaty",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Lovely hotel",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice guest house good food good services",
                "great place stay",
                "ok",
                "wow heaven beaty",
                "lovely hotel"
            ]
        }
    ]
}