{
    "places_with_reviews": [
        {
            "name": "OYO Flagship Ivy hotel",
            "rating": [
                3.3
            ],
            "address": [
                "94, 94/5, Ghoshpara Rd, Airport Area Barrackpore, Barrackpore, West Bengal 743122, India"
            ],
            "reviews": [
                {
                    "text": "It was really worst experience to visit this hotel\nI booked it from make my trip but when I reached hotel they told me all the room are already booked out but they asked me to offer extra more money if I want to stay then\nas I had already paid through make my trip\nThe staffs are very rude at this hotel\nI don’t suggest anyone to visit this place instead find some hotel nearby location",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Don't go in this hotel. They will not accept booking from Oyo app don't go in this hotel. I've seen so many bad reviews about this hotel but i also done this mistake. They are cheaters. Oyo should banned this hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "Experience was moreover good but prices are more location is also not that good\nBut liked it\nCan improve the service.",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "I spent there a wonderful time All is ok and best for couple👍👍",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                },
                {
                    "text": "As my booking was confirmed by OYO still The Hotel Manager strictly refused to provide the room. Very bad behaviour of The Hotel Manager. An unexpected room charge was offered by him which was impossible as our booking was confirmed with OYO. Very bad experience was that kindly improve the matter. As the booking was confirmed, The Hotel Manager should provide the room at the same booking price but he offered quite expensive price. So, I request to the OYO team, kindly look into this kind matters and rectify it in proper way so that rest of the people should not go through this notorious matter. Thank You",
                    "languageCode": "en",
                    "rating": [
                        3.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "really worst experience visit hotel booked make trip reached hotel told room already booked asked offer extra money want stay already paid make trip staffs rude hotel donâ\u0080\u0099t suggest anyone visit place instead find hotel nearby location",
                "dont go hotel accept booking oyo app dont go hotel ive seen many bad reviews hotel also done mistake cheaters oyo banned hotel",
                "experience moreover good prices location also good liked improve service",
                "spent wonderful time ok best coupleð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "booking confirmed oyo still hotel manager strictly refused provide room bad behaviour hotel manager unexpected room charge offered impossible booking confirmed oyo bad experience kindly improve matter booking confirmed hotel manager provide room booking price offered quite expensive price request oyo team kindly look kind matters rectify proper way rest people go notorious matter thank"
            ]
        },
        {
            "name": "Ubique Hotel",
            "rating": [
                4
            ],
            "address": [
                "89, SN Banerjee Rd, Cantonment, Barrackpore, Kolkata, West Bengal 700120, India"
            ],
            "reviews": [
                {
                    "text": "Food is too spicy and hot. We ordered veg-kabab, noodles, chicken. All items were not at all eatable. Even after multiple reminder to waiter, they didn't care about our request to serve non-spicy food. Very poor experience, complete wastage of money. I will not suggest anyone to dine here.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Barrackpor's one of the oldest bar cum restaurant. Spacious. Now we'll decorated. Food quality good. Very near to bkp chiriamore.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst experience we stayed with 17 people for a wedding. And booked 8 rooms for 3 days. They don't know how to provide even basic needs not towels no basket or blanket after a lot of complaints they provide basic items. No ac working. Food was the worst. They don't even provide tea whenever we ask for tea they say we don't have tea. I suggest you can stay at dharamshala but not here.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "A very clean, spacious and nice restaurant cum bar. They have a big lawn inside the premises. This premises is for any kind of event like marriage, anniversary, birthday etc on rent, minimum 800 people can accommodate inside the lawn.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "We like the victuals and the behaviour of the staff are full of comity and pleasant attributes. We had an official outing and we must asseverate that the vittals were scrumptious! In particular, the comportment and mien of some were astonishing!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food spicy hot ordered vegkabab noodles chicken items eatable even multiple reminder waiter didnt care request serve nonspicy food poor experience complete wastage money suggest anyone dine",
                "barrackpors one oldest bar cum restaurant spacious well decorated food quality good near bkp chiriamore",
                "worst experience stayed people wedding booked rooms days dont know provide even basic needs towels basket blanket lot complaints provide basic items ac working food worst dont even provide tea whenever ask tea say dont tea suggest stay dharamshala",
                "clean spacious nice restaurant cum bar big lawn inside premises premises kind event like marriage anniversary birthday etc rent minimum people accommodate inside lawn",
                "like victuals behaviour staff full comity pleasant attributes official outing must asseverate vittals scrumptious particular comportment mien astonishing"
            ]
        },
        {
            "name": "HOTEL SWEET DREAM",
            "rating": [
                4.1
            ],
            "address": [
                "Q99Q+696, Barrackpore - Kalyani Expy, Rabindrapally, Mohan Pur, Barrackpore, West Bengal 700122, India"
            ],
            "reviews": [
                {
                    "text": "Good facilities, helpful staff , spacious dining hall on 4th floor for parties /dinner. Overall happy with the service and quality !",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The hotel is quite ok. Service is not enough . It took quite a long time to get our simple breakfast. The geaser in the bathroom was not working properly.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Room Quality Was Good Condition.Happy With That,But Extra 100/- Also Payable,Don't Know About That Actually..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good one if you have an occasion to attend in aqua banquet hall ...this is the closest hotel from there",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Situated near wireless more, this hotel offers you good rooms with decent services. According to the room size and amenities, the price is a bit high, and few things like broken washroom glasses should get fixed on time. The wardrobe was a little rusty (difficult to open and close) . This hotel is right next to the kalyani expressway, so it's a bit noisy (vehicles honks and engine sound).",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good facilities helpful staff spacious dining hall th floor parties dinner overall happy service quality",
                "hotel quite ok service enough took quite long time get simple breakfast geaser bathroom working properly",
                "room quality good conditionhappy thatbut extra also payabledont know actually",
                "good one occasion attend aqua banquet hall closest hotel",
                "situated near wireless hotel offers good rooms decent services according room size amenities price bit high things like broken washroom glasses get fixed time wardrobe little rusty difficult open close hotel right next kalyani expressway bit noisy vehicles honks engine sound"
            ]
        },
        {
            "name": "Avenue Plaza Hotel and Restaurant",
            "rating": [
                4.6
            ],
            "address": [
                "158, N.S.Avenue, near Samrat hotel, Serampore, West Bengal 712201, India"
            ],
            "reviews": [
                {
                    "text": "The Hotel is right at the prime location which was perfect for us. The staff and the manager was AMAZING. They were very courteous and helpful. They arranged a car for us to do sight-seeing. The food was really good. The rooms were very clean and nice but the size is a bit small but perfect for 2 people stay. Only one recommendation would be to give comforters instead of blankets. Bathroom was very clean and had geyser which provided hot hot water (our main requirement) in this cold weather. Over all a really pleasant stay. Thanks Avenue Plaza! Thanks to the Manager and front desk staff",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Avenue Plaza Hotel is a pleasant place to stay, offering in-house dining options with good-quality food. The entire hotel, including the rooms, is exceptionally clean and well-maintained. The service is courteous, and the manager is particularly helpful. We chose this hotel for our Kolkata tour, and my clients were delighted with their stay here.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Dear owner please have a look on this in a super deluxe room faces horrible experience rooms are so dirty and to open the dustbin,I saw a condom lying in it I go to so many hotels,I have never had such a horrible experience in my life bathroom amenities are not proper look dirty and unhygienic no complimentary drinking water I did not think that such an experience would happen here,I think you should take this issue seriously.I did not like the management of this hotel at all.\nThe reception staff is not very good,they don't even know how to talk to the guests, it's disgusting.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying at Avenue Plaza Hotel in Sirampore during a trip to Kolkata. Despite a booking mix-up, where I inadvertently reserved a room from March 31st to April 2nd instead of staying elsewhere due to a change in plans, the hotel's manager, Mr. Soutik, graciously assisted us and ensured a smooth transition. From the moment we arrived, the hotel staff exhibited exceptional service, displaying warmth and professionalism in their interactions with guests. The rooms were impeccably clean and provided a comfortable stay, while the central location of the hotel proved convenient for exploring the town. Additionally, I appreciated the assistance provided by the staff in handling luggage. Overall, I am thoroughly impressed with Avenue Plaza Hotel and extend my gratitude to Mr. Soutik and the entire team for their outstanding hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very unhygienic experience in room and toilet. Mosquitos and bad smiles makes me irritated. Service also poor and unprofessional The behavior of the reception staff is very bad and mr soutik is also very bad,the behavior of the reception manager is also very bad, he is full of arrogance. It seems from his words that he considers himself the owner of the hotel to be a disgusting person",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel right prime location perfect us staff manager amazing courteous helpful arranged car us sightseeing food really good rooms clean nice size bit small perfect people stay one recommendation would give comforters instead blankets bathroom clean geyser provided hot hot water main requirement cold weather really pleasant stay thanks avenue plaza thanks manager front desk staff",
                "avenue plaza hotel pleasant place stay offering inhouse dining options goodquality food entire hotel including rooms exceptionally clean wellmaintained service courteous manager particularly helpful chose hotel kolkata tour clients delighted stay",
                "dear owner please look super deluxe room faces horrible experience rooms dirty open dustbini saw condom lying go many hotelsi never horrible experience life bathroom amenities proper look dirty unhygienic complimentary drinking water think experience would happen herei think take issue seriouslyi like management hotel reception staff goodthey dont even know talk guests disgusting",
                "recently pleasure staying avenue plaza hotel sirampore trip kolkata despite booking mixup inadvertently reserved room march st april nd instead staying elsewhere due change plans hotels manager mr soutik graciously assisted us ensured smooth transition moment arrived hotel staff exhibited exceptional service displaying warmth professionalism interactions guests rooms impeccably clean provided comfortable stay central location hotel proved convenient exploring town additionally appreciated assistance provided staff handling luggage overall thoroughly impressed avenue plaza hotel extend gratitude mr soutik entire team outstanding hospitality",
                "unhygienic experience room toilet mosquitos bad smiles makes irritated service also poor unprofessional behavior reception staff bad mr soutik also badthe behavior reception manager also bad full arrogance seems words considers owner hotel disgusting person"
            ]
        },
        {
            "name": "Ashoka Lodge-hotel in Barrackpore",
            "rating": [
                3.8
            ],
            "address": [
                "66/a, SN Banerjee Rd, Barrackpore, West Bengal 700120, India"
            ],
            "reviews": [
                {
                    "text": "Rates are too high for two people as it's a slot booking.\n\nBut if you are planning with your group then it's good for party purpose.\nThey charged 1300 for AC and I think 800 for Non ac.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "OWNERS BEHAVIOUR IS TOO MUCH RUDE... DON'T EVER VISIT THIS HOTEL... THE WORST HOTEL EVER... 😡😡",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hotel owner behavior is so rude Don't know how to behave. When i have asked for room Over phone he told that yes he will provide room but when i am reached Their.. He Just denied for room..\nPosition of hotel is good it’s just walking distance from barrakpore railway station it will just 5 min. Walking distance from station. But owner is very rude.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Best for Unmarried couples For Spend Romantic Times",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "hunger for rating..  if u give less thn 5, owner came to ur door n talk rudely.   bloody dnt deserve a single ⭐, dnt ever saw this oyo hotel... my  opinion is be aware very careful...",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rates high two people slot booking planning group good party purpose charged ac think non ac",
                "owners behaviour much rude dont ever visit hotel worst hotel ever ð\u009f\u0098¡ð\u009f\u0098¡",
                "hotel owner behavior rude dont know behave asked room phone told yes provide room reached denied room position hotel good itâ\u0080\u0099s walking distance barrakpore railway station min walking distance station owner rude",
                "best unmarried couples spend romantic times",
                "hunger rating u give less thn owner came ur door n talk rudely bloody dnt deserve single â­\u0090 dnt ever saw oyo hotel opinion aware careful"
            ]
        },
        {
            "name": "ROYAL RESTAURANT AND LODGING SEARAMPORE",
            "rating": [
                3.6
            ],
            "address": [
                "873/A/A , Pearapore , Delhi Road ( Serampore, Crossing, Sheoraphuli, Serampore, West Bengal 712223, India"
            ],
            "reviews": [
                {
                    "text": "The hotel is decent, but a bit pricey.\n\nThe rooms are spacious, somewhat clean and the design is OK.\n\nThe staff is average, not too rude, but not too friendly or courteous either.\n\nThe restaurant service could be improved, as well as taste and preparation time.\n\nJust another average restaurant, nothing special.\n\nFew parking places, and not too crowded.\n\nHope this helps 🙏",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "We have had here veg thali. They took 25 minutes to serve food. But all the items they served were of good quality. Service staffs were well behave. Price of food was justified. Parking place was good.Overall a good experience to share with.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Royal Dhaba's chai is a regal treat for the senses, blending the finest ingredients with precision and care. Served in ornate cups, each sip is a journey through layers of flavor and tradition. The robust spices dance on the palate, while the creamy texture envelops you in comfort. Whether enjoyed alongside savory snacks or as a standalone indulgence, Royal Dhaba's chai reigns supreme, offering a taste of luxury that leaves a lasting impression.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Not a place to visit for sure.\nOn the first day we had a agreement for ₹2500 per day but later after staying at the place they charged me ₹4000 per day , by just completely denying any agreement.\nWhen I raised questions this people started to threaten like some goons .. due to family safety we jst paid what ever they asked and left the place.\nRequest everyone to be very cautious and vigilant, if possible just avoid staying at such irresponsible places.\nI made a mistake by staying at this hotel, I hope anyone reading this review will take a lesson from my incident.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Good food. But very expensive, not worth for money.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "hotel decent bit pricey rooms spacious somewhat clean design ok staff average rude friendly courteous either restaurant service could improved well taste preparation time another average restaurant nothing special parking places crowded hope helps ð\u009f\u0099\u008f",
                "veg thali took minutes serve food items served good quality service staffs well behave price food justified parking place goodoverall good experience share",
                "royal dhabas chai regal treat senses blending finest ingredients precision care served ornate cups sip journey layers flavor tradition robust spices dance palate creamy texture envelops comfort whether enjoyed alongside savory snacks standalone indulgence royal dhabas chai reigns supreme offering taste luxury leaves lasting impression",
                "place visit sure first day agreement â\u0082¹ per day later staying place charged â\u0082¹ per day completely denying agreement raised questions people started threaten like goons due family safety jst paid ever asked left place request everyone cautious vigilant possible avoid staying irresponsible places made mistake staying hotel hope anyone reading review take lesson incident",
                "good food expensive worth money"
            ]
        },
        {
            "name": "K2 Hotel and Restuarant cum Bar",
            "rating": [
                4
            ],
            "address": [
                "Chak-Kanthalia, Expressway, Dum Dum, Barrackpore, West Bengal 700121, India"
            ],
            "reviews": [
                {
                    "text": "I gave K2 Hotel just one star because I can't give it zero. Honestly, it's better to sleep on the road than stay there. The hotel looks unwelcoming even from a distance.\nI booked five rooms for my friends during my wedding, but the rooms were a big disappointment. They were dirty, bathrooms were blocked, blankets were dusty, no fresh air, and there were even hairs on the pillows. The cleaning staff only used room freshener, which didn't help much.\nThe hotel has a dance bar, and one of my female friends had a bad experience with some drunk people outside the hotel misbehaved with her when she was in a reserved e-rickshaw.\nOverall, the stay was terrible. I strongly advise avoiding this hotel.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very good food quality with great environment",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I found it very comforting.\nHope you get it too",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "One of the finest places in the locality, with a homely Ambience and a cordial staff that make you feel like family serving you exceptionally tasty and good food served in a jiffy. You will leave this place with a hangover but not mainly of alcohol but of the beautiful moments you'll make here with friends and the moments you create here",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This food quality was Awesome.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "gave k hotel one star cant give zero honestly better sleep road stay hotel looks unwelcoming even distance booked five rooms friends wedding rooms big disappointment dirty bathrooms blocked blankets dusty fresh air even hairs pillows cleaning staff used room freshener didnt help much hotel dance bar one female friends bad experience drunk people outside hotel misbehaved reserved erickshaw overall stay terrible strongly advise avoiding hotel",
                "good food quality great environment",
                "found comforting hope get",
                "one finest places locality homely ambience cordial staff make feel like family serving exceptionally tasty good food served jiffy leave place hangover mainly alcohol beautiful moments youll make friends moments create",
                "food quality awesome"
            ]
        },
        {
            "name": "Bongo Darbar",
            "rating": [
                4.1
            ],
            "address": [
                "58, N.S.Avenue, Serampore, Kolkata, West Bengal 712201, India"
            ],
            "reviews": [
                {
                    "text": "Last night we visited this place the ambiance was great and the food quality was also great....\nSpecial thanks to my friend #Sujay ghosh for suggesting this restaurant...\nIn one word i would like to say that I'm totally satisfied.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Food quality is good\nServices also ok\nAtmosphere is quite good.\n\nBiriyani and Sizzling brownie with ICE cream not find up to the mark.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Undoubtedly, Bongo Darbar is one of the best restaurants of Serampore to get the hunger satisfied from a wide range of menu.\nWe tried Fish Fry (Bhetki), Beer Batter Fish Finger, Mexican Grilled Sizzler (Chicken), Cheese Garlic Naan, Rara Mutton, Blue Lagoon & Death by Chocolate. Very few restaurants, in this locality, serve the pieces of Mutton as soft as Bongo Darbar does.\nApart from the scrumptious food, one must admire their ambience, as well. You can enjoy your lunch/dinner with friends, family, colleagues or your loved ones.\nYou can give it a try, you’ll not be disappointed for sure.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very Nice Ambience. Food quantity and quality both are superb . I really appreciate.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place for family and friends, I liked both the food and atmosphere.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "last night visited place ambiance great food quality also great special thanks friend sujay ghosh suggesting restaurant one word would like say im totally satisfied",
                "food quality good services also ok atmosphere quite good biriyani sizzling brownie ice cream find mark",
                "undoubtedly bongo darbar one best restaurants serampore get hunger satisfied wide range menu tried fish fry bhetki beer batter fish finger mexican grilled sizzler chicken cheese garlic naan rara mutton blue lagoon death chocolate restaurants locality serve pieces mutton soft bongo darbar apart scrumptious food one must admire ambience well enjoy lunchdinner friends family colleagues loved ones give try youâ\u0080\u0099ll disappointed sure",
                "nice ambience food quantity quality superb really appreciate",
                "good place family friends liked food atmosphere"
            ]
        },
        {
            "name": "Barrackpore",
            "rating": [
                4.6
            ],
            "address": [
                "Q96C+CPG, Barrackpore, West Bengal 700120, India"
            ],
            "reviews": [
                {
                    "text": "A beautiful historical place on the bank of The Ganga to visit any day. Total six Lord Shiva temples are there along with Main Temple & Nat Mandir.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "My hometown love for the city and one of the best historical place is Barrackpore and also famous for various freedom fighters like Mangal Pandey and Mahatma Gandhi etc...",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "My hometown. Another place for your favourite plate of Dada Boudi biriyani. Also try Durga mistanno bhandar.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Old rail junction but it may creat prblm for new passengers to choose which overbridge to go platform *1, 1A, 2",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "An old town which is now very advanced in terms of amenities and hospitals.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful historical place bank ganga visit day total six lord shiva temples along main temple nat mandir",
                "hometown love city one best historical place barrackpore also famous various freedom fighters like mangal pandey mahatma gandhi etc",
                "hometown another place favourite plate dada boudi biriyani also try durga mistanno bhandar",
                "old rail junction may creat prblm new passengers choose overbridge go platform",
                "old town advanced terms amenities hospitals"
            ]
        },
        {
            "name": "OYO HotelOYO Biswas Global Group",
            "rating": [
                3.6
            ],
            "address": [
                "near SIDDHA WATERFRONT, Math Para, Titagarh, Khardaha, Kolkata, West Bengal 700118, India"
            ],
            "reviews": [
                {
                    "text": "Its not so much of a hotel, than a guest house or a lodge. The rooms are small and cozy and the bath was average. The housekeeping was great and done by a very helpful gentleman.\nThe location is a big letdown as its far from many important areas of Sodepur and in a rather remote part of the town. The guesthouse is locked at night so late night visit/departure has to be agreed with the housekeeping to unlock the gates. Breakfast and everything has to be done outside.\nWould not recommend",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Really this hotel is a hidden gem… their hospitality is absolutely good… Also room & food prices are quite reasonable and drinks are a little bit higher…\nI definitely recommend you visit this hotel… Beside location easily accessible by three railway stations Barrackpore (2 mile), Titagarh (1 mile approx) and Khardaha (1.2 mile)…\nAt least the room is much cleaner than other hotels…",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "This is new oyo ?\nUnmarried couple are allowed?\nAny contact number",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Oyo not available",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "much hotel guest house lodge rooms small cozy bath average housekeeping great done helpful gentleman location big letdown far many important areas sodepur rather remote part town guesthouse locked night late night visitdeparture agreed housekeeping unlock gates breakfast everything done outside would recommend",
                "really hotel hidden gemâ\u0080¦ hospitality absolutely goodâ\u0080¦ also room food prices quite reasonable drinks little bit higherâ\u0080¦ definitely recommend visit hotelâ\u0080¦ beside location easily accessible three railway stations barrackpore mile titagarh mile approx khardaha mileâ\u0080¦ least room much cleaner hotelsâ\u0080¦",
                "new oyo unmarried couple allowed contact number",
                "oyo available",
                "nice"
            ]
        }
    ]
}