{
    "places_with_reviews": [
        {
            "name": "Hotel Peak Bound",
            "rating": [
                4.4
            ],
            "address": [
                "Teh, Panchrukhi, Chhatar, Himachal Pradesh 176103, India"
            ],
            "reviews": [
                {
                    "text": "I happened to be at Hotel Peak Bound a few days back at my neice's marriage. All the things were taken care of very nicely. The rooms and the cuisine were very good. The manager and staff members assisted us very well in the best possible manner. The rooms were elegant and luxurious. I myself found the place very nice for any kind of occasion....Consider my review if you are looking for a place for marriage, ring ceremonies, birthday parties etc.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Very nice hotel, we had great experience and we all enjoyed a lot during our stay. Great ambiance and staff is very good at their work and well trained.😀👍. The quality of food is also amazing. Thanks for making our stay and event memorable and enjoyable.we had a great and even new kind of experience of hospitality as the staff here was so helpful. Again thank you so much for making our event memorable.We would like to visit again soon.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I Stayed in the hotel this month with my family. It is very neat and clean hotel and staff is also very nice.\nI wanted to mention that I forgot my Shirt in the hotel and after coming back from the hotel when I called the hotel staff they confirmed it and couriered my shirt to my address. Very honest staff.\nI recommend to choose this hotel for your safe and enjoyable stay.\nThanks",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Best place for marriage. Food is awesome. Arrangements,staff, ambiance everything is perfect. Perfect place . budget friendly. I m fully satisfied with this place. Specially kewal kishan g is very good in handling and managing things. A big thanks to hotel peak bound for making my marriage so special.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently had the pleasure of booking this Hotel for my Sister's wedding on 14th Feb, 2024 and I couldn't be happier with the experience. From start to finish, everything was seamless and professional.\n\nThe staff at the hotel went above and beyond to ensure that every detail was taken care of. The event spaces were beautifully decorated, and the ambiance was just right for a joyous celebration.\n\nThe rooms were spacious, comfortable, and well-appointed. The hotel's attention to cleanliness and hygiene was commendable.\n\nThe catering team prepared a delectable spread that catered to various tastes and dietary preferences. Our guests raved about the flavors and presentation.\n\nWhat truly stood out was the personalized services we received by the hotel staff and specially the Manager (Mr. K.K Sharma). The Manager is at your service before and during the event. No matter what the time is, he is always there to assist you.\n\nI highly recommend Hotel Peak Bound for anyone planning a wedding or any special occasion. The hotel can easily accommodate 250-300 persons at a time.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "happened hotel peak bound days back neices marriage things taken care nicely rooms cuisine good manager staff members assisted us well best possible manner rooms elegant luxurious found place nice kind occasionconsider review looking place marriage ring ceremonies birthday parties etc",
                "nice hotel great experience enjoyed lot stay great ambiance staff good work well trainedð\u009f\u0098\u0080ð\u009f\u0091\u008d quality food also amazing thanks making stay event memorable enjoyablewe great even new kind experience hospitality staff helpful thank much making event memorablewe would like visit soon",
                "stayed hotel month family neat clean hotel staff also nice wanted mention forgot shirt hotel coming back hotel called hotel staff confirmed couriered shirt address honest staff recommend choose hotel safe enjoyable stay thanks",
                "best place marriage food awesome arrangementsstaff ambiance everything perfect perfect place budget friendly fully satisfied place specially kewal kishan g good handling managing things big thanks hotel peak bound making marriage special",
                "recently pleasure booking hotel sisters wedding th feb couldnt happier experience start finish everything seamless professional staff hotel went beyond ensure every detail taken care event spaces beautifully decorated ambiance right joyous celebration rooms spacious comfortable wellappointed hotels attention cleanliness hygiene commendable catering team prepared delectable spread catered various tastes dietary preferences guests raved flavors presentation truly stood personalized services received hotel staff specially manager mr kk sharma manager service event matter time always assist highly recommend hotel peak bound anyone planning wedding special occasion hotel easily accommodate persons time"
            ]
        },
        {
            "name": "Signature Nest Hotel & Restaurant -Best Hotel in Palampur",
            "rating": [
                4.8
            ],
            "address": [
                "NH154, Sungal, Mat, Himachal Pradesh 176061, India"
            ],
            "reviews": [
                {
                    "text": "Staff is ultimate and too eco friendly with everyone..... happiness on their faces...\nRoom are well furnished ❤️🫂",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I visited this place on 26th dec with my family.\nPlace was quite good,well maintained nice and clean.\nStaff was very polite and very attentive.\nFood was amazing.\nHighly recommended to all.\nThanks",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Excellent room, good hospitality & very polite staff.\n\nImpressed with hotel cleaness",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "wonderful place to stay in.. parking space available.. food preparation is good... friendly staff..",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Must try their lemon chicken, and crispy corn.awesome place to hangout with friends.nice ambience and service.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff ultimate eco friendly everyone happiness faces room well furnished â\u009d¤ï¸\u008fð\u009f « \u0082",
                "visited place th dec family place quite goodwell maintained nice clean staff polite attentive food amazing highly recommended thanks",
                "excellent room good hospitality polite staff impressed hotel cleaness",
                "wonderful place stay parking space available food preparation good friendly staff",
                "must try lemon chicken crispy cornawesome place hangout friendsnice ambience service"
            ]
        },
        {
            "name": "Do Pal Hotel & Restaurant",
            "rating": [
                4.3
            ],
            "address": [
                "palampur, 3HHR+96V, Mandi - Pathankot Rd, Sungal, Mat, Himachal Pradesh 176061, India"
            ],
            "reviews": [
                {
                    "text": "Very good food and great people, location is at its best, wheel chair entrance and yumm.....!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "This is the best restaurant to have tasty pure veg food.\nAll the dishes were tasty and freshly prepared, just homely like experience.\nWe ordered sandwiches, puri bhaaji and paratha.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "What a place... If u want to eat food which we made in our home then u should definately try this restaurant.\nStaff is friendly and kind\nFood are awesome\nOwner is very kind and humble.\nAt last I would like to say that this restaurant deserves 5 star.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very gud family restaurant.  Well cooperated staff. This restaurant is value for money.  I have taken dinner last tym and mutton curry was awesome. Lime soda they make is great.. very gud point in palampur  baijnath road....",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "After a highly energetic and tiring ride, we stopped at this restruant which was the only place open anyways. We ordered Veg biryani and raitha and at that late hours they gave us piping hot biryani. The taste and texture was just amazing. Will surely recommend this place if you are mid way between Palampur and Baijnath.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good food great people location best wheel chair entrance yumm",
                "best restaurant tasty pure veg food dishes tasty freshly prepared homely like experience ordered sandwiches puri bhaaji paratha",
                "place u want eat food made home u definately try restaurant staff friendly kind food awesome owner kind humble last would like say restaurant deserves star",
                "gud family restaurant well cooperated staff restaurant value money taken dinner last tym mutton curry awesome lime soda make great gud point palampur baijnath road",
                "highly energetic tiring ride stopped restruant place open anyways ordered veg biryani raitha late hours gave us piping hot biryani taste texture amazing surely recommend place mid way palampur baijnath"
            ]
        },
        {
            "name": "Hotel Royal Valleys-Restaurant & Banquet Hall",
            "rating": [
                4.1
            ],
            "address": [
                "Village Balu Panchrukhi Palampur Road P O Saliana, Distt, opposite Radha Swami Satsang Dera, Palampur, Majhenu, Himachal Pradesh 176103, India"
            ],
            "reviews": [
                {
                    "text": "Good place for conducting a meeting",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Well maintained, well service",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Beautiful place for stay ,,,, beautiful,,clean rooms",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Located Near Saliana , Panchrukhi. Do Visit",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place conducting meeting",
                "well maintained well service",
                "beautiful place stay beautifulclean rooms",
                "located near saliana panchrukhi visit"
            ]
        },
        {
            "name": "Modernite hotel",
            "rating": [
                4.4
            ],
            "address": [
                "3HFV+JW8, Gangoh, Himachal Pradesh 176081, India"
            ],
            "reviews": [
                {
                    "text": "I m so happy after visiting this hotel because of Delicious food ,friendly behaviour of staff ..everything is best ....",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Food was very good rates are normal. Place and view is fantastic.  love the place.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "very bad room & amenities are very bad only a bed in room and the linen is very dirty  slow service\nNot recommended",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Iam so happy after visiting this property",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Good food and warm regards",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "happy visiting hotel delicious food friendly behaviour staff everything best",
                "food good rates normal place view fantastic love place",
                "bad room amenities bad bed room linen dirty slow service recommended",
                "iam happy visiting property",
                "good food warm regards"
            ]
        },
        {
            "name": "OYO Home 73820 Megh Raj Villa",
            "rating": [
                4.3
            ],
            "address": [
                "Near Rathan Bus Stop, Panchrukhi, Palampur, Holsu, Himachal Pradesh 176081, India"
            ],
            "reviews": [
                {
                    "text": "The rooms were clean, very comfortable,  Best Homestay in palampur  I highly recommend this hotel for anyone visiting Palampur  👍👍👍.....",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice room. Well maintained and having all required facilities.👌👍",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Best homestay for stay in palampur",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "It's infrastructure and interior designing is too good",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Worst hotel",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "rooms clean comfortable best homestay palampur highly recommend hotel anyone visiting palampur ð\u009f\u0091\u008dð\u009f\u0091\u008dð\u009f\u0091\u008d",
                "nice room well maintained required facilitiesð\u009f\u0091\u008cð\u009f\u0091\u008d",
                "best homestay stay palampur",
                "infrastructure interior designing good",
                "worst hotel"
            ]
        },
        {
            "name": "Megh Raj Villa-Hotel in palampur /Homestay in palampur",
            "rating": [
                4
            ],
            "address": [
                "3G7V+3QX, Po, Vill, Holsu, Deogran, Himachal Pradesh 176061, India"
            ],
            "reviews": [
                {
                    "text": "Love this place",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Best place",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "love place",
                "best place"
            ]
        },
        {
            "name": "Shilpa hotel and restaurant",
            "rating": [
                4.8
            ],
            "address": [
                "3HJ3+VWM, Tanda Rd, Kangra, Bihar, Himachal Pradesh 176001, India"
            ],
            "reviews": [
                {
                    "text": "#staff is very good 😋😋",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Excellent",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff good ð\u009f\u0098\u008bð\u009f\u0098\u008b",
                "good",
                "excellent"
            ]
        },
        {
            "name": "lvdon ka gaon",
            "rating": [
                "Unknown"
            ],
            "address": [
                "3H29+5Q6, Chhatar, Himachal Pradesh 176103, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "OYO 83868 Himavat",
            "rating": [
                "Unknown"
            ],
            "address": [
                "2HV9-38, Palampur, Andreta, Himachal Pradesh 176103, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}