{
    "places_with_reviews": [
        {
            "name": "Dew Drops Farm Resorts by Maat Hotels",
            "rating": [
                4.5
            ],
            "address": [
                "Mankulam Road Kallar - Vattiyar, 2XW5+8XP Kallar Valley, PO, Munnar, Kerala 685611, India"
            ],
            "reviews": [
                {
                    "text": "Visited Dew drops Munnar for two days. It has great location, very neat and spacious room, food was excellent. Service from staff was very good. This is located in a huge plantation property, you will feel very close to nature and whoever prefers to stay away from city and crowd can happily enjoy here. They even provide Jeep service to go around near by places, visited a couple of places and it was very good. I booked plantation stay and farm stay both categories and both rooms were very very good. There is a cattle farm, there are few other animals that are sheltered here.Overall a very good experience of visiting here. Keep up the good work the whole team of Dew drops.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We stayed here for 2 nights.\n\nPositives:\nThe best part about this property is its location. It is deeply nested in the nature, totally cut off from the modern noise. Ideal for peace lovers.\n\nAlthough not much options in the food department, still the same was tasty.\n\nThe service was quick. The staff was very helpful and friendly.\n\nThe rooms were clean, decent and value for money. The bathroom, toilets were clean too.\n\nNegatives:\nThere was no ventilation in the room. There were windows available but without grills. If u keep the windows open anyone could enter easily. I think window grills will solve the problem here.\n\nSince the property is deeply nested, the only way to reach there is through a off roading of approx 5 minutes by a jeep service provided by the hotel management. Not suitable for senior citizens. I think if road quality is improved it will solve the problem here.\n\nAll in all 4/5 stars",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We stayed there for 3 nights. We were given normal plantation view rooms for first 2 nights and honeymoon cottage, the third day. Honeymoon cottages are costlier, spacious but we didn't like it.\nLighting is not proper. Bathroom very small with not much space for cloth hanging. Not very clean. Plantation view rooms were clean. TV didn't work due to some cable connection problem for first 2 days.\nFood has to be ordered 40 mins before but food was good. Not much options for vegetarian though.\nVery distant from Munnar town & other sight seeing places. It'll cost money for transportation and this is not worth all the effort & money. Can go for other better options at this cost.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "We went on a family trip recently to munnar. On 4th April 2024 we reached dew drops by afternoon, the welcome was very pleasing, staffs were kind and helpful.\nThe ambience is very nice, you will be living along with nature. The rooms are clean and neat, the washroom too is very clean. Food was really delicious.\nWe stayed two nights in plantation view rooms, these rooms were quite hot during the day ( we went in the wrong season..) and one night in farm view, that is the best experience, you get the feeling of being in middle of a jungle away from the roads, crowds and the city.\nThere's also games and other activities like cycling, fishing and camping too.\nOverall a wonderful place for families and friends for a vacay in the woods.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "It's inside a large private farm and has two resorts in different places. So photos seen while booking might be confusing.\nFarm Stay location is amazing, quite deep inside the farm. But with average room, food and service.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited dew drops munnar two days great location neat spacious room food excellent service staff good located huge plantation property feel close nature whoever prefers stay away city crowd happily enjoy even provide jeep service go around near places visited couple places good booked plantation stay farm stay categories rooms good cattle farm animals sheltered hereoverall good experience visiting keep good work whole team dew drops",
                "stayed nights positives best part property location deeply nested nature totally cut modern noise ideal peace lovers although much options food department still tasty service quick staff helpful friendly rooms clean decent value money bathroom toilets clean negatives ventilation room windows available without grills u keep windows open anyone could enter easily think window grills solve problem since property deeply nested way reach roading approx minutes jeep service provided hotel management suitable senior citizens think road quality improved solve problem stars",
                "stayed nights given normal plantation view rooms first nights honeymoon cottage third day honeymoon cottages costlier spacious didnt like lighting proper bathroom small much space cloth hanging clean plantation view rooms clean tv didnt work due cable connection problem first days food ordered mins food good much options vegetarian though distant munnar town sight seeing places itll cost money transportation worth effort money go better options cost",
                "went family trip recently munnar th april reached dew drops afternoon welcome pleasing staffs kind helpful ambience nice living along nature rooms clean neat washroom clean food really delicious stayed two nights plantation view rooms rooms quite hot day went wrong season one night farm view best experience get feeling middle jungle away roads crowds city theres also games activities like cycling fishing camping overall wonderful place families friends vacay woods",
                "inside large private farm two resorts different places photos seen booking might confusing farm stay location amazing quite deep inside farm average room food service"
            ]
        },
        {
            "name": "Willmount Cabin Homes, Munnar",
            "rating": [
                4.7
            ],
            "address": [
                "8 Acre, Kallar Vattiyar, Kerala 685565, India"
            ],
            "reviews": [
                {
                    "text": "It was an amazing experience we had at Willmount, Munnar. This place is a great option if you want to spend quality time with nature.This place is situated at a hill areas where the accommodation is in a tree cabin which we can face a beautiful view of the area and has a fine surroundings enriched with wonderful plantations along with chairs to sit.We loved the atmosphere and hospitality offered at Willmount, the staffs were also very friendly & caring. And the trekking was the best part of the all.Thank you Willmount for wonderful experience..",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It was an overall great experience with lovely view, compact and comfortable rooms. Staffs were very friendly, services were topnotch. More than these the food here was a cherry on the cake, fresh and home made. The ambience was awesome one.Small suggestion from our side that a dressing mirror and room freshner could have been placed otherwise all arrangements were good.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "The stay was excellent. The resort's staff was amiable. We asked the resort staff to set up a Jeep safari, and the Jeep safari was excellent as well. The driver took us off-road and visited a few mesmerizing viewpoints and tea plantations.\n\nWe spent two nights there. A-Frame on one night and Square Cabin-1 on the other. Both rooms had an incredible view. 🏕️\n\nWe had a great time by the CAMPFIRE. The campfire was expertly planned by the team. We listened to the guest stories/songs and also played Dumb Charades. Danced after a while at the end. We had a great time, it was so much fun. ✨\n\nWithout a doubt, we will visit the resort again!!\n\nRecommendations:\n- Place way boards to direct people to the property.\n- Can build up a shared eating space. currently, meals are brought straight to the room.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Just wow experience. After a 4 day Kerala trip booked Willmount cabin home for taking some good rest under green before leaving back. But Just last day turned out to be one of best with adventurous trek for sunset view, one of best camp fire talks with Willmount and guest crew ever. And my God view from room keeps you wondering the wonder of nature. Best crew for happy and safe stay. Thanks everyone guys.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Had a lovely time unwinding from the daily mundane routine. The service is amazing , entire staff is very friendly and helpful. The view from the cabins are captivating. The location is very peaceful and away from the hustle and bustle. And how can I forget the amazing trekking to Pettimudi hill too for the sunset. Thank you Akshay , Subin and rest of the staff for making our stay so enjoyable. And yea there was bonfire too !",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "amazing experience willmount munnar place great option want spend quality time naturethis place situated hill areas accommodation tree cabin face beautiful view area fine surroundings enriched wonderful plantations along chairs sitwe loved atmosphere hospitality offered willmount staffs also friendly caring trekking best part allthank willmount wonderful experience",
                "overall great experience lovely view compact comfortable rooms staffs friendly services topnotch food cherry cake fresh home made ambience awesome onesmall suggestion side dressing mirror room freshner could placed otherwise arrangements good",
                "stay excellent resorts staff amiable asked resort staff set jeep safari jeep safari excellent well driver took us offroad visited mesmerizing viewpoints tea plantations spent two nights aframe one night square cabin rooms incredible view ð\u009f\u008f\u0095ï¸\u008f great time campfire campfire expertly planned team listened guest storiessongs also played dumb charades danced end great time much fun â\u009c¨ without doubt visit resort recommendations place way boards direct people property build shared eating space currently meals brought straight room",
                "wow experience day kerala trip booked willmount cabin home taking good rest green leaving back last day turned one best adventurous trek sunset view one best camp fire talks willmount guest crew ever god view room keeps wondering wonder nature best crew happy safe stay thanks everyone guys",
                "lovely time unwinding daily mundane routine service amazing entire staff friendly helpful view cabins captivating location peaceful away hustle bustle forget amazing trekking pettimudi hill sunset thank akshay subin rest staff making stay enjoyable yea bonfire"
            ]
        },
        {
            "name": "Ela Ecoland Munnar - A Nature Retreat",
            "rating": [
                4.4
            ],
            "address": [
                "Mankulam Road, Kallar - Vattiyar, 2XRG+965, PO, Kallar Valley, Kerala 685611, India"
            ],
            "reviews": [
                {
                    "text": "My friend and I thoroughly enjoyed our stay at Ela Ecoland! The staff is friendly, welcoming, and helpful. They helped coordinate places to explore and activities to do in Munnar. The rooms are lovely with beautiful views. We enjoyed our meals and felt like we got authentic tasty Indian food from their restaurant. Overall we highly recommend staying here and will definitely be back in the future!",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Pleasant experience for lovers of greenery! We stayed in a luxury tent for 3 days and felt very comfortable. The room lacked a bit since some of the lights didn't work, kettle was broken and bathroom not ideal. But if you are just coming to sleep and enjoy the surroundings it will do! Great food service we loved the restaurant. The waters in front of the reception are lovely for a dip as well. The sounds of the birds will surprise you :)",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Treehouse was booked so we had the cottage overlooking the river, which was better than the treehouse. The view was lovely as the cottage is up high and the balcony  felt to be amongst the trees. A monkey visited us on our first night and I’m sure I saw fireflies! Birdlife in the morning was incredible. This place is right in a jungle. Food was good but the room was a bit small and needs a new coat of paint. Bed was comfortable . Wifi strong.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Location was superb, i had initially booked the tree house. It was pretty old and didn't look safe. Also, it wasn't properly cleaned. However hotel staff gave me another room. Dont book tree and luxury tent if you have problem in climbing huge stairs. Food could be better. Staff is very kind. Also they dont serve food in tree house so we changed.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "India is a beautiful country. There's no doubt about that, but after a while you also enjoy peace and quiet and nature. You get all that here.\nWe had half board and the breakfast and dinner were excellent and plentiful.\nOur tent was very spacious and clean. Hot water was available.\nYou should be fit to walk to the apartments.\n\nWe went on our excursions with the local tourist guide, Jaison. Just ask for him at reception, you won't regret it.\n\nAll in all, just a great place with nice people.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "friend thoroughly enjoyed stay ela ecoland staff friendly welcoming helpful helped coordinate places explore activities munnar rooms lovely beautiful views enjoyed meals felt like got authentic tasty indian food restaurant overall highly recommend staying definitely back future",
                "pleasant experience lovers greenery stayed luxury tent days felt comfortable room lacked bit since lights didnt work kettle broken bathroom ideal coming sleep enjoy surroundings great food service loved restaurant waters front reception lovely dip well sounds birds surprise",
                "treehouse booked cottage overlooking river better treehouse view lovely cottage high balcony felt amongst trees monkey visited us first night iâ\u0080\u0099m sure saw fireflies birdlife morning incredible place right jungle food good room bit small needs new coat paint bed comfortable wifi strong",
                "location superb initially booked tree house pretty old didnt look safe also wasnt properly cleaned however hotel staff gave another room dont book tree luxury tent problem climbing huge stairs food could better staff kind also dont serve food tree house changed",
                "india beautiful country theres doubt also enjoy peace quiet nature get half board breakfast dinner excellent plentiful tent spacious clean hot water available fit walk apartments went excursions local tourist guide jaison ask reception wont regret great place nice people"
            ]
        },
        {
            "name": "jüSTa Rangers Munnar Foothills, Kerala",
            "rating": [
                4.3
            ],
            "address": [
                "Minipady, Kochi, Aluva - Munnar Rd, Adimali, Kerala 685561, India"
            ],
            "reviews": [
                {
                    "text": "The stay here was pleasant. The staff are very friendly and helpful. The rooms are neat and includes necessary facilities. Annie Joseph, executive of house keeping is really pleasant and made us feel welcome. The front desk staffs are also pleasant, made our stay comfortable. The restaurant is amazing. The quality and taste of food is superb. The staffs are really hospitable and they made sure the food is upto our taste.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Visited in month of Feb'24, the hotel is very nice, the staff is too good and very helpful.\nWe stayed here for 2night. The rooms are very spacious and clean, food served by the kitchen team is too good.\nWould like to thanks Ajit, Annie, Surya and complete support staff. You all are doing a great job",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "I recently had the pleasure of staying in Justa Rangers Hotel for a two-day getaway, and I must say, it exceeded my expectations in every aspect. From the moment I arrived, I was greeted with warmth and hospitality, setting the tone for a delightful experience.\n\nAccommodation: The room I stayed in was impeccably clean, tastefully decorated, and provided all the amenities one could desire for a comfortable stay. The bed was plush and inviting, ensuring a restful night's sleep after a day of exploring the city.\n\nBreakfast: One of the highlights of my stay was the complimentary breakfast offered by the hotel. Each morning, I was greeted with a sumptuous spread from freshly baked pastries to made-to-order omelets, there was something to satisfy every palate. The quality of the food was exceptional, and the attentive staff ensured that my coffee cup was never empty.\n\nFacilities: The hotel boasts a range of facilities designed to enhance the guest experience.\n\nLocation: Situated along the picturesque mountain ,the hotel offers stunning views and convenient access to the city's main attractions.\n\nService: The service at the Hotel truly sets it apart. From the friendly front desk staff to the attentive housekeeping team, every member of the hotel staff went above and beyond to ensure that my stay was nothing short of exceptional. They were always ready to assist with any inquiries or requests, making me feel like a valued guest throughout my entire stay.\n\nOverall Experience: My two-day stay at Justa Rangers Hotel was nothing short of delightful. From the luxurious accommodations to the delectable breakfast and impeccable service, every aspect of my experience exceeded my expectations. I would highly recommend this hotel to anyone looking for a memorable and rejuvenating getaway. I cannot wait to return for another visit in the future.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Great hotel! We stopped randomly on our way to Munnar for a night and loved the comfortable room, cleanliness and smiling staff. They were very kind to show us all their room categories for us to choose a suitable room. The higher category rooms are very spacious but even the lower category ones are clean and comfortable.\n\nSpecial mention to Annie for the warm hospitality.\n\nThe food at the restaurant was nice and the restaurant staff was nice as well. Would definitely recommend to others.\n\nFollow @thatgoangirl for more hotel recommendations and travel tips..",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We are a big family. We took 5 rooms. All was good. Especially, the breakfast served was excellent. South Indian Vegetarian breakfast. Other services was great. Only problem is the hot water... Not hot at all.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stay pleasant staff friendly helpful rooms neat includes necessary facilities annie joseph executive house keeping really pleasant made us feel welcome front desk staffs also pleasant made stay comfortable restaurant amazing quality taste food superb staffs really hospitable made sure food upto taste",
                "visited month feb hotel nice staff good helpful stayed night rooms spacious clean food served kitchen team good would like thanks ajit annie surya complete support staff great job",
                "recently pleasure staying justa rangers hotel twoday getaway must say exceeded expectations every aspect moment arrived greeted warmth hospitality setting tone delightful experience accommodation room stayed impeccably clean tastefully decorated provided amenities one could desire comfortable stay bed plush inviting ensuring restful nights sleep day exploring city breakfast one highlights stay complimentary breakfast offered hotel morning greeted sumptuous spread freshly baked pastries madetoorder omelets something satisfy every palate quality food exceptional attentive staff ensured coffee cup never empty facilities hotel boasts range facilities designed enhance guest experience location situated along picturesque mountain hotel offers stunning views convenient access citys main attractions service service hotel truly sets apart friendly front desk staff attentive housekeeping team every member hotel staff went beyond ensure stay nothing short exceptional always ready assist inquiries requests making feel like valued guest throughout entire stay overall experience twoday stay justa rangers hotel nothing short delightful luxurious accommodations delectable breakfast impeccable service every aspect experience exceeded expectations would highly recommend hotel anyone looking memorable rejuvenating getaway wait return another visit future",
                "great hotel stopped randomly way munnar night loved comfortable room cleanliness smiling staff kind show us room categories us choose suitable room higher category rooms spacious even lower category ones clean comfortable special mention annie warm hospitality food restaurant nice restaurant staff nice well would definitely recommend others follow thatgoangirl hotel recommendations travel tips",
                "big family took rooms good especially breakfast served excellent south indian vegetarian breakfast services great problem hot water hot"
            ]
        },
        {
            "name": "Forest Haven Resort",
            "rating": [
                3.9
            ],
            "address": [
                "Vattayar, Post Office, Kallar - Mankulam Rd, Munnar, Kerala 685612, India"
            ],
            "reviews": [
                {
                    "text": "It's a good place admist the nature....a liite distant from the town....\nRoom are spacious....We had a balcony but u can't comfortably sit there as they are only metal seats....\nThe bathroom and the amenities were not up to the mark....It was like the rooms have not been used for a long time.\nBut I would really like to appreciate the staff from the helpers to the receptionist...all were very kind a d soft spoken..\nOn our demand they helped us to set  up a camp fire which was an awesome experience...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Had great experience here , for someone looking to escape city life will recommend this hotel.\n\nIt’s ideal for couples and family.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Such a wonderful ambience, Naturefriendly atmosphere. If we stay at there  ,we will get  good experience from their. Especially their staff are kept good manner and good service...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Receptionist Christina was very courteous and so were the entire staff and especially the food in charge manager. It was indeed a very pleasant stay at Munnar Forest Haven Resort. Location lives up to the name of the resort. Guys it's a must visit stay location if you love real forest surrounding with chirping birds to wake you up....Keep it up staff u r great in your service...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Best hotel staff and very clean and hygiene rooms. The view is so pleasant 😍. You should definitely try and Experience nature from her heart.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place admist naturea liite distant town room spaciouswe balcony u cant comfortably sit metal seats bathroom amenities markit like rooms used long time would really like appreciate staff helpers receptionistall kind soft spoken demand helped us set camp fire awesome experience",
                "great experience someone looking escape city life recommend hotel itâ\u0080\u0099s ideal couples family",
                "wonderful ambience naturefriendly atmosphere stay get good experience especially staff kept good manner good service",
                "receptionist christina courteous entire staff especially food charge manager indeed pleasant stay munnar forest resort location lives name resort guys must visit stay location love real forest surrounding chirping birds wake upkeep staff u r great service",
                "best hotel staff clean hygiene rooms view pleasant ð\u009f\u0098\u008d definitely try experience nature heart"
            ]
        },
        {
            "name": "Palm Tree Inn",
            "rating": [
                4.1
            ],
            "address": [
                "Palmtreeinn, Adimali, Kerala 685561, India"
            ],
            "reviews": [
                {
                    "text": "The incharge was friendly. Allowed us to upgrade to ac rooms. Neet and clean mainly spacious rooms. Car and bike parking available. Neat bathroom. Hot water available.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place to stay in munnar. Rooms are clean and spacious. Staff is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "This is not a hotel its a lodge. No room service boy. U have to carry your luggage by ur own. Very poor location. Its far away from munnar(30 km). Exact location is adimali, a cheap location. No lift and Ground floor room are on the road. U open the door and road starts. If u are in hurry to go to office then u can go for it. Otherwise a horrible experience u are going to have. I booked it for 3 days and then i have to book another hotel with no cancellation option. Never recommend to anyone.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good place neat and clean, not get hot water in morning",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Centre town adimali. Good service very responsive to the request. Good room with a hall and small balcony with town and hill view.  Got hot water in the morning. Good pricing. The only down side i think is that the staff are not in uniform, wearing casual dress.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "incharge friendly allowed us upgrade ac rooms neet clean mainly spacious rooms car bike parking available neat bathroom hot water available",
                "good place stay munnar rooms clean spacious staff also good",
                "hotel lodge room service boy u carry luggage ur poor location far away munnar km exact location adimali cheap location lift ground floor room road u open door road starts u hurry go office u go otherwise horrible experience u going booked days book another hotel cancellation option never recommend anyone",
                "good place neat clean get hot water morning",
                "centre town adimali good service responsive request good room hall small balcony town hill view got hot water morning good pricing side think staff uniform wearing casual dress"
            ]
        },
        {
            "name": "Falling Waters",
            "rating": [
                4.4
            ],
            "address": [
                "Kallar - Mankulam Rd, Kallar Vattiyar, Kerala 685561, India"
            ],
            "reviews": [
                {
                    "text": "It's a peaceful environment. You'll feel very relaxed throughout ur stay. And it's a family friendly spot. The food prepared by them were simply awesome. A small drawback is that You'll get a minimal options in your breakfast buffet.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Consider a 4.5 stars. This is one fabulous property for families and groups. Biggest credit to the wonderful location of the waterfall in the backyard and of course, Mr. Kiran. His service standards are no less than a five star hotel. The helper guy (who is studying on the weekends) is a gem. The only drawback for us was the distance from all the sightseeing places and limited breakfast options. Made our stay just perfect.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "This accommodation surpasses a 3-star rating; I experienced great relaxation and refreshment during my two-day stay. The service, food, and location were all excellent, making my Kerala trip truly memorable.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Really good atmosphere with very comfortable climate...I really like it's ambiance😍  but😪 the room was purely furnished especially the mattress and 🛏️😬😬😬...... Their food and service was satisfying😊....",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Excellent rooms, great service by staff and morning breakfast was good.\nService was quick and staff and manager was very responsive\nHighlight was private waterfall in resort with sooting sound of water flow.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "peaceful environment youll feel relaxed throughout ur stay family friendly spot food prepared simply awesome small drawback youll get minimal options breakfast buffet",
                "consider stars one fabulous property families groups biggest credit wonderful location waterfall backyard course mr kiran service standards less five star hotel helper guy studying weekends gem drawback us distance sightseeing places limited breakfast options made stay perfect",
                "accommodation surpasses star rating experienced great relaxation refreshment twoday stay service food location excellent making kerala trip truly memorable",
                "really good atmosphere comfortable climatei really like ambianceð\u009f\u0098\u008d butð\u009f\u0098ª room purely furnished especially mattress ð\u009f\u009b\u008fï¸\u008fð\u009f\u0098¬ð\u009f\u0098¬ð\u009f\u0098¬ food service satisfyingð\u009f\u0098\u008a",
                "excellent rooms great service staff morning breakfast good service quick staff manager responsive highlight private waterfall resort sooting sound water flow"
            ]
        },
        {
            "name": "Veetee Mid Town, Adimali, Munnar Road, Kerala",
            "rating": [
                4.2
            ],
            "address": [
                "Veetee Complex, Near Private, Bus Stand Road, Adimali, Kerala 685561, India"
            ],
            "reviews": [
                {
                    "text": "This restaurant is an excellent choice for group outings. The seating arrangement is well-suited for accommodating larger parties, making it a great spot for gatherings.\n\nThe food served here is not only delicious but also full of flavor. Every dish we tried was a delightful treat for our taste buds, although it's worth noting that the prices are on the higher side.\n\nThe restaurant maintains a high level of cleanliness, which is always reassuring for diners. The service was attentive and efficient, ensuring a pleasant dining experience.\n\nOverall, this restaurant has a premium feel, making it a top pick for those looking to enjoy good food in a comfortable and well-maintained setting, even if it comes at a slightly higher cost.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms are average. This is not even a 3 star property. If you’re looking a hotel for Munnar, don’t make a mistake like I did. As it’s 40 km away from Munnar and is situated in Adimali. We can say this is the best you can find in there but we planned for munnar not here. Nearby Annapurna restaurant is worth visiting.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Crazy location \"Adimali\" Munnar... beautiful... hotel was good .... but few cockrohes witnessed by us...Drainage issue in my friends room... Remember that it is a nice location, but it is 1:15 or 1:30 minutes away from actual munnar\n.. it consumes so much time, and it is advisable of adimali is not your exact choice then book hotel in Munnar itself...\nMOUNTAINS AND GHATS EVERYWHERE",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Amazing service....thank you very much team....food was too delicious must try biriyaani.....whole staff deserves an appreciation for the service they are offering.....I just loved the place....I will recommend every one to visit and try the delicious food and service at very affordable prices",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Excellent place to stay and very near to Adimali bus station.  Proximity to Munnar make this place an ideal location to stay and visit Munnar.  Neat and tidy rooms, excellent customer service and very good amenities makes us to visit there often.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "restaurant excellent choice group outings seating arrangement wellsuited accommodating larger parties making great spot gatherings food served delicious also full flavor every dish tried delightful treat taste buds although worth noting prices higher side restaurant maintains high level cleanliness always reassuring diners service attentive efficient ensuring pleasant dining experience overall restaurant premium feel making top pick looking enjoy good food comfortable wellmaintained setting even comes slightly higher cost",
                "rooms average even star property youâ\u0080\u0099re looking hotel munnar donâ\u0080\u0099t make mistake like itâ\u0080\u0099s km away munnar situated adimali say best find planned munnar nearby annapurna restaurant worth visiting",
                "crazy location adimali munnar beautiful hotel good cockrohes witnessed usdrainage issue friends room remember nice location minutes away actual munnar consumes much time advisable adimali exact choice book hotel munnar mountains ghats everywhere",
                "amazing servicethank much teamfood delicious must try biriyaaniwhole staff deserves appreciation service offeringi loved placei recommend every one visit try delicious food service affordable prices",
                "excellent place stay near adimali bus station proximity munnar make place ideal location stay visit munnar neat tidy rooms excellent customer service good amenities makes us visit often"
            ]
        },
        {
            "name": "JANNAH RESIDENCY",
            "rating": [
                3.6
            ],
            "address": [
                "Sivarams Building, Kochi-Madurai-Tondi Point Rd, Adimali, Kerala 685561, India"
            ],
            "reviews": [
                {
                    "text": "A good place for stay and breakfast on the way to destinations. Parking space is available with restrooms and the group tour can be managed and provided by the staff members in the hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Very bad food. Price was also over priced. They are getting customers who are coming for saphire restaurant. We also got fooled like that. Please be noted saphire restaurant shifted to next building.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Service can be improved a bit more and Location is good but no amble parking facility available",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Food was very bad. It was also overpriced. The toilet was just horrible.",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                },
                {
                    "text": "Mandhi is not good at all especially thier chutney with mandhi is very bad",
                    "languageCode": "en",
                    "rating": [
                        3.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good place stay breakfast way destinations parking space available restrooms group tour managed provided staff members hotel",
                "bad food price also priced getting customers coming saphire restaurant also got fooled like please noted saphire restaurant shifted next building",
                "service improved bit location good amble parking facility available",
                "food bad also overpriced toilet horrible",
                "mandhi good especially thier chutney mandhi bad"
            ]
        },
        {
            "name": "Wild Mist Munnar Homestay",
            "rating": [
                4.7
            ],
            "address": [
                "Kurisupara, Kottapara, Vattiyar, P.O, Kallar - Mankulam Rd, Munnar, Adimali, Kerala 685565, India"
            ],
            "reviews": [
                {
                    "text": "Clean Rooms, great Food and perfectly quiet Location with a view.\n\nOur Hostess is a gentle person with the best cooking skills. Dhal and Chicken curry was amazing. Asking for bigger portions was possible.\n\nFrom here you can go on a 20min morning hike to the hilltop that you see from your room. Munnar is 30-40min drive.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Perfectly clean and great sized rooms. Such a peaceful and green location. Lots of information given from the hosts. Run by the most lovely and helpful family.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Sunil and Sandhu are wonderful hosts! Keeping the place nice and tidy!\nVery happy to have stayed with them. Had to leave for family friend emergency. Otherwise would have stayed longer!",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good stay and homely food.Best stay for family with kids.We  stayed for 2 days and had 5 meal over there.Charges also nominal.Highly reccomend.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent location, beautiful place to chill, peaceful and heavenly.\nThe owners were very good.The breakfast served was very tasty.\nWould highly recommend.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean rooms great food perfectly quiet location view hostess gentle person best cooking skills dhal chicken curry amazing asking bigger portions possible go min morning hike hilltop see room munnar min drive",
                "perfectly clean great sized rooms peaceful green location lots information given hosts run lovely helpful family",
                "sunil sandhu wonderful hosts keeping place nice tidy happy stayed leave family friend emergency otherwise would stayed longer",
                "good stay homely foodbest stay family kidswe stayed days meal therecharges also nominalhighly reccomend",
                "excellent location beautiful place chill peaceful heavenly owners goodthe breakfast served tasty would highly recommend"
            ]
        }
    ]
}