{
    "places_with_reviews": [
        {
            "name": "Silverline Retreat Hotels Pvt Ltd",
            "rating": [
                4.2
            ],
            "address": [
                "Sandel Rock, Vazhavandhanadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "We as a group of six families stayed for two days. The ambience is very good.Sufficient car parking. Food is good by and large. Well maintained. Enjoyed IPL match (in big screen) at the open lounge. However the tariff is bit costly.. Overall we enjoyed the stay and the services are good.. Good place to stay in Kollihills for families and groups",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "If you want to explore unspoilt natural beauty, this is the place for you. The resort is very calm and adorable located at top of a hill. Very spacious rooms, vast garden area, childrens play area, indoor games, campfire and many more to keep you relaxed and enjoy with your family. The service is top notch and the staff are very courteous. I completely enjoyed my 2 days stay and special mention about the Management who helped me with the bookings at the last moment. Kudos SLR Team....",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "One of the best resorts we have been to. There are 2 floors of rooms, ground floor will have garden view.\n\nPros\n- Rooms are clean\n- Helpful staff\n- They serve complimentary tea and coffee in the garden.\n- They have lot of greenary. Garden everywhere. Kids can run around till they get tired\n- They lit up the garden area with lights in the night, which should not be missed\n- Kids play area has slides, swings etc\n- Good photo spots, hills views are breathtaking\n\nCons\n- No outside food allowed. Food that they provide is on expensive side and quantity is on the lower side",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Silverline retreat hotel is situate at Kolli Hills a small hill station in Tamilnadu.\n\nI want to extend my heartfelt appreciation for the impeccable architectural planning of the resort. Every detail, from the layout to the design elements, reflects a thoughtful and harmonious approach. It truly enhances the overall experience and makes for a memorable stay, creating such a stunning environment for guests to enjoy.\n\nI compliment the management for their attention to detail and meticulous daily maintenance of the property! It shines!\n\nI commend the exceptional service provided by the staff during my recent stay at the resort. Their kindness and attentiveness made me feel truly welcomed and valued as a guest.\n\nMoreover, I must mention the delicious food served in the restaurant; each dish was not only tasty but also served without delay.\n\nThank you for maintaining such high standards of service and for making my stay so enjoyable. Will certainly visit again.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Place is calm and quiet. For families and for get together it is a nice place. Last week we stayed there for 2 days and enjoyed every moment. No second thoughts to recommend this place. Rooms are quite spacious and well maintained. Location only just away from the main town.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "group six families stayed two days ambience goodsufficient car parking food good large well maintained enjoyed ipl match big screen open lounge however tariff bit costly overall enjoyed stay services good good place stay kollihills families groups",
                "want explore unspoilt natural beauty place resort calm adorable located top hill spacious rooms vast garden area childrens play area indoor games campfire many keep relaxed enjoy family service top notch staff courteous completely enjoyed days stay special mention management helped bookings last moment kudos slr team",
                "one best resorts floors rooms ground floor garden view pros rooms clean helpful staff serve complimentary tea coffee garden lot greenary garden everywhere kids run around till get tired lit garden area lights night missed kids play area slides swings etc good photo spots hills views breathtaking cons outside food allowed food provide expensive side quantity lower side",
                "silverline retreat hotel situate kolli hills small hill station tamilnadu want extend heartfelt appreciation impeccable architectural planning resort every detail layout design elements reflects thoughtful harmonious approach truly enhances overall experience makes memorable stay creating stunning environment guests enjoy compliment management attention detail meticulous daily maintenance property shines commend exceptional service provided staff recent stay resort kindness attentiveness made feel truly welcomed valued guest moreover must mention delicious food served restaurant dish tasty also served without delay thank maintaining high standards service making stay enjoyable certainly visit",
                "place calm quiet families get together nice place last week stayed days enjoyed every moment second thoughts recommend place rooms quite spacious well maintained location away main town"
            ]
        },
        {
            "name": "RVR Rejoice Villa Resorts Kolli Hills",
            "rating": [
                4.7
            ],
            "address": [
                "No:18/68, Osani Nagar Arapaleeswarar Temple Main Road Tempalam, Ariyur Nadu Kolli Hills, Ariyurnadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "I recently stayed at RVR rejoice hotel and had a fantastic experience. The room was impeccably clean and tastefully decorated, creating a cozy atmosphere. The bed was incredibly comfortable, providing a restful night's sleep. The amenities were top-notch, including a spacious bathroom with luxurious toiletries. The room service was prompt and the staff were friendly and accommodating. The view from the room was breathtaking, adding to the overall enjoyment of my stay. I highly recommend [Hotel Name] for anyone looking for a comfortable and enjoyable hotel experience.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Staffs and room services are extraordinary. Especially Mr. Prem, manager and Mr. Mani evening event manager are great. Their caring, patience are great.\nThe only point to consider is about the room. We took 113. It is very small. Living area, bed room are very small. To be consider.\nWe have to definitely say about the food. Food is excellent. Evening camp fire get together are super. Congrats and wishes to all staffs and to the management 👏",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good service and rooms.\nNeed to improve food taste special non veg items. Yesterday we tried chicken Chettinadu and chilly chicken both taste not good but fine. Fully bone. Try to chahe\n\nOthers service are super and location",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Worst experience...  Don't even try.. We should call and get everything....  The room cost is high.. There is no option to pay at the end, After ever order we should pay also unable use UPI as well...  Worst service.....  Please don't spoil your holiday.....",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This restaurant was very good.. not only that the worker who works here take good care of us.. especially the businessman named  𝙂𝙊𝙋𝙄𝙄 is a very important person. He spoke in such a way that my heart was suffering.. I appreciate him 😍",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently stayed rvr rejoice hotel fantastic experience room impeccably clean tastefully decorated creating cozy atmosphere bed incredibly comfortable providing restful nights sleep amenities topnotch including spacious bathroom luxurious toiletries room service prompt staff friendly accommodating view room breathtaking adding overall enjoyment stay highly recommend hotel name anyone looking comfortable enjoyable hotel experience",
                "staffs room services extraordinary especially mr prem manager mr mani evening event manager great caring patience great point consider room took small living area bed room small consider definitely say food food excellent evening camp fire get together super congrats wishes staffs management ð\u009f\u0091\u008f",
                "good service rooms need improve food taste special non veg items yesterday tried chicken chettinadu chilly chicken taste good fine fully bone try chahe others service super location",
                "worst experience dont even try call get everything room cost high option pay end ever order pay also unable use upi well worst service please dont spoil holiday",
                "restaurant good worker works take good care us especially businessman named ð\u009d\u0099\u0082ð\u009d\u0099\u008að\u009d\u0099\u008bð\u009d\u0099\u0084ð\u009d\u0099\u0084 important person spoke way heart suffering appreciate ð\u009f\u0098\u008d"
            ]
        },
        {
            "name": "Seattle Garden KolliHills",
            "rating": [
                4.6
            ],
            "address": [
                "Seattle Garden, 15/31, Puranikaadupatti, Valavanthinadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "Beautiful location surrounded by Greenery and forest. A good place for overnight stay along with friends and family.\n\nI recently visited the place with bunch of friends for a overnight stay. We booked two rooms with can occupy 6 and and other 4 people. They do not have bunker or dorms, they had two big queen size beds and requested additional mattress.\n\nThe bathroom are clean, so are the rooms. There is no AC room facilities but the weather was pleasant even in summer.\n\nYou have to order food, in advance. The food was delicious but they have limited options available.\n\nOverall it was a great experience only thing which I felt lacking was the hospitality of the staff.\n\nI recommend to visit the place for a overnight stay with friends and family",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We stayed here for a night and it was a nice place to stay. The rooms were neat and clean. The location is really nice between the green trees.\nThere is a small stream near the resort where you can play and walk around. They provide wifi even though mobile network is not there.\nThe food is really tasty and they have both veg and non veg options. The staffs are friendly and really a nice place to stay.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "I booked this place based on reviews and was disappointed. Rooms are pretty small. The food being served was made to order, small list of menu, and was not really as per my liking. Room was pretty clean, but yet we found few cockroaches. Parking , very limited narrow space available inside the premises. We had to wait for quite long time, so that the other cars parked behind us could clear way.Almost 1.5 hrs wasted, especially when you have come from a far away place, it makes no sense. Staff was pretty helpful. Overall it's an average experience.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "We stayed there for 2 days. Very calm place surrounded with nature. Good location accessible to all tourist places. Special mention to the food- it was great like home food. Overall one place to stay in Kolli Hills!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "It's one of the most beautiful stays I have had. The location is good. I like the rooms. The rooms were clean. The owner is nice. You have a trekking place inside the property and it's very beautiful.  When we went, all the rooms were full and so many people were there. So,  I felt service was a little slow. But, it's good. I don't mind going back there again.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful location surrounded greenery forest good place overnight stay along friends family recently visited place bunch friends overnight stay booked two rooms occupy people bunker dorms two big queen size beds requested additional mattress bathroom clean rooms ac room facilities weather pleasant even summer order food advance food delicious limited options available overall great experience thing felt lacking hospitality staff recommend visit place overnight stay friends family",
                "stayed night nice place stay rooms neat clean location really nice green trees small stream near resort play walk around provide wifi even though mobile network food really tasty veg non veg options staffs friendly really nice place stay",
                "booked place based reviews disappointed rooms pretty small food served made order small list menu really per liking room pretty clean yet found cockroaches parking limited narrow space available inside premises wait quite long time cars parked behind us could clear wayalmost hrs wasted especially come far away place makes sense staff pretty helpful overall average experience",
                "stayed days calm place surrounded nature good location accessible tourist places special mention food great like home food overall one place stay kolli hills",
                "one beautiful stays location good like rooms rooms clean owner nice trekking place inside property beautiful went rooms full many people felt service little slow good dont mind going back"
            ]
        },
        {
            "name": "RK Garden & Resort Kolli Hills",
            "rating": [
                4.9
            ],
            "address": [
                "Paruthimudi Privu, Thembalam, Melkalingampatty [P.o, Kolli Hills, Ariyurnadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "Very nice place for a laid-back vacation. Their service is prompt. Mild and nice food. Cook is very good and you can expect fresh and tasty food. Their rooms and atmosphere are very good but air-conditioning is a must during the day as its pretty hot. They have very few air-conditioned rooms.. That's a focus area.. Overall kolli doesn't have much attractions, so the expectation is to have good facilities in the resort, they are currently improving their facilities like swimming pool, play area. Price can be a little lower considering the current facilities.. A good experience as a family with 3 kids for us for a day.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "One of the best place for  family and friends. Good ambiance. Rooms are very neat and clean. Staff’s are very kind and supportive.\nThey are going to add swimming pool facilities so highly recommended",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We had stayed here after a long ride from Bangalore.\n\nPrice was decent, not too cheap not too expensive.\nIf you don't know Tamil you will have a bit of hard time communicating there.\nOverall nice stay",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "We had wonderful time.... So nice place...\nExcellent atmosphere... So comfortable..\nVery near to Arabaleeswarar temple, aagaya ganga... We stayed for 4 days... Guidance from friendly Rajesh Sir was very useful.. Room service is good, food arrangements was so nice.. .enjoyed Fire camp ...",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Awesome experience with the resort and the staff members. The room and the surroundings were clean. The cottages are compact and neatly maintained. The foods were served hot and they have a live kitchen, no complaints about the food. Overall the experience was amazing. Only draw back I would say is the network was weak, obviously can't expect in such remote places. Otherwise the  everything was perfect.\n\nWould visit one more time once the bamboo cottage constructions are completed.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place laidback vacation service prompt mild nice food cook good expect fresh tasty food rooms atmosphere good airconditioning must day pretty hot airconditioned rooms thats focus area overall kolli doesnt much attractions expectation good facilities resort currently improving facilities like swimming pool play area price little lower considering current facilities good experience family kids us day",
                "one best place family friends good ambiance rooms neat clean staffâ\u0080\u0099s kind supportive going add swimming pool facilities highly recommended",
                "stayed long ride bangalore price decent cheap expensive dont know tamil bit hard time communicating overall nice stay",
                "wonderful time nice place excellent atmosphere comfortable near arabaleeswarar temple aagaya ganga stayed days guidance friendly rajesh sir useful room service good food arrangements nice enjoyed fire camp",
                "awesome experience resort staff members room surroundings clean cottages compact neatly maintained foods served hot live kitchen complaints food overall experience amazing draw back would say network weak obviously cant expect remote places otherwise everything perfect would visit one time bamboo cottage constructions completed"
            ]
        },
        {
            "name": "Green Grass Residency, Kolli Hills",
            "rating": [
                4.8
            ],
            "address": [
                "Alawadi Post, Valapurnadu, Kolli Hills, 35/19, Pilandoor Pirivu Road, Valappurnadu, Tamil Nadu 637441, India"
            ],
            "reviews": [
                {
                    "text": "I've had an amazing experience here with family where we stayed for 2 nights. They provided a tasty complimentary breakfast and also you can order your lunch or dinner from them which is additional cost, They cook so well... Rooms are very neat and clean. This stay is located in a very good spot surrounded with nature all around.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "The place, stay was excellent! Need to improve with the service which is exceptional. Beautiful view from the rooms. Overall wonderful experience. Located a bit far from the town. Peaceful place.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very neat and clean room and rest room..Car parking and safety also good. The residency owner Mr.Ragupathy sir and their managers are very humble persons. The best resort for family and bachelors im Kolli hills.. Highly recommended",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Fantastic room stay in kolli hills morning 🌅 sunset is awesome.newly opened residency and rooms are very neat and clean .reasonable price compare with other resort and provide the complementary break fast . Fire camp🔥🔥 and DJ was awesome. Had a great new year celebration.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Best place to enjoy with family and friends. Excellent room service, cleanliness well maintained, awesome food and campfire was like a cherry on top. Amazon experience.\nThank you all for your service.\n\nMust visit place.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "ive amazing experience family stayed nights provided tasty complimentary breakfast also order lunch dinner additional cost cook well rooms neat clean stay located good spot surrounded nature around",
                "place stay excellent need improve service exceptional beautiful view rooms overall wonderful experience located bit far town peaceful place",
                "neat clean room rest roomcar parking safety also good residency owner mrragupathy sir managers humble persons best resort family bachelors im kolli hills highly recommended",
                "fantastic room stay kolli hills morning ð\u009f\u008c sunset awesomenewly opened residency rooms neat clean reasonable price compare resort provide complementary break fast fire campð\u009f\u0094¥ð\u009f\u0094¥ dj awesome great new year celebration",
                "best place enjoy family friends excellent room service cleanliness well maintained awesome food campfire like cherry top amazon experience thank service must visit place"
            ]
        },
        {
            "name": "AG Resort",
            "rating": [
                3.7
            ],
            "address": [
                "8934+68G, Solakkadu, Namakkal, Tamil Nadu 637001, India"
            ],
            "reviews": [
                {
                    "text": "I recently stayed at AG Resort in Kolli Hills and had a fantastic experience. The campfire was a highlight, creating a cosy and enjoyable atmosphere. The rooms were comfortable, and it was convenient to have access to RO water. They provided food and arranged surprise birthday party cakes for me to celebrate my wife's birthday, which were delightful. Overall, AG Resort made my stay memorable, and I highly recommend it for a relaxing getaway.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "No mobile signal , No TV,  No wifi , and No proper cleaning in toilet and room worst but cost is high",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "They scammed us with 2500 per night for 4 people. If u guys paying money in online kindly ask them a proper picture, which they have allocated to us.\nKind information those who are traveling from Chennai to kolli & u guys traveling in two wheeler.. strictly don't book this resort.\nIn other resorts with good toilet and safety and parking they charge just 1500/- for 6 peoples.\nSo be aware of this resort",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "The room was Good for the money….\nNice private place no disturbance and well maintained",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "No basic amenities (charging,no wifi,mobile network,room service),can't stand in bathroom (no washbasin,soapstand,bathroom mat)way too expensive for such a anthole.charging plug not available.no room for dressing table. Customer grievance are not accepted.Worst behaviour from employees.Cheap maintanence and smelly bedsheets (may cause allergies).Finally there are plenty of nice rooms for the same price range.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recently stayed ag resort kolli hills fantastic experience campfire highlight creating cosy enjoyable atmosphere rooms comfortable convenient access ro water provided food arranged surprise birthday party cakes celebrate wifes birthday delightful overall ag resort made stay memorable highly recommend relaxing getaway",
                "mobile signal tv wifi proper cleaning toilet room worst cost high",
                "scammed us per night people u guys paying money online kindly ask proper picture allocated us kind information traveling chennai kolli u guys traveling two wheeler strictly dont book resort resorts good toilet safety parking charge peoples aware resort",
                "room good moneyâ\u0080¦ nice private place disturbance well maintained",
                "basic amenities chargingno wifimobile networkroom servicecant stand bathroom washbasinsoapstandbathroom matway expensive antholecharging plug availableno room dressing table customer grievance acceptedworst behaviour employeescheap maintanence smelly bedsheets may cause allergiesfinally plenty nice rooms price range"
            ]
        },
        {
            "name": "Maasila Resort",
            "rating": [
                4.2
            ],
            "address": [
                "Nathukulli to maasila falls road, Kollihills, Nathukulli, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "Best experience nd with clean nd hygiene rooms gud service",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst service ..... saying bad about customers ...rude behaviour..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Simply waste no comments\nBetter avoid it",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very nice aria super cool location",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Neat And Clean Room With Naturastic Environment. Very Luxury Room",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best experience nd clean nd hygiene rooms gud service",
                "worst service saying bad customers rude behaviour",
                "simply waste comments better avoid",
                "nice aria super cool location",
                "neat clean room naturastic environment luxury room"
            ]
        },
        {
            "name": "Iyman Rooms",
            "rating": [
                4.8
            ],
            "address": [
                "793M+2MV, Unnamed Road, Valappurnadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "Cheap and best need to book earlier",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Contact number plzz",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Good 👍",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Very good place",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "cheap best need book earlier",
                "contact number plzz",
                "good ð\u009f\u0091\u008d",
                "good place",
                "good"
            ]
        },
        {
            "name": "A G Resort",
            "rating": [
                4
            ],
            "address": [
                "79RJ+3W, Ariyurnadu, Tamil Nadu 637411, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Seven Hills Residency",
            "rating": [
                4.2
            ],
            "address": [
                "Nedungappalli road, Elamatthi, Devanurnadu, Tamil Nadu 637411, India"
            ],
            "reviews": [
                {
                    "text": "Very very Good and clean very good type of people taking care with human care food excellent",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very bad.. Poor respect.. High room rent",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Very good place....nice people",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good clean good type people taking care human care food excellent",
                "bad poor respect high room rent",
                "good placenice people",
                "nice"
            ]
        }
    ]
}