{
    "places_with_reviews": [
        {
            "name": "Baramati Club",
            "rating": [
                4.2
            ],
            "address": [
                "Sayali hill, 5HFX+JV5, Bhigwan Road, Bhigwan Rd, Saily Nagar, Shiva Nagar, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "It was a good short overnight stay. Food is just ok. Don't expect too much. Rooms need Upkeep & Maintenance...",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Baramati Club offers a luxurious blend of excellent food, inviting ambiance, and impeccable service. With a range of activities including a swimming pool and gym, it's the perfect destination for indulgence and leisure. Highly recommended for a truly memorable experience.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Staying at Baramati Club Hotel, and it was a fantastic experience from start to finish. The staff was incredibly welcoming and attentive, making sure every aspect of my stay was comfortable.\n\nThe rooms were clean, spacious, and tastefully decorated, providing a cozy retreat after a day of exploring Baramati. The hotel's amenities were impressive, including a well-maintained pool and a gym that allowed me to stick to my fitness routine.\n\nWhat truly stood out was the exceptional service. The staff went above and beyond to cater to my needs, whether it was arranging transportation or providing recommendations for local attractions. The on-site restaurant offered a diverse menu with delicious options, satisfying my taste buds.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Hotel is good, rooms are specious. Staff is co operative. They serve food till 11 PM.\nLocation is a bit odd. No nearby market etc\nFood was good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We visited Baramati Club for official dinner party.. The pool, lighting and sound system for outdoor dinner seating was good.. so ambiance was very nice .. food was also very good.  Toilets are neglected or not clean hence 1 star less.. otherwise good experience..",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good short overnight stay food ok dont expect much rooms need upkeep maintenance",
                "baramati club offers luxurious blend excellent food inviting ambiance impeccable service range activities including swimming pool gym perfect destination indulgence leisure highly recommended truly memorable experience",
                "staying baramati club hotel fantastic experience start finish staff incredibly welcoming attentive making sure every aspect stay comfortable rooms clean spacious tastefully decorated providing cozy retreat day exploring baramati hotels amenities impressive including wellmaintained pool gym allowed stick fitness routine truly stood exceptional service staff went beyond cater needs whether arranging transportation providing recommendations local attractions onsite restaurant offered diverse menu delicious options satisfying taste buds",
                "hotel good rooms specious staff co operative serve food till pm location bit odd nearby market etc food good",
                "visited baramati club official dinner party pool lighting sound system outdoor dinner seating good ambiance nice food also good toilets neglected clean hence star less otherwise good experience"
            ]
        },
        {
            "name": "Hotel City Inn",
            "rating": [
                4.1
            ],
            "address": [
                "5H8W+FJP, Bhigwan Road, Shiva Nagar, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Excellent place in every aspect. The rooms were nice, spacious and aesthetically pleasing. Service was prompt, both in the restaurant as well as in room service. Food was delicious.\nParking was available and location was also good.\nReally enjoyed.\nThe only issue was with the bathroom, where the fixtures need to be changed. The paint on the door was peeling off which needs to be addressed.\nOtherwise, a really comfortable and enjoyable stay",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "3.5 of 5\nThere are no new hotels in baramati and you have dependency on city inn\nRooms needs a big screen\nBetter Toiletries\nCleaner rooms\nBreakfast is average\nThe hotel is loosing it charm\nBakery is average\nStreet food is good\nIn room dining experience was not pleasant",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The ambiance of the hotel is quite good. There is enough space for parking also. There are 2 sections one is fir tea and snacks and another one is for lunch and dinner. Both the segments are quite good. The breakfast ans snacks corner is quite good. The food quality and quantity is good enough. Taste of the food is awesome. We had wheat roti which was so soft. We loved the same.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms are good.\nWiFi is so week.\nTheir restaurant service is very slow you have to order at least १ hr before.\nLimited options in complimentary breakfast.\nThey provide only one mineral water bottle per day.\nOnly thing is located in good area.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "It took one hour just to make Maggie and there were finger stains of waiter on plate🤢🤢",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "excellent place every aspect rooms nice spacious aesthetically pleasing service prompt restaurant well room service food delicious parking available location also good really enjoyed issue bathroom fixtures need changed paint door peeling needs addressed otherwise really comfortable enjoyable stay",
                "new hotels baramati dependency city inn rooms needs big screen better toiletries cleaner rooms breakfast average hotel loosing charm bakery average street food good room dining experience pleasant",
                "ambiance hotel quite good enough space parking also sections one fir tea snacks another one lunch dinner segments quite good breakfast ans snacks corner quite good food quality quantity good enough taste food awesome wheat roti soft loved",
                "rooms good wifi week restaurant service slow order least à¥§ hr limited options complimentary breakfast provide one mineral water bottle per day thing located good area",
                "took one hour make maggie finger stains waiter plateð\u009f¤¢ð\u009f¤¢"
            ]
        },
        {
            "name": "Sitaram Lawns",
            "rating": [
                4.3
            ],
            "address": [
                "Rui, Mhasobawadi Road, Sawal, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Best atmosphere and nice garden . Beutiful place for photography.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good for marriage n all type of events parking available in ample size",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good Place for Wedding as well as All functions.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Very attractive and very good looking function Hall in baramati.at. saval near Rui village.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Nice place for open air event",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "best atmosphere nice garden beutiful place photography",
                "good marriage n type events parking available ample size",
                "good place wedding well functions",
                "attractive good looking function hall baramatiat saval near rui village",
                "nice place open air event"
            ]
        },
        {
            "name": "Hotel Amardeep",
            "rating": [
                3.7
            ],
            "address": [
                "5HCR+8X9, MSEB colony, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Big premises, sufficient parking. Easy approach. Rooms are average, need cleaning, Bathroom was not clean. Average amenities.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "No attention towards the guests at all even service is also very bad. Will not recommend to anyone",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good place to stay and celebrate...having big parking area, seminar or party hall for 150 persons. The environment is also fresh, and this hotel is near Baramati Bhigwan Road.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "A good hotel for budget freindly stay in Baramati. Service was also good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Worst hotel staff ever. Not friendly",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "big premises sufficient parking easy approach rooms average need cleaning bathroom clean average amenities",
                "attention towards guests even service also bad recommend anyone",
                "good place stay celebratehaving big parking area seminar party hall persons environment also fresh hotel near baramati bhigwan road",
                "good hotel budget freindly stay baramati service also good",
                "worst hotel staff ever friendly"
            ]
        },
        {
            "name": "Hotel Krishnasagar",
            "rating": [
                3.9
            ],
            "address": [
                "Baramati Bhigwan Road, Anand Nagar Colony, Ashok Nagar Colony, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Located on the main road and so is easily accessible to all. Ample parking space is available. Rooms are neat, clean and well maintained. Room service is good. The restaurant is spacious and well maintained. Room Tarrif is moderate with complimentary breakfast. Food quality of breakfast was very good. Only one suggestion for the management is to remove  or hide all the cleansing material like mops bucket etc. kept just by the side of sitting in the restaurant.  it looks very shabby.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This vegetarian restaurant and hotel is easily one of the great places to stay and have food in Baramati. Conveniently located on Bhigwan road with ample parking space, the service you get here is also great.\nPlease follow for more honest google reviews.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Multiple times the food provided was stale and had pungent smell. The manager confirmed it too. Even after complaints they have audacity to serve stale food. Pathetic. Hope the hotel closes down. Anybody new here in Baramati, visit the hotel at your own risk.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Service is lethargic. People are slow and lazy. My room TV was not working so I called reception to sort it out. The guy did not turn up for almost 40 min. I had to call back. Still he took 15 min. After working on it for 20 min he was still not able to sort it out. He just left by saying \"Recharge nahi hai\". I asked for Curd rice with tadka. He only served curd rice without tadka. When asked; he just looked at me as if I asked him for his kidney. In the room where I stayed at 107, the colour of the window wall was really shabby. The bathroom shower does not have force. You have to wait till you get wet. They need to really get things corrected.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Nice hotel for stay and dine. Rooms are speciaus, service is good. Did not expected this level of luxury hotel at a place like BARAMATI. Ample parking is available. Only thing you need to instruct test of food as per your choice. Because some dishes are pretty chilly.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located main road easily accessible ample parking space available rooms neat clean well maintained room service good restaurant spacious well maintained room tarrif moderate complimentary breakfast food quality breakfast good one suggestion management remove hide cleansing material like mops bucket etc kept side sitting restaurant looks shabby",
                "vegetarian restaurant hotel easily one great places stay food baramati conveniently located bhigwan road ample parking space service get also great please follow honest google reviews",
                "multiple times food provided stale pungent smell manager confirmed even complaints audacity serve stale food pathetic hope hotel closes anybody new baramati visit hotel risk",
                "service lethargic people slow lazy room tv working called reception sort guy turn almost min call back still took min working min still able sort left saying recharge nahi hai asked curd rice tadka served curd rice without tadka asked looked asked kidney room stayed colour window wall really shabby bathroom shower force wait till get wet need really get things corrected",
                "nice hotel stay dine rooms speciaus service good expected level luxury hotel place like baramati ample parking available thing need instruct test food per choice dishes pretty chilly"
            ]
        },
        {
            "name": "Hotel Sudit Executive",
            "rating": [
                3.9
            ],
            "address": [
                "Near swimming tank, Bhigwan Road, Pune(MS), Ambika Nagar, Pushpak Apartment, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Food service is good but food quality is very bad",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I have conducted get together here\nNice banquet hall for 70 to 80 persons",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "It has been a very bad place to visit...food quality is not good...please don't visit over here...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Good tasty food at a very slightly higher price.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Rooms are good but the toilet and bathroom are not maintained.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food service good food quality bad",
                "conducted get together nice banquet hall persons",
                "bad place visitfood quality goodplease dont visit",
                "good tasty food slightly higher price",
                "rooms good toilet bathroom maintained"
            ]
        },
        {
            "name": "Hotel Shree Abhishek",
            "rating": [
                3.8
            ],
            "address": [
                "Bhigwan Rd, Saily Nagar, Shiva Nagar, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Visited First time the Hotel for Lunch. Food quality was good. However Hotel needs to be upgraded in terms of Interior and furniture.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "This a good Hotel located in Baramati. It's at the centre of the city and located quite close to major areas in Baramati.\nRooms are good and clean. Washrooms are clean as well. It's a family friendly hotel.\nThe hotel has a family restaurant as well as a Bar and restaurant. The food is good and room service is also available.\nTowel and soap was provided.\nStaff is helpful.\nOne improvement is that in the rooms that have window-ACs , the the ACs need to be maintained better. Also switches in the room are quite old, which need to be upgraded.\nOverall,a good budget friendly hotel.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Rooms need to colour again as this impression makes the customer unhappy.....Also window AC and split AC room rate has a difference still Split AC making too much noise as that of Window AC.....   I will not prefer next time.When asked for a corporate discount ..... No discount was given.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Food quality ossam and best service",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good hotel, best service,very good food",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "visited first time hotel lunch food quality good however hotel needs upgraded terms interior furniture",
                "good hotel located baramati centre city located quite close major areas baramati rooms good clean washrooms clean well family friendly hotel hotel family restaurant well bar restaurant food good room service also available towel soap provided staff helpful one improvement rooms windowacs acs need maintained better also switches room quite old need upgraded overalla good budget friendly hotel",
                "rooms need colour impression makes customer unhappyalso window ac split ac room rate difference still split ac making much noise window ac prefer next timewhen asked corporate discount discount given",
                "food quality ossam best service",
                "good hotel best servicevery good food"
            ]
        },
        {
            "name": "The Royal Inn",
            "rating": [
                4.2
            ],
            "address": [
                "Sikachi Icon, Niranjan Corner, Bhigwan Road, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "Good Quality Food and Service",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Stayed in this hotel on 9th sep'23 for single night only. If you looking for the location then the location is fine.\nThere was a lady at the reception which after a negotiation offered us the 3500/- room at 2800/- with an extra mattress for our daughter.\nthere was no other person to bring the luggage from our car as the car was parked at basement and the reception was at 2nd floor, so we had to carry our luggage ourselves to the room.\nNow comes the room.the room was very large, there was a king size bed, working TV and a kettle. complimentary water bottle we had to ask for. there was no coffee/tea/milk/sugar... you can only have warm water. bathroom was large but the glass panes on bathroom window was broken. luckily there was no other building near window so nobody can peep in.\nrestaurant part.... we preferred to order it in our room as we were tired. the hotel is not having their own restaurant and when we dialled room dining service we were told to call reception first then only they can serve us.\nsomehow we ordered the food.....french fries and chilli chicken. both were very tasty and very nicely presented. but there was condition that we have to settle the restaurant bill immediately and that too in cash. luckily we were carrying sufficient cash so this was settled.\nI was a bit worried coz i was with family and i saw or heard no other person in that hotel. felt like all other rooms are not taken.\nAlso contact number available online was not working.\nFor a single person, hotel is ok, but with some extra money you can book city inn which is far better than this in every way.\nMy request to the management is please invest some money so that customer can have nice experience, you want to go otherwise.... you want customer first and with that money you want to improve... which cannot happen now a days.\nAll the best\nt",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Worst Restaurant experience. Had a very Horrible experience not once but twice. What an exceptional infra, beautiful interior, to Top it all scenic open roof open terrace view. But the serving staff is HORRIFIC. Very bad attitude. No one to talk to properly. No one to give proper answers. No manager to manage the chaos.\n\nAnd the highest Irony was they can't serve Jain food when the owners are themselves Jain. Seriously.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Pleasant, soothing ambience.👌\nQuality food 👌\nPolite staff behaviour 👌\nRoom service for Tea or breakfast was not available. Hope they will improve it soon.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Below average Food and disappointing staff as well as service!!\nDon't ruin your evenings here... Better opt for other restaurants.\n\nAfter initial disappointing experience, thought to try it out hoping they might have improved their services. These people do not know how to handle and treat customers. Basic things like salad, water which are readily available will take 15-20 mins to reach your table after multiple reminders. Once they serve you what you have ordered, they wont bother to come and ask if you need anything else. Food quality was extremely pathetic. Veg Maratha gravy was tasteless watery tomato puree. Even a milkshake we ordered took approx 20-25 mins to reach our table.\n\nNever visiting again!!",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good quality food service",
                "stayed hotel th sep single night looking location location fine lady reception negotiation offered us room extra mattress daughter person bring luggage car car parked basement reception nd floor carry luggage room comes roomthe room large king size bed working tv kettle complimentary water bottle ask coffeeteamilksugar warm water bathroom large glass panes bathroom window broken luckily building near window nobody peep restaurant part preferred order room tired hotel restaurant dialled room dining service told call reception first serve us somehow ordered foodfrench fries chilli chicken tasty nicely presented condition settle restaurant bill immediately cash luckily carrying sufficient cash settled bit worried coz family saw heard person hotel felt like rooms taken also contact number available online working single person hotel ok extra money book city inn far better every way request management please invest money customer nice experience want go otherwise want customer first money want improve happen days best",
                "worst restaurant experience horrible experience twice exceptional infra beautiful interior top scenic open roof open terrace view serving staff horrific bad attitude one talk properly one give proper answers manager manage chaos highest irony cant serve jain food owners jain seriously",
                "pleasant soothing ambienceð\u009f\u0091\u008c quality food ð\u009f\u0091\u008c polite staff behaviour ð\u009f\u0091\u008c room service tea breakfast available hope improve soon",
                "average food disappointing staff well service dont ruin evenings better opt restaurants initial disappointing experience thought try hoping might improved services people know handle treat customers basic things like salad water readily available take mins reach table multiple reminders serve ordered wont bother come ask need anything else food quality extremely pathetic veg maratha gravy tasteless watery tomato puree even milkshake ordered took approx mins reach table never visiting"
            ]
        },
        {
            "name": "Hotel V Bharat Residency",
            "rating": [
                4.4
            ],
            "address": [
                "5H6R+MCC, MH SH 68, Shiva Nagar, Baramati, Maharashtra 413102, India"
            ],
            "reviews": [
                {
                    "text": "It was good and hygienic. I liked the rooms which were very spacious and clean. Services were quite slow but ambience and hygiene is best.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Warm and very welcoming staff. Excellent hotel as the rooms were very clean & spacious. The photos of the rooms shown are the exact rooms which you would get. I will surely stop by the next time I visit Baramati. Also would recommend this hotel. Thank you for your hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "We went for Saturday evening dinner. Wow, beautiful serene ambiance. Decent food. Very spacious, nice location, quiet surroundings. Overall enjoyed the evening.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Awesome food. Specially chicken and mutton ran.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Food quality good special for fish and prons",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hygienic liked rooms spacious clean services quite slow ambience hygiene best",
                "warm welcoming staff excellent hotel rooms clean spacious photos rooms shown exact rooms would get surely stop next time visit baramati also would recommend hotel thank hospitality",
                "went saturday evening dinner wow beautiful serene ambiance decent food spacious nice location quiet surroundings overall enjoyed evening",
                "awesome food specially chicken mutton ran",
                "food quality good special fish prons"
            ]
        },
        {
            "name": "Hotel Sunland Baramati",
            "rating": [
                3.9
            ],
            "address": [
                "P/59, Maharashtra Industrial Development Corporation Area, Baramati, Maharashtra 413133, India"
            ],
            "reviews": [
                {
                    "text": "Worst experience....No proper staff.  The restaurant is not working,Tv not working.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "Decent place well decorated & spacious. Their menu is extensive inclusive of continental & Chinese alongside the Indian food.\nThe staff is courteous, attentive, need to improve grooming & uniforms.\nFood is good tasty though we tried only Indian. Can't comment on the other cuisines.\nThe sofas need to be replaced by chairs, they are too low to have food at the table.\nWish them all the best!",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "I am only rating this for the ambience as this is a very good restaurant in a not so big area. The food was nothing special. Anything you order has this pickle kind of smell, which makes you feel if they use pickles instead of oil to fry.\nThe bar isn't that great either. Just that it looks good.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "In need of a good chef,\nMain course dishes should be improved.\nStarters are above average...\nNice place to have booze...\nGood seating arrangement...\nHope so a/c are repaired...\nBar setup is awesome than family dinnings...",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                },
                {
                    "text": "This hotel is just fabulous, the food is amazing, the staff is very attentive, active, friendly and well trained. This place has also got wonderful banquet hall, separate meeting hall and a lawn.\nThe rooms are also up to the mark with beautiful interiors.",
                    "languageCode": "en",
                    "rating": [
                        3.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst experienceno proper staff restaurant workingtv working",
                "decent place well decorated spacious menu extensive inclusive continental chinese alongside indian food staff courteous attentive need improve grooming uniforms food good tasty though tried indian cant comment cuisines sofas need replaced chairs low food table wish best",
                "rating ambience good restaurant big area food nothing special anything order pickle kind smell makes feel use pickles instead oil fry bar isnt great either looks good",
                "need good chef main course dishes improved starters average nice place booze good seating arrangement hope ac repaired bar setup awesome family dinnings",
                "hotel fabulous food amazing staff attentive active friendly well trained place also got wonderful banquet hall separate meeting hall lawn rooms also mark beautiful interiors"
            ]
        }
    ]
}