{
    "places_with_reviews": [
        {
            "name": "Wyte Portico Hotel",
            "rating": [
                4
            ],
            "address": [
                "High School Jn, Karuvatta Pathanamthitta, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Went to Bali\nGood ambience, family friendly.\nIt wasn’t crowded when we went.\n5 stars for the arrangements and ambience. 2 stars for delayed service. Orders for starters taken were forgotten and never given. Takes on an average 1 hour to serve food after placing order. Prices on higher side.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "This place  offers a culinary experience that exceeds expectations. With a charming ambiance and attentive service, dining here is a delight. The menu showcases a fusion of flavors, from traditional favorites to innovative creations, all prepared with the finest ingredients. Whether you're indulging in their signature dishes or exploring their seasonal specials, each bite is a culinary revelation. Don't miss the opportunity to dine at White Portico – it's a culinary journey you won't soon forget.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I reserved lunch for a group of 33 officers from Govt of Haryana, and it was truly exceptional. From the warm welcome to the impeccable service, every aspect of the experience was outstanding. The venue's elegant ambiance and delicious, expertly prepared dishes made for a memorable dining experience. The staff's professionalism and genuine hospitality added to the overall enjoyment. I highly recommend this establishment for anyone seeking a top-notch dining experience.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Went for lunch buffet twice. It costs 399 + tax. Nice buffet except non vegetarian items. Avoid their Fish curry and Chicken roast / curry. But their vegetarian dishes are amazing. Another drawback is limited wash / toilet facility for the restaurant. But they are doing their best to keep it clean.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "\"This hotel offers a pleasant stay with a nice restaurant and bar, along with all basic amenities. However, the gym is currently not operational, and the restaurant prices are on the higher side. The staff is helpful, and the rooms are kept neat and clean. Conveniently located near DTDC High School Junction, it's easily accessible via public bus transportation.\"",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "went bali good ambience family friendly wasnâ\u0080\u0099t crowded went stars arrangements ambience stars delayed service orders starters taken forgotten never given takes average hour serve food placing order prices higher side",
                "place offers culinary experience exceeds expectations charming ambiance attentive service dining delight menu showcases fusion flavors traditional favorites innovative creations prepared finest ingredients whether youre indulging signature dishes exploring seasonal specials bite culinary revelation dont miss opportunity dine white portico â\u0080\u0093 culinary journey wont soon forget",
                "reserved lunch group officers govt haryana truly exceptional warm welcome impeccable service every aspect experience outstanding venues elegant ambiance delicious expertly prepared dishes made memorable dining experience staffs professionalism genuine hospitality added overall enjoyment highly recommend establishment anyone seeking topnotch dining experience",
                "went lunch buffet twice costs tax nice buffet except non vegetarian items avoid fish curry chicken roast curry vegetarian dishes amazing another drawback limited wash toilet facility restaurant best keep clean",
                "hotel offers pleasant stay nice restaurant bar along basic amenities however gym currently operational restaurant prices higher side staff helpful rooms kept neat clean conveniently located near dtdc high school junction easily accessible via public bus transportation"
            ]
        },
        {
            "name": "Park Residency",
            "rating": [
                4
            ],
            "address": [
                "Adoor Pathanapuran Road Parakode, Adoor, Kerala 691554, India"
            ],
            "reviews": [
                {
                    "text": "Had a great stay here for my business trip! The rooms are clean and comfortable, and the bathroom and restaurant facilities are excellent. They even surprised me with a complimentary breakfast, even though I didn't book it. Overall, a very positive experience with friendly and helpful staff.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very nice hotel to stay. For the price you pay the quality of the building, premises, rooms and the food you get is great. Very accessible location. The rooms were well kept, cleaned and with all modern amenities including an ironing board and iron and fridge. The food that was available through room service was great and reasonably priced. There is a mayabay lounge on the rooftop. The normal bar on the ground floor does not affect the quality of a family visit. Plenty of parking, though open. Great experience.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Better than I expected. High-standard hotel with a great staff. I want to give a special thanks to Priya Matthew and the management team.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The hotel is amazing, but the best service I received was from the Receptionist. The receptionist was extremely polite and was super helpful who took an extra mile to help me out with my stay and travel. Thank you very much for all your help!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The worst food I ever had, I have ordered chicken biriyani, the chicken was not at all boiled correctly and the rice was having some bad odour while having it. We ordered 5 chicken biriyani and none of them were good even after paying 200₹ each. Very disappointed because of the food!!",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "great stay business trip rooms clean comfortable bathroom restaurant facilities excellent even surprised complimentary breakfast even though didnt book overall positive experience friendly helpful staff",
                "nice hotel stay price pay quality building premises rooms food get great accessible location rooms well kept cleaned modern amenities including ironing board iron fridge food available room service great reasonably priced mayabay lounge rooftop normal bar ground floor affect quality family visit plenty parking though open great experience",
                "better expected highstandard hotel great staff want give special thanks priya matthew management team",
                "hotel amazing best service received receptionist receptionist extremely polite super helpful took extra mile help stay travel thank much help",
                "worst food ever ordered chicken biriyani chicken boiled correctly rice bad odour ordered chicken biriyani none good even paying â\u0082¹ disappointed food"
            ]
        },
        {
            "name": "Hotel Yamuna",
            "rating": [
                4.1
            ],
            "address": [
                "Yamuna Complex, Kayamkulam - Punalur Rd, near Old Private Bus Stand, Parass La, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Restaurant Hot and Sour!\nIf you have ever visit Adoor anytime Don't  missed out to drop in to this Restaurant for your Break fast. They Continental Break Fast, North Indian and as you know it's Kerela they have Kerela special Items. You have pleasant and fastest service. Food are delicious the staff are polite. What else one need! I recommended to all try it you won't regret",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The staff was very friendly and helpful.\n\nThe room had a cigarette smell, and the towels provided were small.\n\nThe room had all the necessary amenities for a 3-star hotel room.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Good rooms and service. Parking is around the roadside. Can park around 6,7 cars. You can also park behind the hotel inside the gate. Rooms are pretty neat and well maintained. The only negative side is that there is always a liquor smell around the  hotel. Parking behind the hotel is also very difficult as it is always crowded with people from the bar.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Calm and quiet restaurant to enjoy your food with your loved ones. Mr. Ajay is very passionate about the work he do. He makes the dining experience enjoyable.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The restaurant's food serving was impressive, with well-portioned dishes that satisfied both the eyes and the palate. The presentation added to the overall dining experience, making it a delightful culinary journey.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "restaurant hot sour ever visit adoor anytime dont missed drop restaurant break fast continental break fast north indian know kerela kerela special items pleasant fastest service food delicious staff polite else one need recommended try wont regret",
                "staff friendly helpful room cigarette smell towels provided small room necessary amenities star hotel room",
                "good rooms service parking around roadside park around cars also park behind hotel inside gate rooms pretty neat well maintained negative side always liquor smell around hotel parking behind hotel also difficult always crowded people bar",
                "calm quiet restaurant enjoy food loved ones mr ajay passionate work makes dining experience enjoyable",
                "restaurants food serving impressive wellportioned dishes satisfied eyes palate presentation added overall dining experience making delightful culinary journey"
            ]
        },
        {
            "name": "Indraprastha",
            "rating": [
                4
            ],
            "address": [
                "Kayamkulam - Pathanapuram Rd, Vinobaji Sreemoolam Nagar Residents Association, Parass La, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Usually order's from indraprastha if there is any family function in our family. The quality of food is great. And the staff service is also nice. One of the best restaurants in Adoor town.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "I went there to have lunch. Food was good but the serving time was too long. I had to wait for more than one hour after getting the seat.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Worst experience very rude behavior of cabin waiter special bald headed guy\nEven ac is not working here waste of money",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Very bad experience in my life ever. Not recomended for family. Only for proffesional drinkers🥲.... specially HR manager Mr. Santhosh's attitude is very rude and showing no manners to ladies also. Unsatisafied.\nDear management,\nPlease avoid these kind of people otherwise it will affect the goodwill of your whole management.\nThank you.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Food is good. Everything else is just horrible. They just try to rob you. During check in, they promise all kind of things and then will give a different story during check out. Even if you in a hurry during check out, check the bills properly. There will be atleast 1000rs. Extra somewhere. Half of the kitchen bills will be signed and half won't be. Will tell the whole price at first and when you ask only, they will deduct the advance we paid. I had a nightmare at this place.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "usually orders indraprastha family function family quality food great staff service also nice one best restaurants adoor town",
                "went lunch food good serving time long wait one hour getting seat",
                "worst experience rude behavior cabin waiter special bald headed guy even ac working waste money",
                "bad experience life ever recomended family proffesional drinkersð\u009f¥² specially hr manager mr santhoshs attitude rude showing manners ladies also unsatisafied dear management please avoid kind people otherwise affect goodwill whole management thank",
                "food good everything else horrible try rob check promise kind things give different story check even hurry check check bills properly atleast rs extra somewhere half kitchen bills signed half wont tell whole price first ask deduct advance paid nightmare place"
            ]
        },
        {
            "name": "Lals Residency",
            "rating": [
                3.7
            ],
            "address": [
                "Main Central Rd, Pathanāmthitta, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Very good hotel in adoor city, only price is higher than other hotels, but facilities are good",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Lal's Residence is a tranquil haven of luxury. The rooms are beautifully appointed, combining comfort and style effortlessly. The food service is exceptional, with a delightful array of delectable dishes. The attentive staff provided top-notch service, making my stay truly memorable. For a serene and unforgettable experience",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "very poor feedback, not getting proper touching seems very poor food quality's",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Good hotel at reasonable rate",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Stupid place to be ever. Really annoying. Disappointing customer service and under the cot there was an empty glass and months old dust and garbage. Bad attitudes and responsibility. Items we ordered for dinner was good. As in they care you like refugees.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel adoor city price higher hotels facilities good",
                "lals residence tranquil luxury rooms beautifully appointed combining comfort style effortlessly food service exceptional delightful array delectable dishes attentive staff provided topnotch service making stay truly memorable serene unforgettable experience",
                "poor feedback getting proper touching seems poor food qualitys",
                "good hotel reasonable rate",
                "stupid place ever really annoying disappointing customer service cot empty glass months old dust garbage bad attitudes responsibility items ordered dinner good care like refugees"
            ]
        },
        {
            "name": "Hotel Central Park",
            "rating": [
                3.5
            ],
            "address": [
                "Kayamkulam - Pathanapuram Rd, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Good stay, and the bar food is just awesome.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The hotel was below average and the over all experience was very disappointing. We were a two pax booking but the towel provided was just one. We enquired at the reception and he said that's the hotel policy. The complimentary water for second day was provided only after a huge fight and third day they dint even bother to check. Housekeeping was very poor and in our 3 day stay, not even once they cleaned the room. I personally wouldn't recommend this for a family rather you can stay in a lodge in a much cheaper rate and better service.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "I came to know that it has BAR too after reaching there, filled with locals.\nI was tired enough to go and search for another and thus ended up here.\nThe corridor to the room is attached to the bar entry where we'll get the vomiting smell. The rooms and toilets had a smell of fungus, like wet gypsum work.\nThe service was very good and updated.",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "The best thing about the hotel is the staff at the reception. He was very polite and friendly. Everything else is mediocre. Bathrooms aren't clean enough and aren't maintained properly. Food from the restaurant wasn't particularly great. All in all it's an average hotel and is not really worth the money you see in makemytrip etc",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Hectic day experience of staying in this hotel. The hotel manager was so rude and charged me 6600 Indian rupee for one and half days. I really suggest not to choose this hotel for your next stay....",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good stay bar food awesome",
                "hotel average experience disappointing two pax booking towel provided one enquired reception said thats hotel policy complimentary water second day provided huge fight third day dint even bother check housekeeping poor day stay even cleaned room personally wouldnt recommend family rather stay lodge much cheaper rate better service",
                "came know bar reaching filled locals tired enough go search another thus ended corridor room attached bar entry well get vomiting smell rooms toilets smell fungus like wet gypsum work service good updated",
                "best thing hotel staff reception polite friendly everything else mediocre bathrooms arent clean enough arent maintained properly food restaurant wasnt particularly great average hotel really worth money see makemytrip etc",
                "hectic day experience staying hotel hotel manager rude charged indian rupee one half days really suggest choose hotel next stay"
            ]
        },
        {
            "name": "Adoor",
            "rating": [
                4.7
            ],
            "address": [
                "4PWJ+W87, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "The food is good...especially the \"Beef Biryani\" tastes good.\nThe atmosphere is good and the staff are all very active Overall a good hotel.\nIt is a good place to come as a family🥰🥰",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Gem",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Love 💕💕💕💕💕💕",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Good",
                    "languageCode": "en-US",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "food goodespecially beef biryani tastes good atmosphere good staff active overall good hotel good place come familyð\u009f¥°ð\u009f¥°",
                "nice",
                "gem",
                "love ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0095ð\u009f\u0092\u0095",
                "good"
            ]
        },
        {
            "name": "SPOT ON 45878 Adoor Homestay",
            "rating": [
                4.3
            ],
            "address": [
                "Homestay, Suvartha Church - Thomson Bakery Rd, Adoor, Kerala 691523, India"
            ],
            "reviews": [
                {
                    "text": "Clean and calm  budget hotel   Customer service is also good only thing that was poor network in the  room as a suggestion they could provide a wifi network.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good budget lodge and Value for money. Customer service is also good.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Centre of adoor. Not bad. Avg",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Good room for this budget.nice place",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Super service",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "clean calm budget hotel customer service also good thing poor network room suggestion could provide wifi network",
                "good budget lodge value money customer service also good",
                "centre adoor bad avg",
                "good room budgetnice place",
                "super service"
            ]
        },
        {
            "name": "SPOT ON 49126 Silent Valley Appartments",
            "rating": [
                3.7
            ],
            "address": [
                "Silent Valley Appartments, Kayamkulam - Pathanapuram Rd, Adoor, Peringanad, Kerala 691523, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Edatharayil Residency",
            "rating": [
                3.5
            ],
            "address": [
                "Adoor, Kerala 691554, India"
            ],
            "reviews": [
                {
                    "text": "Not bad need some customer support",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "These photos belong to M&M distributions",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Morning ride with my buddy. Ready to Race",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Good and cheap place",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                },
                {
                    "text": "Average good",
                    "languageCode": "en",
                    "rating": [
                        3.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad need customer support",
                "photos belong mm distributions",
                "morning ride buddy ready race",
                "good cheap place",
                "average good"
            ]
        }
    ]
}