{
    "places_with_reviews": [
        {
            "name": "The Tattva - A Boutique Resort",
            "rating": [
                4.3
            ],
            "address": [
                "Shri Badrinath Road, near Tapovan Taxi Stand, Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "We were a group of 4 women and had booked the deluxe cottage and basic room.\nThe rooms were clean although we had to ask the staff to get the basic stuff like toiletries & washroom mat.\nService was good and prompt, they even provided bonfire.\nThe complimentary breakfast did have a good variety however it looks like the chef couldn't make up their mind about the amount of salt to be added. Some days they added too much, other days, the dishes were pretty bland.\nOverall the location and service and safety wise, this is a pretty good choice.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Not built for people with accessibility issues (no lifts, lots of floors) but other than that a very good stay. Very good view of mountains from Supreme rooms and dining areas. Polite people and great service.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Had a great experience at the Tatva  hotel. One of the best places  to stay at Joshimath\nThe views of mountains are absolutely breathtaking  from the hotel . Surprisingly the food was awesome given the poor experience we had at some of the restaurants in Dehradun.\n\nThe staff are very polite and the service was exemplary.\n\nOverall great stay!!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Room wasn’t good. Bathroom lock was broken. Bathroom was smelly. Poor sound insulation in the room. Had a disturbed nights sleep. Could hear everything going on outside. Access to restaurant is also from room corridor. So obviously room won’t be silent. Room heating was good along with electric blankets. Beds were comfy. Staff is polite and service was good. Food was average. You really need to improve the food quality. Restaurant is a nice place to sit at. We checked out early only because we weren’t comfortable. There was not a single person available when we were checking out around 6 am.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "We have a nice experience in a 2 day stay in Tattva Resort in Josimath.The location\nof the resort is great.. The ice laden mountain is clearly visible from the deck which is soothing to eyes. The food quality of the restaurant is quite delicious.Few points want to mention.. The room should be more spacious according to the premium price..And for complete privacy instead of glass window..wooden or any covered wall should be provided.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "group women booked deluxe cottage basic room rooms clean although ask staff get basic stuff like toiletries washroom mat service good prompt even provided bonfire complimentary breakfast good variety however looks like chef couldnt make mind amount salt added days added much days dishes pretty bland overall location service safety wise pretty good choice",
                "built people accessibility issues lifts lots floors good stay good view mountains supreme rooms dining areas polite people great service",
                "great experience tatva hotel one best places stay joshimath views mountains absolutely breathtaking hotel surprisingly food awesome given poor experience restaurants dehradun staff polite service exemplary overall great stay",
                "room wasnâ\u0080\u0099t good bathroom lock broken bathroom smelly poor sound insulation room disturbed nights sleep could hear everything going outside access restaurant also room corridor obviously room wonâ\u0080\u0099t silent room heating good along electric blankets beds comfy staff polite service good food average really need improve food quality restaurant nice place sit checked early werenâ\u0080\u0099t comfortable single person available checking around",
                "nice experience day stay tattva resort josimaththe location resort great ice laden mountain clearly visible deck soothing eyes food quality restaurant quite deliciousfew points want mention room spacious according premium priceand complete privacy instead glass windowwooden covered wall provided"
            ]
        },
        {
            "name": "Aaryam Resort, Auli",
            "rating": [
                4.8
            ],
            "address": [
                "Auli Rd, Auli, Lower, Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "Spacious and tastefully decorated rooms with  elegant furnishings, and all the amenities you need for a rejuvenating retreat. Whether you're an adventure seeker or a relaxation enthusiast, there's something for everyone at Aaryam Resort. Explore the surrounding trails on a guided hike or simply soak in the serenity of nature.\nOver all experience was great ❣️ staff was very nice and quick responsive.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I stayed here for 2 nights. It felt like the best stay in joshimath. The rooms were spacious, clean and beautiful. They provided a room heater and electric blanket to make us feel comfortable as it was very cold. I had experienced the first snowfall of my life here. Their service and food is exceptional.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "Amazing place to visit. This resort is the best place to stay for this once in a lifetime trip. The service was amazing, all the people were very helpful and friendly and they have contacts for every activity and transportation system needed to experience the full enjoyment of this place. The staff is available 24x7. The food is fresh and tasty as well.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "I lost my go pro with accessories in the Auli. I came here and the Hotel team helped me in every way possible. They were very helpful and calm. They showed us CcTv videos just in case. It is a little bumpy and off-road to reach here but it is worth it. The staff is very good. Had enough parking. The main Auli skiing resort is not very far from here.",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                },
                {
                    "text": "We had an amazing experience of 2 days. The day we reached it was my anniversary and they ensured to make it memorable by decorating our room with tempting cake. Location of property will mesmerize you. Hospitality was also best. Overall best place to have stay",
                    "languageCode": "en",
                    "rating": [
                        4.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "spacious tastefully decorated rooms elegant furnishings amenities need rejuvenating retreat whether youre adventure seeker relaxation enthusiast theres something everyone aaryam resort explore surrounding trails guided hike simply soak serenity nature experience great â\u009d£ï¸\u008f staff nice quick responsive",
                "stayed nights felt like best stay joshimath rooms spacious clean beautiful provided room heater electric blanket make us feel comfortable cold experienced first snowfall life service food exceptional",
                "amazing place visit resort best place stay lifetime trip service amazing people helpful friendly contacts every activity transportation system needed experience full enjoyment place staff available x food fresh tasty well",
                "lost go pro accessories auli came hotel team helped every way possible helpful calm showed us cctv videos case little bumpy offroad reach worth staff good enough parking main auli skiing resort far",
                "amazing experience days day reached anniversary ensured make memorable decorating room tempting cake location property mesmerize hospitality also best overall best place stay"
            ]
        },
        {
            "name": "Auli Hill Station",
            "rating": [
                4.7
            ],
            "address": [
                "Pine palace hotel, Auli, Auli Laga Salude, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "Auli is the best place to see a magnificent view of the Himalayan ranges. The hotel we found had a heater, which made the low temperature more comfortable in the room.\nLimited food options. Street food options were pretty good.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice place in winters not a good place for summers. Come here after 15th January if you want to see proper snow covered mountains and want to enjoy winter sports like skiing, ice skating etc. Also, if you want to go by ropeway. Book the ropeway well in advance online via. Internet otherwise you'll not get ropeway tickets as there are only limited slots and in each slot only 25 people are allowed one time.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Best adventures place👌",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Been there only for an hour in summer, while raining. Unfortunately missed ropeway because of traffic on the way from Joshimath and heavy rain added to that.\nTook a ride on Chair lift. But felt its slippery and not safe. Actually they arranged us a last ride little after their usual closing time. I should appreciate them for being so sensible as we travelled so long to get there.\n\nWe got some great views of Nanda Devi and Trishul peaks after the rain settled and clouds gave us some way.\nSleeping beauty , Hathi parbat are others..\n\nBest season to visit is in March to April second week, and you can witness snow fall and if you are lucky enough you can see far mountain peaks as well.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great Himalaya view",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "auli best place see magnificent view himalayan ranges hotel found heater made low temperature comfortable room limited food options street food options pretty good",
                "nice place winters good place summers come th january want see proper snow covered mountains want enjoy winter sports like skiing ice skating etc also want go ropeway book ropeway well advance online via internet otherwise youll get ropeway tickets limited slots slot people allowed one time",
                "best adventures placeð\u009f\u0091\u008c",
                "hour summer raining unfortunately missed ropeway traffic way joshimath heavy rain added took ride chair lift felt slippery safe actually arranged us last ride little usual closing time appreciate sensible travelled long get got great views nanda devi trishul peaks rain settled clouds gave us way sleeping beauty hathi parbat others best season visit march april second week witness snow fall lucky enough see far mountain peaks well",
                "great himalaya view"
            ]
        },
        {
            "name": "Ski resort GMVN Auli",
            "rating": [
                4.1
            ],
            "address": [
                "GHP8+X4H, Auli Rd, Joshimath, Auli Laga Salude, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "Everything about this place is excellent. The location, the resort, the staff and their service and the weather. We stayed here for 3 days and it was a refreshing and relaxing experience. The rooms are fantastic. This property belongs to govt. And that is why the  rates are fixed. The staff is very polite and cooperative.\nThe best part that we did not expect in such cold weather was their restaurant facility. The food was tremendous and tasty like anything. Be it lunch, breakfast or dinner. Each and every item on the menu was excellent and was served with utmost etiquette.  We had a great time here. It's a premium property don't expect it for cheap",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Located near tower 8, this resort is excellent. You can reach there by car in summer and by cable car in winter. Has a great view, food is little costly but very tasty. Room service available. All kinds of amenities were provided. Chair lift is easily accessible. We stayed in deluxe Hut which is difficult for aged people.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Absolutely horrible place!!!! Would request all tourists to never book this (especially foreigners). The service staff is extremely amateur. They don’t even know how to treat or talk to a guest. The food was stale and expensive- lemon ginger tea had no ginger. The rooms are terrible. I belong to Uttarakhand and I am ashamed of this quality. I don’t know who to blame for this - the government, or the people. They have killed “athithi Devo bhava”.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Currently I am staying in this resort. Booked an economy room. After checking in found there is problem with washroom. They tried fixing it. No maintenance. Shifted to another room. Full of bad smell. Went to reception for a conversation but they told it's a government resort so it's like this and they don't have time for maintenance. Similarly the person in the reception told that we got another room as today it's vacant otherwise we have to stay there only. With washroom problem. This is the feedback I can share. Really a bad stay.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "I am currently in delux room which I booked online, this is 24th December, 2023. I must say the rooms, staff and food was less than average for 5k per night. The heater is not working at all and we are staying in cold. Staff is giving vague responses to these complaints. No help whatsoever. Really a bad place and I think u should avoid it completely.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "everything place excellent location resort staff service weather stayed days refreshing relaxing experience rooms fantastic property belongs govt rates fixed staff polite cooperative best part expect cold weather restaurant facility food tremendous tasty like anything lunch breakfast dinner every item menu excellent served utmost etiquette great time premium property dont expect cheap",
                "located near tower resort excellent reach car summer cable car winter great view food little costly tasty room service available kinds amenities provided chair lift easily accessible stayed deluxe hut difficult aged people",
                "absolutely horrible place would request tourists never book especially foreigners service staff extremely amateur donâ\u0080\u0099t even know treat talk guest food stale expensive lemon ginger tea ginger rooms terrible belong uttarakhand ashamed quality donâ\u0080\u0099t know blame government people killed â\u0080\u009cathithi devo bhavaâ\u0080\u009d",
                "currently staying resort booked economy room checking found problem washroom tried fixing maintenance shifted another room full bad smell went reception conversation told government resort like dont time maintenance similarly person reception told got another room today vacant otherwise stay washroom problem feedback share really bad stay",
                "currently delux room booked online th december must say rooms staff food less average k per night heater working staying cold staff giving vague responses complaints help whatsoever really bad place think u avoid completely"
            ]
        },
        {
            "name": "Blue Poppy Resort",
            "rating": [
                4.4
            ],
            "address": [
                "near GMVN, Auli, Auli Laga Salude, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "The location is unbeatable, situated conveniently close to the cable car, and offers stunning views of the peaks from both the bedroom and restaurant. The food quality is excellent, with a focus on pure vegetarian dishes. The staff are incredibly friendly and cooperative, making the stay even more enjoyable. I'm definitely looking forward to staying here again in the future.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Amazing hotel with an awesome view!! Loved staying here, the staff was genuinely welcoming and made sure we had a comfortable stay. Food was also really good. Rooms were also hygienic. I highly recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I just had a 2 night stay, superb service and location. The manager also provided good guidance on nearby attractions.\nDo note, you would have to climb down 200 meters from the main road to reach the resort. The team would carry the required luggage but if you have issues walking on rock surface, do verify.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "I recently stayed at a resort in Uttarakhand and was very delighted. The location was stunning, nestled among the hills. The staff was quite welcoming, and the accommodations were clean and comfy. The resort provided a variety of activities and services to keep everyone occupied. The eating experience was outstanding . Overall, my time at the resort was a fantastic and restorative experience, and I would strongly suggest it to anyone looking for a peaceful escape in blue poppy resort.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "visited in this property last month with my family, hotel was beautiful surroundings, very clean, staff was very polite, excellent service. also food was very testy, value for money. must go...",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location unbeatable situated conveniently close cable car offers stunning views peaks bedroom restaurant food quality excellent focus pure vegetarian dishes staff incredibly friendly cooperative making stay even enjoyable im definitely looking forward staying future",
                "amazing hotel awesome view loved staying staff genuinely welcoming made sure comfortable stay food also really good rooms also hygienic highly recommend place",
                "night stay superb service location manager also provided good guidance nearby attractions note would climb meters main road reach resort team would carry required luggage issues walking rock surface verify",
                "recently stayed resort uttarakhand delighted location stunning nestled among hills staff quite welcoming accommodations clean comfy resort provided variety activities services keep everyone occupied eating experience outstanding overall time resort fantastic restorative experience would strongly suggest anyone looking peaceful escape blue poppy resort",
                "visited property last month family hotel beautiful surroundings clean staff polite excellent service also food testy value money must go"
            ]
        },
        {
            "name": "Tathastu Maitri Ski Resort, Joshimath",
            "rating": [
                4.9
            ],
            "address": [
                "Ravigram Village, Near Fire Brigade Station Tapovan, Road, Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "Staff was caring, friendly, and hospitable. The location is excellent. It’s very calm and the price we pay is worth it. Our experience was amazing. The hotel was clean and neat and well taken care of. Circuit, the hotel puppy was very cute and it’s a nice touch for customers who are animal lovers and can play with the dog. Everything was great. If I had any suggestions it would be to place trash cans through the resort to reduce littering but other than that it was a 5 star experience.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Remarkable locations, breath taking views and great staff make the staying here very memorable.\n\nInitially I was hesitant to take up the rooms at the first level because I felt they were unnecessarily expensive. We were settling down for the lower levels because they were relatively cheaper. My wife had some issues to climb up and down (pretty steep steps). It was a pleasant surprise for us when the sales team offered us the first level rooms for the same price (though this is off-season and not many guest at all). Still it was a great way to work towards customer satisfaction - and we really appreciated the team for this gesture.\n\nIt was a real pleasure to meet Mr Negi (one of the managerial staff) who would take time and effort to explain (in detail) about every possible temple, places of visit. Very rare to find such persons who would genuinely feel proud of our culture, our heritage and would encourage visitors to appreciate the history of the places. Since the purpose of my visit is more in these lines (than mere entertainment), I could easily connect with his line of thinking.\n\nOther staff members, chef, food everything make you feel happy in this place",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "I recently had an exceptional stay at a mountain hotel that left an indelible mark on my experience. The staff's warmth and hospitality truly elevated the entire visit. From the moment I arrived, I was greeted with genuine smiles and a willingness to assist.\n\nThe hotel staff went above and beyond to ensure every aspect of my stay was comfortable. Their attentiveness to details, from room cleanliness to prompt room service, was remarkable. The genuine friendliness of the staff created a welcoming atmosphere that made me feel right at home in the serene mountain setting.\n\nThe breathtaking views from the hotel added an extra layer of magic to the stay. Waking up to the sight of majestic mountains and fresh air was invigorating. The staff's local knowledge also came in handy, as they provided excellent recommendations for nearby hiking trails and scenic spots.\n\nOverall, my stay at this mountain hotel was a perfect blend of natural beauty, comfort, and exceptional service. The staff's genuine kindness and dedication special mention of a person named Raja to ensuring a memorable experience make this establishment stand out. I highly recommend this hotel to anyone seeking a peaceful retreat in the mountains, coupled with impeccable service and warm hospitality.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Premium rooms are spacious with best of amenities provided in the room as well as in the resort.\nEntire team is always ready to help and they are prompt in responding to any need.\nKudos to Bhupendra Rana and entire support team for making the stay worth remembering.\nProperty is in very good location and well maintained.\n\nI would highly recommend this resort to everyone for a great stay.",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                },
                {
                    "text": "Excellent hotel and superb service. All staff was very polite, courteous and responsive. Location is also nice with a good view of the mountains. Special mention of Raja Negi who was very attentive.\nHighly recommended!!",
                    "languageCode": "en",
                    "rating": [
                        4.9
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staff caring friendly hospitable location excellent itâ\u0080\u0099s calm price pay worth experience amazing hotel clean neat well taken care circuit hotel puppy cute itâ\u0080\u0099s nice touch customers animal lovers play dog everything great suggestions would place trash cans resort reduce littering star experience",
                "remarkable locations breath taking views great staff make staying memorable initially hesitant take rooms first level felt unnecessarily expensive settling lower levels relatively cheaper wife issues climb pretty steep steps pleasant surprise us sales team offered us first level rooms price though offseason many guest still great way work towards customer satisfaction really appreciated team gesture real pleasure meet mr negi one managerial staff would take time effort explain detail every possible temple places visit rare find persons would genuinely feel proud culture heritage would encourage visitors appreciate history places since purpose visit lines mere entertainment could easily connect line thinking staff members chef food everything make feel happy place",
                "recently exceptional stay mountain hotel left indelible mark experience staffs warmth hospitality truly elevated entire visit moment arrived greeted genuine smiles willingness assist hotel staff went beyond ensure every aspect stay comfortable attentiveness details room cleanliness prompt room service remarkable genuine friendliness staff created welcoming atmosphere made feel right home serene mountain setting breathtaking views hotel added extra layer magic stay waking sight majestic mountains fresh air invigorating staffs local knowledge also came handy provided excellent recommendations nearby hiking trails scenic spots overall stay mountain hotel perfect blend natural beauty comfort exceptional service staffs genuine kindness dedication special mention person named raja ensuring memorable experience make establishment stand highly recommend hotel anyone seeking peaceful retreat mountains coupled impeccable service warm hospitality",
                "premium rooms spacious best amenities provided room well resort entire team always ready help prompt responding need kudos bhupendra rana entire support team making stay worth remembering property good location well maintained would highly recommend resort everyone great stay",
                "excellent hotel superb service staff polite courteous responsive location also nice good view mountains special mention raja negi attentive highly recommended"
            ]
        },
        {
            "name": "Hotel Uday Palace Joshimath",
            "rating": [
                4.1
            ],
            "address": [
                "Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "We have stayed in the Hotel Uday Palace for 3 nights / 2 days. One of the best places to stay in terms of cleanliness of rooms, washrooms, and food was of amazing. Great hospitality by the Manager Mr. Harish , you can reach out to him regarding any problem and he'll help you out for sure.\nKudos to entire Staff especially Mohit & Om Prakashji were of great help. Rahul & Dipendra ji from the kitchen staff were amazing.\n\nWe haven't had booked any stay in Joshimath but we found some good reviews for the Uday Palace & decided to see the hotel. Surprisingly, once we saw the rooms & the deal they offered, we immediately booked the place.\nI strongly recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "The rooms are nice, especially the ones with balcony. Staff is cordial. Food is good but they need prior intimation as availability is limited (expected as per the location). Overall a decent experience",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "At 2k Rooms give all the basic facilities required but services seems inadequate to give complete  satisfaction. Even tea was refused during checkin at just around 7PM due to overcrowded restaurant. It seems they can only cater properly when it is less crowded.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very good, polite and attentive staff  attended us.\nThe room was nice with all amenities mentioned.\nWe booked it through our tour organiser and got satisfied.\nThe package was inclusive of breakfast and dinner which we enjoyed. The food was tasty. The warm drinking water was also made available as per our requirement.\n\nThe location is very near to Shri Laxmi Narsinha Mandir which is visited in the morning.\nThey also helped for the Guide for Auli ski point trekking.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Best hotel near the narshinh mandir, good view of joshimath, food quality is also good.\nJust need to take care of child bez window and balcony having no grill so possibility to fall down child from heights...",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "stayed hotel uday palace nights days one best places stay terms cleanliness rooms washrooms food amazing great hospitality manager mr harish reach regarding problem hell help sure kudos entire staff especially mohit om prakashji great help rahul dipendra ji kitchen staff amazing havent booked stay joshimath found good reviews uday palace decided see hotel surprisingly saw rooms deal offered immediately booked place strongly recommend place",
                "rooms nice especially ones balcony staff cordial food good need prior intimation availability limited expected per location overall decent experience",
                "k rooms give basic facilities required services seems inadequate give complete satisfaction even tea refused checkin around pm due overcrowded restaurant seems cater properly less crowded",
                "good polite attentive staff attended us room nice amenities mentioned booked tour organiser got satisfied package inclusive breakfast dinner enjoyed food tasty warm drinking water also made available per requirement location near shri laxmi narsinha mandir visited morning also helped guide auli ski point trekking",
                "best hotel near narshinh mandir good view joshimath food quality also good need take care child bez window balcony grill possibility fall child heights"
            ]
        },
        {
            "name": "Hotel Panchvati Inn",
            "rating": [
                4.6
            ],
            "address": [
                "Singhdhar, Bus Stand, Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "During our recent stay at Hotel Panchvati Inn, we were thoroughly impressed with the level of comfort provided by the accommodations as well as the exceptional service offered by their staff. Not only did our room exceed our expectations in terms of cleanliness and amenities, but the food served in the hotel's restaurant was also a standout feature - delicious dishes prepared with fresh ingredients left us wanting more! We highly recommend Hotel Panchvati Inn for anyone seeking an enjoyable stay with top-notch hospitality in this area.",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Hotel Panchvati Inn is truly a culinary delight with a wide range of delicious dishes that are bound to satisfy any palate. The food is exceptional in quality, taste and presentation, making it a must-visit for any food connoisseur. The diverse menu offers a variety of options, including traditional Indian cuisine and international favorites, all cooked to perfection. The ambiance adds to the overall dining experience, with attentive service and a warm, inviting atmosphere. Overall, Hotel Panchvati Inn is a top choice for those seeking a memorable dining experience with exceptional food",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Peaceful location with great views is the highlight of the place. Amitji takes care of the customers by personally taking time to enquire all the details. We were pleasantly surprised with an offer for upgradation of the room category (may be because of off-season ..nevertheless a very nice gesture from the hotel)\n\nFood, staff everything deserve an A+ :-) We would definitely recommend this place for those peace loving people looking for a good accommodation. BTW Narasing Mandir which is one of the main temples to be visited is very near by ...those who would love to walk in Himalayas (like we do) can do so from the Hotel!!!",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Stay was too good, friendly staffs, restaurant was clean and food was delicious!! Overall best stay! Surely will recommend others🙂",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                },
                {
                    "text": "Very Good service, Food is very good. Loved everything we ate here. Fast and Quality service. Thumbs up to Girish for a good service",
                    "languageCode": "en",
                    "rating": [
                        4.6
                    ]
                }
            ],
            "preprocessed_reviews": [
                "recent stay hotel panchvati inn thoroughly impressed level comfort provided accommodations well exceptional service offered staff room exceed expectations terms cleanliness amenities food served hotels restaurant also standout feature delicious dishes prepared fresh ingredients left us wanting highly recommend hotel panchvati inn anyone seeking enjoyable stay topnotch hospitality area",
                "hotel panchvati inn truly culinary delight wide range delicious dishes bound satisfy palate food exceptional quality taste presentation making mustvisit food connoisseur diverse menu offers variety options including traditional indian cuisine international favorites cooked perfection ambiance adds overall dining experience attentive service warm inviting atmosphere overall hotel panchvati inn top choice seeking memorable dining experience exceptional food",
                "peaceful location great views highlight place amitji takes care customers personally taking time enquire details pleasantly surprised offer upgradation room category may offseason nevertheless nice gesture hotel food staff everything deserve would definitely recommend place peace loving people looking good accommodation btw narasing mandir one main temples visited near would love walk himalayas like hotel",
                "stay good friendly staffs restaurant clean food delicious overall best stay surely recommend othersð\u009f\u0099\u0082",
                "good service food good loved everything ate fast quality service thumbs girish good service"
            ]
        },
        {
            "name": "The Cliff Top Club, Auli",
            "rating": [
                4.5
            ],
            "address": [
                "Auli Skiing Village, Joshimath, Auli Laga Salude, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "It was a bad experience for our family. We have paid the amount in advance which was on higher side, but when we saw the rooms not in good condition, bath tub was not working and others. We have booked for 2 nights but due to this reason we liked to move to other hotel. We have told them to pay us for the 01 days but still they have not refunded the amount. We are daily call them for our hard earn money.\n\nIt has been since 04 months now we haven't received the money from the hotel as promised by them",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I visit in cliff top club, Auli and here rooms and service are best and also location is soo beautiful. The view from the hotel is awesome",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Good staff service,nice Room. nice budget\nCoprative staff all foods very testi good location 👌",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "The destination Is very wonderful  . There is Excellent service and care here . And it is a very nice place for enjoying holiday or trip .",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Thanku so much for best quality rooms, service and Location 💐",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bad experience family paid amount advance higher side saw rooms good condition bath tub working others booked nights due reason liked move hotel told pay us days still refunded amount daily call hard earn money since months havent received money hotel promised",
                "visit cliff top club auli rooms service best also location soo beautiful view hotel awesome",
                "good staff servicenice room nice budget coprative staff foods testi good location ð\u009f\u0091\u008c",
                "destination wonderful excellent service care nice place enjoying holiday trip",
                "thanku much best quality rooms service location ð\u009f\u0092\u0090"
            ]
        },
        {
            "name": "hotel mount view annexy",
            "rating": [
                3.7
            ],
            "address": [
                "Shankaracharya Math, Upper Bazar, Joshimath, Uttarakhand 246443, India"
            ],
            "reviews": [
                {
                    "text": "Worst experience ever... Worst hotel anyone can ever live in.\nNo lift in the hotel.\nFood is very bad.\nNo shower provided in washroom.\nHeater was at extra cost but it was okay okay, heater was not really heating the room. Wall between room and washroom was leaking.\nDoor is so defective that you can get stuck inside the washroom.\nRoof is leaking. In so much cold we have to stay in a room with leaking water.\n\nMr. Sanjeev was really rude while checking out. We were getting late due to water leakage, no shower and every discomfort and instead of helping he chose to be rude.\nComplete disaster.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "This is like second Home for me!!! Service, facilities was good.. Room cleaning was awesome food was delicious ..must stay in this hotel thanks to all staff😀👍",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Very bad experience.\nRoom size is very small.\nStaff is very rude very bad service.\nFalse images of the room are shown on websites.\nThe room which was given to us did not had the lock and still they did not change the room.\nNot at all worth spending money on this hotel..",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "These guys are fraudsters, please don't book rooms here. They will ask for advance money once you paid it congratulations you are cheated by them. Because they will promise something and will give nothing, not even room.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Food was great good place to stay if you are planning to visit badrinath temple it is almost 40 kms far. It is located between the market .Rooms are also great comfortable stay.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "worst experience ever worst hotel anyone ever live lift hotel food bad shower provided washroom heater extra cost okay okay heater really heating room wall room washroom leaking door defective get stuck inside washroom roof leaking much cold stay room leaking water mr sanjeev really rude checking getting late due water leakage shower every discomfort instead helping chose rude complete disaster",
                "like second home service facilities good room cleaning awesome food delicious must stay hotel thanks staffð\u009f\u0098\u0080ð\u009f\u0091\u008d",
                "bad experience room size small staff rude bad service false images room shown websites room given us lock still change room worth spending money hotel",
                "guys fraudsters please dont book rooms ask advance money paid congratulations cheated promise something give nothing even room",
                "food great good place stay planning visit badrinath temple almost kms far located market rooms also great comfortable stay"
            ]
        }
    ]
}