{
    "places_with_reviews": [
        {
            "name": "Bangaram Island Resort",
            "rating": [
                4.7
            ],
            "address": [
                "Bangaram island, Lakshadweep 682553, India"
            ],
            "reviews": [
                {
                    "text": "This beautiful Island resort located in Bangaram Atol gives you a peaceful and relaxing holiday away from people and pollution.\nThe rooms are neat and clean and provide all the amenities like A/c, refrigerator etc.\nThis resort is a place in Lakshadweep where you will get liqueur also. They also offers water sports like snorkeling, scuba, kayak etc.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Visit and stay at Bangaram is one of my best resort stays. It actually surpassed all my expectations. There is actually very little information online on how beautiful and awesome the resort is. The resort has great facilities, good water sport activities with experienced instructors and the most loving and caring staff. There is also a spa and bar. Blessed with abundant natural beauty, crystal clear waters, absolute white sand, mind blowing underwater world, turtles, dolphins, rich and thriving corals and bioluminescence.  Highly recommended.  Only 2 downsides. Sulfur smell in bathroom water ( this is not harmful, just smells bad) and no wifi (this was already being setup). Both were not deal breakers for me. Bangaram is indeed hidden treasure of India and will easily give tough competition to any of the high rated resorts overseas.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "It is a very nice place to stay. If you are planning to stay here,plan to stay for 2 nights at least. Rooms are not that great as you expect to be if you are paying 18-20k per night for room. Food is great though. The beach could be more clean,but it is our duty too not to litter the beach. Water sports activities like snorkelling and scuba is must here. The glowing beach is unique in its own way. Overall it is a recommended honeymoon destination if u don’t want to go to Maldives. Airtel 4g works fine on the island.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Great place to stay. Staff go completely out of their way to make your stay great. House keeping dept needs training not to leave litter outside rooms. Cooks excellent. Boat rides n tours excellent. Reception can be neater.\nLitter cleaning should be better.\nTo avoid running the resort in the absence of being able to supply good showering water (rotten egg smell)",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Lifetime experience. The view is simply amazing. The staff are so  friendly and cooperative. Amazing varieties of food and drinks available. Different types of water activities. It was great fun and a lifetime experience.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "beautiful island resort located bangaram atol gives peaceful relaxing holiday away people pollution rooms neat clean provide amenities like ac refrigerator etc resort place lakshadweep get liqueur also also offers water sports like snorkeling scuba kayak etc",
                "visit stay bangaram one best resort stays actually surpassed expectations actually little information online beautiful awesome resort resort great facilities good water sport activities experienced instructors loving caring staff also spa bar blessed abundant natural beauty crystal clear waters absolute white sand mind blowing underwater world turtles dolphins rich thriving corals bioluminescence highly recommended downsides sulfur smell bathroom water harmful smells bad wifi already setup deal breakers bangaram indeed hidden treasure india easily give tough competition high rated resorts overseas",
                "nice place stay planning stay hereplan stay nights least rooms great expect paying k per night room food great though beach could cleanbut duty litter beach water sports activities like snorkelling scuba must glowing beach unique way overall recommended honeymoon destination u donâ\u0080\u0099t want go maldives airtel g works fine island",
                "great place stay staff go completely way make stay great house keeping dept needs training leave litter outside rooms cooks excellent boat rides n tours excellent reception neater litter cleaning better avoid running resort absence able supply good showering water rotten egg smell",
                "lifetime experience view simply amazing staff friendly cooperative amazing varieties food drinks available different types water activities great fun lifetime experience"
            ]
        },
        {
            "name": "Lakshadweep Resort",
            "rating": [
                4.4
            ],
            "address": [
                "near North Beach, Bangaram, Lakshadweep 682553, India"
            ],
            "reviews": [
                {
                    "text": "Bangaram is an hidden and unexplored travel destination of India. Very scenic and beautiful beach with crystal clear water and white sand. Safe and mostly still water. Peaceful and virtually disconnected from other parts of India. Beach is ultra clean. You will hardly find a piece of garbage on the beach. This is an inhabited and offbeat island of India. There is only one resort on this island operated by the government. Resort has quite good range of rooms with almost all the facilities one need of. However, if you are water sports enthusiasts, you will enter the room only in the evening. Staff is very co-operative and they are local people from Agatti island and working here.\nOnly, food is one negative point. Local Lakshadweep people try to make North Indian food(as 90% of the tourists are from North India) and it goes wrong. It would be great, if they focus on local cuisines only(veg and non-veg). ButYou will ignore food when you look at the beach and the resort.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One of the best seaside facilities I ever visited.  Uninhabited.  Only a resort run by Lakshadweep Administration.  The stay at the cottage is awesome. Its a heaven for sea lovers.  Very calm and peaceful surroundings.  Pristine water and a huge array of corals.  Multitude options for water sports and related adventure activities.  The food served is delicious but very expensive.  The only real concern is the quality of water provided in the washrooms and bathrooms.  It's really horrible to take bath in water having sulphurous contents.  Rest all are really memorable.  A must visit for those who have a penchant for sea.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Bangaram Resort in Lakshdweep is a Government run resort under SPORT and is very well managed and reasonably priced. The natural beauty of beaches and the richness of marine life, is to be seen to believe. The beaches are far more beautiful than those in Maldives, Thailand, Mauritius or even Hawaii; the fact that the places are not at all crowded multiplies the joy of tourists. The place boasts of several water sports that are very reasonably priced. Due to low capacity at Bangaram Resort, limited flights and Government Regulations requiring permit to visit- detailed and timely planning is required.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "A solely different experience to live in tents on the sea beach. Beautiful and natural resources to explore in the surrounding lagoons through various adventure water sports. Next to heaven in earth.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Calm and peaceful environment, turquoise blue ocean, lots of water sport activities, non spicy decent food. A truly relaxing holiday. A bit expensive place. Tap water smells of sulphur, something you need to get used to.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "bangaram hidden unexplored travel destination india scenic beautiful beach crystal clear water white sand safe mostly still water peaceful virtually disconnected parts india beach ultra clean hardly find piece garbage beach inhabited offbeat island india one resort island operated government resort quite good range rooms almost facilities one need however water sports enthusiasts enter room evening staff cooperative local people agatti island working food one negative point local lakshadweep people try make north indian foodas tourists north india goes wrong would great focus local cuisines onlyveg nonveg butyou ignore food look beach resort",
                "one best seaside facilities ever visited uninhabited resort run lakshadweep administration stay cottage awesome heaven sea lovers calm peaceful surroundings pristine water huge array corals multitude options water sports related adventure activities food served delicious expensive real concern quality water provided washrooms bathrooms really horrible take bath water sulphurous contents rest really memorable must visit penchant sea",
                "bangaram resort lakshdweep government run resort sport well managed reasonably priced natural beauty beaches richness marine life seen believe beaches far beautiful maldives thailand mauritius even hawaii fact places crowded multiplies joy tourists place boasts several water sports reasonably priced due low capacity bangaram resort limited flights government regulations requiring permit visit detailed timely planning required",
                "solely different experience live tents sea beach beautiful natural resources explore surrounding lagoons various adventure water sports next heaven earth",
                "calm peaceful environment turquoise blue ocean lots water sport activities non spicy decent food truly relaxing holiday bit expensive place tap water smells sulphur something need get used"
            ]
        },
        {
            "name": "Thinnakkara Island",
            "rating": [
                4.4
            ],
            "address": [
                "W8X9+2G4, Bangaram, Lakshadweep 682553, India"
            ],
            "reviews": [
                {
                    "text": "Staying in Thinnakkara island was a whole new experience. You can experience the feel of being an islander if you stay at Thinnakara. This is a very small and isolated island and you can walk around it within an hour. Surrounded by turquoise blues, this island is rich in sea life because there is not much developement. The eco system of this island is well preserved. There are no buildings in this island. You have to stay in tents. But a luxury tent with restrooms.  Where ever you go, you can find beautiful birds, ghost crabs, hermit crabs etc. The staffs were very kind. Food was great. If you stay here, do not miss the ship wreck snorkeling where you get to swim around a 200 years old submerged ship. Also don't miss to visit islands Parle 1 and Parle 2.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Beautiful small island just 15 mins on a boat ride from Bangaram island. This place is magical due to the turquoise water and accessibility within the island region.\n\nThe island is fairly walkable and we did it in 30-40 minutes. The landscape is breathtaking with the snapper fish, Manta rays and other beautiful creatures swimming besides us on the shore.\n\nThis island is best explored while snorkelling as we can see sea turtles and colorful fishes underneath the ocean.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "A beautiful small island just for a perfect day trip. Crystal clear blue water of this untouched pristine beach is simply awesome. Note that there is no hotel or resort available for a stay. You can stay in Agatti, or in Bangaram. A few families stay on the island. You can request them to give you coconut wate. It tastes so amazing. If you are lucky, you can visit the lighthouse when it's open.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "One if the beautiful island in India..Silent, calm, good Non a/c cottages for stay.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                },
                {
                    "text": "Temporarily closed down during the new administration. Sparsely populated island mostly serves as a tourist destination.",
                    "languageCode": "en",
                    "rating": [
                        4.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "staying thinnakkara island whole new experience experience feel islander stay thinnakara small isolated island walk around within hour surrounded turquoise blues island rich sea life much developement eco system island well preserved buildings island stay tents luxury tent restrooms ever go find beautiful birds ghost crabs hermit crabs etc staffs kind food great stay miss ship wreck snorkeling get swim around years old submerged ship also dont miss visit islands parle parle",
                "beautiful small island mins boat ride bangaram island place magical due turquoise water accessibility within island region island fairly walkable minutes landscape breathtaking snapper fish manta rays beautiful creatures swimming besides us shore island best explored snorkelling see sea turtles colorful fishes underneath ocean",
                "beautiful small island perfect day trip crystal clear blue water untouched pristine beach simply awesome note hotel resort available stay stay agatti bangaram families stay island request give coconut wate tastes amazing lucky visit lighthouse open",
                "one beautiful island indiasilent calm good non ac cottages stay",
                "temporarily closed new administration sparsely populated island mostly serves tourist destination"
            ]
        },
        {
            "name": "Aleti 9 hotel",
            "rating": [
                "Unknown"
            ],
            "address": [
                "W8V7+G7, Bangaram, Lakshadweep, India"
            ],
            "reviews": [],
            "preprocessed_reviews": []
        }
    ]
}