{
    "places_with_reviews": [
        {
            "name": "haritha hotel Bhadrachalam",
            "rating": [
                3.7
            ],
            "address": [
                "Temple Rd, opp. Sub Collector Office, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Good rooms n nice ventilation with hot water in the attached bathroom. Both potty and wash rooms are separate and the washbasin is in the middle of both rooms. Which saves time to get ready. A good balcony gives a good outer scenic view. Beds and blankets are also neat and clean. The price of the rooms are a high compared to outside hotels and private rooms. Also need to increase the non a/c rooms(11 count) instead a/c rooms(37) i think. Overall good hospitality for families.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Govt dept run  hotel. Spacious, good location. But in not very good conditions. Bathrooms bad. No facilities at all. Beddings are not maintained.  Reception had huge lizards running. No restaurant. Good place but no maintenance. 😞",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "A good place to stay while considering the room charges.  This being a govt institution, one should not expect much more.  You might encounter cockroaches.  Food is not up to the mark.  Services are as if they are doing a favour.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Location is the only best part of this hotel and it is 700m distant from the temple. Parking space is nice when compared to other hotels. But you have to be cautious when parking ur vehicle. Rooms are ok. U r lucky if the ac is working in your room. So don't expect more by looking at the gmaps pics. Overall, it's a decent spot to spend one night with family and friends.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                },
                {
                    "text": "Nothing very special except the location which is adjacent to the Bhadrachalam temple. Service is very poor actually there is no room Service at all. Such a huge hotel with all amenities but lacks proper care. Having a huge restaurant and dining area but not functional.",
                    "languageCode": "en",
                    "rating": [
                        3.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good rooms n nice ventilation hot water attached bathroom potty wash rooms separate washbasin middle rooms saves time get ready good balcony gives good outer scenic view beds blankets also neat clean price rooms high compared outside hotels private rooms also need increase non ac rooms count instead ac rooms think overall good hospitality families",
                "govt dept run hotel spacious good location good conditions bathrooms bad facilities beddings maintained reception huge lizards running restaurant good place maintenance ð\u009f\u0098\u009e",
                "good place stay considering room charges govt institution one expect much might encounter cockroaches food mark services favour",
                "location best part hotel distant temple parking space nice compared hotels cautious parking ur vehicle rooms ok u r lucky ac working room dont expect looking gmaps pics overall decent spot spend one night family friends",
                "nothing special except location adjacent bhadrachalam temple service poor actually room service huge hotel amenities lacks proper care huge restaurant dining area functional"
            ]
        },
        {
            "name": "SRI BHAVYA RESIDENCY",
            "rating": [
                4.3
            ],
            "address": [
                "Ramalayam Kalyanamandapam road, MV8M+XM5, 4-1-64, opp. SBI&HDFC ATM, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Very convenient and walkable distance to temple. Rooms are spacious. Cleanliness can be improved. Hot water is available from solar heaters. When there is not enough sun, you don’t get hot water. Our room had a great view of temple.",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "The hotel was located very near to the temple. Hotel rooms are maintained in a good condition.\nWe cannot expect any services like metropolitan hotels in this city\nServices are meeting the city level expectations",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Decent rooms, neat and very near to the temple. Rooms are a little small with basic things. As it's residency, there's no restaurant and also no parking facility, but they will help you to park before the residency itself. You can find many eatable places nearby",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Everything is perfect. Their hospitality is so good! They gave us a room even after we checked out. Temple view from windows is best thing about this residency!",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                },
                {
                    "text": "Centrally located hotel and very close to temple. Rooms were good and neat, but no maintenance at all. Rooms were not cleaned, and bedsheets were not changed every day. Moreover, lizards and cockroaches were having gala time in the room. Miscommunication between night staff and  management is very large and always affects the end consumer. We had a very bad experience due to this miscommunication, and management was too blunt to sort out the issue smoothly.  NOT RECOMMENDED",
                    "languageCode": "en",
                    "rating": [
                        4.3
                    ]
                }
            ],
            "preprocessed_reviews": [
                "convenient walkable distance temple rooms spacious cleanliness improved hot water available solar heaters enough sun donâ\u0080\u0099t get hot water room great view temple",
                "hotel located near temple hotel rooms maintained good condition expect services like metropolitan hotels city services meeting city level expectations",
                "decent rooms neat near temple rooms little small basic things residency theres restaurant also parking facility help park residency find many eatable places nearby",
                "everything perfect hospitality good gave us room even checked temple view windows best thing residency",
                "centrally located hotel close temple rooms good neat maintenance rooms cleaned bedsheets changed every day moreover lizards cockroaches gala time room miscommunication night staff management large always affects end consumer bad experience due miscommunication management blunt sort issue smoothly recommended"
            ]
        },
        {
            "name": "Srinidhi Residency",
            "rating": [
                4
            ],
            "address": [
                "MV8M+JHX, Temple Rd, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Location of the room is very good, just a 2 minute walk from the main temple. The room is good, but there were more than 20 mosquitoes in our room. That was very irritating. Maintenence should be improved. Car parking is available, which is very nice.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "It's good and family friendly. The biggest plus point is that it's right next to the main temple. But sleep may be disturbed due to noise from adjacent temple. Otherwise, clean and functional. No food and beverages. But a two minute walk will lead to tea and food stalls.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Go for it 👍\nRooms are okay given that it's a piligrim area. Location is amazing, just a minute walk to main temple and very close by to many other shops too. Overall Excellent 👍",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "Good hotel.very neat and clean rooms . Location is very near to west entrance of temple.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                },
                {
                    "text": "The rooms are neat and clean. The staff takes really good care in making sure your linens are tidy and your washroom is clean.\nThere's not a lot to offer for service though, no restaurant, no room service etc. One can however just take a quick walk to go to a nearby eatery.\nThere's parking in the basement, it's better to intimate the hotel prior to your arrival as the parking space is a little tight in my opinion (parks 4-5 cars).\nThe location is superb, temple is at a walkable distance.\n\nOverall, very good value for your back for a nights stay or two.",
                    "languageCode": "en",
                    "rating": [
                        4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "location room good minute walk main temple room good mosquitoes room irritating maintenence improved car parking available nice",
                "good family friendly biggest plus point right next main temple sleep may disturbed due noise adjacent temple otherwise clean functional food beverages two minute walk lead tea food stalls",
                "go ð\u009f\u0091\u008d rooms okay given piligrim area location amazing minute walk main temple close many shops overall excellent ð\u009f\u0091\u008d",
                "good hotelvery neat clean rooms location near west entrance temple",
                "rooms neat clean staff takes really good care making sure linens tidy washroom clean theres lot offer service though restaurant room service etc one however take quick walk go nearby eatery theres parking basement better intimate hotel prior arrival parking space little tight opinion parks cars location superb temple walkable distance overall good value back nights stay two"
            ]
        },
        {
            "name": "Varun Residency",
            "rating": [
                4.7
            ],
            "address": [
                "Ramalayam center, 1-1-38, near Godavari river Venkateshwara Colony, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Very nice place, great staff. The hotel is very conveniently located, a mere 2 minutes from the temple and another 2 minutes from the river, if one wishes to take a dip in the waters before visiting the temple.\n\nHighly recommended, especially for the hospitality shown by the staff.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "This property in Badrachalam offers excellent value for money. It is situated within easy walking distance of the temple and Godavari ghat. The rooms are very clean and the service is outstanding. I would definitely recommend this place for a stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Excellent hotel nearer to Temple,Godavari river ghat,food courts & excellent service by Shri Srinivasarao garu & team ,Sri sitaramachadra Murthy will bless them & families since all of them are taking care of pilgrims needs ,hotel maintenance is good & suitably designed for pilgrims",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice and clean rooms. Worth the money for the price. Extremely helpful staff and very close proximity to the temple. There are many stalls selling homemade and very delicious food near the hotel.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                },
                {
                    "text": "Nice hotel.We stayed in pent house room as we were 5 members.Room was neat and clean.we had view of temple from one side and godavari on other side.Very near to both river and temple.They arranged  nice sitting area with shade.They have their own good parking area .Had a great stay.",
                    "languageCode": "en",
                    "rating": [
                        4.7
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice place great staff hotel conveniently located mere minutes temple another minutes river one wishes take dip waters visiting temple highly recommended especially hospitality shown staff",
                "property badrachalam offers excellent value money situated within easy walking distance temple godavari ghat rooms clean service outstanding would definitely recommend place stay",
                "excellent hotel nearer templegodavari river ghatfood courts excellent service shri srinivasarao garu team sri sitaramachadra murthy bless families since taking care pilgrims needs hotel maintenance good suitably designed pilgrims",
                "nice clean rooms worth money price extremely helpful staff close proximity temple many stalls selling homemade delicious food near hotel",
                "nice hotelwe stayed pent house room membersroom neat cleanwe view temple one side godavari sidevery near river templethey arranged nice sitting area shadethey good parking area great stay"
            ]
        },
        {
            "name": "Padmasali Satram",
            "rating": [
                4.2
            ],
            "address": [
                "MV9M+8XH, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Non AC room - 1000/-\nAC room - 1500/-\nName itself AC room but AC won't work.\nTV is there but NO cable connection.\nGeyser is there but NO water since there is NO power connection for that.\nNO wifi at least. NO single for mobile network.\nNO generator during powercuts, suffered a lot (around 6hrs) in hot summer.\n\nBetter to choose a Non AC room instead.\n\nSpecial note: whatever we asked management, they will respond 'NO' only.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I stayed in an AC room. The room n bathroom are pretty clean. The food they served for dinner in the Satram is delicious. The reception is warm and welcoming. This is pretty close to the temple. I would highy recommend this place.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good ambience and good food, friendly staff",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Nice place\nJust 300 Meters from temple\nNon AC rooms charge 700\n&\nAC rooms charge 1200\nFree meals in it's price\nWorth stay",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "It was nice experience to stay there and was near to temple...",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "non ac room ac room name ac room ac wont work tv cable connection geyser water since power connection wifi least single mobile network generator powercuts suffered lot around hrs hot summer better choose non ac room instead special note whatever asked management respond",
                "stayed ac room room n bathroom pretty clean food served dinner satram delicious reception warm welcoming pretty close temple would highy recommend place",
                "good ambience good food friendly staff",
                "nice place meters temple non ac rooms charge ac rooms charge free meals price worth stay",
                "nice experience stay near temple"
            ]
        },
        {
            "name": "Nandini Residency",
            "rating": [
                4.1
            ],
            "address": [
                "MV9M+5VV, Old Market Road, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Good hotel in bhadrachalam.\nNew property which has opened up recently.\nLocated around 200 meters from the temple.\nRooms are spacious and clean. Toilets are clean and running hot water is available.\nAmple parking available.\nFamily Rooms are more compared to single and double bed rooms.\nThere is no restaurant in the hotel.\nWe need to walk around 200 meters to find a restaurant.\nOverall, there are only small restaurants in the town.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Not satisfied. No hot water in our room. They provided heater which takes lot of time to heat. Double check if taps are working fine before checking in.",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Every thing was good except room service....they charged 3500 for a suit room for 4 members but they didn't provided drinking water....I asked the I got 1 lt water bottle.....they are selling 1ltr water bottle @25rs",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Just walkble distance for temple and car parking very classy and hi-fi rooms are available. quick service available for room cleaning.very reasonable  prices .",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                },
                {
                    "text": "Very clean and new Residency to stay nearby Badhrachalam temple. I liked it, but the room cost is a bit high in my view..",
                    "languageCode": "en",
                    "rating": [
                        4.1
                    ]
                }
            ],
            "preprocessed_reviews": [
                "good hotel bhadrachalam new property opened recently located around meters temple rooms spacious clean toilets clean running hot water available ample parking available family rooms compared single double bed rooms restaurant hotel need walk around meters find restaurant overall small restaurants town",
                "satisfied hot water room provided heater takes lot time heat double check taps working fine checking",
                "every thing good except room servicethey charged suit room members didnt provided drinking wateri asked got lt water bottlethey selling ltr water bottle rs",
                "walkble distance temple car parking classy hifi rooms available quick service available room cleaningvery reasonable prices",
                "clean new residency stay nearby badhrachalam temple liked room cost bit high view"
            ]
        },
        {
            "name": "RAGHAVANILAYAM REDDY BHAVAN",
            "rating": [
                4.2
            ],
            "address": [
                "MVGR+P58, Ashok Nagar Colony, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Neat and spacious with many rooms. Approach from the town is a bit tough though due to a narrow road with a sharp turn.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Good To stay, Ambience is good. The only concern is a little far from the city, you need to have a vehicle.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "Rooms were neat, clean and spacious.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "We have arranged a training/ workshop, place is out of the City and calm area. But we can't expect tea, snacks here. Lunch will be arranged based on order, tasty and good.",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                },
                {
                    "text": "I got married here. the location is not good and there is no enough parking. AC are not working we have to bring our own technicians to repair them. Atlast as it was my marriage I am happy that's why 4 rating or else it would be 2",
                    "languageCode": "en",
                    "rating": [
                        4.2
                    ]
                }
            ],
            "preprocessed_reviews": [
                "neat spacious many rooms approach town bit tough though due narrow road sharp turn",
                "good stay ambience good concern little far city need vehicle",
                "rooms neat clean spacious",
                "arranged training workshop place city calm area cant expect tea snacks lunch arranged based order tasty good",
                "got married location good enough parking ac working bring technicians repair atlast marriage happy thats rating else would"
            ]
        },
        {
            "name": "Sri Sudharsana Residency",
            "rating": [
                3.4
            ],
            "address": [
                "1-1-61, Temple Main Road Opp: Ramalayam Temple, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Located close to the temple. Rooms are just average. Very small. Tv doesn't work in the room. From the balcony you can see the temple. Car parking is not there. You have to park near the temple. No restaurant in the hotel. Opposite restaurants are there. The staff are ok. Price is higher for  the room",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "A very nice place to stay.\nClean rooms, very near to the temple, polite staff",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Very bad .don't book room in this hotel ..normal days 1500 weakends...2000 no tv ..no wifi",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Room was clean and neat but bathroom sanitary ware is not at all in good condition.",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                },
                {
                    "text": "Residency very west maintenance and\nBad service and not maintenance don't prer tha residency",
                    "languageCode": "en",
                    "rating": [
                        3.4
                    ]
                }
            ],
            "preprocessed_reviews": [
                "located close temple rooms average small tv doesnt work room balcony see temple car parking park near temple restaurant hotel opposite restaurants staff ok price higher room",
                "nice place stay clean rooms near temple polite staff",
                "bad dont book room hotel normal days weakends tv wifi",
                "room clean neat bathroom sanitary ware good condition",
                "residency west maintenance bad service maintenance dont prer tha residency"
            ]
        },
        {
            "name": "Sriramabhadra KSHATRIYAS Annadana Satram",
            "rating": [
                4.5
            ],
            "address": [
                "MV9P+FH2, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "Nice accommodation and friendly service. Annadhanam is also available",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Near to bhadrachalam temple, has parking 10 cars, Rooms ok for one day stay.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "Worst wedding/family event venue of all time.\nGreedy management and low grade service.\nThey charge over agreement fee middle of the event and threaten to cancel the event.\n1 star rating is waste too.\nBe cautious booking this venue.\nThere are better wedding functional hall in the town.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "A nice venue for stay. Very welcoming staff.\nGreat rooms, neatly maintained.\nNear to main temple. Food is also served on prior intimation. AC and hot geysers available.\nRooms will be allocated on their availability.\nA small temple present in premises. Ample parking space.\nA function hall as well available in the venue.\nOverall a great place.",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                },
                {
                    "text": "I am going yesterday my frnd marriage he alotment room here rooms are very clean nice bed ac fully working condition and banquet hall was very good my frnds fully enjoy in sangeet hall dinning hall also good fully air conditioner all good please visit with family..",
                    "languageCode": "en",
                    "rating": [
                        4.5
                    ]
                }
            ],
            "preprocessed_reviews": [
                "nice accommodation friendly service annadhanam also available",
                "near bhadrachalam temple parking cars rooms ok one day stay",
                "worst weddingfamily event venue time greedy management low grade service charge agreement fee middle event threaten cancel event star rating waste cautious booking venue better wedding functional hall town",
                "nice venue stay welcoming staff great rooms neatly maintained near main temple food also served prior intimation ac hot geysers available rooms allocated availability small temple present premises ample parking space function hall well available venue overall great place",
                "going yesterday frnd marriage alotment room rooms clean nice bed ac fully working condition banquet hall good frnds fully enjoy sangeet hall dinning hall also good fully air conditioner good please visit family"
            ]
        },
        {
            "name": "Sitaram Inn - Bhadrachalam",
            "rating": [
                3.8
            ],
            "address": [
                "13-2-199, OPP RTC, Bus Stand Rd, Ashok Nagar Colony, Bhadrachalam, Andhra Pradesh 507111, India"
            ],
            "reviews": [
                {
                    "text": "We had phoned to book the room since we would reach late in the night. Once we reached, the night receptionist was busy with his personal phone call, he didn't disconnect! Room didn't have towels or toiletries, there was a hot water kettle, but no water, cups or glasses. It didn't even have a power socket except next to the bedside table. Quite a pricey hotel for no service at all. Bad experience.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Earlier good this hotel .now wonder no service ,only need improve service and increase man power ..now very wonder occupancy is very low ...if service and renovate the rooms customer will comes more ..",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "I booked the room for a night, it was quite comfortable, it’s new with good and new design, bathrooms were very clean. 4 star as the hot water was not coming in tap and this is winter. They don’t have restaurant in hotel. Parking was available. bedsheets were not ironed. It’s on the main road very convenient. This one is best in terms of new trends of hotel room in badrachalam i didn’t find better then this hotel. Nearby many hotels tiffin centre’s are available.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Good and affordable rooms.\nYou will get auto to temple by paying Rs.20/person.\nI paid 1600 for one night.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                },
                {
                    "text": "Hi all, we stayed at this hotel for a day and our experience was really bad. The room key they give you doesn't work and every time you have to wait for the receptionist to open the door for you. Bedsheets were not neat and service. Very poor\nThink twice before opting.\nVery limited car parking that too open area.\nNo hot water.",
                    "languageCode": "en",
                    "rating": [
                        3.8
                    ]
                }
            ],
            "preprocessed_reviews": [
                "phoned book room since would reach late night reached night receptionist busy personal phone call didnt disconnect room didnt towels toiletries hot water kettle water cups glasses didnt even power socket except next bedside table quite pricey hotel service bad experience",
                "earlier good hotel wonder service need improve service increase man power wonder occupancy low service renovate rooms customer comes",
                "booked room night quite comfortable itâ\u0080\u0099s new good new design bathrooms clean star hot water coming tap winter donâ\u0080\u0099t restaurant hotel parking available bedsheets ironed itâ\u0080\u0099s main road convenient one best terms new trends hotel room badrachalam didnâ\u0080\u0099t find better hotel nearby many hotels tiffin centreâ\u0080\u0099s available",
                "good affordable rooms get auto temple paying rsperson paid one night",
                "hi stayed hotel day experience really bad room key give doesnt work every time wait receptionist open door bedsheets neat service poor think twice opting limited car parking open area hot water"
            ]
        }
    ]
}